{"name":"askreddit","description":"r/AskReddit is the place to ask and answer thought-provoking questions.","subscribers":38502986,"posts":[{"title":"How did you find out you were getting cheated on?","not_safe_for_work":false,"locked":false,"body":"","score":9652,"comments":[{"body":"I didn't know at the time we broke up, for sure, but she was engaged a week after we broke up.\n\nI can't even figure out how that worked, exactly.","score":6008,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Phone bill.  She was texting some random number 600 times a month.   I thought I recognized the number and when I put it in my phone it was a buddy of mine.","score":4931,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When she left me cause she got pregnant, and thought it was a different guys.  Turns out I was 1 of 3 possible dads, couple years later and a few paternity tests and turns out it was mine.","score":4445,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He pocket dialed me while bragging about it to a co-worker. The universe really had my back on that one.","score":6918,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The guy shot me a message on social media, said he was sorry and didn’t know she was in a relationship. \n\nI bumped into him at a bar years later and bought him a drink.","score":15053,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Her roommates called and asked me to meet them for lunch, said it was important. I met them and they told me she had been cheating on me with her ex the entire time I was deployed. They showed me pictures (back when you had to get pictures developed). They said I was a good man and I didn't deserve to be treated like that. They had collected my things that morning when she left for work and gave them to me. I drove to her work, walked up to her, showed her the pictures and demanded the ring back. She gave it to me and I left. Later she called me yelling about me \"conspiring with her roommates\" basically trying to make it my fault. She asked what I was doing meeting with them? I said, \" it's called respect and closure and it sounds like this\" I unplugged the phone (landline), waited an hour plugged in the phone and called the phone company, said I needed to change my number and never heard from her again.\n\nI took it really rough and am thankful for her roommates and the friends that got me through probably the darkest time of my life.","score":12789,"comments":[{"body":"Roommates are MVP.","score":4278,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Was using her phone for GPS while we were on a road trip because mine had issues when she got a text from the guy we had been in marriage counseling about who she says she hasnt talked to him for months about seeing her tomorrow.\n\n24 years of being together\n23 years married\n2 kids\nA house\n\nAll down the fucking drain and ruined my life for a guy who could pass for a real life Ned Flanders.","score":6662,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Open up the tablet to play with it, found an open email that I had never seen before - read the messages between them. I’ve never been the same since. Divorced now. We were together for 30 years.\n\nEdit: I am overwhelmed by all of your love and kindness. Thank you. Love back to all of you. \n\nYes I tried and wanted to keep my marriage, but he continued to lie and betray me so that I was left with no choice but to divorce. \n\nDo you know what helped me so much? My mom, without asking or anything, came over and filled my freezer with crock pot meals and casseroles. I was so depressed and I had 2 children to care for, and dinner was always so easy just to pop in and be done with. She did that for about a year. Forever grateful for her thoughtfulness and generosity.","score":11419,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He hooked up with random girls when he was supposed to be at his mom. \nOne evening at a friends party,there was a girl who wasn't of our group ( a friend of a friend) \nShe went \" Oh! Hi! Remember me! It was sooo fun\"","score":2166,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What scandal is currently happening in the world of your niche interest that the general public would probably have no idea about? [SERIOUS]","not_safe_for_work":false,"locked":false,"body":"","score":3863,"comments":[{"body":"**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Judges of Irish Dance competitions were caught trading sex acts for scores. \"Arse in the air\" is the new catch-phrase of the entire organization - thanks to one judge's particularly graphic text messages.","score":3866,"comments":[{"body":"Isn't this a world that is mostly populated by children???","score":585,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"My grandmother's \"fall alert\" which is supposed to be a medical device thats like a necklace worn around her neck which calls emergency contacts if it detects she has fallen over,  can receive phone calls. \n\nNow she has telemarketers calling her on this emergency thing trying to sell her $1000 medical devices. Who the F sold the list of contact numbers for senior's emergency fall devices?","score":2244,"comments":[{"body":"Wow","score":266,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I’ve subscribed to Birchbox for 8 or 9 years and they recently stopped shipping monthly boxes with no communication or warning whatsoever, yet they have still kept taking customers’ money. I realized only last night that I hadn’t received a box in a while and never received a separate order I placed on Oct 11; did some research and apparently Birchbox is going under. The majority of subscribers’ posts on social media are like “Why isn’t customer service getting back to me? I haven’t received my order and it’s been a month!” My Birchbox account showed my next order date of Dec 30, 1969 which is a common default date in programming so I’m told. So everything is wiped: there is no customer service anymore. No one is going to answer them. Subscribers and customers will collectively have to come to the slow realization that they’re not getting their money back.","score":1758,"comments":[{"body":"3 words: credit card chargeback.","score":961,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Yuji Naka co-creator of Sonic the Hedgehog was arrested for insider trading.","score":1546,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Health researcher. Don’t know if scandal is the appropriate term but I’d say the direction Alzheimer’s disease research and therapy development. \n\nI’m simplifying and likely leaving out some important details, but the prevailing theory is that Alzheimer’s is caused by a buildup of plaques in the brain, which damages and kills brain cells and disrupts normal brain functioning. This is supported by some research in mice decades ago and by limited studies in humans who have specific genetic factors that leads to Alzheimer’s much earlier in life than usual. The theory for treatment then is to target and reduce the plaques in the brain.\n\nBut, it has been shown that some early and landmark Alzheimer’s disease research contained evidence of data manipulation. Second, several trials testing drugs that target the plaques have shown that yes the plaques can be reduced, but that does not result in delaying, preventing, or reversing cognitive decline in Alzheimer’s. In the US, the recently approved Aduhelm (aducanumab), which is in the above category, arguably just doesn’t work. The counter argument is that these treatments are started too late in life. Third, many older adults with substantial plaques in their brains don’t exhibit Alzheimer’s dementia symptoms. They’re otherwise normal and can live independently. Fourth, accumulating evidence suggests that most people with Alzheimer’s have pathology of other dementias (like vascular dementia). Quick note: Alzheimer’s disease is the most common cause of dementia. Alzheimer’s dementia is a type of dementia, caused by Alzheimer’s.\n\nSo I’d say part of the scandal is that we’ve spent billions and decades on false leads, perpetrated in part by researchers whose livelihoods are at stake since there is something of a revolving door between researchers and grant review committees. We should have been investigating other theories and treatments, if nothing else to rule them out. Unlike with plaque targeting drugs, we do have moderate long term evidence showing that what is good for your heart is good for your brain, as in lifestyle things like exercise. Counterargument here is that Alzheimer’s and dementia can develop over decades and it’s actually just subtle brain changes we can’t measure yet or haven’t identified that is influencing behaviors.","score":1335,"comments":[{"body":"As a non scientist who has been processing image data for this research for almost a decade this is very disheartening. There really are people trying so hard to work on this.","score":325,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Who is aging like fine wine?","not_safe_for_work":false,"locked":false,"body":"","score":922,"comments":[{"body":"Marisa Tomei","score":1737,"comments":[{"body":"Given she started as fine wine, she must be hyper-fine wine by now.","score":371,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Ming Na Wen. \n\nI watched some late 90s reruns of ER around the same time that I was watching the Book of Boba Fett. She looks like she has hardly aged a day.","score":740,"comments":[{"body":"I told my wife how old she was and she thought I was joking. So I showed her a picture of her in street fighter from 1994.","score":134,"comments":[{"body":"Chun Li. That was ages ago too.","score":61,"comments":[{"body":"For me, it was Tuesday","score":110,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Oscar Isaac","score":500,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Linda Cardellini keeps getting more attractive","score":474,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Angela Bassett.","score":727,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Paul Rudd for sure.","score":1116,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What's the most NSFW experience you witnessed right in front of your eyes?","not_safe_for_work":true,"locked":false,"body":"","score":26528,"comments":[{"body":"I watched a man fall when his repelling gear failed. He fell about 100ft, and the sound his body made when he hit will haunt me forever.  He broke his spine, pelvis, both legs, one arm, and an orbital bone, but he survived.  There were a lot of people around to give first aid, and I helped carry him out of the canyon to the ambulance and I swear I thought he was dead already. He looked like thawed hamburger meat. The Rangers? Park Police? (Not sure what they were) took our info and a few days later, to our surprise, the guy was alive and wanted to see the people who carried him out. He gave us all some really nice leather backpacks from the company he worked for.  I still have it some 20+ years later.","score":2405,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A coworker, just before quitting, took a shit in their cubical. They wanted to have him charged with indecent exposure, but since no one saw him, besides me and I wasn’t admitting to having seen it, they dropped it. They also tried to use the defecating in public laws, but the police pointed out that their office was in fact private, not a public space.\n\nThe man became a legend around the office.","score":3749,"comments":[{"body":"This feels like a logistical nightmare but I respect the energy.","score":457,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Ran into a burning house as a teenager. It was an old couple just a few houses down from mine.\n\nGot through the living room, into the dining area, but smoke started getting bad. Got down on my knees and crawled to the hallway, to look into the bedrooms. The couple were dead, in bed, burning. I know this by the shape of the lumps, not because they were recognizable. \n\nI learned 2 things:\n\n1. Don't ever run into a burning house. It's dumb. I got lucky.  \n\n2. The smell of burning humans is something you never forget.","score":15706,"comments":[{"body":"My mother killed herself by setting herself on fire, and... I didn't see it happen, but I saw the aftermath. You're right, you never forget the smell.","score":7137,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"A coworker at a factory got a set of shop shears caught in an [extrusion puller](https://ams-plasticextrusions.com/collections/pullers). (Link is SFW, just a page for a manufacturer of said equipment that has pictures of the gear so you can see what it does.) The shears got tangled in a strip of plastic that had got wrapped around the belt, and when the shears rounded the turn with his fingers stuck in them, it basically ripped his hand in half, nearly twisting his thumb, middle finger, and forefinger off. All because he thought he could clear a jam/tangle without having to stop and re-start the line. Saving 15 minutes cost him a functioning hand.","score":5391,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"In a club in Berlin Germany. It was quite sex positive. A woman in her 30's sat down next to me on a \"weird chair\" and we started chatting.\n\nAt some point during the conversation a man kneeled down in front of her and started to fist her (consensually).\n\nSHE DIDNT BREAK EYECONTACT. SHE DIDNT EVEN FLINCH. SHE JUST CONTINUED THE CONVERSATION LIKE NORMAL.\n\nI had no idea how to deal with that and didnt want to be rude so we continued the conversation and i tried to ignore the man who had half his arm in her vagina.","score":11371,"comments":[{"body":"You were speaking to a very sophisticated hand puppet","score":4151,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Lmao…you didn’t want to be rude 🤣","score":4919,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I was in a train compartment sitting by a window, it was broad daylight. There were two young students, boy a girl. Suddenly the girl opened the guy's fly and started to jack him off.\n\nI did not know how to react, as nothing like that happened to me before, also they blocked my way to the corridor. They did not even close the curtains, so the conductor girl passing by saw them too, and apparently did not know how to react as well. Then they got off on the very next stop. I think they did not have a ticket.","score":21845,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Who is this generation’s greatest artist?","not_safe_for_work":false,"locked":false,"body":"","score":1106,"comments":[{"body":"Someone toiling away in obscurity who will not be discovered until after they drink themselves to death in 2048.","score":2910,"comments":[{"body":"So there is a career for me","score":642,"comments":[{"body":"Nnng, they didn’t quite say that","score":136,"comments":[{"body":"Too late im already drunk and finger painting","score":246,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"This is the correct answer, it has to be","score":48,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Define “this generation”","score":1504,"comments":[{"body":"Define \"artist\".","score":722,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This thread is a dumpster fire","score":1065,"comments":[{"body":"The question was gasoline.","score":516,"comments":[{"body":"Shit, I think we found the answer to the question. That line is absolute fire","score":82,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What's the most overated movie of all time?","not_safe_for_work":false,"locked":false,"body":"","score":883,"comments":[{"body":"Please enjoy our snack bar before the main feature starts.","score":843,"comments":[{"body":"Let's all go to the lobby is pretty awesome tho","score":247,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"As a big horror movie fan, most horror movies are terrible","score":1149,"comments":[{"body":"And the bigger the box office success, usually the more bland they are","score":253,"comments":[{"body":"Terrible I can forgive.  Some of my favourite horror movies of all time are terrible.\n\nBland however, cannot be forgiven in a horror movie.  Anything rated PG-13 has a pretty big uphill battle ahead.","score":204,"comments":[{"body":"I love house of wax.  I said it.  Fuck it feels good.","score":104,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"What do you recommend?","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Threat Level: Midnight\n\nBad acting. A villain with a golden face? Killing the animal rapist was cool though.","score":1160,"comments":[{"body":"Dwigt was a such a good character, though.  Seemed like a real person.","score":148,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I found the inconsistent levels of effort from the actors unnerving, like some of the actors tried really hard and some of the other actors look like their boss made them do this\n\nAnd how did they get licensing to play Billy Joel songs, it didn't seem like they had much of a budget","score":98,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What’s your favorite cereal of all time?","not_safe_for_work":false,"locked":false,"body":"","score":206,"comments":[{"body":"This is an unconventional choice, but Cracklin Oats. It bounces between the bottom shelf and the top shelf at the grocery store (aka not prime real estate).","score":110,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Basically anything that turned the milk into chocolate milk. Cocoa Pebbles was the best.","score":70,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"there is nothing like eating an entire box of Life Cinnamon and sh*tting out everything in my system","score":150,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oh's! Can't find them everywhere but if I see it I pick up like 5 boxes!","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Golden Grahams","score":113,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cinnamon Toast Crunch","score":381,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Trix, I know they are exclusively for children, but it is not strictly enforced. If anyone hassles you when buying them just tell them they are for your niece or something like that.\n\nTake an alternate route home and make sure you aren’t being tailed, you should be fine.","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Raisin nut bran. The raisins are coated in this nutty shell of deliciousness, slivers of almonds, served on a bed of bran flakes that taste like semi sweet wheeties and it doesn’t all tear apart in milk like wet toilet paper.  Not nearly as much sugar as the rest of thread but definitely more flavor!","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Rice Crispie Treats","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cap'n Crunch, if you dare.","score":158,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What song cover is so famous, most people don’t know it’s a cover?","not_safe_for_work":false,"locked":false,"body":"","score":284,"comments":[{"body":"My brother told me that Girls Just Want To Have Fun by Cyndi Lauper is actually a cover. Looked it up, he's right. I had NO idea","score":107,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The one that comes to mind is \"Tainted Love.\" I thought the Soft Cell version from 1982 was the original, but it was originally recorded by Motown artist Gloria Jones 17 years before.","score":466,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Houndog by Elvis Presley was originally recorded by Big Mama Thornton","score":373,"comments":[{"body":"Also, Blue Suede Shoes was written and recorded by Carl Perkins before Elvis recorded the song.","score":122,"comments":[{"body":"My grandparents lived next door to Carl Perkins. He would let my brother and I swim in his pool during summers and Carl often came out with his guitar and played for us. I remember him singing “Blue Suede Shoes” while we swam. At the time, I had no idea who he was, lol.","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It’s My Life - No Doubt\n\nIt’s an excellent cover, but you gotta hear the [original](https://youtu.be/cFH5JgyZK1I) by a band called Talk Talk. They were a British synth-pop band from the 80s who went into all sorts of ambient music in their later records. One of my favorite bands ever, and I have Gwen Stefani and co. to thank for sending me down that rabbit hole.","score":59,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I Will Always Love You","score":441,"comments":[{"body":"I always wondered how Dolly reacted the first time she heard the Whitney version.   Turns out she said in a recent interview that Kevin Costner had gotten permission to use it and she then heard nothing more about it.   Then much later she was driving and heard it on the radio and she almost lost control of her car.","score":100,"comments":[{"body":"I have actually seem an interview with Dolly where they ask her exactly that question! Dolly, in all her beautiful class, proceeds to gush over the amazing job that Whitney Houston did performing this song. She said that it didn't even feel like the same song because Whitney added so much emotion and in different verses. Dolly just decided \"That's it. That is HER song now.\"","score":125,"comments":[{"body":"Dolly Parton is such a class act. What a sweetheart.","score":81,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What do you think about removing “In God We Trust” from American money?","not_safe_for_work":false,"locked":false,"body":"","score":202,"comments":[{"body":"I don't care whether it's there or not tbh. I'm atheist, I don't believe in any god. But 4 words are hardly on my to-do list for america.","score":171,"comments":[{"body":"If it was removed today and no one told me. I'll guess it would be five years until I notice - even though I always look on the back of quarters.","score":21,"comments":[{"body":"It'd probably take a lot of people a long ass time. Since cash is less and less common each year for a lot of people.\n\nI went to a small store the other day and tried to pay with cash for the first time in months probably. They didn't take cash","score":1,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I'm all for it, but don't waste money removing existing references.  This isn't a battle worth fighting to me.  So many other religious intrusions that matter way more.","score":17,"comments":[]},{"body":"It shouldn't be there, but on my list of things that need to be changed, this is way down the list. We need to take God out of the Supreme Court and the legislatures first.","score":167,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Never should have been there to begin with.","score":192,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"From what I've seen so far in my life, I don't trust god at all.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I think it’s justified, but it’s definitely not my primary concern. \n\nYou know what is a primary concern of mine, though? The inclusion of religion in politics and government.","score":6,"comments":[]},{"body":"Do it.  The phrase had a good 67 year run.  Time to try something else, like back to E Pluribus Unum or something.","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Shouldn't have ever been there. The founding fathers expressed that they wanted separation of church and government","score":55,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What is your kink?","not_safe_for_work":true,"locked":false,"body":"","score":310,"comments":[{"body":"I'm a pleasure dom","score":142,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'm a pretty normal feet and potatoes kinda guy","score":495,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Wouldn't you like to know, weather boy","score":834,"comments":[{"body":"where are your parents??","score":92,"comments":[{"body":"...Kids sketchy. Back to you guys.","score":72,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I get off on reading about other people’s kinks and then thinking about them when I masturbate.","score":376,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Hearing the woman orgasm.\n\nIt's an auditory thing I think spawing from watching scrambled porn back in my adolescent days and only being able to hear it.","score":78,"comments":[]},{"body":"I know it's probably vanilla compared to some of the rest of you, but female worship. I just want to find a girl with a free use kink who's willing to let me eat her pussy, finger her, and massage her whole body for hours. 🤷‍♂️","score":357,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"At this point? Basic affection","score":352,"comments":[{"body":"Human decency 😔","score":78,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"If you could telepathically say one thing to everyone what would you say?","not_safe_for_work":false,"locked":false,"body":"","score":101,"comments":[{"body":"\"To all subjects of Ymir. My name is Eren Yeager. I'm using the power of the Founding Titan to address all of Ymir's subjects...\"","score":227,"comments":[{"body":"Ha ha","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"“It’s actually pronounced ‘Jod’.”","score":215,"comments":[{"body":"This made me laugh way too hard. Thank you","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"*We are coming*","score":75,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Be excellent to each other.","score":179,"comments":[{"body":"And.. Party on Dudes!!","score":49,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"WE HAVE BEEN TRYING TO REACH YOU ABOUT YOUR CAR'S EXTENDED WARRANTY!!","score":150,"comments":[{"body":"You monster.","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Words are so imprecise. I would broadcast a feeling to everyone of unconditional love and acceptance. A lot of people have never felt that, and many have forgotten if they once did. Not saying it would solve any problems or anything. It would be more like a gift you give someone and expect nothing in return.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What do you guys think about period sex? Do you find it disgusting, arousing or you don’t care?","not_safe_for_work":true,"locked":false,"body":"","score":2958,"comments":[{"body":"As a guy, as long as I can shower after I’ve got no problem with it.\n\nMy wife can be one of two ways; super horny due to hormones, or so cramped and in pain she’d probably rip my manhood off if I mentioned sex, let alone tried it.\n\nSo really, it’s up to her","score":6569,"comments":[{"body":"\"I've got no problem with it\" says whilst featuring an avatar that confirms it 😂","score":2833,"comments":[{"body":"Avatar checks out.","score":292,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"For me it depends on where I am in the cycle. I have 2 really heavy days and I don’t feel remotely sexy. But any other days are fine. If it’s light, it’s a yes","score":2676,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Went back to girl's place one night. She warned me before but we'd both had a bit to drink and were beyond caring by that point. The night was magical. Amazing sex all night long. Spent the night. Over a cup of coffee the next morning I asked, \"So what are your plans for today?\"\n\nShe replied \"Probably gonna try clean up that murder scene in my bed. Looks like I slaughtered a pig in there.\"","score":6410,"comments":[{"body":"That's why you put a towel down, or a shower curtain.","score":623,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"If she gives me a heads up so I can put a towel or something down, and I have access to a shower afterwards, then I'm down for whatever.","score":415,"comments":[]},{"body":"A very old, very wise man once said, \"Doesn't matter, had sex.\"","score":2740,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"In Germany, we say \"Ein echter Pirat sticht auch ins Rote Meer!\" (A real pirate also sails on the Red Sea)","score":1759,"comments":[{"body":"I prefer “in der Regel hatten die Wikinger rote Bärte”, which (very) loosely translates to “in the Viking period, they had red beards”.","score":212,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What is the dumbest lyric of all time?","not_safe_for_work":false,"locked":false,"body":"","score":194,"comments":[{"body":"\"I'll have a quesadilla\" - Nickelback","score":131,"comments":[{"body":"And what the hell is on Joey's head?","score":46,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"“Just a shy guy, looking for a two-ply Hefty bag \n\nTo hold my love”\n\nHot damn, that is the clunkiest name brand drop that I ever heard of.","score":104,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“England is my city”","score":216,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“Only time will tell if we stand the test of time.”\n\nWell, yeah…","score":209,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Kid Rock rhymes \"things\" with \"things\"  \n… And we were trying different things  \nWe were smoking funny things","score":186,"comments":[{"body":"All while defiling the memory of Warren Zevon.","score":103,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"\"she got a big booty, so I call her Big Booty\" - 2 Chainz","score":276,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"Fucking Magnets, How Do They Work?\"","score":229,"comments":[{"body":"No, even better is the next line\n\n“And I don’t wanna talk to a scientist\n\nY’all motherfuckers are lying and getting me pissed!”","score":80,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Glasses wearers of Reddit, what are some things that become impractical when wearing glasses and how do you get around them??","not_safe_for_work":false,"locked":false,"body":"","score":637,"comments":[{"body":"Rollercoasters. Never actually had a problem wearing glasses, but i always feel they are going to fly off","score":474,"comments":[{"body":"On our senior class trip to Cedar Point, a classmate lost his glasses on the Top Thrill Dragster.\n\nI always roll mine up in the front of my shirt and gingerly hold onto it when I ride coasters.","score":118,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"3D movies were a struggle for a while, i solved this by not going to see 3D movies","score":317,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Vr is the biggest annoying one. I'll just wear contacts when  I dont feel like dealing with it","score":260,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When my face gets oily in the summer and my glasses slide off my nose all the time 😑😑","score":923,"comments":[{"body":"Oh yeah, I feel that. Mine don’t have regular nose pads since mine are plastic, so they get really slippery","score":113,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Laying on your side on the couch to watch TV.\n\nSolved by folding in one arm, and awkwardly balancing the glasses on your face, ignoring the arm in front of your eyes","score":466,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When it rains and you are cycling, walking outside...grrrr","score":719,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Coming in from outside on a winter day and its -20 and instant fog when you get in lol","score":454,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Opening the oven door. They steam up, so I put them on my head. They then get knotted in my hair, so now I have messy hair, bent glasses that now sit wonky on my face. Oh and the tickle of a random strand of hair in my glasses that I can't see because I have to take my glasses off to try and see where it is, therefore not being able to see anyway.","score":533,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Who is one celebrity nobody hates?","not_safe_for_work":false,"locked":false,"body":"","score":13364,"comments":[{"body":"Rick moranis. Although he did get punched by some random. That guy probably wouldn’t have if he knew it was him.","score":9999,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Maggie Smith","score":5657,"comments":[{"body":"That’s *Dame* Maggie Smith to you! \n\nBut seriously, she’s impeccable.","score":1814,"comments":[{"body":"Reminds me of 2007 Oscars:\n\nSteve Martin: And there's that *damn* Helen Mirren\n\nAlec Baldwin: Steve, that's **dame** Helen Mirren","score":434,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The late Fred Rogers.","score":20509,"comments":[{"body":"I met him when I was a young punk working in a video rental store. He was truly truly a saint. He chatted with us for a while and treated me and my metal head co worker with the same respect and love that he treated everyone on his show, and as he left told us he was proud to have such fine upstanding young men as his neighbors. \n\nOne of my favorite memories.\n\n[edit: He was buying a used copy of Billy Elliot to give to his nephew for his birthday, or maybe Christmas.]","score":14214,"comments":[{"body":"I've told this story many times on Reddit but, my dad GM'd a country club in Pittsburgh he was a frequent guest at. Fred Rogers would play bawdy sea chanties at the piano for the staff while they cleaned up after big events just to be nice/thank them. He knew it was funny for Mr Rogers to be cheekily dirty, so he always did it.","score":6357,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"A friend of mine grew up near to Fred Roger’s home and ran into him a few times. He told me that Fred was exactly who you’d hope he would be.","score":726,"comments":[{"body":"\"Never meet your heroes...except Mr. Rogers.\"","score":314,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"The biggest, hardest hitting insult I've ever read is \"You aren't being the person Mr. Rogers knows you can be.\"","score":631,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What movie has the best ending?","not_safe_for_work":false,"locked":false,"body":"","score":183,"comments":[{"body":"\nThis is Ripley, last survivor of the Nostromo, signing off.\n\nAlien","score":127,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\n\nThat'll do pig. That'll do.","score":73,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The Shawshank Redemption","score":420,"comments":[{"body":"Yes, I can watch this movie a thousand times.\n\nAfter years and years of being locked up with your best friend, finally having freedom must be angelic.\n\nNot only to have freedom, but to be reunited with your brother on one of the most beautiful beaches in the world. \n\nThen to spend the rest of your days in paradise after spending more than half your life in hell.\n\nHow can that not be the best ending ever?","score":81,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Monsters Inc. Such a beautiful ending.\n\n“Boo?”\n\n“Kitty!”\n\nAnd then that smile that Sully has. Damn, what a perfect ending!","score":123,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The Princess Bride. \"As you wish.\"","score":46,"comments":[]},{"body":"The Thing.\n\n“Why don’t we just...wait here for a while. See what happens?”","score":159,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The Prestige with all the reveals in the last minutes was amazing.","score":197,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Silence of the Lambs\n\n“Im having an old friend for dinner”","score":140,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\nMen in Black. Jay memory wiping Kay into retirement, tying back to the beginning scene. Then the tabloid cover: “man awakens from 35-year coma” to show Tommy Lee Jones is alright.\n\nThen zooming all the way out of our Galaxy contained in a marble to remind us we are just a small piece in an intergalactic puzzle. Absolutely beautiful.","score":92,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What country would you go to if monkey wasn't a problem?","not_safe_for_work":false,"locked":false,"body":"","score":39,"comments":[{"body":"Planet of the apes","score":112,"comments":[{"body":"I hate every chimp I see. \n\nFrom chimpan-A to chimpanzee.","score":1,"comments":[{"body":"🎶No you'll never make a monkey out of me.\n\nOh my God, I was wrong.\n\nIt was Earth all along.\n\nLooks like you finally made a monkey,\n\nYes we finally make a monkey. \n\nYes you finally made a monkey out of MEEEE?🎶","score":1,"comments":[]},{"body":"Dr Zaius! Dr Zaius!!","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"The Netherlands. Specifically to Amsterdam. That way, I don't have to spank my monkey","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oz","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Just here for the laughs… not disappointed","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Why can't you do it?  Why can't you set your monkey free? Always giving in to it.  Do you love the monkey or do you love me?","score":23,"comments":[{"body":"My monkey don't *scratch*  \nMy monkey don't *bite*  \nMy monkey don't swing no *tree*","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I want to visit a place with a monkey problem!","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What totally kills your boner?","not_safe_for_work":true,"locked":false,"body":"","score":6030,"comments":[{"body":"The apartment over mine having their bathtub fall through the ceiling onto our bed almost killing us","score":5106,"comments":[{"body":"Sexy","score":1466,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"At my age? Whiskey, unfortunately... first it sets the stage for it to be hard in the first place, then it takes it away... fickle bastard...","score":7211,"comments":[{"body":"Classic Shakespeare. “… It provokes the desire, but it takes away the performance.” \n(Macbeth Act 2. Scene 3)","score":3249,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Being on the clock. If I have to rush I can't get off.","score":3393,"comments":[{"body":"I thought you meant like being at work","score":772,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Hearing these words, “just hurry up and get it over with.”  Nah, I’m good.  I’ll skip it tonight.","score":7677,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Someone recently brought a baby round to the house. I didn't know they were coming or anything, but I just heard it crying from the other side of the house while I was doing the business. Not only did it kill my boner, it killed it for hours.","score":5347,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When she says something hurt, I just go concern mode.","score":6964,"comments":[{"body":"This is sweet tho. When I lost my virginity it took us a few tries because of course it was kind of painful for me, and every time I expressed that he would soften up because he was worried and didn’t want to cause me pain. Then he would get frustrated with himself for not being able to get it back. It took some time to get right.","score":953,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What is the most beautiful short poem ever written?","not_safe_for_work":false,"locked":false,"body":"","score":82,"comments":[{"body":"Stephen kissed me in the spring,\r  \nRobin in the fall,\r  \nBut Colin only looked at me\r  \nAnd never kissed at all.\r  \n\r  \nStephen’s kiss was lost in jest,\r  \nRobin’s lost in play,\r  \nBut the kiss in Colin’s eyes\r  \nHaunts me night and day.\r  \n\r  \n\\~Sara Teasdale","score":65,"comments":[]},{"body":"I walked a mile with Pleasure;\r  \nShe chatted all the way;\r  \nBut left me none the wiser\r  \nFor all she had to say.\r  \n\r  \nI walked a mile with Sorrow;\r  \nAnd ne’er a word said she;\r  \nBut, oh! The things I learned from her,\r  \nWhen Sorrow walked with me.\r  \n\r  \n\\--Robert Browning Hamilton","score":49,"comments":[]},{"body":"Nature’s first green is gold,\n\n\nHer hardest hue to hold. \n\n\nHer early leaf’s a flower;\n\n\nBut only so an hour.\n\n\nThen leaf subsides to leaf.\n\n\nSo Eden sank to grief,\n\n\nSo dawn goes down to day.\n\n\nNothing gold can stay.\n\n\n-Robert Frost","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I have a soft spot for Yeats' He Wishes for the Cloths of Heaven:\n\n\n\nHad I the heavens’ embroidered cloths,\n\nEnwrought with golden and silver light,\n\nThe blue and the dim and the dark cloths\n\nOf night and light and the half-light,\n\nI would spread the cloths under your feet:\n\nBut I, being poor, have only my dreams;\n\nI have spread my dreams under your feet;\n\nTread softly because you tread on my dreams.","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Do not stand at my grave and weep\r  \nI am not there. I do not sleep.\r  \nI am a thousand winds that blow.\r  \nI am the diamond glints on snow.\r  \nI am the sunlight on ripened grain.\r  \nI am the gentle autumn rain.\r  \nWhen you awaken in the morning's hush\r  \nI am the swift uplifting rush\r  \nOf quiet birds in circled flight.\r  \nI am the soft stars that shine at night.\r  \nDo not stand at my grave and cry;\r  \nI am not there. I did not die.\r  \n\r  \n\\-Mary Elizabeth Frye.","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Forget not that the earth delights to feel your bare feet, and the winds long to play with your hair.\n\nKhalil Gibran","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This one got me through a bad breakup:\n\nThe night has a thousand eyes,\r  \nAnd the day but one;\r  \nYet the light of the bright world dies\r  \nWith the dying sun.\r  \n\r  \nThe mind has a thousand eyes,\r  \nAnd the heart but one:\r  \nYet the light of a whole life dies\r  \nWhen love is done.\r  \n\r  \n\t\\-- Francis William Bourdillon","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"*The tiger*\n\n*He destroyed his cage*\n\n*yes*\n\n*YES*\n\n*The tiger is out*\n\n\n\n\nBy Nael, age 6, courtsy of Tumblr","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"She asks me to kill the spider.\nInstead, I get the most\npeaceful weapons I can find.\n\nI take a cup and a napkin.\nI catch the spider, put it outside\nand allow it to walk away.\n\nIf I am ever caught in the wrong place\nat the wrong time, just being alive\nand not bothering anyone,\n\nI hope I am greeted\nwith the same kind\nof mercy.","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"All the best of life is fleeting,\n\nUnexpected, unrepeating.\n\nMake a person glad to find you.\n\nLeave a better place behind you.\n\n-Sprog","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What's the most passive-aggressive thing you can bring to a Thanksgiving dinner?","not_safe_for_work":false,"locked":false,"body":"","score":219,"comments":[{"body":"A second turkey","score":776,"comments":[{"body":"My dad did this to my sister last year with absolutely no sense that bringing a Honeybaked pre-sliced turkey breast might be upsetting to someone who worked hard to make a turkey.\n\n1st Thanksgiving she hosted (after our mom died).  It’s my turn this year and I’ve flat-out asked him not to bring anything.","score":176,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"A second turkey wins but also cleaning products,  and then start quietly cleaning the host's house.\n\nMy grandmother did both of these things!","score":112,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The influenza virus.","score":103,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A family member's ex.","score":222,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"100% its a turkey. When asked why you brought a turkey, simply say \"I understand how hard they can be to cook properly\" and do not elaborate further","score":359,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A.A. Pamphlets","score":61,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Order a pizza.","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Unresolved childhood trauma","score":130,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A Native American","score":233,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What's your controversial music opinion?","not_safe_for_work":false,"locked":false,"body":"","score":1583,"comments":[{"body":"Some people might not be the best musicians, but they put so much emotion into their music that for me it's as good or even better than a perfectly performed song.","score":1823,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oversinging is a scourge on all music. I’m sincerely open to enjoying all types of music, but oversinging might be the only thing that actively makes me hate the song it’s on.\n\nIn case you don’t know what oversinging is, it’s that obnoxious habit of over-embellishing singing by adding needless runs, belts and generally squeezing every possible note into as little space as possible. It’s pure showing off, and does nothing to make the song better - in fact it makes it worse, it smothers the music and often works against the actual meaning of the lyrics they’re singing.\n\nEDIT: Wow, my first gold and highest voted comment ever! Cheers all! While I am here, let me give you a clear example of what I am talking about:\n\nListen to this version of \"[Baby It's Cold Outside\" by Cee Lo Green and Christina Aguilera.](https://www.youtube.com/watch?v=bu1tk1pdsf4&amp;ab_channel=KingXKhalid) Both extremely talented singers. And they completely ruin this song. Do they actually sound like they are meaning what they are saying? Do they actually sound like they are singing to each other? It's utterly soulless and unpleasant.\n\n[Now check out this version with Tom Jones and Cery Matthews.](https://www.youtube.com/watch?v=8wIVAfhVvhw&amp;ab_channel=DesmondG) Also extremely talented vocalists, but they keep in check. They sound like they mean what singing, they really bring it life. The result is so much better, so much more real and enjoyable. Even with the big belt at the end they keep it in check and match the instruments rather than overwhelm them.","score":2383,"comments":[{"body":"This is the main reason I can't watch singing competitions. Most participants do that on them for no reason and the crown goes wild while I'm just hoping they'll shut up. One guy sang \"Bridge Over Troubled Water,\" which is a slow, melodic song, and ended it by belting out and with a note squeeze. Fuck that guy","score":609,"comments":[{"body":"Makes me think of every time someone sings the American national anthem at a sports event. Jesus christ","score":386,"comments":[{"body":"Jack Black did a good version of The Star Spangled Banner where he just sang the damn song and didn't drag it out. Was so refreshing.","score":95,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Agree.\n\nOversinging is a good term. I call it vocal gymnastics, and yeah, it's annoying and detracts from the song.","score":78,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Looking at you Star Spangled Banner","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It sucks when people over-do the Star Spangled Banner. Come on, just leave it alone.","score":333,"comments":[{"body":"..... of the braaaAaaaaAAAAAaaaaaaaaAAAaa\n\nHate it too.","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Most of you who can't find good modern music are just really bad at looking for it, this holds true for every genre.","score":1985,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What does the Reddit community hate on the most?","not_safe_for_work":false,"locked":false,"body":"","score":1814,"comments":[{"body":"James Corden","score":3165,"comments":[{"body":"I actually never really was familiar with James Corden before Reddit. Never heard him speak, or anything he was involved with\n\nMost of that’s still the same but now I can’t stand the fucker","score":766,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Gender reveals","score":1809,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Reddit","score":834,"comments":[{"body":"and redditors.","score":304,"comments":[{"body":"Damn redditors... they ruined reddit!","score":193,"comments":[{"body":"You redditors sure are a contentious people","score":46,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Lately Twitter","score":1453,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Reposts","score":242,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Tiktok.","score":1176,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"(Serious) What movies have you watched that genuinely instilled fear in you or left you uncomfortable after watching them?","not_safe_for_work":false,"locked":false,"body":"","score":26,"comments":[{"body":"**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Requiem for a Dream","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The *Final Destination* movies.\n\nYou know how you always hear rumors about how an entire generation of people who first watched those movies had weird fears of their own cars or were scared to touch a spoon and stuff? Yeah, whatever you’ve heard is true and what actually happened to people!","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Paranormal Activity. Only the first one","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"To be honest, the first Paranormal Activity movie gave me the creeps. The idea of putting cameras in the house and seeing things move when they shouldn't creeps me out.","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The Mist","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Schindler's List really did a number on me","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The Grudge. Can’t watch it without looking in the corner to see if I’m about to die","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"'Barbarian' got me in a lot of ways","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Vivarium. I found it deeply disturbing. Every time I drive by a housing complex where all the houses are built the same way I shudder a little bit.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What is the best offline mobile game you have played?","not_safe_for_work":false,"locked":false,"body":"","score":244,"comments":[{"body":"\"I love hue\"is quite peaceful, and playing allows you to lose track of time. In aeroplane mode, there are no advertisements either:)","score":54,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Stardew Valley","score":171,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Angry birds. The original one when it first came out.","score":76,"comments":[{"body":"They just rereleased it for modern devices. Got rid of the ads and other bullshit. It's great to play again.","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Monument Valley. It's just a really fun puzzle game that scratched the itch for me","score":91,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Shattered Pixel Dungeon","score":55,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Plague inc","score":57,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Kingdom rush","score":17,"comments":[]},{"body":"Star Wars: The Knights of the Old Republic","score":12,"comments":[]},{"body":"Retrobowl","score":69,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"If you had a custom license plate, what would it say?","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"ASSMAN","score":14,"comments":[{"body":"I'm Cosmo Kramer, the Assman!","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I’d pay for a totally random set of letters and numbers that look just like a generic license plate. Only I would know!","score":5,"comments":[]},{"body":"PSY WGN","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"i would probably choose something that would look like a normal license plate but no one would know i paid a bunch more for it","score":4,"comments":[]},{"body":"COVFEFE","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Spider-Van.  Is that the right number of letters?  If it's too short add a 6 and if it can fit a 9.","score":3,"comments":[]},{"body":"I’ve always wanted to get an electric car with 1P21GW (1.21 gigawatts) as my plates. Sadly, it’s taken in my state… and I don’t have an electric car.","score":3,"comments":[]},{"body":"3JOH22A. some dude has that plate, in the rear view mirror it spells asshole. great prank","score":1,"comments":[]},{"body":"I actually do have a custom license plate but I'm sure as hell not going to put it here for the whole world to see! I'm sorry but I'd rather stay anonymous here.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What popular saying have you grown to hate?","not_safe_for_work":false,"locked":false,"body":"","score":43,"comments":[{"body":"\"No offense, but...\" Clearly if you have to say that, then you're going to offend the person with what you are about to tell them.","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“Well life isn’t fair”\n\nIt isn’t. But we’re almost never using it to talk about the concept of cosmic justice and how it’s wrong. We’re talking about specific individuals who use this as a way for people not to call them out on shitty behavior. \n\nYou get COVID the day before a vacation you’ve been really holding out for? Life isn’t fair sometimes. \n\nYour boss promotes his fresh out of high school son to a management position that was promised to you, a great employee of 10 years? Your boss is a dick.","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“Say it louder for the people in the back”…..","score":72,"comments":[{"body":"“You guys having a good morning so far?”\n\n“Oh come on I think we can do a little better than that! YOU GUYS FEELIN GO GOOD THIS MORNING?!”","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"“This”","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“Guess it’s free” when something doesn’t ring up","score":59,"comments":[{"body":"I've been out of retail for 20 years and this saying still makes me twitch when I hear it.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I hate all corporate jargon:  'circle back', 'out of pocket, (how did that come to mean out of the office?), 'let's put a pin in this', etc.  But I've come to REALLY hate 'Let that sink in'.  I read what you wrote and understood what you meant.  Don't be a condescending asshole by assuming I don't understand what your little freaking twitter brain crapped out.","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Be the bigger person.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"Thoughts and prayers.\"\n\nIf they actually did anything, you wouldn't need to vocalize it.\n\nIt's just virtue signaling.","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Which celebrity is considered beautiful but you just can't see it?","not_safe_for_work":false,"locked":false,"body":"","score":21018,"comments":[{"body":"A character on some show or game said the secret of celebrities is they're all actually strange looking or oddly ugly in some special way. I've always remembered that.","score":6737,"comments":[{"body":"I work in film and tv, and a big-time director once said to me (off-hand while we were both getting snacks in the office kitchen) \"y'know, the most famous actors are short people with oversized heads -- it's just what looks best on camera\"\n\ndude wasn't wrong....","score":4731,"comments":[{"body":"Why did I think immediately of Tom Cruise?","score":3041,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I mean, just look at Danny DeVito. By this definition he's a perfect TV face.","score":986,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I could be wrong but I remember some study that did an analysis of celebrity faces and most of them fall inside the golden ratio of \"average\" - as in celebrities are all usually pretty \"average\" looking ie \"conventionally attractive\" . Models on the other hand tend to be uhh \"unique\" looking.","score":824,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Case in point is Anna Taylor-Joy from Queens Gambit. Striking and memorable as she is strange looking.","score":2292,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"My search history is approaching 30 celebrities because I have no idea who most of these people are","score":18637,"comments":[{"body":"My knowledge of celebrities ended around 1998. Is Claudia Schiffer still insanely hot? Is Leonardo DiCaprio still dating a 19 yo?","score":4169,"comments":[{"body":"I don’t know for certain, but I’m going to guess yes and yes.","score":2868,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Remember when Blake Shelton was named sexiest man alive and literally not a single person agreed.","score":34853,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"When did you realize you're basically a dinosaur to young people?","not_safe_for_work":false,"locked":false,"body":"","score":17,"comments":[{"body":"My 10 year old sister, the absolute bitch, called me a boomer earlier.\n\nI'm fucking 22.","score":18,"comments":[{"body":"I'm 34, and I have a little sister that's 18.\n\nWhen she was a kid, there was a black and white film from the 40s on the TV, and she actually asked me if that was the sort of TV we watched when I was a child. \n\nI'm not that old!","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"The second the new lingo being used turned from a cool word I would use to annoying and stupid.","score":7,"comments":[]},{"body":"My coworker didn't know what y2k was, and how they didn't use four digits for some date programming","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When at my 20's a 3rd grader told me he thought I was 46. I had never recovered from that one.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When my 12 year old niece was talking about the celebrities she found cute and I had to Google every since one of them.","score":5,"comments":[]},{"body":"About 20 years ago","score":4,"comments":[]},{"body":"We got a babysitter for my son when he was very young. She was closer in age to him than to me. That made me realize how old I am to a high school kid.","score":4,"comments":[]},{"body":"Find out they’ve never seen much less even heard of some of my favorite movies that I consider must watch classics. So I put it on the TV and they instantly say “this looks old”. \n\nI will cut a kid.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When people a bit younger then me started doing tik tok dances and talking about tik tok. I don't know what a tik tak is but I want no part of it.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Men of reddit, what types of women would you never date?","not_safe_for_work":false,"locked":false,"body":"","score":22,"comments":[{"body":"Women who don't like me back :(","score":49,"comments":[{"body":"Read this as \"don't like MY back\", and I was picturing what could be wrong with your back.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Girls who can’t say “sorry” or “thank you”","score":28,"comments":[]},{"body":"A very (very) pretty girl at work I used to talk to sometimes at break time found out I was getting married and came up to me one day and said \"I can't believe you're getting married. I could never go through life with just one dick\". Then she turned and started walking in the direction I had been walking. When I resumed walking, she stopped suddenly so that I bumped into her. She had her bum out and I ran right into it. It was easily the most blatant attempt by any girl trying to get me to take a sexual interest I'd ever seen in my life. What she didn't know is that I had massive hangups on fidelity and cheating and she literally couldn't have made it easier for me to walk away. Women should be able to be sexually forward, but that was being a sleaze bag. If I were single I would never date a woman that doesn't respect boundaries.","score":30,"comments":[{"body":"She's not interested in you. She's interested in being a more attractive woman than your wife and proving it by taking you away from her. \n\nThat's all.\n\nThis is half the reason why relationships you get into when you cheat on your woman never last. Once you've broken up with your current girl, the girl you broke up for is now longer interested because she's gotten the validation she wants.","score":22,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Women who do sex work. Nothing against sex workers, but that's something I wouldn't be comfortable with, regardless of whether it's OnlyFans, full prostitution, or anything in between.","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Girls who are lazy or spoilt. Literally everything would be ruined by them.","score":14,"comments":[]},{"body":"The ones looking for sugar daddies.","score":14,"comments":[]},{"body":"Married women.","score":12,"comments":[]},{"body":"Narcissists (at least not another one)","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What are some well known 'facts' that are actually untrue?","not_safe_for_work":false,"locked":false,"body":"","score":33,"comments":[{"body":"Swallowing gum does not result in it sitting in your stomach for seven years.","score":54,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You are more likely to get killed in car crash when you're near your home, because you know the road very well and relax too much.\n\nWhile in fact, it's simply because you are statistically more often driving in your home perimeter than out.","score":112,"comments":[{"body":"When I read that most accidents occur within 3 miles of your home, I freaked out and moved.","score":46,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"86.3% of stats are made up on the spot.","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If your palm is larger than your face, it indicates that you have cancer. This is not correct. In fact, it's a ruse to trick you into putting your hand up to your face, only for Steve to smack your hand into your own face in front of the entire class, including Jessica, whom you've had a crush on since fourth grade! The sting of shame and embarrassment will last a lifetime, but the pain of hitting yourself in the face will fade.","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Touching toads or frogs give you warts","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Starve a cold, feed a fever. It was originally, if you starve a cold (don't eat properly when you're sick) you'll end up feeding a fever (trying to eat properly when you're even sicker).","score":16,"comments":[]},{"body":"“Scar tissue is stronger.” False. Scar tissue takes up to 18 months to fully form and is, at best, 80% of the tensile strength of the original skin.-\nCertified Wound Care RN\nOh, and dogs don’t have “antibiotic qualities” in their saliva. They have poop, because they lick their own buttholes.","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Eating carrots are good for the eyes.","score":13,"comments":[{"body":"Apparently the UK made that up during WW2 to hide the fact that they were using radar to detect enemy bombers at night and didn’t want the Germans to find about radar","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"If they KNOW that you know Dasher and Dancer and Prancer and Vixen and Comet and Cupid and Donner and Blitzen, WHY would they think you don't know \"the most famous reindeer of all\"?","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[{"body":"Spoken like a true litigator.","score":10,"comments":[{"body":"I could see this being something that evolves into a SCOTUS case of the public versus Saint Nick.","score":3,"comments":[]}]},{"body":"D&amp;D&amp;P&amp;V&amp;C&amp;C&amp;D&amp;B were invented by C.Clement Moore in his 1822 poem *A Visit From St. Nicholas*, aka \"Twas the Night Before Christmas\"\n\nRudolf was invented a hundred years later in the 1930s as a marketing stunt by a department store called Montgomery Ward.","score":6,"comments":[]},{"body":"If I was Rudolph wouldn't have helped them motherfuckers!!!\n\n Oh you all like me now now that I'm literally the only person who can get us out of this that's convenient!!!\n\nFUCK YOU FAT MAN","score":4,"comments":[{"body":"HELL YEA","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"He was not only the most famous reindeer of all, but also the most infamous. After using his nose to save Christmas he went back to the North Pole and got heavily involved in the red light district. Those elves got a lot of action.","score":3,"comments":[]},{"body":"I’ve asked this myself many times. We are being played.","score":3,"comments":[]},{"body":"They were a part of the branch davidians and eschewed the outside world.","score":3,"comments":[]},{"body":"Yeah also in the claymation Rudolph movie at the end the elf throws the \"bird that doesn't fly it swims\" off of the sleigh without an umbrella likely to its death.","score":3,"comments":[]},{"body":"Didn't that dude join the club a bit later than the rest?","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What is the worst social media app?","not_safe_for_work":false,"locked":false,"body":"","score":108,"comments":[{"body":"Not on social media from past 3-4 years. Life is good. I only use reddit for like 10-20 minutes a day and sometimes not even that so basically I'm off social media and life is wonderful.","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Tiktok. Rewires your brain for a shorter attention span.","score":557,"comments":[{"body":"It is digital cocaine.","score":55,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I’ve noticed this. I have a job where I have long periods of free time. I used to watch YouTube videos or streams or things like that, but after being on TikTok for the past year or two I can hardly make it through a 20 minute video unless I’m 100% invested in it.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Twitter also does so. Aldous Huxley nails it, toxic brevity:\n\n&gt; “The soul of wit may become the very body of untruth. However elegant and memorable, brevity can never, in the nature of things, do justice to all the facts of a complex situation. On such a theme one can be brief only by omission and simplification. Omission and simplification help us to understand - but help us, in many cases, to understand the wrong thing; for our comprehension may be only of the abbreviator's neatly formulated notions, not of the vast, ramifying reality from which these notions have been so arbitrarily abstracted.”","score":93,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Instagram.\n\nEverybody is a model, everybody has nice vacations, everybody lives in a mansion. It just makes you hate your own life.","score":220,"comments":[{"body":"I just follow cats and other animals","score":97,"comments":[{"body":"I like to follow museums and illustrators. \n\nI just wished they would show the posts chronologically. If I am following someone, I want to see their posts as they put them up. Not a day or two later.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You're too good for this world.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"TikTok leads the pack. Instagram is moving in fast. My husband tells me I'm not very social but social media isn't what it used to be. I could keep in touch with friends and not have to see films or reels of half naked women. I don't want to be social with them, they aren't real and over half og them are underage Chinese little girls, maybe 13 at most but most are younger. Not what I want to see, follow or be any part of.","score":69,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What was your biggest fear when you were a child?","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"Tornadoes. But then again, I grew up in Tornado Alley.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Quicksand","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Going to hell. Religion fucks kids up.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Home invasion. \n\nI happened to catch a handful of those later evening news specials that were all about this topic when I was around 8 years old. First time I ever had what felt like a legit panic attack.","score":3,"comments":[]},{"body":"Heights and chipmunks. Super random I know, but it's true.","score":2,"comments":[]},{"body":"My Parents","score":2,"comments":[{"body":"I’m sorry 😢❤️","score":3,"comments":[]}]},{"body":"The dark, since I grew up with creepypastas I always thought Jeff the Killer or Smile Dog was going to kill me outside in the dark......","score":2,"comments":[]},{"body":"Armageddon","score":2,"comments":[]},{"body":"bloody mary. i used to use the bathroom with the door open and have my mom stand with me","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What is something you grew up thinking it was totally normal, then later realized that it was actually completely f*cked up?","not_safe_for_work":false,"locked":false,"body":"","score":16,"comments":[{"body":"I was always in trouble ages 13-18. Not like just a little trouble, like major trouble all the time. Even when I hadn’t done anything yet. I never knew why literally everything I had a thought of doing (like having sex for the first time or if I wanted to tell my mom I was at someone else’s how when I’m really somewhere I’m not supposed to be - ya know basic teenager stuff), I would get in major trouble! Even if it was just a thought I had and didn’t even do anything yet, my parents always knew! It was literally everything. And I wouldn’t just get grounded, it would be screaming matches, taking my door away, emotional abuse. I just figured I was a bad kid and there was no such thing as hiding anything from my parents and no such thing has having an ounce of privacy.\n\nFast forward when I was 20 years old and moved out, I decided to sell my laptop I had since a kid and my old phone. Guess what the computer shop found? Nearly 10 years worth of key logging, camera hijacking, screen recording and gps monitoring data from a spyware. And it was still actively pulling data…","score":26,"comments":[{"body":"That's some f*cked up shit right there. I'm sorry you had to endure all that. That must have left you traumatized, hope you put boundaries and that you're getting yourself together now.","score":14,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Casual sexism and sexual innuendos in my favourite childhood movies","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Thought it was normal that the oldest girl helps take care of the other children, including those older than her. \n\nWasn't until I was an adult that I realized how messed up it was and how much of my childhood was affected by it.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"How my mind works.\n\nI feel like ADHD has been pretty normalized with how many people have been diagnosed in the past couple of years, but recently I've come to learn that I have a few different conditions that do things that I always thought was just normal to my ADHD but we're actually something entirely different and it's really changed my way of thinking about things.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My parents put peanut butter in the fridge","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Eating garbage junk like fast food for most of my meals.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That being physically and verbally abused by your drunk father was normal.\n\nAnd that it was something \"we don't talk about\".\n\nAnd that you never had holidays ever, your parents worked all day and night at their restaurant and you just come home from school by yourself and heat up dinner.\n\nAnd that you would wander the streets by yourself, your parents having no clue where you are but you came home at night, but got hit by a car and also molested by a filthy paedo.\n\nOk, some of those I knew were not normal, but in general this whole thing I now realise was domestic abuse but back then it was just ... normal, except \"we don't talk about those things\" and \"they shouldn't have happened.\" Also the whole fill in your own day and you could be dead or alive or anywhere for all your parents knew. I find it weird sometimes how children are constantly supervised or can't go anywhere, but then remember the being hit by the car and the paedo and go, oh yeah, that's why.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Show me the poop knife!!","score":5,"comments":[]},{"body":"That I'd be going to hell when I died because I was born sinful and everything I did was sinful. 🤨","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What is a fashion trend that you absolutely hate?","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"Fast fashion generates a mind boggling amount of waste","score":14,"comments":[]},{"body":"Wearing pajamas as regular clothes. Takes me off guard","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Booger catcher nose rings and and other dangley jewelry like ear gauges.  Used to work in a factory where those kinds of things can get ripped out in many inventive ways.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Sagging pants","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Most main land Chinese fashion","score":7,"comments":[]},{"body":"Trends. They’re for the anxious and insecure.","score":7,"comments":[]},{"body":"Crop tops. I want a whole ass shirt please","score":6,"comments":[{"body":"For me its specifically stuff like cropped jumpers.\n\nIf I'm cold enough to need a jumper, it has to be a full one.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I'm convinced that a lot of weird women's fashion trends get started by attractive women who can make anything look good. Idk how mom jeans made it through though because NOBODY looks good in those.","score":1,"comments":[]},{"body":"Puffy-sleeved dresses worn with sneakers/trainers","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The person next to you on the plane has a nose that whistles with every breath. What do you do?","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"This is why I bring noise-cancelling headphones!","score":9,"comments":[{"body":"I fly every week. If I didn’t have headphones, I’d go insane. Bunch of people making shuffling noises, random coughs, kids being lil shits, and awkward convos where the random super friendly person locks someone into a 2 hour interview that the other likely didn’t want. For the love of God give me music","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Tap my pen in tune, and hope that the person on whistler's other side takes up an instrument, so we can be a band!","score":7,"comments":[]},{"body":"Ear plugs.","score":6,"comments":[]},{"body":"Fart","score":4,"comments":[{"body":"Next thing you know there's a follow-up post that says \"The person on the plane next to you has a butthole that whistles every time they fart. What do you do?\"","score":5,"comments":[]}]},{"body":"OP clearly on a plane right now.","score":4,"comments":[]},{"body":"Beatbox to it","score":8,"comments":[]},{"body":"get my headphones on and blast a loud song","score":3,"comments":[]},{"body":"Get out a tissue and loudly blow my nose, even if I don't need to.  If it's anything like yawning or coughing, it'll make the next guy over feel the need to do the same.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"If you could have a sit down dinner with 3 other people, living or dead, who would it be?","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"I'd pick three living people, dead people put me off my dinner.","score":9,"comments":[{"body":"I think this question is about if YOU are living or dead. Jeez, read the question.","score":1,"comments":[{"body":"Would someone feed me if I chose to die though?  I don't want to miss out on a free dinner.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"That one guy's dead wife","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Hitler, Bin laden, and Toby","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My dad (who died 10 years ago), my 9 year old and my 6 year old (who are both very much alive and healthy). One of my biggest regrets is that my dad never met my kids.","score":1,"comments":[{"body":"This is so sweet. I’m sorry they never got to meet their grandpa, but just try to take note of the little bits of him that you see in them. He lives on.","score":1,"comments":[]}]},{"body":"Mao, Hittler, and Pol Pot \n\nDon't judge me. I'd just expect the moment they'll start poking each other with their forks.","score":3,"comments":[]},{"body":"Bob Ross, Mister Rogers, and Robert Keeshan (Captain Kangaroo)     \n     \nThe wholesome would be off the charts.","score":1,"comments":[]},{"body":"Greta thunberg, trump, kanye. Watch the chaos unfold","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"who remembers tins full of buttons?","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[{"body":"me. I’d dig through them looking for the fancy ones and group same type buttons.","score":5,"comments":[{"body":"Lol yup. I would separate them by color then by size then by how many holes they had and if they had the tab with hole in back.","score":4,"comments":[]}]},{"body":"I mentioned this to someone before and they looked at me like i was crazy! I remember the buttons. i also had a tin of marbles i used to dump on the floor and they'd go rolling everywhere. it also reminds me of the jars of sand everyone seemed to have. and you'd have to keep tipping the jar over to find the blue button or the little dog or what ever was on the list.","score":3,"comments":[]},{"body":"Shit, we just inherited the button tins from my wife's 100 year old grandmother. Crazy, watching everybody dig through and find little gems that they think look really cool.","score":3,"comments":[{"body":"I know right? It's like a time capsule.","score":2,"comments":[]}]},{"body":"My mom has my great grandmother's, in a cut tobacco tin box.","score":1,"comments":[]},{"body":"Barely","score":1,"comments":[]},{"body":"Pepperidge Farms remembers.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"or giant jars full of books of matches","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My mother had an old 48 oz jar that was fir peanut butter and washed it out and kept buttons like crazy.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"If the characters acted logically, what tv show should have ended in the first season?","not_safe_for_work":false,"locked":false,"body":"","score":84,"comments":[{"body":"Murder she Wrote.  People should just stay the fuck away from Jessica Lansbury and they'll probably live a lot longer.\n\nEdit:. Jessica Fletcher, played by Angela Lansbury.  Thank you!","score":98,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"House. No logical administrator would employ a liability like that.","score":129,"comments":[{"body":" first there's not a nurse working there, and second you would throw that insubordinate fuck out rather than have riots in your staff.","score":31,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Gilligan should have been removed one way or the other","score":42,"comments":[{"body":"They had wood suitable for rafts on that island.  Patch the hole in the Minnow. Next they make to mast for the boat.  Use the ridiculous amount of clothing Ginger and the Howles had with them to fashion a sail.  Either just Skipper and Gillian go bring back help (the Professor had determined the location of the island in season 1) or get everyone on the boat and trek towards civilization.","score":36,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Pretty Little Liars. Just go to the police, tell the truth and the show would be over.","score":115,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Probably *How To Get Away With Murder*.\n\nIf the kids had called the police and said that &gt;!they just stopped their professor's husband from murdering their classmate and may have accidentally killed him in turn!&lt;, they probably wouldn't even be in that much legal trouble, with some careful wording. Especially if they revealed what provoked it - &gt;!Rebecca had walked in on Sam attempting to dispose of evidence that he arranged a murder that his wife was now investigating. They would've also got it on recording that Sam *wasn't* dead but started attacking the students again, making it a caught-on-tape act of self-defense.!&lt;","score":31,"comments":[]},{"body":"I gotta go with Breaking Bad. If Walt had taken that job with Elliot at Grey Matter the show is done.","score":229,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Ned stark would have never trusted Littlefinger","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Castlevania. If they don't burn Dracula's wife, the world goes on peacefully.","score":63,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What is something others assume about you that is completely false? (SERIOUS)","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"I'm happy.\n\nNo. I am miserable.","score":1,"comments":[]},{"body":"That just because I’m quiet, I’m not nice","score":1,"comments":[]},{"body":"That I'm a high schooler\n\nI'm like a good 5 - 10 years older than most people think because of my growth disorder","score":1,"comments":[]},{"body":"Some assume that my legs not working means that my mind also doesn't work.","score":1,"comments":[]},{"body":"I’m a bit of a rough cut guy.  Former military, amateur fighter, drive a murdered out fully custom muscle car.  They think that means you don’t have a softer side.  I cry during some movies, will help people when I can, and am totally in love with my bunnies.    \nAnother assumption is I vote conservative.  Nope.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Older redditor and father of two here, including a severely disabled child.\n\nOthers assume that I know what I'm doing.\n\nI'm just reasonably honest, and perhaps have been a little lucky in selecting my friends and colleagues.\n\nI have an awesome wife that does way, way more lifting than most people realize. And I try to think and maybe research a bit before I start committing to any super-important courses of action.\n\nFeh. \n\nTruth is, often it's just me saying \"let's try this because I don't THINK it will break anything worse.\"\n\nThe formula seems to have worked reasonably well so far, although there have been more than a few major winces where it did not. But there's still lots of times where I feel like I'm impersonating an adult. It never truly goes away.","score":1,"comments":[]},{"body":"I'm confident and fit. People think I'm packing a Pringles can, but it's more of a Snickers bar","score":1,"comments":[]},{"body":"That because I am Hispanic I know Spanish.","score":1,"comments":[]},{"body":"They think I'm serious just bc I'm shy and quiet but that's not true 🫠","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Which Simpsons scene lives rent free in your head?","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"“DENTAL PLAN!”\n\n“LISA NEEDS BRACES”","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“Feels like nothing at all!”… “Stupid Sex Flanders”\n\nAnd\n\n“Im Bart Simpson, who the hell are you?”","score":1,"comments":[]},{"body":"Tomacco!","score":1,"comments":[{"body":"Tastes like grandma!","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Sideshow Bob stepping on those rakes.","score":1,"comments":[]},{"body":"🎶See my vest!","score":1,"comments":[]},{"body":"“IT’S CHOWDAH! SAY IT FRENCHY!”","score":1,"comments":[]},{"body":"Abe Simpson's  'IT'LL HAPPEN TO YOU ' moment\n\nFucking A right","score":1,"comments":[]},{"body":"[I bring you love]\n(https://youtu.be/b4Kdp3CHoK4)","score":1,"comments":[]},{"body":"The one where homer makes a speech about how some lady degraded him and the whole time hes looking at her boobs and then he says \"I've made up my mind\"","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How do you keep going when the world has become so rotten?","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"Be good to the people around you. Volunteer for something in your area. You can't fix the world or humanity but you can do some good in the lives you touch.","score":20,"comments":[{"body":"Thank you for your advice. It really helps.","score":3,"comments":[]},{"body":"I just started donating blood - my only regret was not doing this sooner.","score":2,"comments":[]}]},{"body":"If the will to live was a pizza, I'm on my last slice.","score":7,"comments":[]},{"body":"[Look for the helpers.](https://youtu.be/-LGHtc_D328)","score":3,"comments":[]},{"body":"I don't know..... life is almost unbearable right now. People don't care about nobody but themselves,  I believe I care too much for people that look right through me, I feel like a ghost who doesn't know they are really dead. I have no friends or family. All I do is work, come home to an empty house and get high because it's my only escape. I'm definitely an addict but living life without some relief just doesn't feel possible. I have not been in a relationship in years. I have a lot of trauma to get past. Maybe I just need therapy I guess. Sorry, I'm not trying to bring anyone down, I just felt that I needed to say something to an actual person, even if it's just online.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Technically it's not. Overall things are on an upward trend. Just bads news travels fast and makes clicks and views.","score":10,"comments":[]},{"body":"I've been alive for 24 years at this point I'm invested.","score":2,"comments":[]},{"body":"I go out of my way to be kind and create beautiful changes everywhere I go.\nI know it sounds cheesy but it has become a way of life.\nFor every shitty thing I know or see I will try and do 2 or 3 good deeds.\nThat’s how good actions and love will overtake all the shit.\nI refuse to let the bad things make me depressed, I will just go and do even better so that negative energy can go to hell!\n\nI’d say the first year it might have been a conscious decision every moment of the day… not anymore 🙏😅","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Focus on your “immediate world”, the people you interact with on a daily basis, neighbors, friends, colleagues, and improve that your part in the big world. Control the things you can control and accept the things you cannot.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What tastes absolutely amazing?","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"Enchiladas","score":13,"comments":[]},{"body":"Burgers","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cold beer in a hot shower with the lights off and your favorite music playing while you pee.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Chicken pot pie 😋🥧","score":3,"comments":[]},{"body":"tiramisu","score":3,"comments":[]},{"body":"Papa John's garlic sauce.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My S/O.","score":4,"comments":[]},{"body":"Human meat","score":3,"comments":[{"body":"Police....","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Have you got the hunger?","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What do you do if you can't afford Christmas gifts for everyone?","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"Be artistic and make them gifts. It’s pretty cheap and it works well","score":14,"comments":[{"body":"I usually make homemade gifts too or bake a cake.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Christmas isn't about gifts.  It's a time to enjoy the company of friends and family.","score":10,"comments":[{"body":"Corporate America would like a word with you, saello.","score":3,"comments":[]}]},{"body":"Bake some cookies?","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Write them letters about a few points why you have always loved, or learned to love Them. Maybe a few points about what makes you special. I guarantee this is a gift they will never forget.","score":6,"comments":[]},{"body":"Bake something","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Get a combined gift for everyone. Take everyone out somewhere, doesn’t have to be expensive, just an experience.","score":3,"comments":[]},{"body":"My son is the only one that receives gifts from me and no one else, most people are hypocrites anyways, don't worry about it and just gift to whoever is the most special person or pet in your life","score":3,"comments":[]},{"body":"Experiences\n\nDrive everyone out to a hike in a mountain and bring a picnic lunch for everyone. Doesn't have to be that specific, but think of a day out you can do with people. Christmas memories matter more than Christmas stuff","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Which fictional food would you like to try?","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"Lambas bread from LotR. I’ve tried some renditions of it but to try the real stuff would be fantastic","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not food per se but I'd be down for a pan galactic gargle blaster.","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The gray stuff, I hear it's delicious.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Butterbeer.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I’ve always wanted a krabby patty","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Mario's mushrooms 🍄","score":8,"comments":[{"body":"Dont wanna eat peach?","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"The gum from Charlie and the chocolate factory that tastes like an entire roast beef dinner","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"*Lembas.*","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Klingon Blood Wine out of the skull of a freshly slain foe...","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What is your honest opinion of Jehovah's Witnesses?","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"Delusional child abusers.","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"brainwashed.","score":12,"comments":[]},{"body":"Stay away from my door &amp; we're good.","score":12,"comments":[]},{"body":"I dislike people ramming their religion down the throats of others.","score":9,"comments":[]},{"body":"Their missionaries aren't as sexy as Mormon missionaries (imho)","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The worst of all the cults. 2 witness rule protects child abusers.","score":6,"comments":[]},{"body":"It’s a cult. Like Scientology.","score":5,"comments":[]},{"body":"brain wash, also making people work extra hard and they track metrics and a lot of things related with performance","score":4,"comments":[]},{"body":"No more or less crazy than the others.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Bit spooky","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Do you like your name that your parents gave you? If you don't, why?","not_safe_for_work":false,"locked":false,"body":"","score":74,"comments":[{"body":"Who waits 9 months to name their child \"Jonty\"","score":57,"comments":[{"body":"Jonty’s parents!","score":21,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"My Native name when converted to English word for Word stands for chicken feet","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No, never did and still don't.  Just don't like the sound of it.","score":22,"comments":[]},{"body":"No.  It's nearly impossible to pronounce.  There are three possible ways to say it, and my family uses what appears to be the least common.  To make things worse, it's one letter off from a very common name in my generation, so I have quite frequently been called another name altogether.  And when you have a weird name, people feel free to tell you you're wrong about it--not just how to say it, but sometimes what it even is.","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No. They didn't spell it the way it is supposed to be pronounced, so 99% of the time, my name gets mispronounced. I have given up on correcting people and just respond to what is said. My mom said I should stick an accent over one of the vowels to help, but I think that is fkn stupid. I don't even think it would help. \n\nNot to mention, we are white, and this is a sort of ethnic Spanish type name. My siblings have normal names like Carrie, Sarah, Jennifer.  Then my name sticks out like a sore thumb. No idea wtf they were thinking when they came up with my name.","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nope, never liked my name.  My mom named me.  My dad told me what he wanted to name me.  \n\nDamnit mom, dad's name was way better.  I can't even properly say my own name for reason.  I don't have a speech impediment but with my own fuckin name I seem to.","score":36,"comments":[{"body":"So, serious question, why not legally change your name?","score":16,"comments":[{"body":"I've thought about it, but I do love my mother.  Kinda the only th8ng she wholly gave me from the jump.  She explained the movie or wherever the fuck it came from.  \n\nI'm 36....I'm a dude and I changed my last name when I was 17 (dont ask) and that shit made a cluster fuck of my life for like the next 4 yrs.   Ppl didn't know how to fund me...social security all messed up.  FAFSA and student loans all messed up.  Ppl couldn't f8nd me haha.\n\nIt's such a pain in the ass.  I don't want to tell ppl anything ever if I can help.  I'll keep it,  we are kind odf attached to eachother at this point.","score":13,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"I got my asshole father's name and my full name basically translates to \"polluted river\" 😑","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What are some goods things to include in a comfort care package for someone going through chemo?","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"A small stuffed animal type thing is appropriate for any age. There is something comforting about having one when you're awake at 2am and your brain won't shut off.","score":5,"comments":[{"body":"Good idea. There are weighted ones, for anxiety. Also, perhaps a heating pad. If this person is losing hair in the winter, a soft cap to wear at night is nice, too.","score":3,"comments":[]}]},{"body":"anything that calms a stomach.","score":2,"comments":[]},{"body":"Warm slippers, hats that keep your head warm that wouldn't look like a giant beanie so it can be worn insight. Also heated blankets.","score":2,"comments":[]},{"body":"Marijuana gummies","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Carob chocolate","score":1,"comments":[]},{"body":"Fuzzy socks. lap blankets. Puzzle book or coloring book (they make them for adults)","score":1,"comments":[]},{"body":"Chap stick, or other unscented lotions and creams.","score":1,"comments":[]},{"body":"Gift cards to restaurants that deliver. Ginger candies for nausea.","score":1,"comments":[]},{"body":"Something to make them laugh. My SIL bought me a Strange Planet book when I was recovering from surgery and it made my whole day.\n\nAlso something to keep them warm. Warm socks, a comfy sweater, a beanie hat, etc.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Which Final Fantasy is your favorite?","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"FFX will always be my favorite.","score":10,"comments":[{"body":"Easily has the best levelling system of the entire series, IMHO.\n\nAnd the emotional content... I think I teared up like ten times throughout the game. Totally not a coincidence.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Objectively 7 is the best. \n\nBut 9 was \"my\" final fantasy series growing up. So 9 holds a special spot in my heart.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"4 will always hold a special place in my heart as my first JRPG, but realistically speaking, 6 is my favorite.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"8. I was obsessed with that game.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'm currently playing VI for the first time and loving it!\n\nIf I had to pick one, I'd go with FFXII. Not a popular choice, but I really liked the open world, lore and level-up system.","score":4,"comments":[{"body":"FFVI is my all time favorite. I hope you enjoy it!","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"XI then X","score":4,"comments":[{"body":"Waiting for the X fans to show up in droves... Unpopular opinion, but X is an absolute gem in so many ways and should be the overrated one, not VII","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Six","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How do you get yourself motivated if you feel like you're chronically lazy?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"Heard of this Chinese learning method where you study for five minutes, break for 10 then gradually increase the study time but keeping at least an hourly break where you can have fun, eat a snack or whatnot, works pretty well for cleaning on weekends in my experience but not as good motivation as getting paid.","score":3,"comments":[]},{"body":"I give myself 30 minutes if I can spare. Then I decide I made myself a deal and my 30 minutes is up.","score":2,"comments":[]},{"body":"Motivation is fickle af, strive for discipline. Discipline has been around the world twice before motivation even got its shoes on.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nothing you do will come in handy. I have tried. But I also know it's gonna be like this if I let it be. So. I just push myself doing something I am supposed to do until I feel normal. So that feeling last just for a few days at max until it gets easy to manage. \n\nBut to do that, you have to show a bit of courage and will power and do something you are not feeling like doing, resisting against giving up until it's not hard.","score":2,"comments":[]},{"body":"Adderall","score":1,"comments":[]},{"body":"What works for me is a reward system plus 20 minute increments of work.","score":1,"comments":[]},{"body":"I give myself a countdown.  \n\nI usually choose random numbers too, like in 23 seconds I'll get off reddit and go eat.","score":1,"comments":[]},{"body":"when i'm feeling lazy and am having a hard time getting up, i do a count down to get up. just a quick 1-2-3, ALRIGHT I'M UP DAMMIT. then i jump around a bit to get the blood flowing","score":1,"comments":[]},{"body":"The big thing that's helped me is teeing myself up for what I need to do. If my goal is to work out tomorrow, tonight I'm going to lay my gym clothes out next to the bed, put my keys and wallet in my gym bag, and put a bottle of water on my nightstand so that as soon as my alarm hits, it's all there ready to go.\n\nWhen I'm wrapping up at work, I make a list of the next days tasks, clean up my inbox, and tidy my desk so my workstation is exactly how I want it the next day.\n\nJust little 5 minute rituals like that have really helped me stick to my commitments to myself.\n\nAlso, I try and think less about shit and just go. If it's gonna be a pain in the ass, all thinking will do is guide me to reasons not to. If I get into the tiniest first step before my mind has time to bargain with itself, I'm usually well into the shit I need to do before I realize I don't want to do it!\n\nMore recently I had this realization that I spent years trying to make my brain function better, be more efficient, more disciplined. It hit me that it's totally unrealistic to try and rewire my entire mind. I need to accept my mind as it's always been and learn to work with it instead of against it. It's okay to think working out sucks, as long as I know I need to do it and get my ass through those doors in the morning. It's okay to hate bullshit admin work as long as I know it needs to be done and get that first box checked so I can build momentum.","score":1,"comments":[]},{"body":"I think how grateful my future self will be. My future self is worth whatever effort I put into doing what needs to be done now.","score":1,"comments":[]}]},{"title":"When was the last time that money bought you happiness and what was it?","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"I bought myself a new computer for the first time since 2005 a couple months ago. 17 years of getting hand me downs from friends or buying used. Finally in a financial place where I can afford that luxury.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Bought a jet ski. Can’t be unhappy on that.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Last year's Christmas bonus that I used 25% of to pay for groceries for some low income families in my community.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Macarons. Everyday.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Bought myself a brand new car outright last year. It is my first brand new car. All of my other cars have been used.","score":3,"comments":[]},{"body":"Getting Taylor Swift tickets! My step daughter wants to go badly, and I got selected for the presale and after 7 hours in a queue, I finally got them. Didn’t realize at the time, what a big deal it was. She is ecstatic, and I leveled up on step dad status lol!","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Every Tuesday is grocery day. So I’d say last Tuesday.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"cheesy, but I bought my dog a new toy and she loves it, makes me happy seeing her happy :D","score":3,"comments":[]},{"body":"Subnautica... Miss those times of terror and awe","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Plantain chips and avocado cream at dinner on Friday.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Women who sleep with a bra on, why? Does it not hurt/is it comfortable ?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"I have a sleep bra, basically just a loose cotton bralette. I’m a 36J, and I don’t need my boobs flopping around all night uncaged.","score":1,"comments":[{"body":"I volunteer to hold them in place for you","score":1,"comments":[{"body":"Shame on u books","score":1,"comments":[]}]}]},{"body":"This topic came up while talking with my bestfriend, she even said it’s a pretty common thing, and that alone BAFFLED me. How do y’all even sleep comfortably lol ????.","score":1,"comments":[{"body":"Ive NEVER had a gf that wore a bra to bed. In fact most did that magic trick bra off under the shirt when we stepped in the door for the night🤣","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"i guess maybe if you have bigger tatas, it would be nice to have the support so they’re not like… everywhere? but i cant imagine wearing one unless it’s like thin loose material","score":1,"comments":[]},{"body":"I personally find it uncomfortable to sleep without one. I need to feel supported.","score":1,"comments":[]},{"body":"I knew a women a few ago that had a really huge pair. She had a small frame with huge breast. It gave her a lit of back problems and she told me that wearring a bra at all time, even when she slept, helped her back a lot giving her support.\n\nI understand why a women wears a bra when her breast a medium size or large but I dont understand if their are small.","score":1,"comments":[]},{"body":"I used to when I had roommates bc it felt too revealing to not wear one. It was emotional comfort over physical comfort.","score":1,"comments":[]},{"body":"As much as I wish people wouldn't freak out that they can see a woman's nipples poking through their shirts, they do. So if I'm wearing a bra to sleep, it's because of that. It's not too uncomfortable, but I prefer not wearing one.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"If you were given wishes by an evil genie, how would you word your wishes to avoid getting tricked by him?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"I'm not sure, but the contract lawyer I'd retain would probably know.","score":1,"comments":[]},{"body":"the evil genie's first trick is to convince you that you can outwit him with careful thought; his second trick is to consign you to a life of servitude","score":1,"comments":[]},{"body":"Evil Genie (Djinn) wouldn't give you any wishes.","score":1,"comments":[]},{"body":"Honestly, I'd just avoid wishing for anything significant, so there's no way of twisting it to create any serious consequences. Basically this [xkcd](https://xkcd.com/2193/).","score":1,"comments":[]}]},{"title":"People who collect strange or unusual things, what do you collect and why?","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"Victorian medical equipment","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Roses and old creepy cookbooks. I have one for jello that is fed up. Think tuna and lemon jello. Or blue cheese and lemon jello.","score":3,"comments":[]},{"body":"My dog's whiskers, I don't know why I like them.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I collect all sorts of things. To be completely honest, I think it's bc I have a lot of horder tendencies :/\n\nBut I collect vintage/antiques, bones, rocks/crystals, feathers, anything that catches my interest","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Uranium Glass! Have a hefty collection and the blacklight led strip to show it off.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I collect bullet casings and old strings from my bass guitar","score":2,"comments":[]},{"body":"Lighters. I love cigarettes and once I had to get one from my crush so I could smoke, it was blue which is my favourite color (and from my favorite person) but I had to give it back. I asked him if I could keep it and he said no. After 2 days he gave it to me and I was very hyped and from that day any lighter that would seem beautiful enough to me I'd keep it","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Those should plush toys you see st Disneyworld. I started with 1 for each park, but then got an alternative for 1 of the parks. Now I have 16 of them and growing. I'm a big disney nerd and this is the only merch collection I look for","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I collect anything Krampus. Love everything about it. I'm excited we are in Krampus season, but I collect all year.","score":2,"comments":[]},{"body":"For no good reason I keep grocery lists that I find in carts and hand baskets. It’s interesting seeing what other people buy and I like seeing handwriting. Once I found a grocery list on stationery that had birds printed on it. The list had bird food written on it, it was cute. I don’t have that many because most people don’t tend to use pen and paper as much, and I don’t go out of my way to find written lists.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What are your favorite substitute swear words?","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"Dag Nabbit!!","score":5,"comments":[]},{"body":"Love when Bandit from Bluey says Biscuits","score":3,"comments":[]},{"body":"Son of a biscuit.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"Barbra Streisand!\"","score":3,"comments":[]},{"body":"Awww hamburgers","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Feck. Shite. Battlestar Galactica.","score":2,"comments":[]},{"body":"Aw fishsticks","score":2,"comments":[]},{"body":"Mother Father!!","score":2,"comments":[]},{"body":"Dag nabbit","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What is the worst part of being ridiculously attractive?","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"To sexy for my shirt","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That it doesn't last forever.\n\n\nEventually you will grow old and become less attractive.","score":6,"comments":[]},{"body":"Nothing, it’s awesome.","score":4,"comments":[]},{"body":"Getting way ahead in life when compared to normies by doing the bare minimum /s","score":4,"comments":[]},{"body":"Being constantly harassed.\n\nHaving people think you owe them something because you were nice to them or they were nice to you.\n\nNot being able to make friends with the opposite sex because they always think you are flirting.\n\nPeople are not taking you seriously.\n\nPeople thinking that you have it easier because you are attractive.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I simply don't know. That's a problem I'd like to have.","score":3,"comments":[]},{"body":"Well, I do mean to brag, but I am ridiculously attracted to mosquitoes. Not as good as you may imagine.","score":3,"comments":[{"body":"Attracted to mosquitos or attractive to mosquitos. Kind of 2 different things.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Tired all the time. From the sex","score":3,"comments":[]},{"body":"Having to be extremely humble about it","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What’s a strange food combination that surprisingly works?","not_safe_for_work":false,"locked":false,"body":"","score":1089,"comments":[{"body":"Cheese and raspberry jam on toast","score":991,"comments":[{"body":"you basically making a poor man's danish","score":478,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"try guava","score":69,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yes!  I love particularly brie and raspberry jam on crackers or toast ♥️","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Watermelon with feta cheese, very popular in Greece.\n\nEdit. Wow, didn't expect that combination to be known outside of Greece as well!","score":954,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[deleted]","score":116,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Strawberry jam, with goat cheese on a burger.","score":235,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Peanut butter and bacon sandwiches are delicious.","score":478,"comments":[{"body":"Peanut butter and apple sandwiches are also fantastic!","score":146,"comments":[{"body":"I've recently discovered peanut butter and banana sandwiches.  My life hasn't been the same.","score":96,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"can we love and dislike someone at the same time? what do y'all think?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"Yes, example: family","score":11,"comments":[{"body":"This is how I felt about my sister for the longest. Now, almost all the love is gone and the dislike has transformed into something ugly that I don’t like.","score":2,"comments":[]}]},{"body":"You can love someone but not like them at a specific moment. I love my surly teenager, but I might not like him very much when he's having an autism-related meltdown.","score":3,"comments":[]},{"body":"Yes. My mother.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yea sure.\n\nImagine having a kid who went the wrong way in life despite how you raised him (criminal behavior, bad person, etc).","score":3,"comments":[]},{"body":"Of course! But it probably won't last a long time if the dislike part continues. Those types of feelings have a knack for festering into resentment and hatred.","score":2,"comments":[]},{"body":"Absolutely! I love my brother, but most of the time I honestly just don't like him very much.","score":2,"comments":[]},{"body":"Yes.  Yes.","score":2,"comments":[]},{"body":"They say \"real\" love is when you even like their flaws so I'd say yes","score":1,"comments":[]},{"body":"do it every damn day.  yes, my dad is impossible to get along with, but I love him.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What will 2022 be remembered for?","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"Prob the queen’s death","score":16,"comments":[]},{"body":"The start of decline/upheaval/change in Russia.","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"James Webb Telescope","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Ukraine","score":10,"comments":[]},{"body":"Uvalde massacre","score":7,"comments":[]},{"body":"Elon and RUS vs UKR","score":5,"comments":[]},{"body":"- Death of Queen Elizabeth \n- War Between Russia and Ukraine \n- Crippling Inflation","score":5,"comments":[]},{"body":"10 pounds of crap in a 5 pound bag…","score":4,"comments":[]},{"body":"For being the worst year of my life. I feel like I'm in a telenovela with all these crazy plot twists.","score":9,"comments":[{"body":"Worst year of your life,  so far.","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What’s the all time best Christmas movie?","not_safe_for_work":false,"locked":false,"body":"","score":503,"comments":[{"body":"Muppet Christmas Carol 🐸","score":775,"comments":[{"body":"\"tomorrow you become a man of ... *BUSINESS*\n\n\"You will love ... *BUSINESS*. It is the AMERICAN WAY!\"\n\n(Dickens whispers to Sam) \n\n\"Oh! *Ahem* It is the BRITISH WAY!\"","score":156,"comments":[{"body":"I love the way he looks around afterwards like \"wait, who said that?\"","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Me and my sisters grew up watching this every year and now me and my wife and son watch it every year.  The songs are so good I find myself singing them year round. Really just incredible, not only my favorite Christmas movie but one of my favorite movies of all time.  I love A Christmas Carol anyway, but everyone, including and especially Michael Caine, playing it straight with only Gonzo as Charles Dickens and Rizzo (as himself) being there for comic relief is pure genius. Without a doubt the best version of this story among a plethora of strong contenders. \n\nAdditionally: Looking forward to the restored edition on Disney+ here in a few weeks.  The song “When Love is Gone” might have been too much of a slog for kids but it makes the whole movie much more meaningful and the end reprise of it  “When Love is Found” so much more powerful. Of course, I feel like my vhs copy growing up always had this song on it, and I know my dvd copy has the option of watching it with it but it’s in pan and scan and not letterbox format if you do, which was odd.","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"We’re Marley and Maaaarley…. Ooooooooooh!","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Home Alone","score":861,"comments":[{"body":"“Look whatcha did, ya little jerk!”","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Stop motion Rudolph","score":237,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The original animated How The Grinch Stole Christmas","score":579,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Christmas Vacation","score":617,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What TV show got cancelled too soon?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"Mindhunter","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Firefly","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Freaks and geeks","score":1,"comments":[]},{"body":"The society","score":1,"comments":[]},{"body":"Santa Clarita Diet. Still need to figure out what happened to Mr. Ball Legs.\n\nAlso American Vandal. There's a season 3 I have an idea for :(","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Lie to Me","score":1,"comments":[]},{"body":"Arrested Development","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cowboy bebop","score":1,"comments":[]},{"body":"I’m still upset over Santa Clarita Diet","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Pushing Daisies","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Why you don’t have a good relation with your parents?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"My mother is a narcissist","score":7,"comments":[]},{"body":"because they are/were bad people. that is enough. and then one died and another disappeared so oh well no redemption arc i guess.","score":3,"comments":[]},{"body":"Because Mom was certifiable- got institutionalized after the divorce even- and Pop's was never around because of her at first then because he was dating shorter and shorter women until he married a Filipino woman half his height.  Nice lady though, she could have done better.","score":2,"comments":[]},{"body":"They've been dead for 41 years. The relationship has been one sided since then.","score":2,"comments":[]},{"body":"They felt it was more important to hate BIPOC, women, leftists, LGBTQ+, etc than to see their grandchildren. I didn’t want all that venom around my kids and they couldn’t stop. They made their choice and so did I.","score":2,"comments":[]},{"body":"My dad was mentally abusive to my mom so we left when I was 3. I saw him off and on for a few years then he was out of my life until I turned 34. Randomly ran into him at a dive bar. I bought him a beer. He told me he wasn't gay. He didn't even recognize me and thought I was trying to hit on him. I got to talking with him and a few weeks later he decided I didn't grow into a person he wanted in his life.","score":1,"comments":[]},{"body":"Because my biomother let my cousin call me a whore after her husband molested me, she left me alone with him as a small child when she *knew* he'd had a child with his sister and she kept talking to and about them to me after all this after being told to STFU about her family around me. Also sided with other cousin's b!tch wife when she sided with cousin with h molester husband.","score":1,"comments":[]},{"body":"My mom’s emotionally manipulative and takes her stress out on everyone","score":1,"comments":[]},{"body":"About 7 years ago my brother was diagnosed with very very severe schizophrenia. At first my parents refused to believe it because of the stigma and this resulted in him refusing treatment and ending up in prison several times. Somehow this just tore my family apart and we really just don't see or talk to each other very much.","score":1,"comments":[]},{"body":"My dad remarried 3 months after my mom died, to a woman that mentally (and on one or two occasions physically) abused me for several years.  And we weren't particularly close before that, with him off at work all the time because he wasn't really emotionally available when I was a kid.  He was one of those boomer \"I show my love by the money I make\" dads.  And I get it, but... (This is part of why I don't see myself having children.  If I have to work 60+ hours a week to take care of them I'd rather not subject them to that.)\n\nWe see each other on holidays and there's a part of me that loves him because he's the only dad I've got but it's hard for me to trust/be close to him, even years later as an adult.\n\n(On a lighter note, he's had a chronic habit of being late, which annoys me to no end so a large part of it really is a personality conflict.)","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What’s it like having a house in the middle of nowhere?","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"Probably not for everybody but I’ve got woods to explore. I’ve got my own swimming hole, see deer and what not, it’s nice.","score":3,"comments":[]},{"body":"The starry sky at night.","score":3,"comments":[]},{"body":"I lived in the middle of nowhere before I was old enough to drive and before internet is what it is today. It was horribly boring, and impossible to go anywhere fun. \n\nI'd probably appreciate it more today, as an adult.","score":2,"comments":[]},{"body":"Mostly boring. It’s a pain to have to drive 30 minutes just to reach a grocery store and you can forget any entertainment. However, and it is probably a false sense of security, it does seem safe. I never even owned a key in the ~15 years I lived there, you leave it unlocked.","score":2,"comments":[]},{"body":"It can be real dark and spooky at night. Strange sounds in the woods at night activate primal instincts. Even though you know it's just a deer or a possum, your brain is all like \"But what if it IS the Chupacabra this time? You should totally walk a little faster\"","score":2,"comments":[]},{"body":"It’s peaceful. I love hearing the animals at night. The owls are my favorite.\nSometimes it’s a little nerve wracking being out at night and hearing a wolf. But, I wouldn’t trade it for anything! \nYou really have to make sure you don’t forget anything you truly need at the store!","score":2,"comments":[]},{"body":"Mostly wonderful. I do miss delivery. Winters are rough though. City doesn't come plow and we are on our own. But it's so nice to just let the kids run free and not worry.","score":2,"comments":[]},{"body":"depends on the person.  Personally, I hated it.  A 30 minute trip to the grocery store (your choices are a Casey's gas station, a Walmart, or a dollar general) is not fun.  No delivery sucks.  If you have internet, it's suuuper slow and shitty.  Having to drive yourself an hour to the nearest hospital after you've sliced your fingers off on a saw blade isn't fun, but I know more than one person who did just that.  But stars are nice.  Another good thing is being introduced to the concept of a deep freeze since people often have deer meat or buy stuff in bulk for the winter.  First major purchase I made when I moved to the city. 10/10","score":2,"comments":[]},{"body":"It's awesome except for when you forget something at the store or when a vehicle breaks down. There is peace and quiet, wild life, privacy, freedom basically.","score":2,"comments":[]},{"body":"Quiet and I can pee outside without landing in a list. Also the stars are great. On a side note we have bears, too many bears.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What was your most awful tinder date experience?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"I’ve almost been straight up assaulted but the worst still is this one time when the guy I met up with for a hookup revealed he was actually looking to date so we wouldn’t be getting into anything. Proceeded to walk me around the mall at a really fast pace, almost power walking, when I asked why he said it was so I could get a glimpse of how he’d be helping me lose weight when we started dating. \n\nHe refused to let me go home on my own, insisted on dropping me to my apartment and before I went into my building insisted we sit on the grass outside so he could sing me something, I obliged and he proceeded to sing “fix you” by Coldplay and I love Coldplay but I wanted to punch the guy. \n\nNeedless to say I did not see him again and when I told him the news he didn’t take it too well..","score":8,"comments":[{"body":"Yeah I'd be moving house if I were you.","score":1,"comments":[{"body":"It’s all good, after yelling at me for being an asshole he blocked me everywhere. This was 3 years ago 😌","score":1,"comments":[{"body":"Good to hear. Sounds like a real weirdo. Could he at least sing?","score":1,"comments":[{"body":"Shockingly, man had some pipes. He’s on a church choir too.","score":1,"comments":[]}]}]}]}]},{"body":"One small flame and she was ash","score":3,"comments":[]},{"body":"Gal told me that babies are sexually attacted to their parents and that pedophiles weren't that bad because of that.","score":3,"comments":[{"body":"Wowwwww","score":1,"comments":[{"body":"No shit, that was my last time ever going on Tinder too.","score":2,"comments":[]}]}]},{"body":"In depth stories about past sexual abuse... freaked me out. Then just went to my room and got naked... like i was meant to just, do it. No thanks.","score":1,"comments":[]}]},{"title":"What will ruin the Thanksgiving Day dinner at your table this year?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"The cake pops I'm bringing. I made 50. But 8 of them are meatballs covered in frosting.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“So about Roe v. Wade?”","score":7,"comments":[]},{"body":"My mom inviting some random vagabond that nobody else but her knows but they have a tragic backstory (aka drugs) lmao","score":5,"comments":[]},{"body":"“Anyone else not able to taste or smell the turkey?”","score":14,"comments":[]},{"body":"One of my aunts has unilaterally decided that there will only be turkey breasts, not a whole turkey, this year because there will also be a ham.  Even though everyone wants turkey. And we already have a frozen turkey ready to cook.\n\nAbsolute insanity.","score":4,"comments":[{"body":"If there’s no dark meat at mine, I’m flipping tables.","score":4,"comments":[{"body":"Same.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Don't know...I haven't made up my mind yet.","score":3,"comments":[]},{"body":"The various members of my family gloating about whose house is larger/nicer, and what a shame it is that I choose to live a simpler life with my cute little family in my cute little house and my cute little bank account. My wife will kick me under the table before I say anything I’ll regret, though. She’s my glue!","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Any talk of Hunter Biden","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"People who are actually in a happy marriage, what’s your story?","not_safe_for_work":false,"locked":false,"body":"","score":50,"comments":[{"body":"We talk, we joke, we laugh at the silly things we do, we support each other.","score":71,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No marriage is perfect. No marriage is 24/7 happiness. It’s about finding someone who makes you want to be the best version of yourself, and then respecting each other. Respect meaning give and take, sharing responsibilities, not cheating, communicating when something is wrong, etc.","score":46,"comments":[]},{"body":"We had a pretty dark year, went to marriage counselling.  It was an absolute game changer.  Best decision we ever made.  I feel like I got my best friend back","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A few keys for me:\n\n1. **Go on regular dates**\n2. **Speak their love language consistently**\n3. **Knowing how to be happy on your own &amp; having the boundaries to have someone else add to that**\n4. **Daily communication**\n\nMy marriage hit the rocks like six months in; the honeymoon period was over &amp; we couldn't figure out why.  Then we realized that we had stopped dating lol.  Got married, moved in together, were together all the time outside of work, but no more effort for planned dates outside of the house.  The solution was:\n\n1. Weekly scheduled dates (as unromantic as that sounds, it's actually awesome!)\n2. We take turns for who plans it; typically food &amp; activity (dinner &amp; movie, etc.)\n\nBeen working great for 15+ years now!  Also, relationships are like plants &amp; need to be watered regularly.  A big reason people quit both romantic relationships &amp; jobs are because they don't feel *appreciated*.  Everyone has their own way of feeling loved.  The 5 Love Languages books highlights the core ones:\n\n1. Words of affirmation\n2. Acts of service\n3. Gifts\n4. Quality time spent\n5. Physical touch\n\nThey all overlap, but people tend to grow up feeling loved in a certain way, so maybe they're a dates &amp; vacation person, or a chocolate &amp; flowers person, or whatever.  First step is asking your partner what their love language is &amp; finding out what that means to them.\n\nSecond step is expressing love in their language to them on a regular basis, proactively!  It's so easy to coast in a relationship once things get settled, but again, relationships are like plants &amp; need to be watered regularly to stay alive!\n\nAnother big one is learning how to be happy on your own.  We've all seen those domino-effect relationships...\"we can fix the relationship by getting engaged...by getting married...by buying a house together...by getting a dog...by having a baby...\".  I really like this article about Will Smith:\n\n* [https://www.etonline.com/will-smith-talks-about-retiring-from-making-jada-pinkett-smith-happy-in-resurfaced-video-149545](https://www.etonline.com/will-smith-talks-about-retiring-from-making-jada-pinkett-smith-happy-in-resurfaced-video-149545)\n\nI like his insights on relationship happiness:\n\n&gt;\"I asked her what does she think is one of the biggest revelations that she had about love? She said, '**You cannot** ***make*** **a person happy.**' And I thought that was a real deep idea,\" Will admits. \"**You can make a person smile. You can make a person feel good. You can make a person laugh. But whether or not a person is happy is** ***deeply and totally and utterly out of your control*****.**\"\n\nThis is also an excellent quote:\n\n&gt;\"I remember the day I retired. I literally said to Jada, 'That's it. I retire. I retire from *trying to make you happy*. I need you to go make yourself happy and just prove to me that it's even possible,'\" he says. \"And after we cracked...up, we started talking about how we came into this false romantic concept that somehow when we got married that we would become one. And **we realized is that we were two completely separate people on two completely separate individual journeys and that we were choosing to walk our separate journeys together.** ***Her happiness was her responsibility and my happiness was my responsibility.\"***\n\nYour job in a relationship isn't to *make* someone else happy; it's to *provide a loving environment* where they feel safe, happy, and have room to grow.  Likewise, it's no one else's job to make *you* happy, because that falsely gives up control of happiness to someone else, meaning you become entirely dependent on how they treat you for how you feel, which is ridiculous!  So that means we have to erect &amp; enforce 2 very specific boundaries:\n\n1. Knowing how to make ourselves happy on our own, independently\n2. Allowing other people to add to our personal happiness, which also means putting up boundaries on our self-worth &amp; self-respect in order to reject behaviors that don't comply with our personal set of rules.  A lot of people get stuck in abusive relationships for long periods of time for a lot of reasons, including a lack of boundaries!\n\nAs far as daily communication goes, this involves 3 things for me:\n\n1. Daily meeting\n2. Blueprints\n3. Discussion Helper\n\nThis doesn't have to be more than a couple minutes, just to discuss the day &amp; the plans for the next day, see where we each need help, celebrate small victories, vent about hardships, etc.  It's a purpose-driven conversation to review the mechanics of our lives going into tomorrow.\n\nNot a lecture, not long, but should really be done on a daily basis, and preferably not at the end of the day when everyone is at the end of their emotional ropes.  We have a simple rule of \"no serious conversations after 8pm\" so that we're not trying to make serious decisions when we're brain-friend haha!\n\npart 1/2","score":33,"comments":[{"body":"part 2/2\n\nBlueprints are also important.  Life is like a patchwork quilt, made up of individual squares.  Each square represents a unique, active situation in your life.  Each of you comes with a pre-existing blueprint; your job is to create a NEW, compromised blueprint together.\n\nFor finances, maybe you're a spender &amp; they're a saver.  For car maintenance, maybe they hate doing &amp; you don't mind doing it. A lot of silent resentment builds when we don't go over each &amp; every situation in our lives &amp; define how we're going to play the game together!\n\nI also use a little tool I call the \"Discussion Helper\":\n\n* [https://i.imgur.com/IXpkApT.png](https://i.imgur.com/IXpkApT.png)\n\nThe purpose of this is to switch from \"me vs. you\" to \"us vs. the problem\".  The way it works is:\n\n* You pick exactly ONE topic to discuss &amp; write it down.  You can print this sheet out or laminate &amp; use it with a dry-erase marker.  And then optionally get a clipboard &amp; hang it on the wall with a 3M hook.  You then illustrate the cost of doing nothing, you both come up with solutions, and you both come up with ideas to compromise on.\n* For example, if you have to solve dinner: if cooking at home will take too long, then you can order food delivery.  The cost of doing nothing is you both go hungry &amp; get mad at each other.  Maybe they want Taco Bell, you want Burger King, and a compromise option is McDonalds.\n* Now that you've physically written down your options, you have a visible inventory to work with.  If you got to pick last time, maybe let them pick this time!  Or choose the compromise option, which isn't what either of you want, but at least you both kinda-sorta want it.\n\nIt's a simple (and silly) tool, but I find it's REALLY effective for shifting things from an argument that goes all over the place (too many topics, bringing up the past, projecting the future, no visibly-written options, etc.) into a purpose-driven discussion with the goal of a specific outcome for exactly *one topic*.\n\nAnyway, imagine the opposite:\n\n* No regular dating (or not dating at all)\n* No one feels appreciated because their particular love language isn't being \"spoken\" to them on a regular basis\n* They don't know how to be happy on their own &amp; expect the other person to \"make\" them happy all the time\n* They don't have even a quick daily meeting to review the day, plan out the next day, and get any help required\n* They have separate blueprints for everything, which clash &amp; creates silent resentment\n* They have heated arguments that are all over the place &amp; attack each other, rather than laser-focused discussions designed to solve problems together\n\nIt's not rocket science, but when you're in the middle of a relationship, especially one that's going south, it's hard to see clearly.  Having some good external support systems like a dating schedule, proactive communication, and tools like the Discussion Helper can really go a long way for allowing us to do simple things to make some really big changes in our lives!\n\nI had this discussion recently with a buddy who is going through some marital troubles.  Sometimes the problem is pretty one-sided, but in this case, the problem was *both* of them...but I had to clarify to him that change has to start *somewhere*, and he could either wait for *her* to grow up OR be an example &amp; be the first one to change.  Relevant meme:\n\n* [https://i.imgur.com/rpEkirY.mp4](https://i.imgur.com/rpEkirY.mp4)\n\nI had to really walk him through the logic...so you don't really take her out on dates...you guys fight so you don't communicate...\"you don't know what her love language is &amp; don't put in any effort to speak it to her...every discussion blows up into a huge argument...you're on two completely separate pages for every situation in your lives...and you expect to have a happy marriage?\"\n\nMarriages are fun, but they're also work that requires effort!  Which is mostly in the form of being willing to be mature about how we handle things like communication in our relationships.  Again, it's not rocket science, but it can be hard to see things clearly when things aren't working &amp; when our emotions are high &amp; when we just feel lost!  The good news is, there are some easy fixes available, if we're willing to try!","score":15,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I've been happily married for 20 years.  For us what has helped is, don't take yourself too seriously, laugh and have fun - be able to recognize that you will each change as you grow older, your sex life is important and should not be ignored as you get older, have kids, etc.  Always make time for each other.","score":75,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Don't do dumb shit","score":41,"comments":[{"body":"Even more important is being able to apologize for doing dumb shit, and not getting defensive.","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Been together 10 years and started dating at 16 years old, she is my best friend and i can't wait to see her at the end of the day everyday.","score":12,"comments":[]},{"body":"Communication is key. If you don’t communicate, resentment will fester and come out years later. \n\nDon’t marry anyone you have doubts about. The things that bother you before you get married will not go away. You either have to accept them or move on. \n\nKids test even the best relationships so make sure you’re ready.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"If you could make a Lifetime Movie about any part of your life, what would the name of the movie be?","not_safe_for_work":true,"locked":false,"body":"","score":7,"comments":[{"body":"Marriage: why multiple cocks in your wife doesn’t work","score":2,"comments":[]},{"body":"*How to get third-degree burns and a broken arm in the spam of 3 years!*","score":1,"comments":[]},{"body":"How did I end up in the hospital because of a chicken?","score":1,"comments":[]},{"body":"Insignificant Man and Where to Find Him","score":1,"comments":[]},{"body":"Little Did He Know.","score":1,"comments":[]},{"body":"*The Biggest Penis Award Winner Champion 12 Years Running*","score":1,"comments":[]},{"body":"Glorious Results of a Misspent Youth, or How To Completely Piss Away Four Years of College","score":1,"comments":[]},{"body":"The computer","score":1,"comments":[]},{"body":"My adventures!","score":1,"comments":[]},{"body":"Boulevard of Broken Dreams.  The soundtrack is already done.","score":1,"comments":[]}]},{"title":"What have you said on reddit that you will never dare say in real life?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"I'd rather not say...","score":1,"comments":[{"body":"This is a safe space stranger . Ain't nobody gonna snitch on you.","score":1,"comments":[{"body":"Yeah I ain't saying lol","score":1,"comments":[]}]}]},{"body":"I have a fetish for old/ugly/creepy men. I can't have an orgasm unless I find the guy extremely unattractive or disgusting. I would literally do anything in bed for these type of men.\n\nIt sucks cause my current boyfriend is really good looking.","score":1,"comments":[{"body":"If this post goes on front page\n#RIP Your Inbox","score":1,"comments":[{"body":"Goood looking out, but...","score":1,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"suicidal thoughts","score":1,"comments":[]},{"body":"That I don’t like mustard","score":1,"comments":[]},{"body":"My love for women","score":1,"comments":[]},{"body":"Nothing that I'd *never* say in real life, but quite a lot not meant for mixed company.  My most upvoted comment is about enthusiastically getting railed by a nice, kinky woman and her strapon.  I'd say the *fuck* out of that in person (and I probably have), but that requires a certain crowd, ya know?","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Whats the dumbest reason someone broke up with you?","not_safe_for_work":false,"locked":false,"body":"","score":7795,"comments":[{"body":"Because her friends broke up with their boyfriends.","score":11239,"comments":[{"body":"I had a good friend (at least I thought so at the time) break up with her boyfriend and wanted me to break up with my new boyfriend at the time. I said no. She never spoke to me again. Her reasoning: \"Loyalty means everything\" By the way my boyfriend of the time ... He's my husband. We've been together 9 years and 2 kids.\n\nEdit: Thank y'all so much for all of the positive comments!","score":6773,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"[removed]","score":12607,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I visited my dad. While he was in hospital. With cancer. She broke up with me because I was visiting my dying dad instead of visiting her. I feel like I dodged a major bullet....","score":9502,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No joke. Her mood ring changed colours.","score":11971,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[removed]","score":5524,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Car was too old. Dropped her,  car is still chugging along.","score":4561,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"You've been really sad ever since I cheated on you and I don't like that, so bye!\"","score":2002,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"She broke it off to try and be with a guy at her job. He told her he wouldn’t go out with someone already in a relationship. He was trying to be nice and not cause trouble. She didn’t get the guy and she lost her job because she made a big scene about not getting what she wanted. I’d say I was the lucky one in that situation even if it didn’t feel like it at the time.","score":2413,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"She sent me a breakup text as she was jumping into some other guy's back seat. I got the story a couple hours later through a  mutual friend who was there. The next day she called wanting to get back together.\n\nBasically, she just wanted to cheat guilt free.","score":4336,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Doctors, Nurses, or other Medical Staff; what’s your favorite thing a patient’s said before the anesthetics kick in?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"Obligatory \"Not a doctor\"\n\n\nBut I do remember something I said years ago that cracked up the surgeon and nurses taking my wisdom teeth. My last memory before passing out...\n\nThey put the gas mask on my face and told me to count backward from 100. I think I got to 94 before I said \"Whoa!\"\n\nThey look at me and ask what's wrong.\n\nI say \"That's good shit!\" and pass out. On my way out, I remember them all having a good laugh.","score":4,"comments":[]},{"body":"Obligatory not a doctor either.\n\nI was lying on a gurney with a dislocated collarbone and they asked me to slide onto the operating table. I lifted and it hurt like hell. I said I couldn't and I saw someone put a needle into the IV and push in a shot. Immediately I was happy as a clam and loose as a goose. I said what was that? They replied liquid valium and I asked for a six pack to-go. They lifted me on the table and I could feel the bone moving around under my skin but I didn't care. I do recall them laughing at my request. :)","score":3,"comments":[]},{"body":"Not a doctor but once when I was going under for brain surgery my last memory is saying \"uh...should I still be awake?\" and the anesthesiologist quickly said \"oops, no\" and then put me under.","score":1,"comments":[]}]},{"title":"What is an underrated combination?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"French fries and Ice cream","score":2,"comments":[{"body":"The thing that literally everyone does? That’s the opposite of “underrated”.","score":2,"comments":[]}]},{"body":"14-29-3","score":2,"comments":[]},{"body":"Farting while peeing. 2+2=10","score":2,"comments":[]},{"body":"Coffee and coconut","score":1,"comments":[]},{"body":"Doritos and the freezer","score":1,"comments":[]},{"body":"Tea through a strawberry pencil","score":1,"comments":[]},{"body":"Pizza and orange juice","score":1,"comments":[]},{"body":"Jollof and birria","score":1,"comments":[]},{"body":"A1 sauce and mashed potato’s","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Glasses wearers of Reddit, what are some things that become impractical when wearing glasses and how do you get around them??","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"When entering a place, say a pub, when it's cold out, your glasses immediately steam up. No solution really, just take them off to wipe them.","score":1,"comments":[]},{"body":"Going out in the rain. I usually just take them off since I can see well enough without them.","score":1,"comments":[]},{"body":"Watching 3D movies.","score":1,"comments":[]},{"body":"Trying to put makeup on. I use a magnified mirror.","score":1,"comments":[]},{"body":"Wearing a mask at the same time, which I try to avoid. Fortunately, I can see fairly well without the glasses unless I'm driving, especially at night, in which case, I wouldn't be wearing a mask.","score":1,"comments":[]},{"body":"Working out. I have to wear a sweat band to keep the sweat from dripping onto my lenses. Still doesn't always help.","score":1,"comments":[]},{"body":"Watching 3D movies.","score":1,"comments":[]}]},{"title":"If humans were bred like cattle over thousands of years, to produce lots of meat and be dosile and easy to control, what would we look like?","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"James Corden","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"We would look like this","score":138,"comments":[{"body":"\\*holding up photo of OP's mom\\*","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I assume we'd have a lot more mass/meat on us... We'd be more peaceful and chill overall, we'd easily follow orders generally. That's what we'd look like.","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I remember that a guard in Kruger Park explained that lions firstly eat cheeks and bottocks. How did he know? Many migrants try to sneak through the park at night... exactly at the time when lions hunt. Guards find the remains then. So I guess humans would have big buts and faces.","score":19,"comments":[]},{"body":"Isn’t this the plot of Wall-E?","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Go to Walmart, look around, you will find the answers you seek","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This is the plot of HG Well's Time Machine.. offers a pretty solid description (the eloi).","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The people from Wall-E","score":34,"comments":[]},{"body":"Apparently muscular dystrophy would be [a good trait](https://www.intechopen.com/chapters/65926)\n, and we would likely try to breed people with the condition.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What Video Game do you believe will stand the test of time?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"Tetris already kinda has.","score":40,"comments":[{"body":"Came to say tetris","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Skyrim","score":13,"comments":[{"body":"2111 Skyrim 100th anniversary edition with definitely happen","score":7,"comments":[]}]},{"body":"AOE2","score":9,"comments":[]},{"body":"The Legend of Zelda: Ocarina of Time.","score":8,"comments":[]},{"body":"The classics with simple mechanics and graphics that don’t need to be improved. Tetris, Minecraft, Pac-Man, etc.","score":8,"comments":[]},{"body":"Doom, because they'll port it to every device known to mankind.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Castlevania - Symphony of The Night","score":5,"comments":[]},{"body":"Super Mario 3","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Redditors who have been in horrible car accidents, what do you remember about the actual impact?","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"On our way to school, my sister pulled out in front of a log truck. The best way to describe it is synesthesia. I swear I could smell the air horn and taste the head lights.\n\nIf I am on the road and see a glint of chrome over my left shoulder, my brain reboots.","score":3,"comments":[]},{"body":"I don't like to think about it. It still upsets me 30 years later","score":2,"comments":[]},{"body":"I remember my cousin saying \"isn't that uncle (name), didn't he get his license taken away?\" Then my mom saying \"oh shit he's going to hit us!\" (He was coming down a hill). She ducked, my cousin ducked, I was 10 and playing on my ds and didn't know what was going on and the next thing I saw was a truck slam into my door.","score":2,"comments":[]},{"body":"I remember all of it. I was 16, just got my license. I overcorrected and rolled the car 5 times. The first thing I remember was the sound of the metal crunching on asphalt. I remember the force of the seat belt that held me inside, it was so tight I couldn't breathe. I remember the radio cracking and losing signal. My last thought had I died would have been, \"My driver instructor warned me about this.\" I wasn't upset or scared at all, it was very matter or fact. I didn't have my life flash before my eyes or anything like that. I remember everything that happened after as well. I had a white sheet in the back (1998 Jimmy) and a nurse passed by on her way to work. She said she was positive someone was dead with the sheet laying out.","score":2,"comments":[]},{"body":"15 car ahead of us braked and we my mom driving slammed right into it's rear totalling our car hit so hard my seatbelt snapped and I cracked two ribs wouldn't have happened if some dumb bitch not paying attention hadn't walked out in the road causeing the car ahead of us to break suddenly.","score":1,"comments":[]},{"body":"Not much, aside from feeling all my internal organs slamming around. I do remember almost instantly knowing what was happening. There wasn't any confusion. Just the world was flipping around over and over.","score":1,"comments":[]},{"body":"I hit a telephone going 30 mph while reaching for the cigarette lighter.  The sudden stop made it feel as I was struck from behind followed by my face slamming into the windshield. An ambulance trip to the ER ensued.  I still have problems with my neck after 44 years.","score":1,"comments":[]},{"body":"Waking up in the hospital. No memory of the actual event.","score":1,"comments":[]},{"body":"Not myself, but my father. He hydroplaned going 70+ on the interstate. Car got backwards then left the road, and basically used a rock wall as a vert ramp to flip 13 times down the side of the road. Broke his back in 3 places, his neck in 2 places. Was told somehow, he lived because he wasn’t wearing his seatbelt and ended up in the back seat with the whole top of the car smash down flat. He says the moment he saw the rock wall coming, he told himself it was over, and he was gonna hear a loud boom, and he’d be somewhere else. He said he was terrified, but knew he was going to die, and just held on tight. He said as soon as the car came to a stop, he realized he was still alive, found a way to crawl out of the rear windshield with his back and neck broken, then just laid on the road while people stopped to help. He said he doesn’t remember anything from the moment the rock wall was coming, to the moment the car stopped flipping.","score":1,"comments":[]},{"body":"I was driving home from work on the freeway, and there was a lot of lights, screeching tires, and crashing sounds behind me.  I thought \"oh shit, there's an accident.\"\n\nThen the impact happened. Boom.  \"Holy shit.  **I'm in the accident.\"**  Time slowed way down.  That thing in crash test videos where the car flexes, getting smaller and then bouncing back into more or less shape?  That.  \n\nAt the same time, I was spinning around, with metal and plastic and entire cars flying everywhere.  Then, I was flung backwards, and came to a very abrupt stop.\n\nThe whole thing took maybe a couple seconds, but it seemed like 30.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"what is something your parents told you as a kid that was never true?","not_safe_for_work":false,"locked":false,"body":"","score":52,"comments":[{"body":"That it’s illegal to drive with the dome light on at night","score":166,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"To stay a virgin because I am the same age as prince William. If we became engaged the doctor would check for a hymen and I could never be royal if it was gone. \n\nI grew up poor in LA. How in what world would we have ever been in each other's orbit?","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I love you unconditionally","score":110,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If I eat a lot of porridge, I will grow really tall.","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Drinking coffee as a child will cause you to be short when you are an adult. Its stops/slow your growth 🤣","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Be quiet on the boat, you scare the fish away. In reality, peace of mind and quietness for dad, who is on a boat with me and my sister.","score":29,"comments":[]},{"body":"That on a clear day, from a hill not to far from me in scotland,,,,,, i could see france","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"You mustn't touch yourself *down there*. Because if you do, it'll cause your eyes to cross and make you look cockeyed at things.\"","score":58,"comments":[{"body":"Maybe ahegao was big back then too","score":32,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"If I cracked my knuckles I'd get really bad arthritis, and my knuckles would become enlarged","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What food can you cook perfectly?","not_safe_for_work":false,"locked":false,"body":"","score":17,"comments":[{"body":"Lasagna is my best dish. It's perfect in every way. If the Vikings in Valhalla ate lasagna, it would be mine.","score":12,"comments":[]},{"body":"Boston Butt (Pulled Pork)","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Grilled cheese - perfect crunch melted all the way through","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Bigos or cepelinai. The former is a stew of mixed pork and sauerkraut, and it's my family's native dish we love it so much we asked the funeral home where my grandfather was buried to make it for us, it must be eaten at all family events, the latter is a potato dumpling from Lithuania, and usually stuffed with with meat or mushrooms and they are so delicious.\n\nGrowing up in a Polish household, people would often suggest I ate a lot pierogi growing up. I never had pierogi as a child. The first pierogi I ate was the frozen stuff. Not once. But I ate a lot of cepelinai, because I'm also part Lithuanian. And that was the dumpling of choice.\n\nAlso, FWIW, it's called pierogi. Don't say \"pierogies.\" If you want to eat just one, and you're fucking mad for only wanting one, it's \"pieróg.\" Pyer-ook. The Polish language often morphs an \"oo\" sound into an \"oh\" sound. Like \"Bóg,\" or stól, or tułów that no one can say.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Well I am a mom of exactly 1 and I recently adopted a new husband and turns out my life long passion is to create recipes that will remind the future generations how good I was doing some certain dish and piss off a wife or husband of a grand child of mine.\n\nDon't get me wrong I don't enjoy cooking, I am not a foodie either and following the steps of my god bless her very untalented cook herself grandma who used to cook the same dishes over and over I am a repeat cooker.\n\nSo far I perfected my lasagna, stuffed cabbage, oven fried chicken,  red lentil soup and a special meatball and potato dish.\n\nAll this happened thanks to the many failures my husband lovingly endures so adoption of him was very crucial to the process if I say so myself.","score":4,"comments":[{"body":"wow ok i have a new aspiration in life: family matriarch and founder of all secret recipes. just gotta find a timeless dish that’ll keep them thinking of great great grandma! :P","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Ice cubes","score":3,"comments":[]},{"body":"Im 12 and i can make good rice👍 and i think fried chicken i am good at too, at least what i mean is i know how to do them, and pasta, omlettes, it would probs be eggs tho, i can make eggs perfectly","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oxtail Stew.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I can perfectly cook a plate of Totino's Pizza Rolls without one of them bursting open on the pan.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What’s the stupidest movie/show plot twist?","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":" \n“Somehow Palpatine returned”","score":87,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The ending of Spartacus. So you're telling me that like 20 people have been Spartacus this whole time? Then why have we been following this one guy?!","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Dude Where’s My Car. It was a crappy movie to begin with but it was going good until aliens showed up","score":11,"comments":[{"body":"I feel like it's one of those rare movies where the story doesn't really matter...","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Bran ending up being King. Arya being the one to kill the Night King. Jaime going back to Cersei and dying in the Red Keep. Just all of it.","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Almost any \"it was just a dream\". Unless it severely messed up the person having it (think Miles O'Brien), there's no consequences and the story was pointless.","score":27,"comments":[{"body":"O'Brien must suffer.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"The ending of St Elsewhere. \n\nThe \"it was all a dream\" it's \"it's all in his imagination\" thing is lazy and dumb. Especially in a serious setting. Have a better ending. Don't cop out.","score":6,"comments":[{"body":"Wasn't this in 1988 a pretty novel thing for the finale of a popular show?","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Bobby Ewing in a shower","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What are some good podcasts to listen to??","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"Spooked.","score":3,"comments":[]},{"body":"Diary of a CEO","score":2,"comments":[]},{"body":"James Obrien's Mystery Hour  \nStuff You Should Know  \nKnick Knack News  \nTangle  \nSome specific episodes of Song Exploder  \nDTFH  \nMonday Morning Podcast  \nPFT Live  \nLex Fridman","score":2,"comments":[]},{"body":"Stuff You Should Know.  Interesting and mildly amusing.","score":2,"comments":[]},{"body":"The Andrew Huberman Podcast. Learn a lot of cool things about the brain and body from a Stanford professor","score":1,"comments":[]},{"body":"Leo Laporte the tech guy","score":1,"comments":[]},{"body":"No Dumb Questions is a go-to for me","score":1,"comments":[]},{"body":"Opening Arguments","score":1,"comments":[]},{"body":"Rogan\n\nRuthless podcast is really good.","score":1,"comments":[]},{"body":"Smartless, Conan O Brian needs a friend, WTF with Marc Maron, Talk is Jericho","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Who's the character everyone loves but is actually annoying?","not_safe_for_work":false,"locked":false,"body":"","score":17195,"comments":[{"body":"Tweety Bird from Looney Tunes. So much self-conscious \"cuteness\", plus he stirs up shit to plays the victim. \n\nThe real world has enough manipulative characters, I don't need one in my cartoons.","score":2692,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"So...I just asked my wife this question and she IMMEDIATELY said Snuffleupagus from Sesame Street.\n\nI absolutely had to ask why that was, and she said when she was a child, she loved Big Bird, and she always wanted to be Big Bird's best friend. But she felt like Snuffleupagus was always in the way bc on the show Big Bird would always say Snuffy was his best friend.\n\nShe even told me that til this day she had a minor hatred for wooly mammoths because they remind her of Snuffleupagus.\n\nLearn something new in marriage every day 🤣","score":2827,"comments":[{"body":"Honestly, the absolute grudge that can form as a child and linger forever for some reason or other is so strong.\n\nBut also she's wrong Snuffleupagus was my favorite from Sesame Street and I extra love Wooly Mammoths because of it.\n\nSooooo. I'm willing to fight for his honor.","score":736,"comments":[{"body":"She said she'll meet you tomorrow at the flag pole after school.\n\n3 o'clock.","score":314,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Where are Max and Ruby’s parents?","score":7321,"comments":[{"body":"And that’s how we get Ruby.","score":1374,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Carrie Bradshaw from SATC - self absorbed, not a good friend and just the worst.","score":5581,"comments":[{"body":"I just wanted her to get over Mr. Big after being caught in an affair, that's should have been it for them. Instead, they had to turn the Russian into the bad guy to get her back with Mr. Big. I was so disappointed. When she finally told him off right before going to Paris, I was like, finally! Only to be disappointed in the end.","score":761,"comments":[{"body":"Why would anyone in their right mind cheat on Aiden. If I found out that Aiden doesn't exist and I hallucinated him _I still wouldn't break up with Aiden_","score":599,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I was happy when the ended up together, because they were both just awful. The type of people that truly deserved each other. Aiden was too good for Carrie","score":425,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Optimists of Reddit, how are you still able to feel positive about the future, even with everything that is happening in the world today?","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"If you ignore the news and focus only on your immediate community you'll realize that everything is usually pretty chill and none of that other stuff ever mattered.","score":6,"comments":[{"body":"Looking at history, you can see things are actually getting better all the time\n\nIt’s just our perceptions get fucked today by the media (always pushing negative stories) and we take things we’re lucky to have for granted","score":2,"comments":[]}]},{"body":"Entire empires have crumbled many times in history, someone else eventually comes out on top. The world had an ice age and came back, we may not be alive for the next round, but there will be one.","score":4,"comments":[]},{"body":"I don't worry about the world at large, I stay preoccupied with keeping my own little world as harmonious and clean as possible","score":3,"comments":[]},{"body":"My student loans are finally paid off, I have a burgeoning private practice that includes an optical shop, and I’m getting married next month. We optometrists have a lot to be positive about.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"With the power of imagination anything is possible. I drive semi for a living. I put on music and only worry about what I can control. The rest is white noise.","score":2,"comments":[]},{"body":"My philosophy is that the worse something gets, the better the payoff will be. History has proven this, and if you want a list I’ll grant you one","score":2,"comments":[]},{"body":"If you look at the past, it was actually far worse than the present. We've actually come really far as a species. Even if things are awful now, history suggests that we're making radical improvements and things will get better.","score":2,"comments":[]},{"body":"I don't pay attention to what is happening. I focus on what is happening in my daily life and the goings on around me.","score":1,"comments":[]},{"body":"I focus on myself and my own life when everything else becomes too overwhelming. It's not my responsibility to fix the world, but it can start to feel that way if u focus so much on the negative things in the world","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"You get an anonymous message saying \"mission integrity compromised, abort and rendezvous at extraction point Bravo\", what is your response?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"'Exfil BRAVO compromised. Say again, Exfil BRAVO crawls. Transmit tertiary coordinates via BLACK HORSE plain text. How copy?'\n\nThen we see how much fun this LARP is.","score":5,"comments":[]},{"body":"I would literally write \"?\" What does that even mean?","score":2,"comments":[]},{"body":"Resend to proper channel, this is public.","score":2,"comments":[]},{"body":"Delete it assuming it was a scam, probably block the number as well.","score":2,"comments":[]},{"body":"Bravo is compromised. Revert to Gamma.","score":2,"comments":[]},{"body":"New phone who dis","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'd report it as spam and block.","score":2,"comments":[]},{"body":"Negative. Objective in sight. Proceeding.","score":2,"comments":[]},{"body":"It's for you dad","score":1,"comments":[]},{"body":"Who is bravo and why is extraction pointing at them","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Which USA Federal buildings have the best bathrooms?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"White House. I hear Biden has a nice bathroom","score":2,"comments":[{"body":"This doesn’t sound like firsthand experience…","score":2,"comments":[]},{"body":"Wouldn’t that really be any president who goes in there? Surely they don’t change the bathroom too much","score":2,"comments":[]}]},{"body":"FBI building","score":1,"comments":[]}]},{"title":"What awful smell do you somewhat enjoy because of sentimental value?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"Incense brings back childhood memories","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The manure smell that emanates from the mushroom farm just north of where I grew up when the wind would blow just right .\n\nSo earthy!\n\nOr the pork processing plant to the northwest of us.\n\nBut never the slaughterhouse to the northeast; that was horrid and still is.","score":3,"comments":[]},{"body":"smell of a musty house from the 50s","score":2,"comments":[]},{"body":"My dad's farts","score":2,"comments":[]},{"body":"The rubbish tip. Everytime when we drove past I breathed in nice and hard and said mmm mangoes. I thought it was a mango farm. I was I think 18 and driving around with friends when I was told it was a tip.","score":2,"comments":[]},{"body":"Lutefisk at grandma's christmas.","score":2,"comments":[]},{"body":"My cat’s breath.","score":2,"comments":[]},{"body":"Insulin. It smells like the projector screen my dad would get out every Christmas to look at old pictures","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My farts","score":1,"comments":[]},{"body":"My dick","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"You have to wear your last text message on your shirt, what does your shirt say or show?","not_safe_for_work":true,"locked":false,"body":"","score":4,"comments":[{"body":"\"Sorry for the delay\"\n\nActually I do want this on a shirt now. Thanks Reddit person!","score":1,"comments":[]},{"body":"Made it home safe. Love you goodnight","score":1,"comments":[]},{"body":"I don't have to work in my dreams","score":1,"comments":[]},{"body":"3","score":1,"comments":[]},{"body":"1","score":1,"comments":[]},{"body":"k","score":1,"comments":[]},{"body":"Idk","score":1,"comments":[]},{"body":"Oh I fuckin hope so lol. Yeah unnecessary stairs are the devil","score":1,"comments":[]},{"body":"Vi er på vei nå\n\nWould confuse a lot of people since I live in Canada","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What’s your favorite tv show right now?","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"It's Always Sunny in Philadelphia.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"dahmer documenterie","score":4,"comments":[]},{"body":"Star Wars: Andor","score":12,"comments":[{"body":"Best Star Wars show period. No lightsaber wielding force wizards, no Skywalkers, no Tatooine. Just brilliant writing showcasing the dark, gritty reality of the Rebellion; along with the political intrigue of the Empire. I can't wait for the finale on Wednesday.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I did enjoy the latest AHS NYC","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"BUFFY THE VAMPIRE SLAYER &amp; VERONICA MARS \n\nFor animes I'd say spy x family :)))","score":5,"comments":[]},{"body":"The Peripheral.","score":3,"comments":[]},{"body":"The Rookie","score":3,"comments":[]},{"body":"Resident Alien.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"One of my favorite newer shows is Abbott Elementary! It's wholesome and nice to watch to destress.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What monopolies are in need of being broken up?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"Disney","score":8,"comments":[]},{"body":"Your local electric company is a monopoly, as is your water company.","score":6,"comments":[{"body":"Socialize energy.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Nestlé","score":1,"comments":[]},{"body":"Ticketmaster","score":9,"comments":[]},{"body":"Big pharma","score":7,"comments":[]},{"body":"Internet in Canada. It’s 3 companies and our prices are fucked","score":3,"comments":[]},{"body":"Amazon needs to be broken into 3 companies: it’d fba business; it’s AWS business; and everything else it does. \n\nA company like that kills competition and actually and ironically will kill capitalism.","score":3,"comments":[]},{"body":"All of 'em? If they're monopolies they're probably not good for society. But this country hasn't done proper trust busting in a century.","score":3,"comments":[]},{"body":"US government","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Doomsday prepers. What is the Best advice or tip people should follow in a zombie apocalypse (non-nsfw or nsfw)?","not_safe_for_work":true,"locked":false,"body":"","score":3,"comments":[{"body":"The best tip will always be: Exercise.\n\n You won't survive if you're a fatty.","score":9,"comments":[{"body":"Lol, rule #1.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Find other nearby preppers and become friends with them. When shtf bring em some poisoned banana bread and steal their stuff","score":8,"comments":[{"body":"&gt;When shtf\n\nIf you're going to censor it, just say \"When the manure hits the spreader\".","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Always have an exit strategy if shit goes bad. \n\nLast thing you wanna do is box yourself in somewhere.","score":4,"comments":[]},{"body":"Don't trust gas generators... Renewable, noiseless solar power is the way to survive.","score":4,"comments":[]},{"body":"Solar energy, underground bunker, packaged foods for a lifetime, weapons (small guns, flamethrower, smoke bombs), night vision, cameras everywhere. And maybe a fetish for corpses","score":2,"comments":[{"body":"Corpse fetish seems important ☣️🙂","score":2,"comments":[]}]},{"body":"Wear long sleeve leather jacket, jeans and heavy duty gloves. Zombies will struggle to bite through any sort of thick clothing","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Well if you do have a friend who is a prepper or just generally enjoys being prepared don't go to them expecting a free ride. Bring anything useful that you're able to be at food weapons ammunition or even just an invaluable skill.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"If you could suggest a book to everyone, what would it be?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Ex-heroes, the Superhero VS zombie books I always needed without knowing it.","score":1,"comments":[]},{"body":"1984","score":1,"comments":[]},{"body":"To help people conquer the loneliness epidemic from within: \"Trust\" by Osho\n\nFor sheer entertainment: \"The Kite Runner\" by Khaled Hosseini","score":1,"comments":[]},{"body":"The Four Agreements by Don Miguel Ruiz. It’s a short book, based on Toltec ideology, on spiritual freedom. If you don’t want to read the book, at least read what the four agreements are, they can open your eyes to a forgotten world.","score":1,"comments":[]},{"body":"The art of war, sun zu","score":1,"comments":[]},{"body":"Magician by Raymond Feist","score":1,"comments":[]},{"body":"Zen and the Art of Motorcycle Maintenance","score":1,"comments":[]}]},{"title":"If you could find out what happens after death, would you? Why or why not?","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"For sure. I don't mind spoilers.","score":32,"comments":[]},{"body":"It's possible you won't like the answer.\n\nIn that case, does knowing the answer benefit you in any way?\n\nFor the religious, the answer may cause them to lose faith.  How awful to spend the rest of your life stripped of something that gave you comfort.  \n\nFor the unbelievers, the answer may scare them. If you're going to experience hell after you die, why would you want to start now? The ticket to heaven isn't to be good because you have proof of hell. Once you have that proof, it might be too late. Since nobody in history has died with proof, this is an edge case which isn't addressed by religions.\n\nIt's possible that you experience an incredible amount of pain by your nerves dying. It's possible it's the most peaceful experience ever.  \n\nSeems like this is a question best left unanswered.","score":11,"comments":[{"body":"&gt; For the unbelievers, the answer may scare them. If you're going to experience hell after you die, why would you want to start now? The ticket to heaven isn't to be good because you have proof of hell. Once you have that proof, it might be too late. Since nobody in history has died with proof, this is an edge case which isn't addressed by religions.\n\nFascinating perspective. If you knew hell was real could you even be truly altruistic? Every good deed or positive action would be borne out of fear whether you like it or not.","score":7,"comments":[{"body":"&gt; Fascinating perspective. If you knew hell was real could you even be truly altruistic? Every good deed or positive action would be borne out of fear whether you like it or not.\n\nWhich is a question worth asking of religious people first of all, hell being real or not, if they actually believe it exist, can they ever be truly good? I'd say many religious people don't think so, since they seem to have the idea that without religions people would just be immoral beasts... as if the fear of hell is the only thing keeping us from killing each other.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I think it'd change a lot of people's outlook on life. Off the bat it'd instantly prove/disprove most or all religions which would obviously be a big deal.\n\nIt'd also change how people live in terms of what comes next. Things are different if you think this is the one short mortal life you have vs if you think you'll live for eternity someplace else.\n\nI'd peek behind the veil. Personally as an atheist I think its just lights out; just like before you were born. You simply cease to be; the void.\n\nI've been put under anesthesia for medical procedures and I think it will be like that but you just never come out the other end of the tunnel. Its just nothing.\n\nThat said, I think we need to cherish the limited time we have and the people we share that time with, build a strong future for those who will come next, etc because all you get is a blink against eternity.\n\nIf I'm right, then I know a lot of people who will not get what they're hoping for, though obviously they'd never experience that disappointment because they'll be gone.\n\nIf I'm wrong I'm sure there would be more I could do to metagame the afterlife, but im ok rolling the dice on \"don't be a dick\" as my stratedgy.\n\nIf we could prove religion is wrong though, it would be quite beneficial to rid ourselves of all the flavors of fanaticism and manipulation that cause so many problems for mankind.\n\nI will gaze into the abyss.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yeah, that's the issue with having depression/suicide intent and anxiety. Like, I want to die, but I also need to know what's next or I won't do it lol","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Definitely, I need a warning if I’m going to have to join a religion","score":4,"comments":[]},{"body":"I guess i wouldn't want to know. It would be difficult to accept a void or that our life is just this and we're gone. Better stay in the dark and be surprised haha","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No. I like the suprises.","score":3,"comments":[]},{"body":"Absolutely, I would honestly try and find a way to communicate beyond the dead and let my family know  that it’s ok or we should fear it","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What reality TV cliche do you hate the most?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"The contestant with the hard luck story.","score":3,"comments":[]},{"body":"Constant laugh tracks and guys opening fridges","score":2,"comments":[]},{"body":"\"I've had enough! I'm calling my agent, I'm leaving!\"","score":2,"comments":[]},{"body":"Squealing of tires on gravel or dirt","score":2,"comments":[]},{"body":"Well, I don’t really know if this qualifies, but I have to change the channel every time I see/hear “Flo”","score":1,"comments":[]},{"body":"The long drawn out pause before revealing who the winners/losers are.","score":1,"comments":[]},{"body":"Every time someone coughes in a drama, it’s foreshadowing death.  Especially from cancer.   People don’t cough unless they are going to die.","score":1,"comments":[]}]},{"title":"What was your first social media?","not_safe_for_work":false,"locked":false,"body":"","score":46,"comments":[{"body":"MySpace","score":103,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"ICQ","score":53,"comments":[{"body":"Uh oh!","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Xanga! I miss it!","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Bebo","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"AOL AIM","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"MSN messenger","score":30,"comments":[]},{"body":"Club Penguin","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Friendster","score":16,"comments":[]},{"body":"BBS’s","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What's the best example of the majority being wrong in human history?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"My favorite is when John Snow had to prove that a cholera epidemic was caused by a contaminated water supply and not just some miasma.","score":5,"comments":[{"body":"People really didn’t want to hear about that fecal-oral vector.","score":3,"comments":[]}]},{"body":"Some might say brexit","score":5,"comments":[]},{"body":"Religion.","score":16,"comments":[]},{"body":"Not quite answering your question, but I often think of how the 13th Amendment of the US constitution, the amendment banning slavery, was defeated in the House of Representatives:\n\n&gt;June 15, 1864  \n&gt;  \n&gt;The House of Representatives initially defeated the 13th Amendment (S.J. Res. 16) by a vote of 93 in favor, 65 opposed, and 23 not voting, which is less than the two-thirds majority needed to pass a Constitutional Amendment.","score":3,"comments":[]},{"body":"The Earth is the centre of the universe.","score":3,"comments":[]},{"body":"Car-centric urban design","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The persecution of Jews.","score":4,"comments":[]},{"body":"People who said Leicester couldn't win the Premier league after Christmas when they were top","score":2,"comments":[]},{"body":"Physics before Newton and Einstein. For ex a whole majority believed that we need a constant force to keep something moving on a surface.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What are the scariest creatures that live in the ocean?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Orcas. They kill for fun. They’re basically the humans of the sea. Murder dolphins.","score":1,"comments":[]},{"body":"Box jellyfish","score":1,"comments":[]}]},{"title":"If someone handed you a box with everything you’ve ever lost inside of it, what would you look for first?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"My self confidence","score":10,"comments":[]},{"body":"My deed to a plot of land on Hawaii II I got from Cards Against Humanity.","score":4,"comments":[]},{"body":"Oh cool, I wonder how far down I'll have to go in there to find my sanity.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My \"fluffy pillow\". A floppy ancient feather pillow. I miss it so much. It still smelled like my childhood home before everything went to shit.","score":3,"comments":[]},{"body":"A crocheted black hat my mom made that I lost one stupid drunken night several years back. That was a very bad year, when she passed, and I did a lot of things I regret. That one sticks with me though. Loved that hat, felt like I lost a piece of my mom.","score":3,"comments":[]},{"body":"My favorite stuffed animal","score":2,"comments":[]},{"body":"My old high school class ring","score":2,"comments":[]},{"body":"My grandpa","score":2,"comments":[]},{"body":"My grandma’s ruby ring.","score":2,"comments":[]},{"body":"My loved ones who have passed. Then I could be reunited with them again.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What’s your favourite movie scene?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"“My friends, you bow to no one.”","score":1,"comments":[]},{"body":"”Well if you two don’t mind I’m going to bed, before either one you comes up with another clever idea that’s gonna get us killed. Or worse. EXPELLED”","score":1,"comments":[]},{"body":"Kingsmen - Church massacre scene.\n\nPolar - \"I see you're smoking again? I thought you quit?\" - \"Figured it wouldn't kill me\"","score":1,"comments":[]},{"body":"The Baptism of Fire - The Godfather 1","score":1,"comments":[]},{"body":"When WallE shows EVE his directive and say “Tah-dah!” very proudly as the compressed trash falls apart.\n\nOh and that scene in Terminator when they are having sex and the camera zooms in on their hands grasping hard… yeah thats a good one…","score":1,"comments":[]},{"body":"Tears in the rain.","score":1,"comments":[]},{"body":"the ending scene from casablanca. bogart’s monologue to bergman gets me every time, not to mention the entire sequence is filled with so many famous movie quotes:\n“we’ll always have paris.”\n“here’s looking at you kid.”\n“maybe not today, maybe not tomorrow, but soon and for the rest of your life.”\n“round up the usual suspects.”\n“louis, i’ve got the feeling this is the beginning of a beautiful friendship.”","score":1,"comments":[]},{"body":"The happy end of the babadook","score":1,"comments":[]},{"body":"300, where Leonidas asks the acadians their profession. Then asks the spartans","score":1,"comments":[]},{"body":"Selma Hayek dancing scene, From Dusk Till Dawn.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Why do you wear fur coats?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"it's incredibly warm, 50 years old, Dior, recycled/upcycled, a gift, and  even if it wasn't I hear fuck all about the humans rights abuses that lead to fashion (or even produce) compared to when I wear my fur in Seattle.\n\ni stg if I have one more sjw wearing sweatshop clothes and diamonds talk shit to me and threaten me for wearing my sable stroller coat I might take a goddamn kneecap","score":2,"comments":[{"body":"You sound lovely","score":1,"comments":[]}]},{"body":"I don’t, I’m short so I’d look like a damn Ewok.","score":1,"comments":[]},{"body":"I got one as a gift and it's actually really comfortable and warm. It's not really my style and I wouldn't have bought it myself, but I have to admit that it gets the job done.","score":1,"comments":[]},{"body":"I have fur on the hood of my parka if that counts. It just keeps me warm and I like how it looks","score":1,"comments":[]},{"body":"Only in my winter coats hood","score":1,"comments":[]},{"body":"because I need to care myself while looking stylish","score":1,"comments":[]}]},{"title":"Programmers of Reddit! Any idea how to stay in touch with programming, deal with impostor syndrome &amp; reach your goals?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"Walk before you can run. I always fine myself jumping straight into the deep-end and was overwhelmed because I didn’t know how everything really worked. Felt imposter Syndrome as an effect. So going back and relearning things carefully would be my advice.","score":3,"comments":[{"body":"I recently joined an IT company as a trainee and until then I used to cope with it by creating personal projects on whatever topic I felt like. But now I feel disappointed to the lack of the kind of environment I was expecting. I expected hardcore &amp; difficult journey, and now I mostly do config files for enterprise software fuelling the syndrome.","score":1,"comments":[]}]},{"body":"the question answers itself: you need to be in touch with programming as much as you can.","score":1,"comments":[{"body":"Yes I try to but the recent job opportunity I'm in is the fuel to my camp of syndromes. (see my response to @zrellla123 for more context)","score":1,"comments":[]}]},{"body":"Join a coding community like Stackoverflow or an open source project.","score":1,"comments":[{"body":"That's a good suggestion and my ultimate goal actually","score":1,"comments":[]}]}]},{"title":"What would happen if agressively nice people ruled the world?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"We're about to find out.","score":2,"comments":[]},{"body":"I ask because of this scene from SpongeBob:\n\nhttps://youtu.be/NqrFo3OOP5Y","score":1,"comments":[]},{"body":"Increased cooperation would allow us to improve all around.","score":1,"comments":[]},{"body":"Tons of stagnation. Pretty much every policy screws someone over, so being too nice would mean it's very hard to do anything.","score":0,"comments":[]},{"body":"Murderers will only spend one night behind bars.","score":0,"comments":[]},{"body":"Seems somewhere between China's overarching deal and maybe Bloomberg's soft drink stuff.","score":0,"comments":[]}]},{"title":"Humans of Reddit: What have you witnessed that made you lose faith in humanity?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Turn on the news and pick one.","score":1,"comments":[{"body":"LMAOOOOOO","score":1,"comments":[]}]},{"body":"Thanks for making sure no fish reply to this","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The sheer number of people who not only don't see Trump as an existential threat to democracy, but actually vehemently DEFEND and SUPPORT the PoS.","score":1,"comments":[]},{"body":"In general, or what I see every day?","score":1,"comments":[]},{"body":"Oh, where do I start?  \nAdults not knowing who their current prime-minister/president is, whilst a child does.","score":1,"comments":[]},{"body":"Humans.","score":1,"comments":[]},{"body":"Honestly, the continued shit like the shooting in Colorado Springs. It’s insane to me how fragile these losers are that they want to go kill people doing their own thing. \n\nWastes of oxygen.","score":1,"comments":[]},{"body":"Donald Trump being elected as president...","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When I was 16F my boyfriend 19M and I went to the state fair. Outside the state fair was a guy selling water bottles for $1 each. I bought 2 water bottles with (my) cash- there was a homeless man outside the fair asking for money and I mean like A HOMELESS man, not somebody trying to pretend to be homeless like- please somebody get this man a shower and medical attention possibly, and I went to open my wallet to give him my last ($2) cash so that idk maybe he could get food or water- my boyfriend started yelling at me “Don’t give him your money he’s just going to buy drugs or alcohol” I turned around cus I thought he was joking? He wasn’t, he became more angry trying to rip the cash out of my hands and grabbing me by the arm and I was like “wtf fine I’ll just give him water” and he got even more mad that I offered to buy him water with the cash left in my wallet and said “let’s go leave that man alone he doesn’t need your help” and shit like that. So I gave the homeless man the water bottle I had just bought and apologized profusely. I didn’t enjoy the fair that night. My heart broke for that man having to feel that humiliation and judgement. I tried very hard to break up with him after and it was very hard turned into a stalking situation but were broken up now","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]}