{"name":"bad_cop_no_donut","description":"\"We cannot expect people to have respect for law and order until we teach respect to those we have entrusted to enforce those laws.\" - Hunter S. Thompson","subscribers":539787,"posts":[{"title":"Quick FYI - Don't advocate for violence, don't celebrate violence, don't plan violence here.","not_safe_for_work":false,"locked":false,"body":"I don't want to police you guys but I do not want this sub banned or quarantined. So fuck off with that shit or you're gonna get banned because I assume you are police plant, trying to false flag the sub. \n\nThe admins have been explicitly clear on the subject - advocating for violence is not allowed on reddit. Its a site wide rule. Feel free to sperg out here, but this sub's ability to amplify and spread the news is more important than your feelings.","score":1886,"comments":[{"body":"That being said..... fuck the police","score":516,"comments":[{"body":"And this is something you will all continue to be allowed to say.","score":331,"comments":[{"body":"\\&gt;\"Allowed to say\"\n\nNo wonder I keep getting invitations to join other discussion groups where it is anything goes.","score":112,"comments":[{"body":"I'd love complete anarchy here. But then we'd be kicked off or marginalized on the platform","score":122,"comments":[{"body":"I know, so would I, but we do not own the platform do we.","score":48,"comments":[{"body":"Janitors aren't shareholders :/","score":79,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"When a cop walks despite video of them murdering an innocent, why is it *wrong* to say police should be dealt with by the same standards law enforcement itself applies to civilians?\n\nWe are told in no uncertain terms - by the justice system - that what they did was legitimate and acceptable. There's something wrong and extremely dangerous about claiming this does not apply to the little people. That's the kind of argument an oppressive regime makes about its behavior against those whose necks it's standing on.","score":80,"comments":[{"body":"Ask the admins. I'm not going to pretend to be unsympathetic. I simply care more about the sub than how I personally feel about the scenario or issue. The goal is to be able to amplify the message. Getting banned or quarantined is counter productive and would limit or even cripple our impact as an activist subreddit.","score":43,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"\"I don't want to police you guys\"\n\nHEUHEUHUEUHEUHUEUHEUHUE","score":74,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When we see stories about cops fighting other cops, would it be out of line to cheer them on in their struggles against the men who would deny us our rights?  Or, failing that, to simply note that when cops are on the receiving end of their own violent tendencies, that we the people are the winners of said fight?","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Man pulled over for window tint violation killed; police footage released","not_safe_for_work":false,"locked":false,"body":"","score":1166,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Cop: Sir, I pulled you over because your windows are illegally tinted and I'm going to write you a ticket. Please get back into your vehicle while I write the ticket. Dispatch, I need backup for an uncooperative driver.","score":197,"comments":[{"body":"\"Illegally tinted windows\" is a well known excuse to pull over black people (or, really, anyone cops don't like the look of) without cause.\n\nA black woman, also the first elected Florida state attorney, was pulled over with such an excuse. You can see her knowing smile at about 45 seconds into this video:\n\nhttps://www.youtube.com/watch?v=9FEPDJnyTcY","score":159,"comments":[{"body":"She ran for Florida AG this year but unfortunately got obliterated because the Florida Democratic Party fucking suck at politics.","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Has anyone else noticed that often cop cars ALSO have have window tint violations?  But I guess thats ok, right?","score":283,"comments":[{"body":"They also have a mounted laptop they use while driving. Laws for thee not for me.","score":208,"comments":[{"body":"Sounds about right.","score":36,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"As soon as the guy got out of his vehicle I already know the cop will never see any punishment. ACAB for real, but he gave the cop the slimmest little way out of all of this. The cop is ready to escalate without any worry due to that mistake. Its almost always the cop escalating the situation to violence out of some perceived slight of not being respected.","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"Bullied to Death by Police: An American Story\"","score":90,"comments":[]},{"body":"Every time they refuse to hand over the bodycam footage - you KNOW it is more fucked up than this.","score":90,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"When the Colorado Springs police arrived at Q Club, they arrested the person who took down shooter and locked him in a police car for an hour","not_safe_for_work":false,"locked":false,"body":"","score":3137,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Hmm let’s do a quick rundown, in no particular order (and w/o googling, so feel free to add plz)\n\n• uvalde, police line up and stand around. Possibly kill a kid. Arrest parents. Hours go by. \n\n• Boulder, co, king soopers, police line up for at least an hour outside \n\n• Denver co, police *commit* mass shooting when firing at a suspect on the street and hitting several bystanders - was this the same shooting where they shot the “good guy with a gun” who stopped a shooter? Actually p sure that was *another* incident in Denver in the last couple years \n\nI mean, it’s almost like - and bear with me here - the police aren’t prepared, willing or even necessarily obligated to actually prevent or even interrupt this type of harm in any kind of consistent way.","score":299,"comments":[{"body":"&gt;Possibly kill a kid.\n\nYou mean the one they might have shot themselves, or the one they told to call out and reveal her position to the shooter?","score":83,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Uvalde police would have then found his parents and locked them in a car too.","score":191,"comments":[{"body":"But not before stopping one of their own from trying to save a family member trapped inside.","score":51,"comments":[]}]},{"body":"It's awful that my first reaction to this was \"At least they didn't kill this one.\"","score":95,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Tweets from Your Friendly Butch Anarchist / @butchanarchy\n\n&gt; When the police arrived they arrested the person who took down the Q Club mass shooter and locked him in a police car for an hour while he pleaded to be allowed to find out if his family was okay. ACAB\n\n&gt; **Image:** *Screenshot of text from a BBC article that reads: Mr. Fierro said he was covered in blood when the police arrived, and officers tackled him and put him in handcuffs. He said he was held in a police car for more than an hour, and screamed and pleaded to be let go so that he could see what had happened to his family.*\n\n&gt; Time and time again the role of the police is to exacerbate trauma and punish anyone who uses their agency to help others. They are not here to help us, they are here to punish and control. Fuck the police. We protect us.\n\n&gt; His wife, daughter, and friends were in that club and after saving lives (with the help of other patrons let’s not forget) he was tackled and thrown in a police car without knowing if any of them were injured or dead. The cruelty of cops knows no bounds.","score":698,"comments":[{"body":"The average police officer isn’t very smart and that’s by design. The hiring process is built in a way that actively screens out the intelligent.\n\nThe police academy curriculum is written to a 7th grade reading and comprehension level. It’s not very hard or in-depth and the quality of the training is getting worse. \n\nSince Ferguson fewer and fewer people are wanting to be a cop. The good candidates are looking at the current dumpster fire that is LE and saying “nope!”\n\nAll of this and more is effectively dumbing down the intelligence and abilities of cops as a whole.","score":275,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"He embarrassed them. they needed to show who was in charge there.","score":361,"comments":[{"body":"This here is the explanation for many of these types of incidents\nPissing off a cop is now a capital crime punishable by summery execution","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Exclusive: Under oath, Little Rock narcotics officers say they destroyed evidence, routinely violated the Fourth Amendment","not_safe_for_work":false,"locked":false,"body":"","score":355,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"&gt; Still, most of the police officers who conducted these drug investigations still work at the LRPD, and they don't appear to have received any discipline at all. Some have since been promoted.","score":45,"comments":[]},{"body":"Piggies going to pig.","score":15,"comments":[]},{"body":"LRPD are about as corrupt and unprofessional as it is possible to be.  They are not in any way responsive to political oversight and actively work against their own chain of command to continue on their merry ways.  This is a classic case where the only solution would be a DOJ consent decree followed by complete reorganization.  That will not happen as long as the current crop of officers are in place.","score":10,"comments":[]},{"body":"Even with absolute air tight evidence of perjury the system still protects these POSes pretending to be police officers.","score":27,"comments":[{"body":"They're not pretending. This is who cops are by default.","score":12,"comments":[]}]},{"body":"I think they mean when they say they destroyed evidence, they pocketed the cash that was evidence. A perk of working in law enforcement narcotics are the bribes and cash available.","score":6,"comments":[]},{"body":"How could anyone possibly be surprised this? The only surprises is that the pig admitted it.","score":3,"comments":[]},{"body":"Well that's just shocking!","score":3,"comments":[]},{"body":"Wow! I am not surprised in the least.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"An Ohio man won $45 million in a civil lawsuit against a police department and detective whose actions led to his wrongful conviction and more than 20 years behind bars.","not_safe_for_work":false,"locked":false,"body":"","score":174,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When will the taxpayers get tired of paying for criminal police?","score":26,"comments":[{"body":"Sad part is that, the unions will cry wolf and say, that the cops won’t be able to do their jobs properly if they lose their qualified ‘license to tyrant’ immunity.","score":4,"comments":[{"body":"Qualified immunity is a separate issue, it's not why the municipality pays instead of the police - if the police have QI, so does the municipality.","score":1,"comments":[]}]}]},{"body":"Should be a HUNDRED million","score":9,"comments":[]},{"body":"Miami Township is going to see a tax increase","score":2,"comments":[]},{"body":"Does this mean they will expunge his record and vacate the conviction as part of the lawsuit action?","score":1,"comments":[]},{"body":"So when does that pig go to prison for 20 years?","score":1,"comments":[]}]},{"title":"Texas — An apparent case of mistaken identity in Galveston landed a man in jail for days in May after police thought he was an escaped prison inmate. Jeremi Cummins' lawyer said a police K-9 even bit off half his ear during the arrest.","not_safe_for_work":false,"locked":false,"body":"","score":22,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"It’s the fact that they found out, on scene, after arresting him, that he wasn’t the guy they were looking for and took him to jail anyways to cover-up their mistake.","score":4,"comments":[{"body":"That's a shit ton of criminal and civil liabilities.","score":4,"comments":[]},{"body":"Thats the part that makes me really mad. I can understand stopping him, or detaining him.... but knowing hes not the guy and bringing him to jail for resitsting arrest,........ thats insane.","score":1,"comments":[]}]}]},{"title":"3 arrested in the beating of a detainee in Georgia detention center | CNN","not_safe_for_work":false,"locked":false,"body":"","score":27,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Damn, I didn't think anything would come of this.","score":1,"comments":[]},{"body":"[removed]","score":1,"comments":[{"body":"We're having a bad time with spambots, so your comment or post has been removed automatically. if this is a real person, and not a bot or a  troll, please [CLICK HERE](http://www.reddit.com/message/compose?to=/r/Bad_Cop_No_Donut) to send a modmail.\n\nIn addition to sending a modmail, please read the rules in the sidebar and [reddiquette](http://www.reddit.com/wiki/reddiquette).\n    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"body":"Unless all the other guards in that cell pulled them off him and immediately reported to superiors then that isn’t enough.","score":1,"comments":[]}]},{"title":"Inside One of America’s Deadliest Police Departments. At just 22 years old, Sean Monterrosa became the 33rd person killed by the Vallejo Police Department since 2000.","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Female prison officer fired for having affair with a prisoner. She denies it but put him as the father on her baby's birth certificate. Now she is going to prison.","not_safe_for_work":false,"locked":false,"body":"","score":133,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"It’d be super cute if they end up in the same prison!","score":33,"comments":[]},{"body":"that's... impressively stupid.","score":17,"comments":[]},{"body":"Corrections officer: one job where it’s very bad to bring your work home with you.","score":9,"comments":[]},{"body":"Was she hoping to collect child support from the father?","score":8,"comments":[]},{"body":"I have a cousin that did this shit. He did not get jail time only fired. Has custody too. I kinda feel like putting her in jail isn’t doing society any favors though. That kid wont have either parent in its life for a while. Can’t be good.","score":2,"comments":[{"body":"Might be better off considering.","score":3,"comments":[]}]},{"body":"Seems to happen a lot","score":1,"comments":[]}]},{"title":"Illinois — A Charleston police officer who fled the country after being charged with three sex crimes was sentenced to six years in prison on lesser charges. One charge of child pornography was dismissed.","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Well you gotta hear both sides. Wait until the department releases the full video of him jacking off to kiddie porn, instead of just these edited clips that the lame stream media is using to rile us up. With context, I’m sure it’ll be clear he was jacking off to child abuse videos in self defense.\n\nEdit: it turns out he wasn’t indicted for just blasting ropes to kiddie porn; he actually coerced a 17 yr old girl into filming a sex tape with him, and then threatened to hunt her down if she told anybody. He then skipped bail, fled to Mexico, and got caught at the border.","score":9,"comments":[{"body":"Normally, attempts to avoid arrest results in additional charges, not less? Guess this cop likes to suck dick too, how else do they keep getting these wrist slaps for heinous crimes. Let it be noted that all police suck judicial cocks to receive special treatment.","score":4,"comments":[]}]}]},{"title":"Officer deliberately causes someone on a 4-wheeler to crash by running in front of it, then proceeds to arrest the victim lying helplessly on the ground. As of today there has still been no justice.","not_safe_for_work":false,"locked":false,"body":"","score":24,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"I don't know, I watched with sound off but... ATVs are illegal on public streets right? I've seen plenty of videos where these folks are driving like public nuisances \n\nUnless I get more context, I don't feel bad for the driver speeding into a busy intersection","score":1,"comments":[]}]},{"title":"Sunrise Police sergeant who grabbed officer by throat retires; records say he ‘wiped’ phone, sent text to quell witnesses","not_safe_for_work":false,"locked":false,"body":"","score":36,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Imagine  what happens to a civilian if they had done the same thing.","score":10,"comments":[]},{"body":"Gets to retire and retain his benefits? Fuckin pigs...","score":9,"comments":[]},{"body":"Source without paywall?\n\nEdit: did it myself, here; for the lazy\n\nhttps://www.local10.com/news/local/2022/07/21/sunrise-police-sergeant-who-grabbed-fellow-officers-neck-arrested-charged/","score":5,"comments":[]},{"body":"22 years and he'd never done anything wrong before this. (/s)","score":2,"comments":[]},{"body":"Gets to retire while under felony assault and witness tampering investigation. How convenient.","score":1,"comments":[]}]},{"title":"Texas K-9 cop famous on TikTok now accused of police brutality. The cop is being accused of using the dog to bite someone.","not_safe_for_work":false,"locked":false,"body":"","score":61,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"The amount of people supporting this guy on FB is sad...","score":4,"comments":[]},{"body":"Being a K9 cop would be no fun if you didn't let the 4 legged weapon maul a victim every once in a while ..... sheesh!","score":7,"comments":[]},{"body":"Piece of shit","score":3,"comments":[{"body":"We're having a bad time with spambots, so your comment or post has been removed automatically. if this is a real person, and not a bot or a  troll, please [CLICK HERE](http://www.reddit.com/message/compose?to=/r/Bad_Cop_No_Donut) to send a modmail.\n\nIn addition to sending a modmail, please read the rules in the sidebar and [reddiquette](http://www.reddit.com/wiki/reddiquette).\n    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":0,"comments":[]}]}]},{"title":"A White Father and Son shoot at &amp; Try to Kill a Black FedEx Driver. The Cops are Lenient, Don't Arrest Them. (Misssissippi)","not_safe_for_work":false,"locked":false,"body":"","score":24,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Wow, the chief of police is on tape saying he knew these guys had shot at other people they didn’t want on their street and it sounds like an ex girlfriend was shot at too.","score":4,"comments":[]},{"body":"Why does sound so familiar to me?","score":2,"comments":[]}]},{"title":"California — A former Juvenile Hall officer who pleaded no contest to having sex with a 16-year-old inmate has been ordered to perform 1,000 hours of community service and register as a sex offender.","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"[removed]","score":1,"comments":[{"body":"We're having a bad time with spambots, so your comment or post has been removed automatically. if this is a real person, and not a bot or a  troll, please [CLICK HERE](http://www.reddit.com/message/compose?to=/r/Bad_Cop_No_Donut) to send a modmail.\n\nIn addition to sending a modmail, please read the rules in the sidebar and [reddiquette](http://www.reddit.com/wiki/reddiquette).\n    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]}]},{"title":"Michigan - Two Chelsea residents are suing the city in an attempt shake loose records of alleged police misconduct that officials say should be kept out of the public eye.","not_safe_for_work":false,"locked":false,"body":"","score":30,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"The more government officials want to keep things quiet, the more it needs to be made as public as possible.","score":2,"comments":[]},{"body":"What are they worried about? Most people already know that most cops are shady.","score":1,"comments":[]}]},{"title":"Louisiana - Plaquemine's police chief was indicted on accusations he offered to get charges against a woman's boyfriend dismissed if she performed sexual favors for him.","not_safe_for_work":false,"locked":false,"body":"","score":27,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Feels redundant to name his political affinity in the article.","score":3,"comments":[]}]},{"title":"\"We Can't Ban Racists, Because No One Would Be A Cop!!\"","not_safe_for_work":false,"locked":false,"body":"","score":305,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"I’ve heard the same for the Canadian  military “your going to alienate your key hiring demographic” ever think that if you got rid of the nut jobs you might get MORE people to apply?\n\nThat having been said, the Canadian military/rcmp do more harm then good and should just be abolished","score":12,"comments":[]},{"body":"Where is this cited?","score":1,"comments":[]}]},{"title":"BREAKING: 3 Deputies Arrested For Prison Inmate Beating","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Why not all of them?","score":1,"comments":[]},{"body":"GOOD!!! This needs to be blasted as for what it is: Gang Violence against an unarmed, vulnerable citizen. DEPLORABLE!","score":1,"comments":[]}]},{"title":"A police officer in Chesapeake VA charged with multiple counts of child porn. Children under the age of 1!!!","not_safe_for_work":false,"locked":false,"body":"","score":2813,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Admin suspension, on 24 counts of child porn, and 2 expected counts of rape of a 12 to 14 year old.\n\nThey literally won't just outright fire a child rapist.","score":704,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oh man another bad apple. Where do they keep coming from?","score":181,"comments":[{"body":"The bad tree","score":74,"comments":[]},{"body":"Well since one rotten apple spoils the bunch, they’re all coming from the same shitty ass contaminated apple container. Someone needs to dump all of the apples out and disinfect it before restocking with nice, fresh apples that won’t make people sick.","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I can't even comprehend what CP with babies under one year old would consist of, and I absolutely never want to know.","score":258,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Paid leave just in time for the holidays!","score":49,"comments":[]},{"body":"What a piece of shit","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"An Police Officer you say? UNPOSSIBLE! /s\n\nIt's so so often a cop. Does anyone here know what percentage of cops are bastards, statistically, I wonder? Please help.","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"As a Chesapeake resident I'm not shocked in the slightest. Chesapeake pd is as bad as they come","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"California - A Fresno County correctional officer charged with assaulting an inmate may get to walk away from the case with his record clean again. A courtroom deal could even put the defendant back in a law enforcement uniform.","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Former Iowa State Patrol Trooper pleads guilty to federal civil rights violation","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Florida - A Santa Rosa County Sheriff's Office lieutenant has been sentenced to just over a year in federal prison for lying to federal investigators about defrauding an elderly woman.","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"I hope the cons leave him alone and the guards treat him like everyone else.\n\nHopefully that’s not too bad /s","score":1,"comments":[]}]},{"title":"South Carolina — A Greenville County Highway Patrol Trooper was arrested and charged on Monday with several misconduct charges after SLED officials say he stole while in office","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Manhattan gay bar owner laments NYPD's 'nonchalant' response to vandalism attacks - “I said, ‘We could be targeted because we're a gay bar,’” the owner recalled. “One of the officers said, ‘Well you can't know that.’”","not_safe_for_work":false,"locked":false,"body":"","score":903,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Pigs gonna’ pig","score":66,"comments":[]},{"body":"What does the owner expect from cops? Does he not know what happened at Stonewall or the Upstairs Lounge?","score":49,"comments":[]},{"body":"We need to increase security.  Clubs and neighborhood groups should look to hire security firms to protect these neighborhoods.  It's sucks but this is a stopgap measure for the short term.\n\nThe NYPD needs to be significantly reformed.  If they want to be a part of the reform, welcome aboard.  If they don't, we can start the layoffs now.  Every citizen should expect a certain level of discipline and professionalism.  If the NYPD can't do it they don't deserve to be around in this form.","score":42,"comments":[{"body":"I mean the sentiment is nice but how do u suggest to disempower them? They already wield disproportionate power politically and in the courts.","score":18,"comments":[{"body":"It will take a little while but no government system can withstand constant pressure.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"NYDP endorsed Trump. Thats all you need to know.","score":142,"comments":[{"body":"They loved his joke about slamming heads of hand cuffed suspects into cop cars. He read the room and responded just how they like it.","score":44,"comments":[]},{"body":"Those that work forces..","score":39,"comments":[{"body":"Are the same that burn crosses...","score":7,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Cop Conducts Pretextual Stop and LIES About It!","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Off-Duty Vermont Deputy Shot by Cops in New York After Refusing To Drop Gun","not_safe_for_work":false,"locked":false,"body":"","score":102,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":" Holy smokes! I’m surprised that cop that jumped in front of the cop that was shooting didn’t get his wig split!","score":17,"comments":[{"body":"Ya that was tooooooooo close...","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"“Only if he would have complied with orders”","score":17,"comments":[]},{"body":"\"Drop the gunnn!!!\"  You already know what's about to pop off.\nSounded like a little kid out there.","score":7,"comments":[]},{"body":"How do the boot lickers say it...? If he had just followed the officers commands...🤣🤣🤣\nCop with an illegal, out of state weapon, starts fight, and is shot multiple times by local PD..","score":7,"comments":[]},{"body":"\"And I thought they were cool\"","score":3,"comments":[]},{"body":"This is abysmal. So much lack of training is visible here that even a gun range personnel can ban each and every one of these cops from ever entering a gun range or holding a gun in their life.","score":2,"comments":[]},{"body":"Man when you hear anyone yelling drop the gun at someone else, gtfo of there if you can.","score":1,"comments":[{"body":"Careful, people running away has been known to make officer's fear for their lives.","score":8,"comments":[]}]}]},{"title":"Cops arrest outlaw barber","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Log Lane village Colorado police officer Dawn Fliszar working with active felony charges","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Serial protester Danny Lim in hospital after ‘discontinued’ arrest in Sydney CBD","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Alameda Co. deputy arrested on suspicion of DUI after totaling BBQ truck","not_safe_for_work":false,"locked":false,"body":"","score":51,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"It say charges are up to the Sheriff but actually I'm pretty sure charges are up to the Alameda County DA..  We just ousted the corrupt asshole that literally ran on \"listen, 95% of the crime comes from 2000 individuals in the county\" in a county with a population of 1.69 million.  Lets see if the new guy is any less horrendous.","score":2,"comments":[]},{"body":"Isn't it just funny that when officers are caught driving drunk they're not arrested and charged immediately","score":2,"comments":[]},{"body":"Do the citizens of Alameda County know how much they're paying for \n\n*Sources inside the department said the Ford, which is a standard utility vehicle, is part of what's nicknamed by insiders as the \"BRU Unit,\" which stands for the \"BBQ Response Unit.\"*\r  \n\r  \n*Ziller worked in that unit.*\r  \n\r  \n*Duties include cooking BBQ for events, as well as being called out to fix fences, build sheds and other ancillary duties. The truck carried the BBQ on the back of a trailer. Sources also said that Ziller was returning home from a funeral when the crash occurred.*\n\nFunny all the pre election fear mongering about crime and they can pay to have a whole squad of drunk cops cooking barbecues.","score":2,"comments":[]},{"body":"He was returning home from a funeral? What's that about? I have never heard of holding drunken BBQ at a funeral. Is it some weird cop thing?","score":1,"comments":[]}]},{"title":"New South Wales Police violently arrest 78 year old street personality Danny Lim. Sydney, Australia","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"3 wounded by gunfire in New York, including off-duty Vermont sheriff's deputy shot multiple times by police","not_safe_for_work":false,"locked":false,"body":"","score":86,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"So as I understand the article:\n\n• Off duty Vermont deputy and his gf are in a Saratoga, NY bar. Gets into argument with a man from Utica.\n\n• Deputy flashes his gun, Utica man also flashes a gun. They take the fight outside.\n\n• They shoot at each other.\n\n• The deputy hits the Utica man.\n\n• Saratoga officers arrive on scene, and only yell at the deputy to drop his weapon, and then proceed to shoot him 10 times, as well as wounding the deputy's gf.\n\n• Everyone expected to survive.\n\nWhat an absolute clusterfuck.","score":67,"comments":[{"body":"It's got a real Reno 911 vibe don't it?","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"if you bring a gun into a bar you should be stripped of any legal right to own said gun. And since he was a cop that should disqualify him from ever working in Law enforcement.","score":30,"comments":[{"body":"Since 2004, there is a federal law known as *LEOSA* that amongst other things allow current and retired LEO's to carry *nearly* anywhere they like, regardless of state policy / permit requirements; and in and of itself does not place limitations on things like bars, or if the person has been drinking.\n\nBasically \"Rules for thee, not for me\"","score":28,"comments":[{"body":"The idea is that they will be able to stop a bad guy with a gun.  But we know how well that argument holds water.","score":11,"comments":[{"body":"I will say that the responding officers not only had amazing restraint but above average accuracy as well.  Only 11 shots fired and 10 hit their target!  Based on the last 30 years, I would have expected several zeros tacked onto the end of the first number.","score":9,"comments":[{"body":"For once it looks like the local PD did a decent job, 10 of 11 hits and no empty mag, reload and empty mag again shenanigans. what the heck was the Deputy doing with a gun in a bar at 3 am?","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"The cop resorting to brandishing his weapon to “gain control” over a dumb ass social interaction, let alone escalating the encounter to a fucking duel, should result in him being barred from policing. He is a threat to public safety. \nAnd of course the responding police went in guns blazing. But all in all, literally the erratic behavior of trigger happy members of law enforcement caused the whole scenario.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"How da fuck does he get shot 10 god damn times and not fucking die? What kind of voodoo shit is that?","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Brutal Arrest Of Camden County Black Man Reignites Excessive Force Debate","not_safe_for_work":false,"locked":false,"body":"","score":46,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"I’m glad most Twitter users are calling out Customs and Border Patrol on how they use Civil Asset Forfeiture to steal people’s money.","not_safe_for_work":false,"locked":false,"body":"","score":3373,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"So did they steal the whole $33k or just the #13k in excess of the $20k declared? Incidentally having $33k or $20 k is not illegal.","score":332,"comments":[{"body":"When my dad was battling terminal cancer, he gave my brother and I 55k cash each as he had cleaned out his 401k so we could have it before he's gone and invest in the future - it was a 4 hour drive home with that money and I knew if some cop wanted to fuck with me, that money could disappear forever.","score":138,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"And remember if you are within a 100miles of a boarder or coast, your civil rights are optional.","score":126,"comments":[{"body":"Which is about 2/3rds of the US","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"What in the living fuck is the point of tweeting this shit? Man, cops are so high on their own farts that they believe this shit makes them heroes. wE ToOk sOmE mOnEy, LoVe Us!","score":63,"comments":[]},{"body":"Remember, you can buy a $40k Rolex, walk through customs without any issue, and sell it at your destination for basically the same price.","score":126,"comments":[{"body":"not true, just watch that border patrol show. Tons of people coming across the border with a bunch of gold jewelry and they can't produce the receipts for it and it gets taken away or they have to pay an extra duty on top of it.","score":86,"comments":[{"body":"Extortion. No ones going to have a receipt for any jewelry unless it’s brand new","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Regular law enforcement does this too. Frequently","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Ohio - Three Lorain police officers have been found guilty of employee gross misconduct, and a former lieutenant has been indicted by a Lorain County Grand Jury","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Kern county sheriff beats man on porch after body cam “falls off”","not_safe_for_work":true,"locked":false,"body":"","score":831,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Looks like he was trying to make a leg 'fall off' as well. ACAB.","score":100,"comments":[]},{"body":"Heads on pikes. Fuck the police.","score":65,"comments":[]},{"body":"Just a heads up.  \n\nThis was the deadliest department at one point.  \n\nhttps://www.theguardian.com/us-news/2015/dec/01/the-county-kern-county-deadliest-police-killings","score":61,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Tore that camera right off to beat him with a baton even after both hands were behind him he needed to give him another to the knee.","score":58,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"that POS really did rip off his body camera !! what a coward !!","score":40,"comments":[]},{"body":"Now there's the Kern County that I know.","score":23,"comments":[]},{"body":"I don't think there's anyone who has been though Kern that doesn't have some kind of story like this.","score":17,"comments":[]},{"body":"Column: Is the Kern County sheriff an out-of-control cowboy — or a lost cause? [https://www.latimes.com/california/story/2022-07-08/column-donny-youngblood-kern-county-sheriff](https://www.latimes.com/california/story/2022-07-08/column-donny-youngblood-kern-county-sheriff)","score":17,"comments":[]},{"body":"SCUM","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"City of Austin settles 3 more lawsuits related to excessive force during 2020 police protests","not_safe_for_work":false,"locked":false,"body":"","score":29,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"I feel for you guys. I live in Colorado. We make national news weeks for police brutality videos. The amount of payouts here is staggering.","score":1,"comments":[]}]},{"title":"Columbus to pay $440,000 settlement over officer's 2018 use of force","not_safe_for_work":false,"locked":false,"body":"","score":28,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Note the officer leaning against the door jamb looking at his phone. He doesn't even look away from his phone. That is a very strong indication that excessive force is not unusual in this department. It is in fact the norm.","score":2,"comments":[]},{"body":"You misspelled \"Tax payers\"","score":3,"comments":[]},{"body":"Policy could be to refuse to renew DL/vehicle registration. Pulling right to vote. Wage garnishment. Civil asset forfeiture. Any non violent response to a non violent transaction? Of course not! Debtor's belong in prison because 'Murica! 🤦‍♂️","score":1,"comments":[]}]},{"title":"Cops Tries to Kill Motorcyclist for no Apparent Reason","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"That cop is dog shit!","score":2,"comments":[{"body":"True, but filming himself driving over 80 MPH can cause legal problems for the motorcyclist.","score":1,"comments":[{"body":"Depends. What's the posted speed limit? If it's 75 not so much. If it's 45 he's screwed.","score":1,"comments":[{"body":"At the 1:29 mark he passes a 60 MPH speed limit sign.  Then at 1:42 another signs shows that it's dropped to 55 MPH.","score":2,"comments":[{"body":"Oof","score":2,"comments":[]},{"body":"American policing: Everything = instant death sentence.","score":2,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Woah... Lawyer up. Also, I think posting this with audio was not the move.","score":2,"comments":[]},{"body":"[removed]","score":1,"comments":[{"body":"We're having a bad time with spambots, so your comment or post has been removed automatically. if this is a real person, and not a bot or a  troll, please [CLICK HERE](http://www.reddit.com/message/compose?to=/r/Bad_Cop_No_Donut) to send a modmail.\n\nIn addition to sending a modmail, please read the rules in the sidebar and [reddiquette](http://www.reddit.com/wiki/reddiquette).\n    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]}]},{"title":"FBI investigates if Hardin County police used excessive force","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"LAPD Nabs The Wrong Suspect As Usual .","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"At least they did not beat the shit out of this one, unlike say a car chase where every bystander gets the snot kicked out of them.  At what point does one of these guys get disciplined for this crap?","score":3,"comments":[{"body":"Never, lapd even has a slush fund to pay out to crooked officers if they actually ever get fined or suspended, to make up for any lost earnings.","score":1,"comments":[]}]}]},{"title":"Baltimore spending board approves settlement in excessive force lawsuit against Baltimore Police","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Which police in your town have used excessive force? NJ expands access to that info","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Janitor accuses police of excessive force","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Richmond court to decide if police used excessive force in arrest","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"government thugs are bragging about armed robbery, aggravated kidnapping, and violation of rights again.","not_safe_for_work":false,"locked":false,"body":"","score":40,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Not thugs, thieves","score":6,"comments":[{"body":"Por que no los dos ? Thugs AND thieves!","score":3,"comments":[]}]},{"body":"There are laws about how much money you can bring into the states. Where does it say that it was \"stolen\" from them?","score":0,"comments":[{"body":"What laws are those? Since when did it become a crime to carry cash regardless of the amount?","score":2,"comments":[]},{"body":"Negative ghost rider.  There is no law prohibiting the amount of cash you can travel with.\n\nThe law is that if you are carrying $10k or more then you must declare it on all required documentation and answer truthfully if questioned.  \n\nThat applies whether you are coming in or going out of the country and it goes for foreigners &amp; US citizens alike.\n\nAlso, that $10k number seems to be the industry standard in many western countries.  10k in their currency or equivalent.  \n\nIt may be the same in all countries but I haven’t researched that far.","score":2,"comments":[{"body":"“CBP officers discovered $33K in **unreported** currency possessed” \n\nDid you miss that part?\n\nI know that I didn’t see anything about armed robbery, kidnapping or a human rights violation.I\n\nThey just seized unreported cash going to Egypt.","score":1,"comments":[{"body":"You just owned yourself with your own comment.  You even emboldened the critical word.  **UNREPORTED**\n\nIt’s not the amount that makes it a crime as you claim in your op.  It’s that it wasn’t declared as required by law.\n\nIf it had been declared, or **reported** then the traveler would have been in compliance with the law and they wouldn’t have seized it.","score":1,"comments":[]}]}]}]}]},{"title":"Off duty out of town sheriff in gunfight, leading to suggested wanding of all bar patrons","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"A cop got into a scuffle outside a bar and turned it into a gunfight by brandishing his weapon, then was too drunk to put down his firearm when approached by local police, so they shot him.\n \nNaturally that means they ought to make the bar owner hire a cop for a security guard and have him wand all the civilians that come in.  Because when a coyote is stealing your chickens, what you do is heavily scrutinize your dogs.","score":3,"comments":[]},{"body":"A lot of states already laws preventing even off duty law enforcement from carrying firearms into bars, not sure about NY state.","score":1,"comments":[{"body":"You can open carry in some counties in NYState but you must have a New York license. This sheriff was from another state and most likely didn't have a NY license. Of course we all know that such laws will never be equally enforced when cops are involved. A sheriff in my town dropped his gun in the middle of a bar and nothing ever came of it.","score":1,"comments":[]}]}]},{"title":"Charges dropped against deputy after 2 died in flooded van","not_safe_for_work":false,"locked":false,"body":"","score":60,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"The driver got 9 years in jail. The deputy riding along was also charged but since he had no control and did try to get the prisoners free charges were dropped.","score":7,"comments":[{"body":"The cop absolutely had control\n\n\"I'm a cop and I'm demanding you turn around and avoid the flooded highway\"\n\nDONE","score":3,"comments":[{"body":"The other was another police officer.  Not sure if he outranked him or not.  As for control no idea who was in charge.  Do you know?","score":1,"comments":[{"body":"\\*pulls out gun\\* \"I said fucking stop\"\n\nthere ya go, solution.\n\n&amp;#x200B;\n\nThere exists literally NO EXCUSE WHATSOEVER that the officer didn't stop the car from driving into a flood and then leaving the detainees to die.","score":0,"comments":[]}]}]}]},{"body":"Most ironically named cop ever.","score":2,"comments":[]},{"body":"[removed]","score":1,"comments":[{"body":"We're having a bad time with spambots, so your comment or post has been removed automatically. if this is a real person, and not a bot or a  troll, please [CLICK HERE](http://www.reddit.com/message/compose?to=/r/Bad_Cop_No_Donut) to send a modmail.\n\nIn addition to sending a modmail, please read the rules in the sidebar and [reddiquette](http://www.reddit.com/wiki/reddiquette).\n    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]}]},{"title":"DOJ looking for discrimination, excessive force in Massachusetts police department. What's next?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"I see MA state police talking to black drivers and I always wonder if the drivers did something wrong or are just being harassed by the big dudes in boots.","score":2,"comments":[]}]},{"title":"Law enforcement opposes rules banning cops from being involved in extremist groups","not_safe_for_work":false,"locked":false,"body":"","score":936,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"I'm guessing that's because the list of oathkeepers members was leaked and besides 26 politicians there was a lot of law enforcement named on the list","score":54,"comments":[]},{"body":"It's unbelievable how any of them can wonder why everyone else hates them","score":111,"comments":[{"body":"I don't think any of them are in doubt of why.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Cops are the extremist group.","score":96,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Piggies gotta pig","score":23,"comments":[]},{"body":"You cannot defend the constitution of the United States if your goal is to overthrow the constitution of the United States!!!","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Of course they oppose it! If extremists couldn’t be cops they’d run out of cops.","score":53,"comments":[]},{"body":"So this violates freedom of association for police… something I actually support, but the constitution likely won’t.\n\nOf far more concern, nestled toward the end of this article, is that the cops also oppose the inclusion of an officer’s disciplinary record as part of a Brady Disclosure \n\nIn other words, if the prosecution wants a cop to testify, the Defense must be provided with that cops disciplinary record to see if they have been shown to be liars or otherwise untrustworthy.\n\nThis makes sense from a legal standpoint since impeaching witnesses is extremely important to defense counsel\n\nThe only reason cops would have to oppose this is if they had something to hide","score":38,"comments":[]},{"body":"Now why would any cops be opposed to that?\n\nOh wait - is it cos they’re all racist pigs?","score":18,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How Jessica’s Call for Help Became Evidence Against Her","not_safe_for_work":false,"locked":false,"body":"","score":22,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"ACAB","score":6,"comments":[]},{"body":"Call or no call, the cops will spend the first 24 hours of an investigation trying to prove that the person who found a body (or someone in medical distress who ends up dying) was a murderer because the joy of being able to torture and bully someone into a false confession is one of the main perks of becoming an investigator.  Some junk science about 911 calls is just another arrow in their quiver of garbage evidence.","score":5,"comments":[]},{"body":"ACAB","score":3,"comments":[]},{"body":"I recently read a book titled \"Smoke But No Fire\" by Jessica S. Henry which dives into cases in which people were arrested, prosecuted and many times convicted of crimes that never occurred. Many of those cases feature junk science like bitemark analysis, and blood spatter analysis. It appears that now the author can add another junk science to that list. There is just no way one can listen to a 911 call and make any significant conclusions such as is done in this case. \n\nThe book also notes that in the primary textbook used officers vying to become detectives they are taught that they should approach every death scene under the assumption that a homicide had occurred. This can and no doubt does instill a heavy bias into how detectives view evidence. Indeed, it can lead them to see something completely innocent and determine that it's evidence of murder. This bias also can and does lead detectives to dismiss any and all evidence of innocence no matter how compelling.  This detective had a bias toward murder based on his latest training which is clearly not scientifically valid and is evidenced by the refusal of anybody associated with the case being willing to discuss the case for this article.","score":4,"comments":[]},{"body":"Remember: if you have a problem and then you call the police, well now you have two problems.","score":3,"comments":[]}]},{"title":"Nearly 200 convictions linked to eight New York Police officers who were themselves previously convicted of crimes dismissed at DA’s request","not_safe_for_work":false,"locked":false,"body":"","score":1527,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Nice to see some (late) justice but I fear the damage has been done.  Take George Floyd for example.  His first conviction was vacated as well but he was already dead.  Interesting to note the D.A. spokesman quoted in this article was named Tuttle as that was the name of the 59-year old Navy veteran the Houston cops murdered.  The cop up on murder charges in that case is, yes, the  one that made the first arrest of George Floyd, most likely on false evidence.  In the end, one cop charged with murder and ten others with other crimes.  This is also the case where Joe Gamaldi, National FOP Vice-President now, made these statements...\n\n“We are sick and tired of having targets on our back. We are sick and tired of having dirtbags trying to take our lives when all we’re trying to do is protect this community and protect our families.  If you’re the ones that are out there spreading the rhetoric that police officers are the enemy, just know we’ve all got your number now, we’re going to be keeping track of all of y’all, and we’re going to make sure that we hold you accountable every time you stir the pot on our police officers. We’ve had enough, folks. We’re out there doing our jobs every day, putting our lives on the line for our families.”\n\n[https://en.wikipedia.org/wiki/Harding\\_Street\\_raid](https://en.wikipedia.org/wiki/Harding_Street_raid)","score":33,"comments":[{"body":"**[Harding Street raid](https://en.wikipedia.org/wiki/Harding_Street_raid)** \n \n &gt;On January 28, 2019, in the Pecan Park area in the East End district of Houston, Houston Police Department (HPD) officers initiated a no-knock raid on a house, killing the two homeowners, a husband and wife: Dennis Wayne Tuttle and Rhogena Ann Nicholas. They were aged 59 and 58, respectively. Five HPD officers sustained injuries. St. John Barned-Smith and Keri Blakinger of the Houston Chronicle described the event as \"one of the worst [scandals] to hit HPD in years\".\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&amp;message=OptOut&amp;subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/Bad_Cop_No_Donut/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)","score":10,"comments":[]}]},{"body":"Yaay legal corruptionx","score":46,"comments":[]},{"body":"These draconian jack-boot-wearing government chuckle fucks need to be held accountable for their crimes. \n\nCrazy thought, I know.","score":33,"comments":[]},{"body":"Oh shit. Someone doing their job for once.","score":6,"comments":[]},{"body":"**Punish the pigs**","score":4,"comments":[]},{"body":"New York picked the right DA this time","score":4,"comments":[]},{"body":"&gt; “There is zero tolerance in the NYPD for corruption or criminal activity of any kind by any member of the service,” Sewell said in a statement. “Those who betray their sworn oath to serve and protect the public have no place in the NYPD.”\n\nOh it’s tolerated alright, just don’t get caught!","score":3,"comments":[]},{"body":"The DA has to be charged.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Veteran Freaks out on Police Chief in the middle of a Parade. Chief's police force hid out of town Veteran's stabbing for a local crony. Welcome to Gettysburg, Pennsylvania.","not_safe_for_work":false,"locked":false,"body":"","score":55,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"With no other information,just because of this man’s confidence I believe him.","score":3,"comments":[{"body":"Thanks for the back up!   Here- in the first 15 seconds I roll film of me bumping into my assailant at the grocery store and he apologizes for it.  He didn't know I was filming.  The whole rest of the episode explains why I'm the town crier.  Thanks for the support bro!  This IS real. https://www.youtube.com/watch?v=XjtfxQBlyw0&amp;t=3s","score":1,"comments":[]}]}]},{"title":"Gunfight in upstate NY wounds 3, including Vermont deputy","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"“I’m proud of how our officers handled it,” Montagnino said. “No one emptied their clip.”  Well it's good to have some standards I suppose.","score":1,"comments":[]},{"body":"The over abundance of guns &amp; relatively easy access to them MINIMALLY increase the odds these gunfights (&amp; mass shootings) will only get worse unless we tone down the hateful rhetoric &amp; get some EFFECTIVE gun control legislation. How many more people will this country tolerate losing until we tackle this problem?","score":0,"comments":[]}]},{"title":"Detective in Kansas Helped Men Run Sex Trafficking Operation from 1996 to 1998, U.S. Says","not_safe_for_work":false,"locked":false,"body":"","score":501,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Unhidden: [https://archive.ph/EW8FZ](https://archive.ph/EW8FZ)","score":9,"comments":[]},{"body":"&gt;Mr. Brooks would target women and girls as young as 13 who had just been released from the Beloit Juvenile Correctional Facility or who had run away from broken homes and would force them into sex trafficking, the indictment states. Mr. Golubski, the police officer, “primarily chose young Black girls, ranging in age from 13 to 17 years old, to submit to sex and to provide sexual services to him,” the indictment states.\n\n&gt;The Delevan complex was split into the “office unit,” where Mr. Brooks could lock girls in from the outside; the “relaxed” area, where girls would use alcohol and drugs; and a “working house,” where they were compelled to perform sexual services for adult men, the indictment states.\n\n\nPreying on vulnerable girls... despicable.","score":6,"comments":[]}]},{"title":"Off Duty Vermont Deputy shot by NY Police","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Ten bullet wounds and he will survive.  Bad marksmanship or great doctors...","score":4,"comments":[]},{"body":"The NY Police officers doin the lords work","score":3,"comments":[]},{"body":"Hogs killing eachother.","score":2,"comments":[{"body":"Blue on blue violence.","score":2,"comments":[]}]},{"body":"paid time off for everyone","score":1,"comments":[]},{"body":"He should’ve just complied.","score":1,"comments":[]}]},{"title":"Top FBI official in L.A. formally recuses himself from investigation into Tom Girardi and his law firm","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Most imprisoned citizens per capita by state.","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"How government agencies and private companies [trap and profit off incarcerated people and their loved ones.](https://inquest.org/captive-consumers/)","score":3,"comments":[]},{"body":"I didn't see a list of per-capita imprisonment numbers sorted by State though.  What's the deal with the title of your post?","score":3,"comments":[{"body":"[Link](https://www.killercop.com/images/1984/inmatesPerState.jpg)","score":5,"comments":[{"body":"Thanks!","score":3,"comments":[]}]}]}]},{"title":"Police &amp; Security Try To Enforce Unconstitutional Sign! Get Educated On Our Rights &amp; The Law!","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Ugh another one of these","score":1,"comments":[]}]},{"title":"Homeland Security comes back to SSA to give his interpretation of the law.","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"We're having a bad time with spambots, so your comment or post has been removed automatically. if this is a real person, and not a bot or a  troll, please [CLICK HERE](http://www.reddit.com/message/compose?to=/r/Bad_Cop_No_Donut) to send a modmail.\n\nIn addition to sending a modmail, please read the rules in the sidebar and [reddiquette](http://www.reddit.com/wiki/reddiquette).\n    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Canada - Oneida First Nation woman sues London, Ont., police, alleging officers sexually abused her for years. Elaine Antone, 67, also seeks damages on behalf of 2 children she claims were fathered by LPS officer","not_safe_for_work":false,"locked":false,"body":"","score":51,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"London Ontario police are some of the worst in Canada. They are paid off by Hells Angel's","score":1,"comments":[{"body":"[removed]","score":1,"comments":[{"body":"We're having a bad time with spambots, so your comment or post has been removed automatically. if this is a real person, and not a bot or a  troll, please [CLICK HERE](http://www.reddit.com/message/compose?to=/r/Bad_Cop_No_Donut) to send a modmail.\n\nIn addition to sending a modmail, please read the rules in the sidebar and [reddiquette](http://www.reddit.com/wiki/reddiquette).\n    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]}]},{"body":"Canada just sucks all around. Why hasn’t the US invaded and annexed that shit hole country yet?","score":0,"comments":[]}]},{"title":"Who Botched the DUI Case Against This Phoenix Cop? No One Seems to Know","not_safe_for_work":false,"locked":false,"body":"","score":827,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Nobody botched it. They weren't going to prosecute, but had to make it \"look good\". This is looking like the new preferred tactic, \"Oops! Looks like we made a mistake. Guess we have to let the dirty cop go.\"","score":94,"comments":[{"body":"This tactic is as old as policing itself, long before qualified immunity was a primary tactic. Just put it \"under investigation\" and let the clock run out. It's even a standard part of the union contract cities sign with police unions that puts strict very low limits on allowed investigatory period, often 180 days or even less. After which they aren't even allowed to continue investigating.","score":38,"comments":[]},{"body":"[[09/27/2022][AZ] Why Sheriff Paul Penzone Faces Contempt of Court Citation. The Sheriff’s Office Takes 611 Days to Investigate Misconduct. It’s Supposed to Take 85. | Phoenix New Times](https://www.phoenixnewtimes.com/news/why-maricopa-county-sheriff-faces-contempt-of-court-citation-14466112)\n\n[[10/05/2022][AZ] Sheriff Paul Penzone Faces Fines, More Court Oversight. Judge Proposes Fines, More Oversight to Force Sheriff Paul Penzone to Follow Court Orders. | Phoenix New Times](https://www.phoenixnewtimes.com/news/federal-judge-files-draft-contempt-order-against-sheriff-paul-penzone-14606553)\n\n[[11/11/2022][AZ] Judge Cites Maricopa County Sheriff Paul Penzone for Contempt, Faces Steep Fines in Federal Lawsuit | Phoenix New Times](https://www.phoenixnewtimes.com/news/judge-cites-maricopa-county-sheriff-paul-penzone-for-contempt-14872038)","score":4,"comments":[]}]},{"body":"&gt; Yet Halleman never faced criminal charges for his arrest on July 3, 2021. Not for the DUI, and not for fighting with sheriff's deputies. In fact, he can't be charged — the one-year statute of limitations expired for his case. \n\nI wonder how that happened? Someone didn't mark their calendar?","score":38,"comments":[]},{"body":"Why is there a statute of limitations on these offenses if there is a backlog of DUI cases?\n\nIf the labs and agencies are still processing samples from cases in 2020, but the 2021 case agaianst this cop is already passed it's time, then what are the results of processing these older cases samples going to yield? Doesn't it mean they'll be getting results for cases that are already done?","score":12,"comments":[{"body":"Well how else are you going to funnel money to a private donor in a way that's immune from scrutiny?","score":10,"comments":[]},{"body":"You should actually last-in-first out in this case, mathematically. It doesn’t seem “fair” as some will slip through but it actually means fewer get dropped. No time wasted testing something “first in” but a week away from expiration or worse.","score":6,"comments":[]}]},{"body":"Ah good ol Phoenix PD, officer Jones I hope you get cancer","score":21,"comments":[]},{"body":"This is why there is no such thing as a good cop you bootlickers.\n\nThere’s only two types that stay cops\n\n1.\tCrooked cops\n2.\tcops that protect crooked cops.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Dallas police officer arrested, charged with aggravated assault and fired, department says","not_safe_for_work":false,"locked":false,"body":"","score":55,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"This is the idiot cop who shot at another officer after a night of drinking, what a tool.","score":1,"comments":[]}]},{"title":"Family says Glendale PD jailed grandpa with dementia","not_safe_for_work":false,"locked":false,"body":"","score":75,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"That dumb shit community service officer (a cop who isn’t even smart enough to do real police work) just seems to keep picking this guy up as an easy collar instead of trying to deescalate the situation. He’s cruising for this old man. It’s predatory and wrong.","score":20,"comments":[]},{"body":"04:54 POS Cop \"*I don't know what I have to do to make you understand...*\".  \nFFS the man has dementia - you will never be able to communicate effectively to him. Why can't you, a supposedly fully functioning adult, understand THAT?  \nYou can swing that hammer all you want but he is not and never will be a nail!  \n'Community service officer' my ass! Self serving welfare recipient.","score":17,"comments":[]},{"body":"Wow. They didn’t dislocate his shoulder or tase him. Progress!","score":9,"comments":[]},{"body":"Pathetic.","score":6,"comments":[]},{"body":"Garbage cop probably even a worse husband/father. The whole orchard is rotten.","score":4,"comments":[]},{"body":"More training is *not* the answer, because they don’t think they need it, and that rules, laws, policy &amp; training can all be disregarded when they feel like it.\n\nFire them, revoke their certifications and let them face lawsuits in their individual capacity without QI shield or being indemnified by the city.\n\nYou’ll see the them sit up and take notice real fucking fast.","score":3,"comments":[{"body":"You can’t train people not to be shitty humans.","score":2,"comments":[]}]},{"body":"This is a caretaker problem. Why is the family letting him wander around when he shits himself and could get lost. Cops warned the family multiple times but they let him keep going. That's on them. And I hate most cops but what else are they supposed to do?","score":-13,"comments":[{"body":"&gt; but what else are they supposed to do?\n\nHave some empathy? Warn him an infinite number of times. Certainly never arrest him. Yes it is annoying he keeps coming back, but you know, I bet having dementia is pretty annoying too.","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"A Dallas police officer has been arrested after a shooting inside an Uber | CNN","not_safe_for_work":false,"locked":false,"body":"","score":125,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"\"He was the second Dallas police officer to be arrested this week, after another officer was arrested in a domestic violence incident Thursday.\"\n\nBig surprise there..","score":12,"comments":[{"body":"Just cop things.","score":6,"comments":[]}]},{"body":"Not that cops lie ever(/s), but I'm wondering if the cop is being framed since he was arrested","score":2,"comments":[]}]},{"title":"The Case of Tony Robinson: An investigation has found new evidence that suggests Robinson, incarcerated for twenty-five years after police torture, may be innocent","not_safe_for_work":false,"locked":false,"body":"","score":96,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Marjorie Cohn highlights the first case being heard by the commission involving violence committed by U.S. law enforcement.","not_safe_for_work":false,"locked":false,"body":"","score":228,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"&gt;The commission is a body of the Organization of American States, which includes the United States. It considers cases involving torture, massacres, extrajudicial killings and disappearances in the Americas.\n&gt;\n&gt;**On May 28, 2010, Anastasio Hernández Rojas, a 42-year-old long-time San Diego resident and father of five, was crossing the border from Mexico into the United States when he was apprehended and tortured by U.S. Customs and Border Protection (CBP) agents**.\n&gt;\n&gt;He died in the hospital a few days later from his injuries. In order to cover up their crimes, the agents attempted to destroy evidence and create a false narrative that portrayed them as the victims and Hernández Rojas as the aggressor.\n&gt;\n&gt;After being taken to a detention center, agents used escalating force against Hernández Rojas, although he was unarmed and injured. **“CBP agents punched, kicked, dragged, Tased, hogtied, and denied Anastasio medical attention,”** his family alleged in the complaint they filed against the United States in the Inter-American Commission on Human Rights.\n&gt;\n&gt;**“Autopsy reports confirmed that Anastasio suffered extensive injuries while in custody, including bruising and abrasions on his face and body, five broken ribs, and hemorrhaging of internal organs.” He had a heart attack, went into cardiac arrest and suffered brain damage, which ultimately led to his death. *Both autopsy reports ruled Hernández Rojas’ death a homicide*.**\n&gt;\n&gt;In a 2019 interview, **Hernández Rojas’ widow Maria de Jesús Puga recalled hearing the video recording of her husband calling for help and begging for mercy. “When I heard his voice, he was really screaming in pain. I had never heard so much pain. He never screamed like that, he never cried,” she said.**\n&gt;\n&gt;“**My family is destroyed, my family will never be the same again**,” Puga testified at the Nov. 4 hearing before the Inter-American Commission on Human Rights. She told the commissioners that **her “whole family, we have all been bearing this pain, 12 years, 12 years of pain and anguish not knowing why, why they killed my husband.”**\n\nEdit: fixed my emphasis, which was added by Me.","score":20,"comments":[]},{"body":"If I recall correctly, there’s a mural in Chicano Park of Anastasio Hernandez Rojas. It made my blood boil how little attention this case has gotten. \n\nAlso remember watching a documentary about the origins of Chicano Park and how residents of the area essentially had their homes stolen from them to build all the shipyards and junkyards there. What’s even more infuriating is how so many rich people live free of pollutants or shipyards in Coronado, and they never have to worry about having their lives uprooted to make room for more toxic environments.","score":10,"comments":[]},{"body":"250 people have been murdered by CBP since Hernando was murdered? And no one has been held accountable. That is terrifying! FTP ACAB","score":7,"comments":[]},{"body":"Article 5. Right to Humane Treatment\n\n1. Every person has the right to have his physical, [mental](https://www.killercop.com/dirtysecrets/Hybrid.html), and moral integrity respected.\n\n2. No one shall be subjected to [torture](https://www.killercop.com/Pages/torturedcoverup.htm) or to cruel, inhuman, or degrading punishment or treatment. All persons deprived of their liberty shall be treated with respect for the inherent dignity of the human person.","score":6,"comments":[{"body":"Never understood why this is so hard to understand.\n\nPolicd and prison guards seem to think projecting their \"utopian\" views of cop-robber/good-evil helps when it's just nonsense.  Your job isn't to judge people, it's to create boundaries. They need to keep their morality plays to themselves.","score":3,"comments":[]}]}]},{"title":"LAPD Officer Forgets To Put Police Cruiser In Park #KIPLA","not_safe_for_work":false,"locked":false,"body":"","score":45,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Was it Frank Drebin?","score":3,"comments":[{"body":"&gt;Frank Drebin\n\nThey thought it was [Killercop](https://www.killercop.com/indexchuck.html). Just the mention of his name makes LAPD [cops lose their minds](https://youtu.be/S72qVUadTSc?t=93).","score":0,"comments":[]}]},{"body":"Lol they need the exercise 🐖","score":2,"comments":[]},{"body":"Note to dumb fuck cops:\n\nThe \"P\" alongside the gearshift lever means that the fucking car will stay where you left it when you jump out to chase and maybe shoot some unarmed person. Learn it, and USE IT. you dumb fucks. \n\nMaybe they don't teach that shit in the academy, but now you know.","score":2,"comments":[]},{"body":"ACAM - All Cops Are Morons","score":1,"comments":[]}]},{"title":"Oklahoma Inmate Who Said He Was ‘Tortured’ To Listen to 'Baby Shark’ Song Found Dead","not_safe_for_work":false,"locked":false,"body":"","score":601,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Warning to others, who'd complain.","score":94,"comments":[]},{"body":"Torture doesn't need any quotations around it","score":55,"comments":[]},{"body":"Some jail employee definitely killed this guy in retaliation and now the jail is trying to cover it up. FTP","score":148,"comments":[]},{"body":"&gt;Basco's death was the 14th at the jail this year and comes amid a period of increased scrutiny and outcry against the facility, which has long been plagued with issues of overcrowding, poor living conditions, staffing troubles and frequent deaths.\n\nI feel like if your jail is having at least one inmate death every month, it's not fulfilling its obligation to protect those under its care. And if a jail can't adequately keeps it's prisoners alive, it needs to lose funding and close. I don't give a shit about the implications of that statement. If there isn't enough room for them elsewhere, then I guess you'll have to reassess who actually needs to be in jail.  If any other establishment killed a person in their care each month, it would not only be liquidated in record time, the people responsible would be in jail themselves. But when it's the jail doing it, that's just fucking fine apparently.","score":72,"comments":[{"body":"Since this story broke a [15th inmate](https://okcfox.com/amp/news/local/jail-officials-investigating-inmate-death-at-the-oklahoma-county-detention-center-11-19-2022) had died while incarcerated.","score":30,"comments":[{"body":"Jesus, the joke writes itself, what a systematic failure","score":14,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Oklahoma pigs are straight up Nazis. I grew up there. Most crooked assholes ever.","score":15,"comments":[]},{"body":"I live in okc and something is definitely up. I get a death here and there but there’s been so many. I hear drugs are just open there and the nazis run it","score":92,"comments":[{"body":"Update: local news 9 reporting another one dead today","score":26,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What happens when daddy is a former deputy in the next city over shows up! Driver was incoherent,she tried to give my husband her credit card as ID. She was slurring and could barely keep her eyes open. Dad explains she fell asleep and was slurring because she was tired😳😳 no sobriety test","not_safe_for_work":false,"locked":false,"body":"","score":599,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Daughter of a *former* low level flunky from someplace else.  And yet still benefits form all the privilege of having a member on the inside.  It really is a gang, and once you're 'made', you and all yours are untouchable.","score":57,"comments":[]},{"body":"As the ex-sister in law, I can 110% confirm this. Exhusbands best friend walked away from a DUI, Exbrotherinlaws girlfriend walked away from a public nudity meth induced freak out, exhusband drove drunk with expired plates, no insurance, or seatbelt (in a heavily enforced seatbelt state) and just mentioned his brothers name anytime he was pulled over. So many other stories. \n\nThe double standards are un-freaking-believable","score":32,"comments":[{"body":"We need to abolish out police system entirely and start from scratch. This shit is so goddamn out of hand it is unbelievable. A gang funded by our taxes.","score":18,"comments":[]}]},{"body":"All cops are Bastards.","score":27,"comments":[{"body":"1312","score":6,"comments":[]}]},{"body":"Anyone interested to know what happened:  my husband and 15month old son went out to get us lunch, and my husband entered a turning lane to make a left hand turn. The car was not moving just sitting waiting to make the turn and a woman fell asleep and slammed into the back of my non-moving car. The car was pushed forward and the driver continued down about 60 yards in front of it. My husband checked on our son first and then, texted me that he had just been hit.  He got out to go check on the other driver.  He kept asking for her info: insurance, ID and registration and she wasn’t making sense.  He texted me that she was slurring and tried to give him her credit card as her ID.  He asked if he should call the police (I was already on my way, so I told him heck yes, call them)! His neck and back was hurting him (from the accident) and he didn’t want to leave our son in our car too long alone, so he gave up and walked back to the car.  I got there when her dad arrived. That’s when I started recording.  The first person in the video telling us she fell asleep (which she told us on video as well) was the dad). He is the one telling US she is “just tired and we didn’t need a sobriety test”.  It was weird that the police were allowing him, a civilian to tell US a sobriety test wasn’t needed.  It was total b.s!  He was walking around with them like it was THEIR scene, I immediately felt something “fishy” was going on.  I asked one of them if he was an officer and of course they didn’t answer me!!   Facts: 1) We all noticed she was slurring (except the 2nd officer who arrived later) it was not disputed; 2) all agreed she fell asleep drifted out of her lane and hit my car from behind.  I felt all those facts warranted a sobriety test but—dad and the officers did not!","score":8,"comments":[{"body":"Did you end up going to the address you were provided and speak to a supervisor? Also did she at least have to compensate you as she was the cause of the accident ? Really infuriating situation. Sorry it happened to your husband and baby :(","score":6,"comments":[]}]},{"body":"Wtf","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My uncle was a cop like 40 years ago. Super brief, just a few years before switching careers. But incredibly, he’s still able to leverage this to get out of traffic tickets. If he gets stopped for speeding or whatever he just flashes some PBA card and tells them he’s “on the job” [wink wink] and they let it slide.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Indiana sheriff's deputy accidentally shoots student during high school class","not_safe_for_work":false,"locked":false,"body":"","score":2898,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"If it was a civilian teaching that class and a student was shot they would be charged with at least two violations of the law (crimes).\n\nThus, civilians are held to a higher standard than law enforcement \"professionals\".","score":840,"comments":[{"body":"I’m surprised the cop didn’t suddenly jump the desk, tackle the student to the ground while yelling STOP RESISTING.","score":319,"comments":[{"body":"BLEEDING ON MY UNIFORM?\n\nThat's assault!","score":155,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"There is no such thing as an accidental discharge. Only negligent.","score":604,"comments":[{"body":"The accidental discharge was from the officer’s father.","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"There is absolutely no reason for the cop to pull his gun from the holster in a training situation inside a school full of students. This is not an \"accident\". This is gross negligence, and the cop should be so charged and prosecuted. But the silver lining is that perhaps one or more of the students placed at such high risk will decide that they do not want to be involved in a profession that would employ somebody like the dumb bastard conducting the training.","score":493,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"this is me listening to the radio this morning\n\n'...and that officer is...' (plz be charged plz be charged) 'very sorry...' (maaaaaaaaan)","score":82,"comments":[]},{"body":"Cops &amp; basic gun safety, name a *less* iconic duo!\n\nSeriously though, how does a thing like this even happen? Imagine if a citizen shooter had done this in a simmilar setting. No doubt they’d had their firearm taken from them, and get locked up post haste for a long list of serious felonies.","score":68,"comments":[]},{"body":"If you fail basic safety precautions (making sure the chamber is cleared is one of the most *basic* precautions) you deserve at least some sort of charge. That’s like… a surgeon forgetting to wear gloves or washing their hands before a surgery. There’s no reason for it to not happen.","score":49,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Remember when the cops used civilians for cover while they shot a robber in UPS truck in FL? No charges against the cops.","not_safe_for_work":false,"locked":false,"body":"","score":1501,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"That's pretty sick.\n\nLet's not forget that the cops murdered the UPS driver, too.","score":207,"comments":[{"body":"And UPS thanked the police.","score":71,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"And the random bystander that got killed.  Even if they didn't shoot them, they caused the shootout on a busy street.","score":78,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Like the teen girl murdered in San Bernardino. That story disappeared real quick.","score":106,"comments":[{"body":"Been a solid month and not a peep about this case. Where they are normally so quick to release anything that shows them in a good light, crickets on this one. Quite telling. Waiting to hear this quiet release stating how they fucked up, but no one will be charged for her killing.","score":56,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Qualified Immunity needs to go, insurance for LEO's needs to be a thing just like doctors.","score":72,"comments":[{"body":"It’s unconstitutional anyways as it was legislation from the bench (the judicial branch making the law instead of the legislative branch making them).","score":29,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"When confronted with two hostiles with a hostage, one hostile, the hostage and a bystander ended up dead.","score":63,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That's why they co-oped the American Flag and turned it into a symbol just for themselves. All citizens are second class to them.","score":31,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Former New Orleans Police Officer Pleads Guilty to Federal Civil Rights Offense for Sexually Assaulting a 15-Year-Old Crime Victim","not_safe_for_work":false,"locked":false,"body":"","score":81,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"A 53 yr old, at the time, going for a 14 yr old, who was a sexual assault victim, while being a cop who is supposed to protect her... can my disgust meter ping any harder?","score":2,"comments":[]}]},{"title":"Police trainer jailed for trying to have sex with '15-year-old girl' in KFC who was actually undercover cop","not_safe_for_work":false,"locked":false,"body":"","score":438,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Nonce","score":40,"comments":[{"body":"idk why I thought the british term for pedophiles was \"poof\"...like I knew that term was used for gay men, but still thought it was used interchangably with pedophiles too.","score":10,"comments":[{"body":"We call them “chomos” over here in the states","score":10,"comments":[{"body":"Ah I always thought we just called them priests","score":17,"comments":[{"body":"See also: Boy Scout leaders, Cops, Mormons, sometimes [republicans](https://www.dailykos.com/stories/2018/10/23/1806673/-Republican-Sexual-Predators-Abusers-and-Enablers-Pt-1), or any combination of the aforementioned","score":19,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"Finally some justice on this sub. Seems like it never happens","score":12,"comments":[]},{"body":"Amazed he was charged until I saw it wasn't the US","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Dude look like an older version of Trevor Lawrence","score":3,"comments":[]},{"body":"Are we absolutely sure he wasn't just ordering a 15 piece without breasts?","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Philadelphia officer sentenced for shooting unarmed Black man","not_safe_for_work":false,"locked":false,"body":"","score":87,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"That's it. So you shoot a man with no arms and get of lightly.","score":8,"comments":[]},{"body":"The use of the word \"sentenced\" is highly questionable in this instance. I suppose they used that word because \"slapped on the wrist\" is not a real legal outcome.","score":6,"comments":[]},{"body":"Less than two years. ***Less than two effing years!***","score":3,"comments":[]},{"body":"“Nothing he is going to do in prison is going to make him a better person\", so he gets to leave early. Wtf.","score":2,"comments":[]},{"body":"Why even bother?","score":1,"comments":[]}]},{"title":"Colorado - Aurora’s newly appointed interim police chief, Art Acevedo, in addition to recently being fired by the city of Miami, has a history of misconduct and was a frequent guest on InfoWars, founded by conspiracist Alex Jones","not_safe_for_work":false,"locked":false,"body":"","score":393,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"This is why a federal level misconduct blacklist is needed as any criminal justice reform package","score":62,"comments":[]},{"body":"Seriously? Dude! You like conspiracies?? Let me tell ya about this Batman movie!!!","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"lol this guy likes to job hop. he was austin's police chief, then ditched it for houston's, the miami's, now aurora's?","score":25,"comments":[{"body":"Cause he brings shit to every department he joins….","score":19,"comments":[{"body":"He didn't do us many favors here in austin","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Next stop: Uvalde","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Why would anyone hire this guy?  shitty job in austin, saying a female jogger should be happy she wasnt raped instead of just brutally areated or jaywalking, running houston pd into the ground and lieing about the two murdered citizens and now fired in miami…i have never met the man but he brings crap tomwhatecer department hires him. His ego is a big as an elephant when his ability to lead appeRs to be a mouse.","score":7,"comments":[]},{"body":"How does this guy keep getting jobs? The Goines fake warrant fiasco/Tuttle murder happened under him in Houston and he still gets a job in Miami! Didn't stay long though. How is he not radioactive?","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Isn't he still under investigation for allowing the Tuttle murders to happen right under his nose???","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Chicago cop arrested at training academy, charged with pulling gun on neighbor","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Fucking tip of the iceberg in the CPD. This department is corrupt to the core.","score":2,"comments":[]},{"body":"Grew up in Chicago. Lots of guys I knew became CPD. None of them should have been in positions of power, much less given the judgement to use lethal force. Every CPD officer I’ve known is just a professional gang banger. Scumbags that uphold the thin blue line of silence and violence. The whole force is rotten.","score":1,"comments":[]}]},{"title":"LA’s finest. LA stands for Lost Af.","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"[deleted]","score":1,"comments":[{"body":"But I thought you weren’t a Bootlicker?","score":1,"comments":[]}]}]},{"title":"Cop sentenced to 11 months in jail after shooting and killing unarmed black man who was sitting on curb with his hands in the air","not_safe_for_work":false,"locked":false,"body":"","score":1359,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Should be 20 years to life in prison for murder.","score":443,"comments":[{"body":"If the article read black man shot and killed cop sitting on curb with hands in the air, it be all over the news and he be facing the death penalty. yet when reversed its only 11 months. Burn the system down.","score":152,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"11 months? How insulting to the justice system, the the family and the entire community.","score":285,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He executed that man and got a slap on the wrist. Injustice!","score":87,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"11 months? He'll be out in 5 months with no incidents. This shit is happening everyday throughout the country without any repercussions.","score":167,"comments":[{"body":"Also, those 11 months probably won't even be in gen pop. Fucker's gonna be just short of a hotel suite in jail.","score":74,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Ok 11 months isn't enough but we're focusing on that when also: \n\n&gt;It's the first time in Philadelphia's history that a jury convicted a police officer for an on-duty killing\n\n11 months is 11 months *more* than any other cop has gotten so far in the entire history of one of our country's oldest cities.  So things are going in the *right direction*.","score":106,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Because cops get 6 months for murder whereas everyone else gets the chair.","score":52,"comments":[]},{"body":"ACAB","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Rant Time","not_safe_for_work":false,"locked":false,"body":"I was in a college class last week and we had a discussion on police shootings. Now, to get this straight, I'm not a boot licker and I do support police reformation. But I'm not anti police either. But some of the shit this girl said was wild. \n\nThis girl went from saying that we should demilitarize our police force to saying that cops should be held to the same rules of engagement as the military. \n\nI'm currently serving and I have 15 years of service. I was like \"bruh, I literally smoked some dude for driving too close to us.\" Too many people think that the police should be held to the same ROE as us. It shows a lack of understanding of our ROE.\n\nRules of engagement (ROE) are constantly changing. We've had the \"do not fire until fired upon\" rule but we've also had the \"shoot anyone that moves\" rule as well. ROE changes depending on the administration, mission, current hostility of our environment, and so much more. Here are a few examples from my experiences:\n\nIraq, late 2000s. Vehicle borne IEDs (VBIED) were a major problem at this time. Basically they're suicide bombers in a car. We had signs on our vehicles saying \"STAY AT LEAST 100 METERS AWAY OR YOU WILL BE SHOT\" in English and Arabic. We spotted a vehicle driving towards us. Our interpreter was shouting commands to stop, we threw smoke at them, pointed weapons, shouted and the dude kept on coming. So I fired a 12-round burst from the .50 cal through the windshield. Several other Marines also fired. We annihilated this dude. There wasn't even a body left. Were there explosives? No. Weapons? Also no. Was this shooting justified? Yes. The current ROE at the time allowed us to fire upon vehicles suspected of being VBIEDs in order to preserve our lives. \n\nAfghanistan ~2012. We were conducting a raid on a Taliban compound. It was around 1am. A couple buddies and I scaled the outside wall, and snuck around a building. There were two dudes standing by a fire, one had an AK slung over his back and the other was unarmed. Everyone else was probably sleeping. We had the rest of our team and some ANA dudes outside the wall. I walked up and shot the guy with the AK in the back of the head with a suppressed pistol and my friend killed the unarmed guy with a knife. We let the rest of our guys in and we went through the compound killing everyone in their sleep and captured the HVT. Were the people we killed unarmed? With the exception of that one guy outside, no one had a weapon. Most were sleeping. Did we follow ROE? Yes. \n\nSyria ~2015. I was providing overwatch for my team. My spotter noticed a guy with binoculars and a cell phone watching our guys from a rooftop. A few Army guys got ambushed in this area a few days prior with mortars and machine gun fire. Based on that, we assumed this guy was a spotter and was calling out our location to his ISIS buddies. We radioed higher and they agreed. I shot him. Armed? Not technically. Justified? Yes. \n\nThere are many more examples like these. I don't think anyone wants our cops doing shit like that.\n\nOk rant over.","score":0,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Personally I'd get rid of that qualified immunity shit for starters. Police shouldn't be held to a lower standard than a normal citizen, a criminal conviction as a police officer should come with at least double the normal sentence.\n\nI'd probably recommend taking their lethal weapons away until they figure out how to solve issues without them.\n\nAnd certainly, no military hardware at all. My local swat team definitely doesn't need an MRAP. They don't have the training to use military hardware, and they certainly don't do the intelligence gathering to carry out a military style raid.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You're so full of shit your teeth are brown. But go off there fobhit.","score":3,"comments":[]},{"body":"Gaddamn sounds like you had a ton of fun with minimal risk to your life. Well as long as you don't have any delusions of heroism I can't fault you. You were just doing what you had to do to for the american empire to earn financial stability in return.","score":9,"comments":[{"body":"And you say your gonna be a cop?  Ya most people do have minimal risk to life.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Police absolutely SHOULD be demilitarized. A police force has no need for military equipment.\n\nPolice should have to abide by the Geneva convention.\n\nPolice should absolutely have stricter rules on how they operate.\n\nYou seem to be arguing that people don't understand ROE can escalate, but that's already how police here are supposed to operate, and only use appropriate force depending on the situation. The problem is they ignore those rules and then in the aftermath there is no accountability.\n\nAnd every one of your examples where you killed a person that can't be proven guilty, was arguably not justified. The U.S. doesn't get to make the rules. We shouldn't have been in any of those countries. I hope you get some help and realize that just because you had orders to kill, doesn't make killing right.","score":2,"comments":[]},{"body":"This one isn't about police, this is about you. Except from your first example, you didn't state your ROE. Your ROE are no juristification for your actions.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oh cool, you're a murderer. Fuck you for your service.","score":1,"comments":[]},{"body":"The problem is cowardly corrupt cops, DUH","score":1,"comments":[]},{"body":"What a moron. The point she’s trying to get across is our military- a highly trained organization with the express prurpose of killing our enemies - has more accountability and rules around the use of force than the police. \n\nThe fact that our army is the most apt comparison to our fucking domestic police says everything about how shitty the situation has become.","score":1,"comments":[]}]},{"title":"EXCLUSIVE: Cops Impound Cars Of Homeless Moms, Kids","not_safe_for_work":false,"locked":false,"body":"","score":44,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"These cops are gross","score":6,"comments":[]},{"body":"asshole clown cops, just doing their job. because that's what their BOSS told them to do. it's the higher ups that drive these cops to do evil things to the community... no fucking compassion in a cop  !","score":2,"comments":[]}]},{"title":"Racist, Homophobic &amp; Transphobic PA Parole Officer. Today I Reported Him.","not_safe_for_work":false,"locked":false,"body":"","score":51,"comments":[{"body":"Racist, hateful parole officer? The Powers That Be call that \"The System Working as Intended.\"","score":10,"comments":[]},{"body":"Look at his twitter page. complete nutter.","score":7,"comments":[]},{"body":"We're having a bad time with spambots, so your comment or post has been removed automatically. if this is a real person, and not a bot or a  troll, please [CLICK HERE](http://www.reddit.com/message/compose?to=/r/Bad_Cop_No_Donut) to send a modmail.\n\nIn addition to sending a modmail, please read the rules in the sidebar and [reddiquette](http://www.reddit.com/wiki/reddiquette).\n    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"If that report wasn't anonymous, I would watch your back. I've seen how this story goes, and the next step is nothing being done except over the top and obvious retaliation that no one can do anything about.","score":1,"comments":[{"body":"I know. What else could I do? I feel I have a moral duty. I know I am at risk, but so are POC / gay / trans people who may be at risk from a dangerous bigot who has power over them. Did you see his feed? He's terrible. I struggled so much with this.","score":1,"comments":[]}]},{"body":"Um, as I scroll down that page it appears that guy is a moron.","score":1,"comments":[{"body":"A still-employed moron, despite the complaints.","score":1,"comments":[]}]}]},{"title":"Police &amp; City Pay Off Photographer For Stealing His Camera WITHOUT A WARRANT","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Wow.  Copsplain they are taking your stuff and you can't do anything about it all the while not being able to find a reason to arrest him no matter how hard they tried.\n\nYoutube page of illegally parked cars.  Cops - We want your stuff because you are one of 'those people'.","score":2,"comments":[]}]},{"title":"Indiana cop visits school to teach kids how to be good police -- then accidentally shoots one of them","not_safe_for_work":false,"locked":false,"body":"","score":447,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"What a passive voice in that article:\n\n&gt; It was at this point that the officer's weapon accidentally discharged and resulted in the injury of one student, who was not severely hurt.\n\nDude drew, pointed a loaded gun at someone, and negligently discharged a round.","score":55,"comments":[{"body":"Noooo, the article clearly states that the “weapon accidentally discharged” not the hero pointing it at a child.","score":20,"comments":[]}]},{"body":"What the hell are they doing going to schools showing you how to be a \"good\" cop anyway? Reminds me of when the army recruiters would roll up in their humvee with a PlayStation in the back trying to show everyone how cool it was to be in the military. Keep that shit out of schools.","score":51,"comments":[]},{"body":"Coulda used him in Texas","score":29,"comments":[{"body":"Oh don’t worry, Uvalde police definitely shot a kid too.","score":33,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Jokes on them cause there’s no such thing as a good cop","score":27,"comments":[]},{"body":"Right. Accidental. [Allegedly.](https://youtu.be/iF6Wz7rypdU)","score":21,"comments":[]},{"body":"The correct word is NEGLIGENT. \n\nThe Indiana cop NEGLIGENTLY shot the child.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Well if seeing an innocent person get shot makes them squeamish then they aren't cut out to be cops anyway. Best to find out now.","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Who Botched the DUI Case Against This Phoenix Cop? No One Seems to Know","not_safe_for_work":false,"locked":false,"body":"Here's why: the County Attorney dismissed the initial charges because the bloodwork hadn't come back yet.  The Sheriff's Office didn't resubmit the charge, according to the attorney, while the sheriff says they did. This happened during the reign of disgraced former county attorney Allister Adel, who was forced out of her position earlier this year due to incompetence, failing to charge more than 180 cases in time, and trumping up charges against protestors as gang activity. The statute of limitations on this case actually lapsed on the watch of the new county attorney Rachel Mitchell, who was just elected to the position for a full term on November 8th.","score":31,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Botched? This was on purpose. GTFO…","score":3,"comments":[]},{"body":"They are all pointing fingers at each other when the truth is that they botched the case on purpose.","score":1,"comments":[]}]},{"title":"Des Moines paying $125,000 to man detained for filming police parking illegally","not_safe_for_work":false,"locked":false,"body":"","score":1884,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"*tax payers of Des Moines are paying $125K for incompetent police who have zero accountability.  FTFY","score":399,"comments":[{"body":"Probably got a promotion to be an major ahole.","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I wonder if you took a photo of all that money and the guy who won it rolling around on it in a bed.  Then take that photo and put it up on a billboard with \"I got 125K from the city because the police are criminals\".\n\nI think it would be fun.","score":127,"comments":[]},{"body":"Should come from the pigs personal money, not the taxpayers. It's bullshit.","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They need to start forcing the police to pay via their pensions. These fucking pigs waste tax payer money all the time. ACAB!!","score":167,"comments":[{"body":"Why qualified immunity needs to end.","score":53,"comments":[{"body":"Qualified immunity is a [\"doctrine\"](https://www.google.com/search?&amp;q=%22doctrine%22) created out of [nothing](https://www.killercop.com/Pages/woe.html) to try to protect those who commit criminal acts on a daily basis.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"These cases are largely won on appeal because a local court isn’t going to rule against the cops in their own district. It has to be an appelate court so they don’t fear reprisals and stonewalling by the cops.","score":33,"comments":[]},{"body":"Why does this victim have to pay his own lawyer's fees? What a terrible settlement. At least they were able to talk about it. Usually part of the bargain is they have to be silent about the amount of the settlement.","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Minnesota: The law enforcement lobby showed up Tuesday to oppose new rules proposed by the state’s police licensing board‚ including banning law enforcement officers from being involved in hate, extremist or white supremacist groups — because they said the wording is too vague","not_safe_for_work":false,"locked":false,"body":"","score":792,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Are they concerned that they'd lose too many officers?","score":128,"comments":[{"body":"*Brian Peters, executive director of the Minnesota Police and Peace Officers Association...said 92% of their members who responded to a survey have concerns about the proposed rules.*\n\n#92%","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They’re concerned too many would get fired. \nWhoops, there goes union dues revenue.","score":78,"comments":[]}]},{"body":"Wait, but cops protect and serve. They would never join hate groups. /s","score":40,"comments":[{"body":"Or join a violent failed coup. ACAB","score":17,"comments":[]}]},{"body":"“I’m White Nationalist, not Supremacist.  You liberals are too vague!”","score":29,"comments":[]},{"body":"That's rich coming from the ones who abuse vague wording.\n\nHave it passed and let them learn a little about the suffering they've inflicted on the community as a whole.\n\nAlso, the fuck is vague about hate crimes and white supremacist groups? This should be a red flag for the people they are supposed to serve that these officers are corrupt AF?","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Because very precise wording makes it easier to use loopholes.  Hmmm?\n\nKinda like the law.","score":57,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They're all fucking Nazis","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Video about US-Trained Death Squads","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Officers thought she was drunk behind the wheel; then another officer arrived and took her home","not_safe_for_work":false,"locked":false,"body":"","score":32,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"This is the discretion cops show for people in their circle, but then you have San Diego police throwing a homeless single mom and her kids out of their car because they had nowhere else to go. Absolutely ridiculous","score":9,"comments":[]},{"body":"\"According to the officers interviewed for the internal investigation, they describe being angry and saying, \"It shouldn't have happened.\"\n\nApparently, they were not terribly angry since they allowed it to happen. None of the supposedly \"angry\" cops had the balls to stand up and tell the off-duty sergeant that just because he's banging a chick doesn't get her a free ride on a DUI. They should have told the sergeant that they were arresting her and if he didn't like it, he could take it up with the chief.\n\nInstead, he gets promoted.","score":1,"comments":[]},{"body":"How is this news?  I assume this is happening nationwide at scale.\n\nIt might be news because it **made** the news but let's get real about how cops 'discretion' is exercised.\n\nAnd I don't believe for 1 second the cop was docked 3 days pay, at least not in the word of the sheriff, at least not without objective evidence.","score":-1,"comments":[]}]},{"title":"Took two years for local news to get ahold of this video","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Walton Hills officer let drunk driver go minutes before crash that killed man and mother-of-5","not_safe_for_work":false,"locked":false,"body":"","score":622,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"If a bartender let's you leave they are culpable....but not a cop???","score":75,"comments":[{"body":"Or better yet, if a cop kills an innocent victim in pursuit of a crime you committed, you get charged for that person's death. So by their own logic, this cop should definitely be held liable.","score":31,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"And what of the cop? I'm sure they'll be held accountable for their gross negligence, and dereliction of duty.","score":52,"comments":[{"body":"Criminal. Negligent. Homicide.","score":23,"comments":[]},{"body":"He got that sweet fist bump with the DUI driver.","score":6,"comments":[]}]},{"body":"Driver's BAC was still double the legal limit 4 hours after the crash","score":43,"comments":[]},{"body":"WTF?? The cop gets to resign and faces no ramifications??","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The family should also sue the officer and the municipality that let this idiot go.\n\nSounds like he knew the cop or the cop knew him.","score":7,"comments":[]},{"body":"15 years in prison .... that's it?!?","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Cops Called For Loud Neighbors , unidentified Loud Tyrants Show Up .","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"training won't fix that, some people just aren't suited for dealing with the public","score":3,"comments":[{"body":"*Most* of them aren’t.\nWhat’s really going on here is that they resent being asked to do their jobs. They got dispatched on a call for service when they’d much rather be sleeping in their patrol cars or taking a 4h lunch or w/e, and so now the citizen is gonna hear about it.","score":2,"comments":[]}]}]},{"title":"Cop Is Scared Of A Kitty Cat ?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Cats are sovereign citizens.","score":1,"comments":[]},{"body":"That kitten is very lucky to have escaped with its life. That's a lot of scared cops.","score":1,"comments":[]}]},{"title":"Omaha police officer who put trash on neighbor's car gets criminal mischief citation","not_safe_for_work":false,"locked":false,"body":"","score":54,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Felony Menacing?","score":1,"comments":[]}]},{"title":"Police Across Canada Are Hiring a Tech Company to Justify Bigger Budgets and Belittle Social Services. Helpseeker, a Calgary-based ‘social impact’ firm, has been hired to produce reports for police in Edmonton, Vancouver and Ottawa","not_safe_for_work":false,"locked":false,"body":"","score":34,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Expose their cynicism and turn it against them!","score":1,"comments":[]}]},{"title":"Washington town to pay $1 million to family of woman who died by suicide in jail after being harassed by guard","not_safe_for_work":false,"locked":false,"body":"","score":161,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"&gt; That guard, John Gray, would later be convicted of sexually assaulting four other incarcerated women. But when Kimberly Bender—a 23-year-old Quileute tribal member struggling with drug addiction and depression—tried to report Gray's misconduct, the Forks jail determined her complaint was \"unsubstantiated.\"","score":22,"comments":[{"body":"The guard is a POS, im not denying that at all. However im gonna go out on a limb here and say that most people coming down from heroin withdrawal probably say alot of things. I want to make my comments clear that her harassment shouldnt be any less important that any one else....but it would be alot easier to dismiss her over others. Which is why I assume it wasnt taken seriously. But its just a sad situation. Poor girl","score":-12,"comments":[]}]},{"body":"What an increase job.. you can fuck it up, harass women get fired and only get 15 day suspension.. no wonder crooks become cops","score":10,"comments":[{"body":"Even worse, this area is extreme Good Ol Boys country.","score":1,"comments":[]}]},{"body":"What a POS John Gray is. This poor woman was withdrawing from opiates which is hellish even in the best of circumstances. Extreme depression and this animal was sexually hunting her as she was trapped.","score":8,"comments":[]},{"body":"The natural instinct is to downvote stories like this. Sad to read. Thanks for sharing. Hopefully he gets Justice.","score":2,"comments":[]},{"body":"anybody got a grand total and a yearly total for what cop misdeeds have cost the taxpayers?","score":2,"comments":[]}]},{"title":"Ellen Greenberg was found with 20 stab wounds, half of them to the back of her head, and a Philadelphia pathologist determined it to be a suicide","not_safe_for_work":true,"locked":false,"body":"","score":15614,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Two of the 20 stab wounds were inflicted AFTER Greenberg’s heart STOPPED beating.","score":1111,"comments":[{"body":"&gt;photogrammetry, a new technology unavailable at the time of Ellen's death, that is able to create a 3D anatomical recreation of a corpse.  \nThis was done with the 20 stab wounds Ellen's body sustained. The findings concluded that not all the wounds could've been self-inflicted, particularly the ones to the back of her neck and head.  \nIn 2019, a pathologist at the Philadelphia Medical Examiner's Office decided to take a closer look at the only sample of Ellen's spine with a stab wound.  \nIt was relayed back to the medical examiner that a portion of the spine didn't show clotting or blood, and the stab most likely occurred after Ellen either had no pulse or was dead.  \n'That means that Ellen could not have administered that stab, which means it's impossible for her to have committed suicide,' the Greenberg's' lawyer, Joe Podraza, told DailyMail.com.  \n'Suicide by definition would mean that she would have had to of self-inflicted all of these 20 wounds, and then to top it off, that wound to the spinal cord.  \n'Ellen was found with a knife in her chest, so even assuming that the stab into the spinal cord that they had the sample of was the second to last stab - the knife ends on her chest.  \n'You'd have to then conclude that Ellen stabbed herself twice when she was dead, which is medically impossible. I think that by itself is enough to say this can't be a suicide.'  \n&gt;  \n&gt;Podraza further analyzed three of the wounds to Ellen's stomach that should have caused her to pass out instantly.\r  \n\r  \nAdditionally, her wounds suggested she was stabbed with another knife that wasn't found at the scene.\r  \n\r  \nThe medical examiner also found evidence of defense wounds on Ellen's body that weren't initially acknowledged by investigators in 2011.  \r  \n\r  \nBruises on her arms and legs were healing at different stages. The lawyer also suggested investigators missed trauma that showed strangulation. \n\n&amp;#x200B;\n\nWhat in the fuck? And I'm just finding out about this now? And I haven't heard shit on the news about it. How the fuck did this get buried?","score":646,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"She was murdered by her ex-fiancé Sam Goldberg.\n\nIt’s being covered up by the Philadelphia Police Department because Sam Goldberg’s uncle is one of the most powerful attorney’s in Pennsylvania. \n\nThere is no doubt this was murder.\n\n\nEDIT: Please upvote OP’s post for visibility! The Greenberg family would definitely appreciate it!","score":3744,"comments":[{"body":"Hah! I came here to ask which one of the examiners was close friends with the perpetrator, but I guess this answers that question.","score":347,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The fact that anyone would cover a relative's murder crime says everything about their morals. \n\n\n\n&gt;It’s being covered up by the Philadelphia Police Department because Sam Goldberg’s uncle is one of the most powerful attorney’s in Pennsylvania. \n\nWhat is the uncle's name? \n\nHe probably has dirt on other city officials.","score":152,"comments":[{"body":"James C. Schwartzman","score":117,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Ah, that explains it. I was looking for a mention that her fiancé is a cop.","score":114,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"If I remember correctly, her spinal cord (or part of it) was examined by another pathologist (I believe) and it was determined she couldn’t have afflicted anymore wounds because the spinal cord had been damaged (or even severed) before all the wounds were inflicted. I either read this or heard it on a podcast, I can’t remember which. The entire case is just f’d up and she was definitely murdered.","score":354,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That first pathologist needs to be dragged down town and questioned. Whoever heard of a suicide victim that stabbed themselves 20 times? The cops who agreed with the pathologist also need to be questioned. There has to be a financial audit on everyone involved in the first investigation.","score":199,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Miami police officer being investigated after being caught on camera slamming, injuring man","not_safe_for_work":false,"locked":false,"body":"","score":33,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Aggravated battery plus a coverup.","score":5,"comments":[]},{"body":"So common..","score":3,"comments":[]},{"body":"c'mon man, what is there to investigate... the clown tossed the guy into the pavement. give the guy $500,000 and send the clown cop to prison... as far as i am concerned it is cut and dry... i have made my judgement  !","score":1,"comments":[]},{"body":"Can his rights and any harm done to him be undone?  Yeah didn't think so.\n\nThe city of Miami is going to pay out.","score":1,"comments":[]}]},{"title":"Three Former NYPD Police Officers Plead Guilty to Bribery Scheme: In Exchange for Bribes, Two NYPD Officers Steered Damaged Vehicles to a Tow Truck Company Operated by a Former NYPD Officer","not_safe_for_work":false,"locked":false,"body":"","score":43,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Ex-police officer who shot and killed Ohio resident faces civil lawsuit","not_safe_for_work":false,"locked":false,"body":"","score":40,"comments":[{"body":"\n**    Please don't: \n\n- be a dick to other people\n\n- incite violence, as these comments violate site-wide rules and put us at risk of being banned.\n\n- be racist, sexist, transphobic, or any other forms of bigotry.\n\n- [JAQ](https://rationalwiki.org/wiki/Just_asking_questions#JAQing_off) off\n\n- be an authoritarian apologist\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bad_Cop_No_Donut) if you have any questions or concerns.*","score":1,"comments":[]}]}]}