{"name":"bettercallsaul","description":"A subreddit for the Breaking Bad spinoff \"better Call Saul\" starring Bob Odenkirk.","subscribers":477356,"posts":[{"title":"Better Call Saul Series Discussion Thread","not_safe_for_work":false,"locked":false,"body":"[Well, that's Saul folks.](https://i.imgur.com/mCep7wp.png)\n\nIt's been quite a ride, what did you think?\n\n\n\n---\n#[S06E13 Post-Episode Discussion Thread](https://redd.it/wpigm0)\n\n\n\n#**[Episode Discussion Thread Archive] (https://www.reddit.com/r/betterCallSaul/wiki/index#wiki_discussion_thread_archive)**\n\n---\n\n\n#[Feel free to take our subreddit end-of-season survey!](https://forms.gle/a1LGoBo1Kndf7Fwz9)\n\nResults will be posted in a couple of weeks.\n\n\n\n\n\n---\n\n**Breaking Bad Universe Discord:**\n\n\nWe will be doing a watch-through of Breaking Bad starting August 19th, so it will be super interesting to watch Breaking Bad with the entire context of Better Call Saul.\n\n#**[Join the Discord here!](https://discord.com/invite/breakingbad)**","score":3657,"comments":[{"body":"Reminders:\n\n- [Check out the AMA Dave Porter, composer of BrBa and BCS did!](https://redd.it/wqvpmg)\n\n- Also the [Breaking Bad Universe Discord](https://discord.gg/breakingbad) will be hosting a watch-through of Breaking Bad where we discuss each episode (I think it will be super interesting to rewatch it with the context of Better Call Saul).","score":1,"comments":[]},{"body":"This spin off, while simultaneously being prequel, interquel and sequel of Breaking Bad, not only fleshed out already good characters, but also elevated the already astonishing story of the Breaking Bad universe. \n\nUnforgettable story, characters and relationships. Bravo Vince, bravo Peter, and bravo to all of the actors and producers. I hope each of you has a wonderful rest of career and life.","score":1538,"comments":[{"body":"And it added some of the best characters in either show. Lalo, Kim, and Nacho were what truly elevated the show","score":766,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The first few episodes of Saul have always felt goofy to me. Same for breaking bad- things go to shit way too quickly due to the nature of cable TV and the need to secure viewers. There's glamour in the danger and flashy violence of it all. \n\nThe last episodes of Saul do just a brilliant job of stripping all of that glamour away. No more making Bob Odenkirk look 10 years younger. No more trim suits and bright colours. There's no violence or danger. There's just this old man finally facing the music.\n\nIt was such a devastating ending for me because there is no time machine - there is no way to make up for the lost time or fix any of his mistakes. The closest thing we have to a time machine is to rewind old tapes and watch again. I'm still not sure if that makes it a hopeless ending. There is some ember of hope there.","score":698,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I feel bad for breaking bad fans that never saw the finale and don’t know the true ending","score":631,"comments":[{"body":"It's so bizarre to me. I have multiple friends who love Breaking Bad and have rewatched it regularly, but haven't even tried BCS. They've even told me that everyone they know who's watched BCS has liked it more. Like what more do they need to watch it? Their loss tho","score":526,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"In the end, the show has two very distinct halves. The half with Chuck and the half without. Both equally entertaining and instrumental to the character of Saul. \n\nSo pleased with how great the show turned out.","score":2938,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Incredibly satisfied, loved everything about the series and Kim Wexler became my favorite fictional character. \n\nI do think one of the most overlooked and devastating  lines of dialogue in the entire universe comes from her: “do you want to be a friend of the cartel; or do you want to be a rat?”","score":420,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I think I'm still in denial...","score":1848,"comments":[{"body":"In reality, we’re all just Genes trying to keep the show going and rewinding the tapes.","score":1048,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"/r/BetterCallSaul Season 6 Survey Results!","not_safe_for_work":false,"locked":false,"body":"Here are the results of the Season 6 Survey and the polls from each Post-Episode Discussion thread.\n\nCompare the results to past season surveys:\n\n- [Season 5 Survey Results](https://redd.it/gdj7q1)\n- [Season 4 Survey Results](https://redd.it/9qivur)\n- [Season 3 Survey Results](https://redd.it/6lfpwg)\n\n--\n\n#[How would you rate Season 6? (10,214 responses)](https://i.imgur.com/Cuxxadh.png)\n\n* The average response was 9.34. (Season 5 was 9.18, Season 4 was 8.7, Season 3 was 8.9)\n\n* The mode was overwhelmingly 10.\n\n---\n\n#[Compare each season (10,214 responses)](https://i.imgur.com/JtgjjjW.png)\n\n* The results were fairly clear for Season 6 being the favourite, followed by Season 5, Season 4, Season 3, Season 2 and Season 1.\n* Season 3 and 4 were fairly decisive in where they landed, however there was a big chunk of people that thought 3 was better than 4, and the same goes for Seasons 1 and 2.\n\n\n\n---\n#[Which episode was your favourite? (10,214 responses)](https://i.imgur.com/ZNmCLLV.png)\n\n\n\nEpisode | Percent of survey respondents who believed was best episode | # of votes\n---|---| ---\nEpisode 7 - \"Plan and Execution\"| 35.9% |3,665\nEpisode 13 - \"Saul Gone\"| 21% |2,144\nEpisode 8 - \"Point and Shoot\"| 14.4% |1,471\nEpisode 9 - \"Fun and Games\"| 8.2% |838\nEpisode 12 - \"Waterworks\"| 6.5% |668\nEpisode 3 - \"Rock and Hard Place\"| 5.7% |579\nEpisode 10 - \"Nippy\"| 2.7% |280\nEpisode 11 - \"Breaking Bad\" |2.5% |253\nEpisode 4 - \"Hit and Run\"| 0.8% |79\nEpisode 2 - \"Carrot and Stick\"|0.7% |71\nEpisode 1 - \"Wine and Roses\" |0.7% |71\nEpisode 6 - \"Axe and Grind\" | 0.6% | 58 \nEpisode 5 - \"Black and Blue\" | 0.4% | 37\n\n\n\n--\n\n* Episode 7 - Plan and Execution was the clear favourite with 35.9% of the votes, with Episode 13 - Saul Gone following behind with 21%, and Episode 8 - Point and Shoot with 14.4%\n* 55.1% of all votes went towards 6B\n* Episode 7 - Plan and Execution and Episode 3 - Rock and Hard Place, were the only two episode in 6A to receive higher than 0.8% of the votes\n*Episode 7 - Plan and Execution makes up 80% of the votes for S6A episodes.\n* This is the first season to have five episodes without even a percent of the votes, with Season 5 having only 3 last year\n\n\n---\n\n#[Which actor had the best performance? (10,214 responses)](https://i.imgur.com/NSrikt8.png)\n\n\n\nActor (Character)| Percent of survey respondents who believed had best performance | # of votes\n---|--- | --\nBob Odenkirk (Jimmy \"Saul Goodman/Gene Takovic\" McGill)| 43.1% | 4,398\nRhea Seehorn (Kim Wexler)| 37.1% | 3,791\nTony Dalton (Lalo Salamanca)| 7.5% | 770\nMichael Mando (Nacho Varga) |6.1% | 620\nPatrick Fabian (Howard Hamlin) | 3.2% | 327\nJonathan Banks (Mike Ehrmantraut)|1.3%|137\nGiancarlo Esposito (Gustavo 'Gus' Fring)| 0.7% | 75\nOther| 0.94% | 96\n\n--\n\n* The results were fairly overwhelming with Bob Odenkirk having 43.1% of the votes.\n* Bob Odenkirk jumped up 32.1%, from having only 11% of the votes in Season 5\n* This is Bob Odenkirk's second highest season, with the highest being Season 4 with 48% of the votes\n* This is Rhea Seehorn's second highest season, with the highest being Season 5 with 47.3% of the votes\n* Michael McKean still leads the surveys with the most votes with 58% from Season 3.\n* This is Michael Mando's highest season, with Season 3 being the highest at 7.9%\n* Some of the responses given in the Other category were: All of them, tied between Bob and Rhea, Michael McKean and Lyle\n\n---\n\n#Average rating of each episode from each Post-Episode Discussion Thread poll\n\n(click rating to go to the poll results)\n\n--\n\nEpisode | Rating | # of votes\n---|--- | --\nS06E07 - \"Plan and Execution\"|[9.59](https://youpoll.me/77950/r)|4,204\nS06E03 - \"Rock and Hard Place\"| [9.33](https://youpoll.me/75916/r)|2,359\nS06E08 - \"Point and Shoot\"| [9.24](https://youpoll.me/82078/r) |5,492\nS06E02 - \"Carrot and Stick\"| [9.15](https://youpoll.me/75437/r)|1,482\nS06E12 - \"Waterworks\"| [9.12](https://youpoll.me/84133/r)|3,913\nS06E13 - \"Saul Gone\"| [8.92](https://youpoll.me/84494/r)|7,804\nS06E01 - \"Wine and Roses\"| [8.81](https://youpoll.me/75436/r)|1,996\nS06E09 - \"Fun and Games\"| [8.72](https://youpoll.me/82622/r)|4,106\nS06E11 - \"Breaking Bad\"| [8.46](https://youpoll.me/83712/r)|3,371\nS06E04 - \"Hit and Run\"| [8.18](https://youpoll.me/76416/r)|941\nS06E05 - \"Black and Blue\"| [7.57](https://youpoll.me/76925/r)|787\nS06E06 - \"Axe and Grind\"| [7.56](https://youpoll.me/77421/r)|979\nS06E10 - \"Nippy\"|[7.51](https://youpoll.me/83148/r)|4,594\n\n\n\n\n\n\n--\n* The results closely mimic the \"Favourite Episode\" survey question with S06E07 - \"Plan and Execution\" and S06E03 - \"Rock and Hard Place\" being in the top 3 favourite, however S06E13 - \"Saul Gone\" was rated as the second highest favourite episode, and is actually the 6th highest rated in the post-episode discussion polls.\n\n* S06E07 - \"Plan and Execution\" is the highest rated episode in the post-episode discussion polls, with S03E05 - \"Chicanery\" following with 9.55 and S05E09 - \"Bad Choice Road\" following with 9.51\n* S06E10 - \"Nippy\" is the second lowest rated episode in the post-episode discussion polls with S04E04 - \"Talk\" being the lowest with 7.41\n\n* Season 6 has the second highest rated average episode with 8.63, led by Season 5 with 8.82. Season 3 being 8.53 and Season 4 being 8.44.\n\n* This is the first season to have more than one episode lower than an 8\n* This season has the most episodes rated above a 9 with 5, followed by Season 5 with 3\n\n\n--\n\n--\n\n*Keep in mind that each week, the amount of people that voted were changed, so results could be different.*\n\n--\n\n*eg. our most popular poll was S06E013 - \"Saul Gone\" with 7,804 votes, and our least popular poll was S06E05 - \"Black and Blue\" with 787 votes.*\n\n\n---\n\nThank you for all participating in these surveys over the years. I hope you got something interesting from this data.\n\n\n--\n\nThis will be the last official mod post for awhile. So once again, I thank you all for participating over the years. It really has been a great time.","score":385,"comments":[{"body":"Pretty interesting to see that the general consensus is that every season was better than the last. Probably not many shows that can be said for.\n\nAlso\n\n\"Episode 3 - Rock and Hard Place, was the only episode in 6A to receive higher than 0.8% of the votes with it being 5.7%\"Isn't Plan and Execution 6A though?","score":176,"comments":[{"body":"It's crazy how the only other example I can think of is BB \nvravo bince","score":66,"comments":[{"body":"Bojack Horseman and The Sopranos got better with every season imo","score":62,"comments":[{"body":"I'm halfway thru BoJack so I'll take ur word for it","score":20,"comments":[{"body":"The penultimate episode of bojack is exceptional and unforgettable if not downright traumatizing. I have never been affected this much by any other show or movie. You do need six seasons worth of buildup for it to work though.","score":36,"comments":[{"body":"God The View From Halfway Down just fucked me up in an unprecedented way and that's saying a lot considering that show","score":24,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Personally I thought season 5 of BCS was quite a bit better than season 6. I also thought season 4 of Breaking Bad was the best season","score":24,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"L poll, Hit and Run is the real best episode","score":45,"comments":[]},{"body":"It's interesting that Season 6 is rated the best. When viewing the season as a whole (trying not to ignore the weaker parts) it's significantly more flimsy than the rest. Even thought the payoff was good, many parts of 6A simply fell flat for more and it wasn't just the pace. Some weird scenes, frustratingly vague cold opens every week, and of course the uneventful pacing for three episodes. Other seasons just don't have the much of a dip to me. However, 6B was everything I loved about the show. Intense scenes with Dave Porter's score, a couple silly Saul montages, and great character scenes. And I ate up most of the BB scenes. So I'm not shitting on the season or how it ended, but when stacked against the other seasons I found the previous ones to be stronger.","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"nooo Nippy was literaly my fav episode, the cinematography in it was unreal, how did it get the lowest rating out of all :(","score":22,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Hell’s Kitchen new season cast leaked","not_safe_for_work":false,"locked":false,"body":"","score":470,"comments":[{"body":"Imagine Ramsey yelling at Lalo about his carne asada.","score":1,"comments":[{"body":"“Come on, be nice!”\n\n“YOU CALL THIS A TACO”\n\n“I told you. Be nice.”","score":1,"comments":[]},{"body":"Gordon: you call this a carne asada?!? It’s a carne assault on my tatstebuds!\n\nLalo: Tell me again 😁Tell. me. again. 😐","score":1,"comments":[]}]},{"body":"Can’t wait to see the chicken mission","score":1,"comments":[]},{"body":"The loser gets murdered by Lalo.","score":1,"comments":[]},{"body":"Te vas a morir 🤤","score":1,"comments":[]},{"body":"Good luck sending anything back to the kitchen!","score":1,"comments":[]},{"body":"I sure hope Emilio takes a bath after this.","score":1,"comments":[]},{"body":"“Lalo’s” would be an amazing Taco truck!","score":1,"comments":[]},{"body":"nacho is doing his best hector face","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I’m sure it’s a coincidence","not_safe_for_work":false,"locked":false,"body":"","score":2883,"comments":[{"body":"Hating Huell is sus even without the racism. The man is a delight.","score":1858,"comments":[{"body":"He's the pillar of our church community, a real treasure","score":889,"comments":[{"body":"[A man of God](http://www.freewill-baptistchurch.com/)","score":166,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Hating Huell is just a crime in general. Not just racism, like, death penalty","score":563,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not like the true Breaking Bad fans who only hate Skyler, Marie, Lydia, Carmen, Holly…","score":876,"comments":[{"body":"In fairness, Holly is an *asshole*.","score":398,"comments":[{"body":"She did it for herself. *She liked it.* She was good at it. And she was really—she was alive.","score":187,"comments":[]},{"body":"Very selfish the entire show. No redemption arc. Her character gets an F from me.","score":85,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"at least he doesnt hate ernie 😍😍😍😍","score":236,"comments":[{"body":"A good karaoke performance binds us all","score":104,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Fifteen fucks are given in BCS. Six refer to animals.","not_safe_for_work":false,"locked":false,"body":"","score":1357,"comments":[{"body":"There's no fucking need to...","score":300,"comments":[{"body":"...I seem to be in the middle of some fucking thing here...","score":131,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"After the \"you twisted fuck\" was heart breaking","score":210,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When Jimmy sees Judge Casimiro with a sling in Axe and Grind he says it in the car too before calling Kim","score":72,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"S4E06 is the best use of fuck in the show. Maybe any show ever.","score":69,"comments":[{"body":"Patrick Fabian owns that word like it was gifted to him by Samuel L Jackson.\n\nHe would have given him the N word, but he already promised that to Quentin Tarantino.","score":42,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Now do Breaking Bad please","score":190,"comments":[{"body":"Twenty two fucks, no animals.","score":279,"comments":[{"body":"Don’t know why I read this in Mike’s voice","score":255,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I love that the last f-bomb of the series was “dude, what the fuck?” that feels so perfect.","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Fuck Chuck","not_safe_for_work":false,"locked":false,"body":"I’m watching for the first time I’m only on season 3 episode 1 but holy fuck Chuck is a such an asshole piece of shit I literally hate him so much. That’s all.","score":68,"comments":[{"body":"r/fuckchuck","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Chuck could have went no contact with Jimmy.  No he wanted to be the dickhead oldest brother.   He did about 2 things for Jimmy.  Got him off on Chicago sunroof charge.   Got him job in mailroom.  Otherwise he was an asshole to his brother. \nJimmy deserved better.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“That’s all” 😅","score":1,"comments":[]},{"body":"Please don't short sell the remarkable acting by Michael McKean\n\nAlso, *\"Did you ground yourself?\"*","score":1,"comments":[{"body":"His acting is phenomenal that’s true","score":1,"comments":[{"body":"Episode \"Chicanery\" will be the one to look for. His best acting of all time. Favorite episode","score":1,"comments":[]}]}]},{"body":"Fuck Chuck! \n\nYou mean figuratively, right…?","score":1,"comments":[]},{"body":"Brace yourself","score":1,"comments":[]},{"body":"Chuck can burn in hell seriously","score":1,"comments":[]},{"body":"Chuck and Jimmy have one of the most toxic sibling relationships I've ever seen on the screen.    Neither has clean hands, but what's genius about how this relationship is portrayed is just how much they are accustomed to playing their parts in that relationship without ever thinking about if something better was possible.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I'm so sorry but I just gotta highlight the spelling mistake of the word \"you're\"","not_safe_for_work":false,"locked":false,"body":"","score":1963,"comments":[{"body":"Per the commentary, this was \"a very carefully selected typo.\"","score":718,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"AS IF I COULD EVER MAKE SUCH A MISTAKE! NEVER! NEVER!","score":362,"comments":[{"body":"I KNEW IT WAS YOU'RE! ONE E MORE THAN YOUR!","score":98,"comments":[{"body":"HE COVERED HIS TRACKS, HE GOT THAT IDIOT, AT THE PROP DEPARTMENT TO LIE FOR HIM","score":57,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Seems pretty realistic to see a mistake like that.","score":411,"comments":[{"body":"It adds authenticity.","score":96,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Especially on reddit.","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Sounds about right from someone who would use \"really really\" instead of grasping for a more challenging and descriptive word.  Looks like an authentic thank you note.","score":46,"comments":[]},{"body":"Probably on purpose to portray the client as somewhat undereducated.","score":210,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Hehe, I know that young girl on the left there. She's a local cosplayer in Albuquerque here and she went to be an extra on BCS. I was very happy for her when she announced she got to be an extra back when this episode aired!","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How divisive was the finale?","not_safe_for_work":false,"locked":false,"body":"I’ve been going through posts about the finale of BCS and from IMDB and trade articles it would seem the finale was incredibly beloved, but going through different threads I’ve seen an equal amount of the finale was awful comments and the finale was brilliant, I’m curious to how divisive the ending actually was?","score":180,"comments":[{"body":"It was so divisive it left Jimmy and Kim on opposite sides of the fence.","score":400,"comments":[{"body":"Best answer right here.","score":26,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"My only problem is we didn’t hear winner takes it all again :(","score":123,"comments":[{"body":"Where would you ideally put it? \n\nI’m thinking at the end of the Chuck flashback, Jimmy enters his car and listens to it on CD reminiscing about one of their few good moments as he drives off \n\nOr the courtroom entrance scene","score":42,"comments":[{"body":"Jimmy enters his car, a ford mustang, now fully bald and wearing a black tank top. The camera rises and shows two cars driving side by side, racing it seems. Jimmy looks to his left and the driver of the car is none other than our beloved Chuck McGill. Upon his face is painted a bright smile, to which Jimmy returns and nods. A fork in the road is ahead. Jimmy takes one road and Chuck takes the other. We see the two cars slowly moving further from each other on their respective roads. See You Again by Charlie Puth, featuring Wiz Khalifa, which has been lingering quietly in the background now blares as Charlie says “Oohohohohoohh.”","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Critically? I read a bunch of reviews and the worst I recall seeing was \"B+.\"\n\nIt has a 9.8 on IMDB. I agree that some people did not like the finale, but I don't think that it's equal to the amount of people who liked it.","score":197,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I was pretty disappointed Walter didn’t come back and break Saul out of jail. That would have been pretty bad ass. Then they could have gotten Jesse and moved to like France and started cooking again. Oh well","score":143,"comments":[{"body":"Did you write for the Showtime original series Weeds?","score":19,"comments":[{"body":"No I believe that was a monkey with a type writer","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Not very much at all really","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"saul drank mike’s piss","not_safe_for_work":false,"locked":false,"body":"in the episode \"bag man\" saul is able to completely fill up his water bottle with pee (better known as piss) despite being almost completely dehydrated, and even though he drank most of his water the day before that surely can’t be enough to fill up a water bottle that tall, so it’s a possibility he got some assistance from a more hydrated ally.","score":96,"comments":[{"body":"(better known as piss) thanks bruv","score":87,"comments":[]},{"body":"saul took a full measure","score":1,"comments":[]},{"body":"Now here's what's going to happen.","score":1,"comments":[{"body":"You're Gonna take off my pants and have me piss in your Mesa Verde branded cup, if anyone ask how you'd survive out there, just say this:I pissed in my cup, I dranked it, that's all I know","score":1,"comments":[]}]},{"body":"Least horny BCS fan (?)","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Maybe they extracted the urine from the cartel guys that attacked saul","score":26,"comments":[{"body":"squeezed him out like a lemon","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Hey I know you! Your better drink piss","score":6,"comments":[]},{"body":"Yep, this one’s the last straw. It’s been real. 😂","score":1,"comments":[]},{"body":"Honestly deserves it for what ended up eventually happening to Mike. That pee is in him forever and his spirit lives on.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"A young Charles McGill goofing around the tech department at The university of Pennsylvania. At what point do you think he lost his sense of fun??","not_safe_for_work":false,"locked":false,"body":"","score":370,"comments":[{"body":"Spoiler: That robot is why Charles developed a phobia of electromagnetic radiation.\n\nWHAT HAPPENED?!","score":79,"comments":[{"body":"He learned why you don't get robots horny","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Johnny 5 fried Chuck's brain","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Was Michael McKean ever young?","score":29,"comments":[{"body":"That’s what electromagnetism will do to you","score":19,"comments":[]},{"body":"Yes. Watch spinal tap","score":10,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Short Circuit was such a great movie. Beyond dated now, but still great.","score":14,"comments":[{"body":"It wasn’t until years later that I found out Fisher Stevens wasn’t Indian.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"\"And Chuck gets to read Penthouse ? what a sick joke !\"","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Can we remake Short Circuit please??? \n\nThanks!","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Meanwhile in Marseille 🇫🇷","not_safe_for_work":false,"locked":false,"body":"","score":284,"comments":[{"body":"Me: Mom I want Los Pollos Hermanos  \nMom: We have Los Pollos Hermanos at home  \nLos Pollos Hermanos at home:","score":17,"comments":[{"body":"Los pollos hermanitos*","score":4,"comments":[]}]},{"body":"It is…not acceptable","score":8,"comments":[]},{"body":"Marseille is certainly a city where the Juarez Cartel &amp; the Salamancas would feel at home... burning people in cars ? check. Shooting your ennemy with an AK-47 ? check. Drug trafficking ? a hundred percent.  Marseille is France very own ABQ - as far as drug cartel violence go.\n\nSo it makes some sense.","score":17,"comments":[{"body":"I mean, that only happens in the quartiers nord and not most of Marseille. Also there is serious mafia activity in Aix. Walked past a burnt out car for months that was not reported at all.","score":1,"comments":[]}]},{"body":"Copyright?","score":3,"comments":[{"body":"no, problem! That's why they called it Los Pollos \"Hermanitos\" instead!","score":9,"comments":[{"body":"Les Frères Poulets","score":3,"comments":[]}]}]},{"body":"Gustave Fringue","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"😂😂😂","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"If Better Call Saul was on Cartoon Network by JabaToons..... or possibly this should've been Slippin Jimmy?","not_safe_for_work":false,"locked":false,"body":"","score":33,"comments":[{"body":"I would have watched this.","score":1,"comments":[]},{"body":"Ah, who could forget Saul’s infamous catchphrase\n\n&gt;! Public masturbation !&lt;","score":1,"comments":[]}]},{"title":"Is the business man that Saul and Kim scam at the restaurant the same one that owns the sports car which Walt blows up?","not_safe_for_work":false,"locked":false,"body":"I havent gone far into BCS yet, S2E1. Saul and Kim scam a business man at the restaurant.\n\nBack in Breaking Bad Walt sees an obnoxious business man at the gas station. He pops his car hood and puts a squeegee in between the two electrical nodes which causes it to explode.\n\nI went back and  looked at the business man and he looks exactly the same.","score":25,"comments":[{"body":"Yup, good old Ken Wins.","score":1,"comments":[{"body":"*Does he though?*","score":1,"comments":[]}]},{"body":"That fart had the anger of a repressed minority community","score":1,"comments":[]},{"body":"Ha-Ha!\n\n(Nelson from the Simpsons voice)","score":1,"comments":[]},{"body":"Duh.","score":1,"comments":[]}]},{"title":"Started BCS before ever seeing Breaking Bad. Before the final season of BCS, I thought I'd catch up in case there are references to catch. Love the younger McGill!","not_safe_for_work":false,"locked":false,"body":"","score":37,"comments":[{"body":"Ummm, you do know breaking bad is a sequel he's not younger here he's older","score":1,"comments":[{"body":"younger mcgill","score":1,"comments":[]},{"body":"This is a bait right","score":1,"comments":[]}]},{"body":"&gt;Clearly his taste in women is the same as his taste in lawyers, only the very best.... with just the right amount of dirty","score":0,"comments":[]},{"body":"Love his voice so much. I may be in the minority here but I think he's charismatic and sexy as hell, both as Jimmy and Saul.","score":1,"comments":[]}]},{"title":"The many moods of Mike Ehrmantraut","not_safe_for_work":false,"locked":false,"body":"","score":376,"comments":[{"body":"Is that so?","score":20,"comments":[{"body":"You're DONE !!!","score":7,"comments":[]}]},{"body":"I feel like he's one of those guys who, if you know him well, you can tell when he's happy versus angry while his expression stays perpetually tired.","score":7,"comments":[]},{"body":"Nah. He kinda does a mean mug when he’s angry","score":6,"comments":[]},{"body":"I don't like how the kid named finger is looking at me.......","score":5,"comments":[]},{"body":"You forgot \"stickers\" and \"what gonna happen\" and also \"finger\"","score":5,"comments":[]},{"body":"Finger?","score":1,"comments":[]},{"body":"Waltuh","score":1,"comments":[]}]},{"title":"Couple of Kim doodles. Still practicing(:","not_safe_for_work":false,"locked":false,"body":"","score":257,"comments":[{"body":"You’re practicing? This looks amazing!","score":18,"comments":[{"body":"That’s very nice of you!!! I’m still not super great at capturing peoples features but I’m tryin!","score":7,"comments":[]}]},{"body":"They're excellent drawings! You really nailed the sadness in Florida-era Kim.","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"BEAUTIFUL","score":5,"comments":[]},{"body":"draw her feet next","score":17,"comments":[{"body":"Why don’t u draw upon the word of Christ","score":6,"comments":[]},{"body":"/:","score":9,"comments":[]},{"body":"Second this","score":3,"comments":[]}]},{"body":"Amazing work","score":3,"comments":[]},{"body":"eyes are really nice","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Just finished Better Call Saul after Breaking Bad and El Camino! It was a wild ride and would 100% recommend this show! Solid 10/10","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[{"body":"Ok","score":1,"comments":[{"body":"Indeed","score":1,"comments":[]}]}]},{"title":"Do you guys wish the show had an episode taking place entirely in the Breaking Bad timeline from Sauls POV?","not_safe_for_work":false,"locked":false,"body":"Part of me yes, but at the same time, I think it would have been too fan servicy.","score":6,"comments":[{"body":"No, we saw how hard it could be to even do scenes so many years after the fact. A whole ep would be overkill.","score":1,"comments":[{"body":"Yeah, the flashback scenes from the Gene episodes were well done (except the Kim/Jesse scene which was silly)","score":1,"comments":[]}]},{"body":"Oh for sure, even if it was just key BrBad points or aftermaths of iconic scenes with Saul involved it would've been awesome. That said it would've more so being fanservice and wouldn't leave us with the ambiguity Saul's character and his interactions on BrBad have. So now fans have the in betweens to speculate.","score":1,"comments":[]},{"body":"Eh sure it would have been cool but I’m not sure how much story purpose it provides other than the whole “It’s lion king 1 and a half but with breaking bad” thing.\n\n\nI think the show got across what it needed to from the brba era stuff we got.  It also builds kind of this air of doom and elusiveness to that part of Sauls life.  Like if you just watch BCS the brba time period is really built up like this massive fucking catastrophe in Sauls life.  \n\n\nAnd the fact that you don’t see much of it and it’s only talked up with how crazy it got only adds intrigue imo.\nfavor.  It also encourages viewers to watch Breaking Bad again on rewatch to get that part of the story in full.  Also there’s no real character growth or direction for Saul in that era….he’s just kinda an asshole scumbag for x amount of years.\n\n\nSo yeah other than the “oh cool” factor I don’t think it lends itself to much story potential","score":1,"comments":[]}]},{"title":"couple of posters i made","not_safe_for_work":false,"locked":false,"body":"","score":81,"comments":[{"body":"Lalo voice impersonation \"Excellent ! \" great posters. You perfectly captured angry Hank \"Don't mess with me\" mug.","score":6,"comments":[]},{"body":"I would go back in time and invest in Berkshire Hathaway.","score":4,"comments":[]},{"body":"i'd ask Betsy Kettleman out on a date before she met her husband and became Betsy Kettleman.","score":5,"comments":[{"body":"Betsy Perfectdeecups?","score":2,"comments":[]}]},{"body":"Second quote isn't accurate","score":1,"comments":[]},{"body":"These looks awesome dude, i love them, only thing is I'd change the \"his\" on the second poster to \"my\" to make the quote accurate, I feel it would read better that way.","score":1,"comments":[]}]},{"title":"Why do you think Jimmy never got violent?","not_safe_for_work":false,"locked":false,"body":"All Breaking Bad and BCS criminals, at some point, got violent and murdered (or tried to) someone. But that never happnd to Jimmy. He never showed regret in his acts and never set moral bounderies. But even when he got resons to get violent, he didnt. What ,in your opinion, is the crucial reason based in the character development?","score":6,"comments":[{"body":"Jimmy is a schemer. When he thinks 'retaliation', he thinks 'how can i tear this person down'. He definitely gets angry, but while that make other people's hand start swinging, Jimmy's brain starts scheming.","score":1,"comments":[]},{"body":"Are you forgetting his titanic boxing match with Howard?","score":1,"comments":[]},{"body":"High EQ. Jimmy is extremely empathic and rather see reasons to help someone than to judge someone. He was ok to break the law as long as it didn't involve injuring people, but because he helped criminals and gangsters, he ended up with blood on his hands. He knew that he wouldn't be able to win a physical fight so his first and foremost weapon was that he's street smart and empathic. He was excellent at reading other people. With that you go a long way even if you're an old skinny weak dude.","score":1,"comments":[]},{"body":"At the end when he ripped the old woman's phone out of the wall, he was holding the cord like he was going to strangle her. I'm not sure if he would have or not, but who knows what he would be capable of if she didn't have the life alert on her.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The dustbin would disagree","score":1,"comments":[{"body":"Right, and a door, various steering wheels, and a phonebooth.","score":1,"comments":[]}]},{"body":"Although just for a moment it looked like he would wring Carol Burnett’s neck","score":1,"comments":[]},{"body":"He suggested Walt should kill someone at one point. Might have been jessie. In the last season. That’s pretty violent if you ask me.","score":1,"comments":[{"body":"One of the very first scenes we see in BB of Saul is him suggesting to kill someone.","score":1,"comments":[{"body":"That’s right. Badger right?","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"What a sick joke!","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Go Land Crabs!","score":1,"comments":[]},{"body":"Chuck trolling Jimmy from beyond the grave. Who knew that he actually has a sense of humor.","score":1,"comments":[]}]},{"title":"What did Lalo mean by this?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"he's a furry now get over it","score":1,"comments":[]}]},{"title":"(S5 Spoilers) An edit I made to “Burn Everything”","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"I love the way Gus had to engineer the way the fire started. Using one of his juicy, succulent chickens.","score":1,"comments":[]}]},{"title":"Someone else posted about seeing Kim Wexler everywhere, and I felt that.","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[{"body":"Jenny Sparks! I can see that.","score":2,"comments":[]}]},{"title":"[Question][Huge Spoiler] Do I have to stop and watch Breaking Bad ?","not_safe_for_work":false,"locked":false,"body":"**\\*\\*\\* Spoiler Alert \\*\\*\\***\n\nI have watched almost the entire series. Now I am watching s6e11, or maybe 12. Suddenly the timeline changes, and Walter White and Jesse Pinkman appear. I really want to keep watching but I wonder if I have to stop. I don't want to spoil Breaking Bad. Any advice is welcome. Thanks","score":6,"comments":[{"body":"You should probably stop if you don't want to spoil major character deaths in Breaking Bad. Luckily most of these aren't spoiled until s6e12 and s6e13. But the fate of almost every major Breaking Bad character is mentioned in those episodes.","score":34,"comments":[{"body":"Many thanks. Much obliged.","score":10,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"You probably should've stopped after s6e9 and watched Breaking Bad \n\nBut, at this point.... yes the final few episodes have major Breaking Bad spoilers. \n\nWatch Breaking Bad (and then El Camino) and then finish Better Call Saul.","score":1,"comments":[]},{"body":"its difficult to say, on the one hand there are very big spoilers for breaking bad that include the fates of its main characters, however it doesnt get into the details and mostly has to do with how it impacts jimmys story. if you can handle it, i would recommend watching breaking bad first, then finishing those episodes.","score":7,"comments":[{"body":"Huge thanks.","score":2,"comments":[]}]},{"body":"&gt;!Darth Vader is Luke Skywalker's dad!&lt;","score":12,"comments":[{"body":"In The Sixth Sense you find out that &gt;!the dude in that hair piece the whole time, that's Bruce Willis the whole movie.!&lt;","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Yeah honest BB is meant to be watched first. You should stop now. TONS of BB spoilers in the next two episodes","score":1,"comments":[]},{"body":"As others have said, there will be huge spoilers, but you really won't get as much out of the last 4 or 5 episodes if you haven't seen BB.  You could probably skip El Camino, but I'd probably watch that too...after BB of course.","score":1,"comments":[{"body":"Thank you.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"University of American Samoa, go Land Crabs, oh wait, It's Actually Bats.","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"Are those bats doin' the nasty?","score":1,"comments":[]}]},{"title":"Better call Saul is too powerful","not_safe_for_work":false,"locked":false,"body":"","score":16,"comments":[{"body":"🇳🇱🇳🇱🇳🇱🇳🇱🇳🇱🇳🇱🇳🇱🇳🇱","score":2,"comments":[]}]},{"title":"Official Artwork for the “Better Call Saul” Complete Series Boxset","not_safe_for_work":false,"locked":false,"body":"","score":1315,"comments":[{"body":"They really took the 2000s setting of the show serious by making an ugly late 2000s looking blu-ray","score":531,"comments":[{"body":"Vince Gilligans genius strikes once again","score":108,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I love that they put Marion and Jeff amongst the main characters.","score":235,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I can’t take the Gus and Nacho images seriously anymore","score":123,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'm lowkey shocked that they put Chuck down with the Salamancas, rather than swapping Nacho or Gus out from the second row.","score":199,"comments":[{"body":"Didn't you finish the series? It was revealed that Chuck was the true mastermind of the cartel and Jimmy had to fight his way through HHM to save Kim and defeat his brother once and for all.","score":117,"comments":[{"body":"Remember when he said “It sauling time” and sauled all over Kim, Bravo Vince","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Never thought I'd see the day where Carol Burnett was on a Better Call Saul cover art.\n\nThen again, I never thought Saul would be caught by Carol Burnett, but it worked out beautifully.","score":47,"comments":[]},{"body":"The cropping for Howard is hilarious","score":39,"comments":[]},{"body":"I’ll just buy season 6 and stick with my single season blu rays.","score":36,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I Recreated Los Pollos Hermanos in Roblox","not_safe_for_work":false,"locked":false,"body":"","score":183,"comments":[{"body":"This is acceptable","score":22,"comments":[{"body":"Gustavo?","score":1,"comments":[]}]},{"body":"Make Meth cooking Idle simulator","score":7,"comments":[]},{"body":"Well done.","score":6,"comments":[{"body":"Thank you!","score":3,"comments":[]}]},{"body":"This is great! I’ll be sure to check it out!","score":5,"comments":[]},{"body":"Love it!","score":3,"comments":[{"body":"Tysm","score":2,"comments":[]}]}]},{"title":"Lalo Salamanca GTA","not_safe_for_work":false,"locked":false,"body":"","score":1361,"comments":[{"body":"He looks like  51 year old Tommy Angelo","score":159,"comments":[{"body":"Mr Salieri sends his regards","score":33,"comments":[{"body":"Family is forever.\n\n(The remake of the first Mafia was my first exposure to the saga. I was very apprehensive  of starting Vito's story after that ending. It just felt wrong)","score":11,"comments":[]}]}]},{"body":"You forgot the \"de\"","score":162,"comments":[{"body":"No space🥲","score":35,"comments":[{"body":"De hell you say","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Lalo? Who's Lalo?","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The future hasn't been kind to Tom holland","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No you silly goose, that's Jorge Guzman!","score":9,"comments":[]},{"body":"Looks like Sully from Uncharted lmao","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Just finished [SPOILERS]","not_safe_for_work":false,"locked":false,"body":"Wow just finished and I need a minute that was something else I havnt cried a tv series in a long time but BCS got me at the end, I was really rooting for them to get back together somehow cause tbh I'm a happy ending person but the bittersweetness of that ending really swelled me up. The fact Kim went to the trial expecting Jimmy to blame some things on her bit took everything on him was happy then he got 86 years overall just hit me and the last scene don't get me started just a masterpiece.","score":23,"comments":[{"body":"When i saw kim in the courtroom and knowing saul was just going full saul during his negotiations,i immediately remembered the scene during chicanery- where kim tells saul \n\n&gt;you know, shes(chucks wife)gonna hate you after all this is done. \n\nAnd jimmy was just nonchalant replying with\n\n&gt;&gt;I know\n\nI thought it was gonna be like that. Thank god...","score":7,"comments":[]},{"body":"I agree with all you said","score":3,"comments":[]},{"body":"the scene that got me teared up at the end was the flashback with Chuck. Jimmy loved his brother.","score":3,"comments":[]}]},{"title":"Jimmy1 (art by Tom Haugomat)","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Don’t you “oh Jimmy” me!","score":1,"comments":[]}]},{"title":"Howard’s wife getting coffee","not_safe_for_work":false,"locked":false,"body":"","score":1024,"comments":[{"body":"Forbidden Iced Cappuchino","score":78,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A lot of anger over Howard's devotion to HHM went into that calloused act. The thing is Howard was figuring it out in the end. In Plan &amp; Execution, we saw Howard sadly gaze at Chuck's portrait &amp; state \"there are more important things.\"","score":54,"comments":[{"body":"That’s why it hurt so much! Because we had him all wrong all along, then we see why and how is he is broken, and by whom(as he attempts this coffee peace offering), and still we know he will be ok, even after the they pull the con on him, even up to that point your still rooting for him… and then…. 🤯(lalo) 😔✊","score":28,"comments":[]}]},{"body":"ehm...about the video: if the smartass who did it didn't get the barista on board with the joke and left him a generous tip, he deserves to share the grave with Howard and Lalo","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Please he is already dead…\nThat scene broke my heart… Poor Howard and what a fuckin cold bitch of a wifey","score":114,"comments":[{"body":"At first you think Howard's a heartless robot pretending to be human. Only too late do you realize he's a big hearted human pretending to be a robot.","score":151,"comments":[{"body":"bro gonna have me in tears","score":14,"comments":[]},{"body":"Well said my friend… well said","score":29,"comments":[]},{"body":"yeah poor guy must have been barely holding it together then he's got the crazy fucking mcgill boys to contend with.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"We see her in three scenes and in two of them she’s grieving Howard. Pretty absurd the conclusions people jump to about what their relationship was like.","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What should I watch","not_safe_for_work":false,"locked":false,"body":"My favourite pieces of fiction to this day are breaking bad and better call saul. I've heard and seen from people that the wire and the sopranos is better. Is this true, and if so which should I watch first the wire or the sopranos.","score":2,"comments":[{"body":"Fargo, the series. You’ll also get Betsy kettleman and Saul there as a bonus (the actors, not the characters).","score":1,"comments":[{"body":"A man of taste","score":1,"comments":[]},{"body":"The actress that plays kettleman does such a good job of being the most aggravating person possible. Makes me not want to watch the other things she’s in hah! I’ll check it out, thanks","score":1,"comments":[]}]},{"body":"The Wire","score":1,"comments":[]},{"body":"Sopranos is really great, though I've always enjoyed Breaking Bad/Saul more (it's pretty close). I second the vote for Fargo, though","score":1,"comments":[]},{"body":"The Good Place","score":1,"comments":[]},{"body":"Ozark","score":1,"comments":[]},{"body":"Mr robot","score":1,"comments":[]}]},{"title":"The winner takes it all","not_safe_for_work":false,"locked":false,"body":"Maybe this is common knowledge already, but did anyone notice the winner takes it all being played In Pinata at the phone store? Is it maybe a reference to something or foreshadowing or any connection whatsoever? Considering well, Jimmy and Chuck sing it in the season finale.","score":1,"comments":[]},{"title":"Howard and Jimmy","not_safe_for_work":false,"locked":false,"body":"","score":686,"comments":[{"body":"why does everything main character of breaking bad grow a big grey beard after?","score":48,"comments":[{"body":"&gt;why does everything main character of breaking bad grow a big grey beard after?\n\nThis happens a lot after an actor leaves a longtime series, and notably has happened pretty much every time a longtime Talk Show host has retired. From what I gather a lot of it boils down to just getting annoyed with having had to shave every day, the same way, for however many years you're playing that same character.","score":30,"comments":[{"body":"i was just making a joke i didn’t realize there was actually a reason, appreciate the info tho","score":10,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Saul after he released from his prison and Howard was telling him that it was all a prank","score":77,"comments":[{"body":"The good ending","score":14,"comments":[]}]},{"body":"“Chaaaaarlie Hussle”","score":15,"comments":[]},{"body":"I want to know what Patrick Fabian was doing in Vancouver? Was is there just to visit Bob?? If so, cool.","score":24,"comments":[{"body":"&gt;I want to know what Patrick Fabian was doing in Vancouver? Was is there just to visit Bob?? If so, cool.\n\nIt's possible he was there to visit Bob, it's possible he was there for work because so much stuff is filmed in Vancouver . It's also possible that Patrick, an avid outdoor sportsman, was in the area for a hike or something and their schedules in the area just happened to overlap so they got together.","score":6,"comments":[]}]},{"body":"\nGreat people","score":7,"comments":[]},{"body":"Patrick has such a sweet smile :)","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How do you think Mike knew Saul would spill the coffee in season 1.","not_safe_for_work":false,"locked":false,"body":"Watching season 1 Episode 6 and Mike never tells Saul how he knew Saul would spill the coffee on the detective, what do you think gave it away?","score":0,"comments":[{"body":"Yes","score":1,"comments":[]}]},{"title":"What if I told you these 2 knuckleheads were part of a small time con on a Karen that backfired &amp; would ultimately lead to Jimmy McGill meeting the most dangerous criminals from both sides of the border.","not_safe_for_work":false,"locked":false,"body":"","score":237,"comments":[{"body":"I don’t know. They look like a couple of little biznatches to me…","score":46,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"In another post it was said it was Mike's fault, he didn't let Jimmy get out of the parking without paying $3 or getting another sticker.","score":14,"comments":[]},{"body":"so these guys are responsible for the countless deaths that happen in BCS and Bb","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Them: Walter White, and Saul Goodman, couldn’t have done it without me.","score":8,"comments":[]},{"body":"There horrible at reading people.   There mark asks open ended questions and they don't see it coming.   Quick to attack with big words like biznatch.  They were funny and I was truly scared for them.  Thankfully they had a great lawyer.","score":14,"comments":[{"body":"And they were ungrateful for that. Jimmy talked Tuco out of killing them.","score":10,"comments":[]}]},{"body":"and no Saul, no Walter White","score":5,"comments":[]},{"body":"Y’know i always say that the timeline would’ve DRASTICALLY changed if only Jimmy told these chumps to memorize the whole license plate instead of just the first two digits","score":4,"comments":[]},{"body":"Wish these wastes of air could've been wasted. Instead, we get proactive Howard splayed out on a living room floor... 😡","score":2,"comments":[]},{"body":"They made what was just fan service into something truly remarkable and entertaining.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Hey guys, I've got this project at Highschool about lecture and the theme is based off of Better Call Saul.","not_safe_for_work":false,"locked":false,"body":"https://preview.redd.it/7cxyojeg3d1a1.png?width=502&amp;format=png&amp;auto=webp&amp;s=f6eb4dcb3c6fe3f7c710e0fb39cb52263e558183\n\nI need a microphone or a camera symbol that has the same style as the balance in the title of the show (picture below), the project is due tomorrow morning by 10 AM GMT +2, if its not possible its ok but I thought it would have been cool to have it as a finishing touch for the project.","score":3,"comments":[{"body":"Good luck","score":1,"comments":[]}]},{"title":"No way Chuck was broke. And why did they act like they \"could never afford to biy that house\"?","not_safe_for_work":false,"locked":false,"body":"At the beginning, Jimmy sits Chuck down and tells him that he (Chuck) is about out of money. Anyone else find that completely out of character? Chuck is meticulous and at the top of his profession. His part of the law firm was worth millions. He had no children. Unless Rebecca cleaned him out in the divorce, its wholly unbelievable. His house was paid off. He had no utility or transportation expenses. Just food, really  and would have qualified for disability patments. \n\nBut more than that Chuck was learned, meticulous, snd precise. He would have approached money management and investing the same way. In fact when he dies, we hear that he was worth millions. \n\nTo me, this was a manufactured plot point. Not at all believable. \n\nFast forward to Jimmy and Kim going to visit a really nice house, acting as if they could never afford the house in a million years. So weird. Why in fuck couldnt they afford that house? At this point in the show, Kim has had Mesa Verde as a client for years. Jimmy's solo practice was going really well. I think they even had the 100k from Lalo at this place. They had no kids. Moderate lifestyle. \n\nSo the idea that the house was so far out of their league was bizarre to me. Made no sense.","score":6,"comments":[{"body":"At the beginning Jimmy was trying to con Chuck and HHM by having him leave the firm. He told Chuck he was broke because if Chuck were to leave the Firm it would have both Hurt HHM and entitled Chuck to a very Large payout.","score":15,"comments":[]},{"body":"I think you’re right about Chuck but J&amp;K’s refusal was more about them not wanting the house.","score":3,"comments":[]},{"body":"I'm not too sure but I would assume Jimmy was over exaggerating calling him broke because Chuck didn't seem too concerned about money in any scene. Not to mention Chuck is probably closed off about his finances, as many people are. Jimmy just wanted him to cash out","score":3,"comments":[]},{"body":"I think Chuck mentioned in the first episode to Jimmy that he was okay financially.\n\nI think you are underestimating New Mexico housing prices.","score":1,"comments":[]},{"body":"HHM's financial problems guide a lot of Chuck and Howard's actions.\n\nChuck joins Hamlin, Sr, and their 2 person firm grows to a legal army of hundreds. This arrangement works because Chuck is able to play big roles in big cases, and there is work for everybody handling paperwork for the master.\n\nChuck's infirmity disrupted this model, as the firm had to feed everyone doing only what they could accomplish without Chuck.\n\nHoward's motivation to get Chuck back working is because he can't keep his father's empire running forever without him. If HHM is the superlab, Chuck is the blue meth level cook. Their size means survival requires the very best.\n\nChuck is privately struggling with his mental and emotional health, and trying not  to overdraw the firm's resources. That money may be his, but like Ted Beneke his main priority with it is to keep his soldiers paid until he can make his grand comeback.\n\nThe need to keep up with their payroll is also why Chuck is so driven to poach the Sandpiper case from Jimmy, and why Chuck is sure none of the partners have the capital to buy out his shares.","score":1,"comments":[]},{"body":"I think you’re underestimating the luxuriousness of that house.  \n\nI think Kim makes it clear how much she makes at some point in the show.  Not a number but an idea, I don’t remember when though, I might just be making that up. \n\nBut it can’t be more than 100k. IIRC, she didn’t take HHM’s money and decided to pay for her college.  She and Jimmy were paying Francesca for a time.  She has her apartment that looks pretty nice, and all her bills and expenses.\n\nGranted, the apartment does seem pretty small. She’s also worked for a couple big firms and has independent experience, and had MV the whole time too, so she's been saving a lot of money. But was also doing pro bono work so that takes away from her potential income.\n\nAnd I think it’s only been a year maybe 2, right?  I’d say she’s rounding 3rd base to 100k,  but not there yet.\n\nAnd for the 100k from Lalo, lol I don’t think Kim would seriously consider using that for a large legit investment such as a home.  Too much of a risk.  Especially at that point.\n\nEdit:  I haven’t seen the episode in a while, but if I had to guess, I’d say that was a 400-500k house they were checking out.  At least.","score":1,"comments":[]},{"body":"I’m not sure about the Chuck front. The only thing I can think is that Chuck may have had to pay Rebecca a great deal of alimony and maybe after 2 years his savings was gone. \n\nI feel like Chuck wasn’t broke ever and this is more of a jimmy tactic.\n\nChuck was definitely worth millions due to the firm — but it might not have all been liquid. \n\nAs far as Kim and Jimmy — I never took their house shopping as them looking at a house they couldn’t afford. That has probably would have been at the top of their budget but not impossible.\n\nI think the bigger element to that scene is that Kim and Jimmy just had a pretty big riff in the previous episode and Jimmy’s proposal to fix it with a big house is kind of ludicrous.","score":4,"comments":[]},{"body":"Chuck wasn't as smart as some people seem to think he is. We watch him bumble his way through life for 3 seasons, in which time we see him do nothing but stupid shit.\n\nHe may have had book smarts but he couldn't understand his own emotions.\n\nThe house was a step in their relationship that Kim wasn’t ready for. Money was just an excuse.","score":3,"comments":[]},{"body":"Chuck may be out of money/assets Jimmy knows about and has much elsewhere.  With varying levs of liquidity.  Who here tells their family about everything?  I am close to my family and we talk much and still we barely scratch the surface of eachothers personal financial statements. \n\nIt's been a long time since I watched that part. Am I missing some details that Jimmy knew more?\n\nI doubt he qualified for disability payments.  Not sure how it works there. But here, he would have had too much assets and had to sell off assets first.  He could have his main residence and a cheap vehicle but any investments, retirement funds, pricey items etc over 100,000g would have to go.","score":1,"comments":[{"body":"To claim a disability he would have had to admit something was wrong with himself, which he wasn’t capable of doing.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"doodlery part 2","not_safe_for_work":true,"locked":false,"body":"","score":36,"comments":[{"body":"i fucking love this. Surprised it doesn't have much attention yet.","score":3,"comments":[]},{"body":"I like your style","score":2,"comments":[]},{"body":"These doodles are incredible, especially love Kim’s finger guns one!","score":2,"comments":[]}]},{"title":"Slippin' Jimmy","not_safe_for_work":false,"locked":false,"body":"","score":31,"comments":[{"body":"Wow! This is pretty awesome 🤩","score":2,"comments":[]},{"body":"Jimmy is bigger than his own esteem. \n\nLiterally.","score":1,"comments":[]},{"body":"awesomeee","score":1,"comments":[]}]},{"title":"An attempt","not_safe_for_work":false,"locked":false,"body":"","score":82,"comments":[{"body":"Lol Salamanca","score":17,"comments":[]},{"body":"One of the sketches of all time","score":7,"comments":[{"body":"Should belong in museums","score":3,"comments":[]}]},{"body":"You got his crazy eyes right","score":8,"comments":[]},{"body":"Freddie Mercury?","score":4,"comments":[]},{"body":"Keep at it. You’ll get better","score":6,"comments":[{"body":"Thanks","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"He did NOT wear that shirt at the Live Aid concert","score":2,"comments":[]},{"body":"I dig it.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I see him in the corner of my room when I have sleep paralysis","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The karaoke opening scene in S4Ep10 made me tear up","not_safe_for_work":false,"locked":false,"body":"Just seeing a happy dynamic between Jimmy and Chuck for once, how Jimmy encouraged and supported Chuck, and Chuck was able to let his hair down and be confident in front of everyone. It makes you think about what could have been… It also goes to show how deep in denial Jimmy is about Chuck’s death. He always loved and deeply admired his brother, but he keeps brushing Chuck’s death off like it doesn’t affect him.\n\nAnyway, it’s just such a beautiful opening scene, and very well done.","score":84,"comments":[{"body":"This was my favorite scene in the entire show until jimmy’s confession in the finale stole it","score":19,"comments":[]},{"body":"Yeah same this intro is just heartbreaking. When Jimmy says \"The winner takes it all\" and Chuck says \"And the loser has to fall\".. damn. Best show ever","score":12,"comments":[]},{"body":"[This](https://youtu.be/15_9qtLy7_A) will even tear you up more\n\nps: ONLY WATCH IF YOU’VE FINISHED THE WHOLE SHOW","score":6,"comments":[]},{"body":"I really liked the idea of this scene, but I hated watching it. I just dislike Chuck so much, so seeing him steal the spot light and all just rubs me the wrong way. I do see the beauty and love of it, but I just see him an asshole brother all the time.","score":-3,"comments":[]}]},{"title":"Google \"Oakley and associates\"","not_safe_for_work":false,"locked":false,"body":"","score":317,"comments":[{"body":"That’s actually quite convincing lol","score":41,"comments":[]},{"body":"A hundred cases in 12 years seems like not that many?  Especially if most of them were \"petty.\"","score":16,"comments":[{"body":"Yeah, I mean, I don’t know if anyone who has less than 30-40 cases per year in a lazy cushy job. Usually it’d be a good 100 per year in a city criminal court.","score":2,"comments":[]}]},{"body":"You have 67 tabs open?","score":13,"comments":[{"body":"You don't?","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Better Feed Bill","score":14,"comments":[]},{"body":"Bill trying to pull a Saul.","score":3,"comments":[]},{"body":"I always wondered about all the phone numbers in both shows. They're using the real ABQ area code, how did the show go about doing that?","score":2,"comments":[]},{"body":"Okay this made my day, thanks OP.","score":2,"comments":[]},{"body":"Cool site, but I hate how they make all of these promotional sites images instead of actual HTML pages. Ruins the immersion.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Better Funky Monkey","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[]},{"title":"a drawing of chuck talking to Jimmy before he gets arrested(keep in mind this is my first time digitally drawing so it might look like shit)","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[]},{"title":"Are there better lawyers than Saul in real world?","not_safe_for_work":false,"locked":false,"body":".","score":0,"comments":[{"body":"Luiz Guzman","score":0,"comments":[]},{"body":"I like how Jimmy explained it to Irene Landry... (think it was in \"Alpine shepherd boy\")\n\nIRENE \"I thought all lawyers were idiots...\"\n\nJIMMY \"Oh no, only half of us. The other half, we are crooks !\"","score":0,"comments":[]}]},{"title":"the ending","not_safe_for_work":false,"locked":false,"body":"i feel kinda bad for him. 86 years is totally undeserved.\nedit: 86 years not 89","score":1,"comments":[{"body":"that's why he was only sentenced to 86 years\n. /s","score":3,"comments":[]},{"body":"I love Jimmy as much as the next person, but I don't see how it can be argued it's undeserved. He made his own decisions.","score":3,"comments":[{"body":"I dunno, Walter cooked meth and killed children and he got a happy ending, Jimmy just kinda went along with it and he got a life sentence","score":1,"comments":[{"body":"Walter certainly got a lot of things he wanted in the finale, but died with everyone hating his guts. I guess you can argue that's as happy as he can ask for.\n\n&gt;Jimmy just kinda went along with it and he got a life sentence\n\nOh boy. I'll defer to his own words:\n\n\"So, yeah, I wasn't there when the meth was cooked. I wasn't there when it was sold. I didn't witness any of the murders. But I damn well knew it was happening. I was more than a willing participant. I was indispensable. I kept Walter White out of jail, I laundered his money, I lied for him, I conspired with him, and I made millions. If he hadn't walked into my office that day, Walter White would have been dead or behind bars within a month. And Agent Schrader and Agent Gomez and a whole lot of other people would still be alive. The fact is, Walter White couldn't have done it without me. You got that?\"","score":2,"comments":[{"body":"It’s funny thinking about how pissed off Walt would’ve been with that testimony, too","score":4,"comments":[{"body":"I built this! Me! Me alone! Nobody else!","score":2,"comments":[{"body":"HEISENBERG BLOOD HEISENBERG MONEY","score":1,"comments":[]}]}]}]}]}]},{"body":"Seems appropriate for arguably the second in command of a large violent drug organization. \n\nJimmy is getting the sentence that Juan Bolsa would if Eladio was caught.","score":1,"comments":[]},{"body":"Dummy asked for it so who is the government to disagree lmao","score":1,"comments":[]},{"body":"I agree. I don’t even know how they came up with 86 years, but 20-30 makes more sense to me.","score":1,"comments":[]}]},{"title":"No lawyers?","not_safe_for_work":false,"locked":false,"body":"","score":858,"comments":[{"body":"I know Michael McKean is a probably a really nice guy but I absolutely hate the sight of his arrogant Charles McGill face now.","score":32,"comments":[{"body":"thats when you know the actor did a wonderful job","score":16,"comments":[{"body":"Absolutely! Kevin Bacon in Sleepers is another one.","score":5,"comments":[{"body":"i think the prime example is Skyler, just the pure hate for Anna Gunn is beyond me","score":4,"comments":[{"body":"Hmm. I thought her character was a bit cringey but I never really hated Skyler. I thought her character was believable for the context of the show. It might have been interesting had she gone a bit more Lady Macbeth once she found out but I am happy with what we got.","score":6,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"What's Chuck McGill doing with Kevin Costner?","score":14,"comments":[{"body":"He's about to sleep with him","score":7,"comments":[]}]},{"body":"😂😂😂 Good one!","score":13,"comments":[]},{"body":"They all look so good! Miss them.","score":5,"comments":[]},{"body":"First slide : Better eat at los polos hermanos \nSecond slide : better register at HHM","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Met this lovely man on Saturday, for most people he had a straight face, guess we made him smile","not_safe_for_work":false,"locked":false,"body":"","score":37,"comments":[{"body":"A cosplay from a game as awesome as Bioshock is enough to make almost anyone smile","score":3,"comments":[]},{"body":"I never thought about it, but Bioshock and Breaking Bad work surprisingly well together.","score":1,"comments":[]}]},{"title":"Channeling Saul Goodman for my YouTube videos","not_safe_for_work":false,"locked":false,"body":"Delightfully terrible video production. I think I channel Saul in my on camera personality. Or maybe it's Charlie Kelly. Just sharing for kicks. Like they say, If you can't laugh at yourself...","score":1,"comments":[{"body":"More like channeling the “put your feet up”furniture commercial guy.\n\nSpeak slower — this may require you to condense your script or extend the video.\n\nENUNCIATE — it’s not helpful if people can’t understand you, and if they can’t understand you they will lose interest.\n\nSeriously, speaking clearly is super important and will help a lot.","score":1,"comments":[{"body":"Damn, ok... of all the elements I expected to get negative feedback on - enunciation wasn't one of them. Thanks! ✊️","score":1,"comments":[{"body":"Yeah. That’s why I thought I’d give you some actual advice. I want people to succeed.","score":1,"comments":[{"body":"I mean... I was enunciation the heck out of my words. Maybe it's partly the terrible audio? Lol","score":1,"comments":[{"body":"Clearer audio would certainly help, and some sections are easily understandable. I wouldn’t bother if I didn’t think you could do it. Speaking a little slower will help a lot. Each word needs to be distinct— you often slur words together and it makes it hard to understand.","score":1,"comments":[]}]}]}]}]}]},{"title":"why did kim assume jimmy would leave her?","not_safe_for_work":false,"locked":false,"body":"In the episode where Kim leaves Jimmy, she said he would've pulled the plug on their plan against Howard. She also said that he would've left her and she didn't want that to happen because she was having too much fun. Why did she assume he would've left her? I know their relationship was toxic (to a degree) but Jimmy genuinely loved her and I don't think he would've left her. I've always wondered why she thought that. Any ideas or theories?","score":24,"comments":[{"body":"After the first incident with Lalo he sort of indicates he is planning on breaking up with her in the hotel bc he doesn't want her to get involved/murdered. Asks her to pack. Suddenly kim wants to stay and is trying to pull him back from the ledge. That's when she comes up with the Howard plot. It's kind of subtle. I think a lot of people missed it. \n\nIt's made more confusing by the having fun comment which could be guilt, ignorance of her own internal motivations, idk. I think its a gross misinterpretation to say kim did it FOR fun, the original aim was to stay with him. Bc they're both obsessed with each other due to various psychological issues. We know that Kim probably learned to associate crime/scamming with love from the flashback with her mother. Fun was the bonus.","score":73,"comments":[{"body":"Thank you! I think sometimes people may forget the previous times scamming has been used as a means to keep their relationship together. Most notably the Howard plotting in Something Unforgeable you mention when Jimmy wants to break up...but also when Kim calls Jimmy to scam the guy at the bar into writing a phony check after she wasn't speaking to him following the commercial, and also them becoming close again following the Coushatta scam.","score":18,"comments":[]},{"body":"You know I never looked at it that way. He did mention that he was bad for her and I see what you mean about her reeling him back in. And the flashbacks of her and her mom, their relationship did seem to be based on scamming even though it didn't show a lot of interactions between them. I've watched the show so many times and I didn't put the connection together. She was just as afraid of losing him as he was her.","score":8,"comments":[]},{"body":"The scene when they celebrate their Sandpiper &amp; Howard scam victory by fucking on Jimmy couch is quite revealing. Howard monologue (just before Lalo BANG)  was spot on, a 100%. \"You two are sociopaths, and made for each others: you both have pieces missing.\"","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Because he had already tried to play the \"we need to break up to protect you\" card once. If he knew Lalo was still alive, he'd play it harder.","score":15,"comments":[{"body":"I mean he is not wrong tho, I would done the same if I felt for someone what Jimmy felt/feels for Kim, it's funny to try to guess how Jimmy breaking up with Kim to protect her from Lalo would affect on the creation of Saul Goodman","score":3,"comments":[]}]},{"body":"It has been expressly shown that being a bad girl (when scamming with Jimmy) got Kim aroused. Hence it had a direct impact on their relationship as a whole, including that (ugly) scene when Cliff Main is speaking in the phone about how they won Sandpiper, and they are seen in the background, celebrating their victory and biggest scam by fucking together.\n\nBottom line: the scam fueled Kim relationship with Jimmy to such point that, by season 4 - 5 - 6 it was like a drug to her and a glue holding them together.\n\nRemember the \"Something stupid\" montage. There is no scams during 2003, because Kim is busy with Mesa Verde &amp; pro bono while Jimmy has been disbarred for one year and is only selling phones. So there is no scams, and Kim is 100% honest during this time BUT the montage makes clear they are drifting apart - direction breakup. Kim is proud of her work with Mesa Verde but she is also visibly bored. Something is missing.\n\nAnd then Huell hits the cop with a grocery bag, Coushatta big scam happens: Kim is scamming again, and when the Coushatta scam ends she says to Jimmy with fire in her eyes\n\n\"LET'S DO IT AGAIN.\"\n\nAnd imagine, if Kim gets aroused by scams, how big a scam the Howard one was. Their biggest ever. If that one brutally stops or failed, Kim will be immensely frustrated to such a point, her relationship with Jimmy won't recover.\n\nThat's how I understood her monologue \"BECAUSE I WAS HAVING SO MUCH FUN !\" at the end of \"Fun and games\".","score":8,"comments":[]},{"body":"I don't think he would have left her at all. I think she would have left him if he pulled the plug on the Howard scheme. He provided her an outlet for her ego and superiority complex, and without that he had nothing to offer her. Jimmy lived in constant fear of losing Kim so he leaned further into what she wanted from him. Clearly he was right to do that","score":2,"comments":[{"body":"She was ready to kill a random stranger to save him when she could have fled to safety. I think she actually liked him a little, maybe.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I got that vibe when they visited the Kettlemans together. He just kinda looked at her in disbelief after she got into Betsy. Kim seemed so wholesome in the beginning of the series and I wonder if she had always had the tendency to be dirty like she turned out to be. Like you said, Jimmy provided an outlet for her.","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"bCS easter egg: There is no H in Francesca she is not named after a condiment","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"Please god no","score":1,"comments":[]},{"body":"r/todayilearned","score":1,"comments":[]}]},{"title":"Got meet gus himself at comic con. He was super nice and was signing in a set of los pollos hermanos. Really cool to meet him.","not_safe_for_work":false,"locked":false,"body":"","score":61,"comments":[{"body":"Your photo is…. Acceptable.\n\n(Seriously, you lucky cunt!)","score":8,"comments":[{"body":"Haha. Everything was definitely to my satisfaction.","score":8,"comments":[]}]},{"body":"Unfortunately you weren’t up to pollos standards. He’s gonna kill you","score":6,"comments":[]},{"body":"The one at Liverpool?","score":4,"comments":[{"body":"Yeah!","score":4,"comments":[{"body":"Sweet, I was there too!\n\nI didn’t have time to wait for the photos to start, but I did get him to sign my los pollos hermanos hoodie.\n\nI had lotes of fun meeting him, and I hope you did too","score":3,"comments":[{"body":"I did. It was awesome. Thanks.","score":3,"comments":[]}]}]}]},{"body":"Awesome","score":1,"comments":[]}]},{"title":"what song do you think perfectly described Jimmy McGill","not_safe_for_work":false,"locked":false,"body":"In my opinion it would be I Can't Handle Change by Roar","score":5,"comments":[{"body":"Better Call Saul Theme - Little Barrie","score":9,"comments":[]},{"body":"Darude - Sandstorm","score":1,"comments":[]},{"body":"Jimmy Jazz by The Clash","score":1,"comments":[]},{"body":"The Tide is High - Blondie.","score":1,"comments":[]},{"body":"Shake it Off — Taylor Swift","score":1,"comments":[]}]},{"title":"Lalo","not_safe_for_work":false,"locked":false,"body":"BRO FUCK OFF, Howard just like that? Man that's crazy, I mean amazing this is just... fuck man I'm speechless","score":35,"comments":[{"body":"Said like a true critic","score":25,"comments":[{"body":"Aha...aha u know me😩😩😩","score":3,"comments":[]}]},{"body":"Yeah most people need a minute after that one …","score":9,"comments":[{"body":"Bro i was like wtf, i didn't think he was gonna die just like that outa nowhere, really i didn't want him to die, but damn Lalo was such an amazing character","score":7,"comments":[]},{"body":"I was trying to get caught up on previous seasons while s6 was being released on Netflix weekly (outside the US). His death was spoiled for me on Twitter bc I was only on like epi 2 or 3 of S6 at the time so I was kinda sad but prepared. However, the burial scene literally had me near tears needing a breather.","score":1,"comments":[]}]},{"body":"Namaste","score":6,"comments":[]},{"body":"At least his character went out with a bang","score":5,"comments":[]},{"body":"Howard always lands on his feet","score":2,"comments":[]},{"body":"Yep. Well, was no surprise to me.","score":-1,"comments":[]},{"body":"He's not your bro","score":0,"comments":[]}]},{"title":"Which of you chicaners are telling people you need to watch BB before watching this show?","not_safe_for_work":false,"locked":false,"body":"1. It’s untrue. Everything you need to understand every character’s arc in BCS is given to you by the show.\n\n2. Do you want more people to watch the show or not?","score":0,"comments":[{"body":"2. I don't care.\n\n1. Why would someone want to watch BCS before BB? It's a prequel.","score":9,"comments":[]},{"body":"I watched this show before breaking bad \nAnd I’m glad I did\n\nThat part where Nacho was trying to poison Hector was full of tension \n\nAnd I kept thinking that dude was gonna die","score":1,"comments":[{"body":"Have you watched BB yet?","score":1,"comments":[{"body":"Yeah I’m on my second watch through but this time it’s in Spanish(the og not the Colombian atrocity)","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"I don’t care if people watch the show or not now that it’s over and there’s no fear of it ever being canceled (though I don’t think there ever was). If people want to miss out on the best show of all time, that’s their business.\n\nBut if someone wants to watch it — yes they should watch BB first as it enriches the BCS experience. You can appreciate the challenges and choices the writers made more when you watch it in release order. How it’s really meant to be watch. You don’t need to watch everything in a linear way — people are smart enough to not need a story to be chronological. \n\nAlso I’ve never met anyone who likes BCS and not BB.","score":3,"comments":[]},{"body":"1. okay, but why would someone care when Gus or Mike or Tuco show up. Why would anyone be invested in Gus's building project that isn't explained and goes nowhere, why would anyone give a fuck who this random scientist Gus sees is. Just cause the plot makes sense without breaking bad doesn't mean the direction, pacing, and format do. Plus you miss tons of foreshadowing and callbacks and parallels\n\n2. I don't give a fuck, nebulous other people can watch whatever they want","score":4,"comments":[]},{"body":"Idk man, I, as well as most fans, watch BB first. Because it came out first. Release order is the way things are meant to be seen","score":2,"comments":[]},{"body":"These shows and the movie were meant to be watched in a certain order.  I don’t care how many people watch it, but I want the people that do to get the most out of it.","score":4,"comments":[]},{"body":"Why don’t people just do whatever the fuck they want","score":2,"comments":[{"body":"Jesse","score":1,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"better call saul season 6","not_safe_for_work":false,"locked":false,"body":"can someone please tell me where i can watch better call Saul season 6 for free? no survey or free trial or sign up","score":0,"comments":[{"body":"[removed]","score":3,"comments":[{"body":"[removed]","score":1,"comments":[{"body":"[removed]","score":1,"comments":[]}]}]},{"body":"[deleted]","score":1,"comments":[{"body":"bro trynna scam me that link doesnt even work","score":1,"comments":[{"body":"Sorry I think it just opens with my country ip","score":1,"comments":[]}]}]},{"body":"search up soap2day","score":1,"comments":[]}]},{"title":"Why is Howard explaining the Macallan to Chuck if it is something they \"always did\" after a big victory?","not_safe_for_work":false,"locked":false,"body":"Before he, well you know...spoilers and all...Howard brings Saul and Kim a bottle of Macallan and tells him that he and Chuck always celebrated with Mr. Macallan after a big victory. But after Jimmy is suspended for a year, we see Howard bringing Chuck a bottle and he is explaining why, and how special (and expensive) Macallan is, and making sure Chuck knows it comes out of his end, not out of the general firm money.\n\nIf this was something they ALWAYS did, why would he feel  the need to explain this to him on this instance? There is no way this could be the first time of a tradition that Howard could later describe as something they \"always\" did. Chuck sure as hell never had any more big victories after this moment before he well...you know.","score":2,"comments":[{"body":"Howard wanted to frame his discussion with Chuck as a celebration because its real purpose was to deliver some hard truths to Chuck. Howard wanted Chuck to accept Jimmy’s suspension as a win and move on. The scotch was to certify the hearing as a victory (instead of a humiliating defeat that would require Chuck to retaliate).","score":6,"comments":[{"body":"I'm not asking why he brought the bottle to Chuck in the first place. I know he was trying to paint the 1 year suspension as a victory even though it was obvious Chuck would not see it that way. But none of that explains why he was obviously explaining WHAT Macallan even is, how much it costs, and that \"don't worry...it is coming out of my end.\" if that was truly something they \"always did\". If that was some tradition that they have had for all big victories (Meaning going back several years to at least before Chuck left the firm), then Chuck knows what Macallan is, knows what it costs because surely it is not always Howard being the one that buys it, and also knows that it is a personal luxury expense.\n\nThe bottom line is, it is very obviously a continuity error. The writers remembered the scene with the Macallan and wanted to do a call back to it in Howard's last scene, but didn't actually go back and WATCH that scene again and forgot that that scene clearly showed that this was the first time Howard and Chuck shared a Macallan, and almost certainly the last since Chuck wasn't around much longer. \n\nThey could have easily just had Howard tell Saul and Kim in that scene that he brought the bottle of Macallan over because he \"once brought one to share with his brother Chuck\" WITHOUT saying it was something he ALWAYS did. The callback would have been the same, but without the continuity error.","score":1,"comments":[{"body":"I guess I didn’t think it was something Chuck and Howard always did. I figured it was something they just did that once, when Howard tried to get Chuck to drop the vendetta against Jimmy. Howard wasn’t going to want to explain that actual context during his confrontation with Jimmy and Kim, but the bottle was the perfect prop to let them know he knew what they did and why they did it.","score":1,"comments":[]}]}]},{"body":"They usually drink regular Macallan. That night Howard bought him a 1966 Macallan, which cost something like $35k iirc, as opposed to their usual $80 bottle. Howard brought him the very best bottle of their shared drink to try to cheer him up.","score":1,"comments":[]}]},{"title":"Jimmy pushed the fuck out of this car and I find that hilarious. That’s all. Have a good day.","not_safe_for_work":false,"locked":false,"body":"","score":17,"comments":[{"body":"I love a good used beater car. To me it has so much more character than newer cars.","score":3,"comments":[]},{"body":"What kind of car is it?","score":2,"comments":[{"body":"It’s an import!","score":4,"comments":[]},{"body":"Suzuki Esteem. Idk if I spelled that right.","score":3,"comments":[]},{"body":"https://hiddenremote.com/2015/04/17/better-call-saul-jimmy-mcgill-car/\n\nOK to answer my own question. \n\nNever knew they put so much thought into it! Should have known they would.  Awesome!","score":1,"comments":[]}]},{"body":"Love it!","score":2,"comments":[]},{"body":"It’s worth $500 as long as the $300 hooker is in it!","score":2,"comments":[]}]},{"title":"If Cartoon Network made Better Call Saul","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[{"body":"This should have been Slippin' Jimmy","score":3,"comments":[]}]},{"title":"every shot is akin to a painting. a masterclass in cinematography","not_safe_for_work":false,"locked":false,"body":"","score":2834,"comments":[{"body":"MMMMMM\n\n\nFILL ME UP, CHANDLER","score":365,"comments":[{"body":"Put it in me","score":63,"comments":[{"body":"YOU'RE SO BIG.","score":25,"comments":[]}]},{"body":"i forgot how fucking hilarious those clients were","score":102,"comments":[{"body":"Yeah, this guy and the dude who tried to pay Jimmy in Monopoly money always crack me up","score":89,"comments":[{"body":"Bob kills it, as always, and the actors playing the loony potential clients sell their parts incredibly well","score":35,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Toilet POV shot is the best shot in the History of Cinematography","score":173,"comments":[{"body":"Greatest fecal mind I ever knew.","score":92,"comments":[]},{"body":"Imagine they went with this shot when Hank figured out Walt was Heisenberg.","score":30,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Yes, these shows have some absolutely amazing camerawork.","score":102,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Did Gus Know Lalo Before he Came North?","not_safe_for_work":false,"locked":false,"body":"When they first meet on screen, Lalo tells Gus “I’ve heard a lot about you” and we can easily tell he knows exactly who Gus is because of the pretend while eating the chicken. Are we ever shown whether Gus knew/knew of Lalo’s existence before he came north?","score":1,"comments":[{"body":"Lalo was sent north to replace Hector. he would have been briefed by other members of the cartel about  who  was operating  in ABQ.Gus would know who were the main players, but may not have met them","score":1,"comments":[]}]},{"title":"Saul goodman is bellow parking ticket policies","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"Jimmy knew he had to hire Mike the second he found out he's the only person in the entire universe who's immune to his bullshit","score":1,"comments":[]}]},{"title":"ok this probably not a good idea but does anyone have telegram link for better call saul?","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[]},{"title":"Two things I don't like about BCS so far","not_safe_for_work":false,"locked":false,"body":"Lalo climbing through the ceiling so so unbelievably stupid my jaw hit the floor. \n\nAlso, how did gus pick up mike so soon after he got stabbed?","score":2,"comments":[{"body":"The Lalo one would be stupid if it was anyone else but Lalo, that man is nothing but charming so he’s forgiven","score":6,"comments":[]},{"body":"In fairness, the Lalo climbing through the celling is based on someone doing that in real life. That fast? Probably not.","score":5,"comments":[{"body":"I really wonder if they did it on ceiling tiles though because that fact alone is absurd. Those would bust out under the weight of a full grown man","score":1,"comments":[]}]},{"body":"Gus was having Mike followed","score":2,"comments":[{"body":"my only problem with that is mike didn't see them despite noticing other people following him in the earlier seasons?","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Lalo is an almost supernatural character. Kinda reminds me of Micheal Myers knowing how to drive.","score":2,"comments":[]},{"body":"The cartel scenes require a ton of suspension of disbelief (a fully grown human crawling around on ceiling tiles?) but the lawyer stuff, the relationships between Jimmy and Kim/Chuck/Howard, is incredibly deep and well thought-out.","score":1,"comments":[{"body":"you basically provided an description to my posts lol \n\nmy thoughts exactly","score":1,"comments":[]}]},{"body":"Though, the absolute hilarity of the Lalo roof drop scene helps with how unrealistic it is.","score":1,"comments":[]},{"body":"&gt;Lalo climbing through the ceiling so so unbelievably stupid my jaw hit the floor.\n\nIt's based on an incident that happened in real life.\n\nIt is similar to The Wire's &gt;!Omar leaping from the roof. That actually happened to the real life Omar. ONLY IT WAS HIGHER UP!!&lt;\n\n&amp;#x200B;\n\n&gt;Also, how did gus pick up mike so soon after he got stabbed?\n\n1. Gus' men followed him with the gas cap tracker most likely. As Gus has been known to do.\n2. It is possible that Gus may have orchestrated the attack on Mike to get him to continue working for him. I wouldn't put it past Gus.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"Is there anything you'd change?","not_safe_for_work":false,"locked":false,"body":"Is there anything you'd change about the ending of the show if so what would it be? For me I said on a post here earlier that I would of liked jimmy and Kim to end up together somehow.","score":1,"comments":[{"body":"Nope, not a thing.","score":3,"comments":[]},{"body":"I would take out the better call Saul bus chant","score":4,"comments":[]},{"body":"Adding a post credit scene with the camera going into a bar somewhere and finding Patrick Kuby sitting at the counter having a whiskey while the news of Saul being convicted is playing in the background and him, without looking at the TV going \"It sure was a wild ride...\" and then taking a sip.\n\nJust joking, I wouldn't change anything, I'm sorry Bill Burr couldn't make it into BCS though.","score":2,"comments":[]},{"body":"Kim would be naked","score":3,"comments":[]},{"body":"He should have taken the 7 years. Taking 86 just for forgiveness was pointless. I think if he took 7 he could have reconciled with Kim and not spent the rest of his life in jail, and I still believe he would have gone back to being “Jimmy” as opposed to “Saul”. But spending his whole life in jail- that’s all there is for him now. And Kim risked a lot pretending to be his lawyer to even see him, so they probably won’t see each other again for some time, if ever.","score":2,"comments":[]},{"body":"Id love for Lalo to live, but honestly death is the perfect ending to a character like that.","score":1,"comments":[]},{"body":"I was disapointed when I found out that when Gene rips down the flyer it was not a real scene in the show. I loved the idea that Jimmy and Kim manage to see each other one more time and Jimmy convinces Kim that she should be the one to turn him in for the reward money so she can finally start that pro bono practice she always talked about.","score":1,"comments":[]},{"body":"It is a minor thing and the ending it perfect, but I would have liked in the flash forward where we see Jimmy working in prison the prisoner he was working with to call him Jimmy. Like I know he will be safe in prison and all the prisoners love him, but it makes sad thinking that only Kim (and us the viewers.) know Jimmy as Jimmy. To everyone else he is Saul Goodman, the criminal lawyer.  \nAlso I really wanted the shoplifter girl from the season 4 finale to appear to help Jimmy. I think it would have been sweet if she represented him.","score":1,"comments":[]},{"body":"I’d like to see Kim’s finger gun back to Jimmy","score":1,"comments":[]},{"body":"In a way Jimmy and Kim kinda did end up together. Not physically — but they’re back in each other’s lives again.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Season 6? I have AMC but it’s not on the app or on demand?","not_safe_for_work":false,"locked":false,"body":"In the US how can I watch season 6? My husband is doing his first watch through, I watched it on AMC weekly when it aired and I assumed it would be on the app with our cable subscription, logged in but it’s not there and also not on-demand on cable (Cox) for some reason? What is this chicanery!","score":4,"comments":[{"body":"Same here, watched season 6 on movielair.cc worked well","score":1,"comments":[]}]},{"title":"The respect he always wanted..","not_safe_for_work":false,"locked":false,"body":"I’m throwing a spoiler alert because I am specifically talking about the finale. If you haven’t watched the finally yet, \n\nYe be warned.\n\nI feel like most people focus on the Jimmy\nAnd Kim aspect of the finale, and for good reason. The symbolic light of their ever burning love was poetic, enchanting and just beautiful all around. But I think more centered to the story, the most cathartic part of the ending was that he took a different route from his counter-parts, he took his own advice, faced the music and finally found the adoration in prison that he always longed for. \n\nChuck looked down on him, Howard was constantly a reminder of everything he wasn’t, and even when he was successful and rich, Mike bullied him around, his receptionist rolled her eyes at him and Walt and Jesse constantly reminded him how sleazy and insignificant he was.\n\nBut in prison, he was Saul Fucking Goodman. All of those voices from his past were gone, the love of his life was back, and people chanted his name as he entered the room. \n\nEven when rich, I believe Saul would have traded every shiny nickel he had, just to receive the adoration he will eventually get, once he finally stopped running from himself and accepted his fate. \n\nBetter Call Saul is an epic poem of modern story telling. And if you can’t tell, I am a HUGE admirer.","score":9,"comments":[{"body":"You have an interesting perspective, however I think that it's actually pretty pathetic that Jimmy is truly enjoying the approbation of a bunch of criminals who know nothing about him except that he's an immoral lawyer who often helped terrible people get away with various crimes. In his life, Jimmy had plenty of chances to win the respect of others, but because of his own actions, he lost those chances. Longing for adoration is not a good thing either. \n\nI love BCS too, nonetheless I must admit that I'm not such a big fan of the ending. Could've been worse, but definitely could've been better imo.","score":1,"comments":[]},{"body":"I thought of it as a kind of a mixed blessing, it assures the audience that he won't be shanked or... otherwise hurt by the other inmates, but it's also a reminder of his past even when he is trying to move on.","score":1,"comments":[]}]},{"title":"It finally came!","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"I MUST own this!!! 😲","score":4,"comments":[]},{"body":"Awesome","score":3,"comments":[]},{"body":"I ordered one many months ago and nothing yet, how long did yours take?","score":3,"comments":[{"body":"i ordered this 6 months ago so like 6 months","score":3,"comments":[]}]},{"body":"Nice! Finally got mine yesterday too.","score":2,"comments":[]},{"body":"AHHHHHHHHH I WANT IT!!!!!","score":2,"comments":[]},{"body":"I’m glad you posted the 2 worst photos","score":0,"comments":[{"body":"wtf do you want from me im not a photographer","score":2,"comments":[{"body":"Lol you could have put them on a desk to get the whole shot instead of them getting cropped out","score":0,"comments":[{"body":"fair","score":2,"comments":[]}]}]}]}]},{"title":"BUT WAIT, THERES MORE!","not_safe_for_work":false,"locked":false,"body":"","score":81,"comments":[{"body":"guns named finger","score":1,"comments":[]}]},{"title":"Why did Lars and Cal try to poison Tuco’s Abuelita?","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"r/Okbuddychicanery leaking again","score":9,"comments":[]},{"body":"Do you really think the FBI would hire those two flaquitos?","score":7,"comments":[]},{"body":"A lawyer you can trust saved the day.   Well minus a broke leg.","score":3,"comments":[]},{"body":"They... didn't?","score":3,"comments":[{"body":"Yeah, its why the title says they “tried” to. They didn’t succeed.","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"The actual shitpost is dumb and makes no sense but I'm loving the followup comments here","score":1,"comments":[]},{"body":"What do you think disrespect means?","score":1,"comments":[{"body":"Dis = dispatch\n\nr = ricin\n\nespec = epic\n\nt =troll","score":5,"comments":[]},{"body":"I don’t know i don’t speak spanish","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"What are some moments that you didn’t like on first watch but grew on you later?","not_safe_for_work":false,"locked":false,"body":"For example, I really disliked the Black and Blue cold open when it first aired. I thought it was superfluous and kinda pretentious. Seemed like they were just doing an artsy cold open for the sake of being artsy. Watching it now though, it’s actually a pretty touching tribute to Werner, something we hadn’t really gotten at that point. It’s also a pretty subtle but effective foreshadow of where Lalo shows up later in the episode.\n\nAny moments like that for you?","score":5,"comments":[{"body":"Season 1. I won't say I didn't like it, but I never truly realized how good it was until my first rewatch","score":3,"comments":[{"body":"People are always talking about Mijo, Five-0, and and pimento, but forget Uno, Rico, and Marco","score":1,"comments":[]}]},{"body":"Fun and Games time skip. Initially thought it was rushed and jarring, but then I realized that was point, now it's one of my favorite moments.\n\nI never hated Nippy but it has aged very well with episodes that came after in mind.","score":1,"comments":[]},{"body":"Pretty much the entire show is much better in retrospect","score":-1,"comments":[]}]},{"title":"I still can't get over the fact that those scenes are from the same show","not_safe_for_work":false,"locked":false,"body":"","score":894,"comments":[{"body":"For Breaking Bad:\n\n&gt;!Walter shouting at Jesse to get off the toilet!&lt;\n\nand\n\n&gt;!Skyler telling Walt to bring back Holly!&lt;","score":246,"comments":[{"body":"God, that scene of her running after the car is so hard to watch. Anna can ACT.","score":153,"comments":[{"body":"I sat here for a minute trying to figure out what ACT stood for i am so stupid","score":57,"comments":[{"body":"Air Conditioning Temperature 💕","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"End of 6x03: &gt;! Nacho shoots himself in the head !&lt;\n\nBeggining of 6x04: &gt;! Jimmy appears dressed up as Howard even with a fake tan !&lt;","score":193,"comments":[]},{"body":"Right after Nacho was killed I thought of the showdown scene between Howard and Chuck in season 3 and felt like the BB Universe was not just a couple TV shows it felt more like an incredible novel","score":80,"comments":[]},{"body":"I always get that feeling when im watching scenes with the kettlemans or cliff or schweikart etc in them (mostly the side characters), contrast to like gus cutting victor's throat in the lab or walt killing the nazis. These are just examples\n\nAnd yes - those are from different shows but they share the same universe. Its bizarre","score":46,"comments":[]},{"body":"Mmm, give it to me, Chandler.  You're so biiiig!","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The second Tuco didn’t kill those two guys in the second episode I realized this show was going to be far lighter than BB. And it kinda was, we still got bloody deaths in the last season but even in the last episode there were lots of comedic bits.","score":44,"comments":[{"body":"The worst death of both shows is still in Better Call Saul IMO. Howard's death is just so fucking horrible and shocking","score":82,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Kid Named Middle Finger 🖕","not_safe_for_work":false,"locked":false,"body":"","score":249,"comments":[{"body":"Kid named fuck you","score":10,"comments":[{"body":"Kid named you:","score":4,"comments":[]}]},{"body":"He manages to make it look like not his middle finger somehow","score":6,"comments":[]},{"body":"Land of","score":2,"comments":[]},{"body":"Here's what's gonna happen: I'm going to take this finger and shove it way up your ass.","score":2,"comments":[]},{"body":"Land of finger","score":2,"comments":[]},{"body":"Yea, why?","score":1,"comments":[]},{"body":"Land of fingers.. 4 hands","score":1,"comments":[]}]},{"title":"The New Kettlemens!","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Didn't I see that guy in a primus video some years ago?","score":1,"comments":[]}]},{"title":"Most overlooked scene in BCS?","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"You have to give it to Jimmy though, he came up with a way to make money off that thing in a heartbeat! Not his fault Roland was too insulted to see the potential. 🤭","score":4,"comments":[]},{"body":"Makes one wonder how many takes had to be done, before the actors could hold the laughter in long enough, in creating that comic masterpiece.","score":3,"comments":[{"body":"Yeah, seriously","score":2,"comments":[]}]},{"body":"This scene is gold! 😂 I know a lot of people talk about the first couple seasons of BCS having a different tone than the later seasons, which is true of course, and I think the last couple seasons are probably the best, but I thoroughly enjoy the first seasons as well. They're less high-stakes and we haven't had a chance to know and care about the characters like we do by later seasons, but I found them incredibly compelling and entertaining in their own way.","score":3,"comments":[]},{"body":"\"Hey buddy, you're the one with the sex toilet.\" Oh God. Bwahahaha.","score":1,"comments":[]}]},{"title":"You think this is bad? This doodlery? He's done worse.","not_safe_for_work":false,"locked":false,"body":"","score":605,"comments":[{"body":"JIMMY WITH A LAW DEGREE IS LIKE A CHIMP WITH A BALL POINT PEN","score":70,"comments":[]},{"body":"The Saul caricature is so simple but so perfect, you can instantly tell who it's supposed to be.","score":50,"comments":[{"body":"Hahaha thank you ❤","score":15,"comments":[]}]},{"body":"This is up to Los Pollos standards","score":32,"comments":[{"body":"It's way more than \"acceptable\"","score":12,"comments":[]}]},{"body":"i love your doodle style, it looks so good","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Something Stupid split screen scenes were amazing.","score":11,"comments":[{"body":"that scene lives in my head rent free","score":6,"comments":[]}]},{"body":"Werner Ziegler u ever heard of that guy","score":9,"comments":[]},{"body":"ZIEEEEEEEEGLER\nWhat’s he up to man? What’s he doing?","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"If you had to describe Chuck McGill in one word how do you do it?","not_safe_for_work":false,"locked":false,"body":"","score":766,"comments":[{"body":"Hedefecatedthroughthesunroof.","score":317,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Sanctimonious","score":349,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Bitter.","score":619,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Crazy","score":232,"comments":[{"body":"HE IS NOT!","score":147,"comments":[{"body":"He KNEW he switched those numbers!","score":105,"comments":[{"body":"He KNEW it was 1216, one after magna Carta!","score":80,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"i do the most obvious : chicanery","score":777,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Dead.","score":178,"comments":[{"body":"Roasted","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This show is a masterpiece. But where is the rest?","not_safe_for_work":false,"locked":false,"body":"I watched the show on Netflix but where’s season 6? I’m dying to see it.","score":18,"comments":[{"body":"The 6th and final season finished airing on cable over the summer. It’s probably going to be another year at least before it’s available on Netflix.","score":19,"comments":[{"body":"Daammmnn so there’s no way to see it online?","score":1,"comments":[{"body":"You can buy it on Amazon for cheap. 1000% worth it.","score":11,"comments":[{"body":"Will do thank you","score":2,"comments":[{"body":"I think it’s on sale on iTunes right now","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"you can pirate it","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"[deleted]","score":3,"comments":[{"body":"Here before your words disappear","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"\\- Where's the rest? Season 6, Skyler, where is the rest??","score":2,"comments":[]},{"body":"buy it on amazon or pirate","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"HHM Pens?","not_safe_for_work":false,"locked":false,"body":"Hello! My brother absolutely loves this show and I was getting him birthday gifts of little trinkets related to it, however I cannot for the life of me find the holy grail, an HHM pen.\n\nI was wondering if anybody knew where a guy could find an HHM pen? I only find stickers.\n\nAny tips would be greatly appreciated!!","score":6,"comments":[{"body":"Find a local office supplies or stationary store and ask if they'll custom make them. Worst case scenario you could \"research\" a logo and upload it to vista print and probably order some from there","score":3,"comments":[{"body":"Thanks for the advice, I'm looking into that now!","score":1,"comments":[]}]},{"body":"I would love a \"Better Call Saul\" pen","score":1,"comments":[]}]},{"title":"get in the eva jimmy","not_safe_for_work":false,"locked":false,"body":"","score":94,"comments":[{"body":"‘If I'd known it would have ended up like this, I would have changed the carpet like Walter Jr. suggested.’","score":7,"comments":[]},{"body":"I hope Finger doesn't see this. His heart will be broken.\n\n\"Waltuh, why would you do this to me, Waltuh\"","score":10,"comments":[{"body":"This is the moment Waltuh \" Broke bad \" to Me . Just because Finger said \" not right now\" he did this","score":7,"comments":[]}]}]},{"title":"How can I watch season 6 in Canada?","not_safe_for_work":false,"locked":false,"body":"Season 6 isn’t on Netflix here and I don’t wanna wait forever for them to add it. Haven’t been able to find any other way to watch it. Anyone know how?","score":1,"comments":[{"body":"Amazon Prime.","score":4,"comments":[{"body":"It’s not on prime ( which has AMC+) it was removed","score":1,"comments":[{"body":"I just finished watching it on prime","score":1,"comments":[]}]}]},{"body":"You can buy the season off YouTube for $30 or just wait till it comes onto Netflix. BB only took 5 months after it ended so maybe BCS will show up January or February.","score":2,"comments":[]}]},{"title":"Season 6 ep 3","not_safe_for_work":false,"locked":false,"body":"Just finished the episode “rock and a hard place”\n\nHad to stop for the rest of the day because I am now in pain","score":9,"comments":[]},{"title":"Nacho study","not_safe_for_work":false,"locked":false,"body":"","score":72,"comments":[{"body":"Yassified Nacho","score":26,"comments":[]},{"body":"Nacho will never slay!\nThe Nacho in question:","score":15,"comments":[]},{"body":"Slayyyy","score":4,"comments":[]},{"body":"I thought it was Prince.","score":2,"comments":[]},{"body":"Too much chin. Nacho rocks just a bit more chin line than the Geico Gecko.","score":1,"comments":[]},{"body":"Na-chad","score":1,"comments":[]},{"body":"Queso","score":1,"comments":[]},{"body":"nacho looking majestic","score":1,"comments":[]},{"body":"Not yours, either","score":-4,"comments":[{"body":"This is my art lol- I can show proof if you really want. If it's about the signature check my profile-","score":7,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Where to watch","not_safe_for_work":false,"locked":false,"body":"S6?  I just finished S5 on Netflix, but searched and can only find the \"purchase\" option on Amazon?  Why would it not be on AMC streaming?  I have that through Amazon?  Isn't this their show?","score":1,"comments":[{"body":"AMC didn't produce the show, they just licensed the broadcast rights from Sony Pictures Television. So they only had a narrow window of time in which they were licensed to stream the show—whereas with a show they produce themselves, like *The Walking Dead*, they can keeping streaming the whole series indefinitely.","score":6,"comments":[]},{"body":"It will come on to Netflix soon enough. BB S5 only took 5 months after the last episode aired. So January/February probably.","score":1,"comments":[]}]},{"title":"Heisenberg 😎","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[]},{"title":"bcs ending is absurdly sad","not_safe_for_work":false,"locked":false,"body":"I remember thinking the ending of breaking bad was sad when I watched it (I still think it's a little sad) but after I saw \"Saul Gone\" that changed \n\n\nJimmy just wanted someone who cared about him, Chuck despised him for being dearer to his parents, Walt treated him like absolute trash, Mike looked down on Saul at times, Kim was the only that really care about him\n\n\nNow Jimmy is away from kim forever and will die in prison, this ending completely devastated me","score":149,"comments":[{"body":"Kim was the only person he loved, and the only person who loved him. Fessing up and taking responsibility was him apologizing for what he'd done to her, to himself, and to their relationship. I found it more bittersweet than outright sad. I found it sort of beautiful that he sacrificed himself to say sorry. Kim saw it, and she forgave him.","score":137,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I just rewatched this for the first time. The line after “80 years?” killed me. He says: “well, with good behavior…” and they just smile and look down. It broke my heart both times and I’m still thinking about it. That small hope in him is still there, but how long can it last?","score":37,"comments":[{"body":"guess no hope, just a joke","score":7,"comments":[]}]},{"body":"It was beautiful, sad, and perfect. One of the best endings to a show of all time","score":99,"comments":[]},{"body":"For what it’s worth, it seems he’s well loved in the prison. He spent years looking after the worst of the worst, and in return he earned their respect, something he seldom got working with the lawyers of his past. You could see it as him being dropped into a cesspit of degenerates, or you could see it as him being out in a place where he’s finally accepted for who he is.\n\nAlso that last episode really reminded me what a jerk Walt was as a person. Arrogance had consumed him till the very end, whereas Jimmy ended up humbling himself.","score":39,"comments":[{"body":"This is an important point. Jimmy/Saul may have ended up being a “*criminal* lawyer,” but he was still really good at his job. He effectively defended his clients against the criminal justice system and treated them like normal people no matter what they’d done or what they looked like, and they respected him and were grateful to him for it. He never really stopped being Jimmy: that part of him that would have been perfectly happy doing elder law the rest of his life never left, he just put it away to perform as Saul.","score":9,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"But remember that he had lost her already. She left him because they brought out the worst in each other, and then he had become nearly unrecognizable to her in his unhealthy way of coping with the trauma and grief by fully embracing the Saul Goodman persona. It was inevitable that he would get caught eventually with his inability to stay \"clean\" and lay low. Then it became a question of either cheating the system to get a light sentence, or admitting everything and going to prison for the duration. And by admitting everything he had done, though they still couldn't be together, he again became a man Kim could enjoy a cigarette with, as they had used to do. That ended up being worth everything to him.\n\nIt's actually really romantic when you think about it.","score":19,"comments":[]},{"body":"Saul deserved a happy ending","score":6,"comments":[]},{"body":"Great ending but see me i would’ve took that 7 year plea deal and sent Kim a “I’m sorry” letter and kept it pushing","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I still sometimes can't believe he ended up in prison. I think it was the best ending honestly but especially rewatching scenes it's hard to think about what will eventually happen.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Did You Know?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[]},{"title":"I legally graffitied this stencil today.","not_safe_for_work":false,"locked":false,"body":"","score":41,"comments":[]},{"title":"These Edits NEED to be SEEN!","not_safe_for_work":false,"locked":false,"body":"I found these two edits on YouTube and you guys have got to check them out. They're so well done. \n\n[https://www.youtube.com/watch?v=4mkkIdR4eLk](https://www.youtube.com/watch?v=4mkkIdR4eLk)\n\nBravo souvlakid.","score":1,"comments":[]},{"title":"Breaking Bad Season 2 Extra: Minisode 02 Better Call Saul - Better Help ...","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[]},{"title":"Why didn’t Jimmy just play video games to cope","not_safe_for_work":false,"locked":false,"body":"Discuss","score":221,"comments":[{"body":"He’s more of a humanities guy.","score":169,"comments":[]},{"body":"Devil may cry 5 wasn’t out yet","score":123,"comments":[{"body":"lol never thought I’d see DMC talk here","score":15,"comments":[{"body":"You think this is bad? This GUNTRICKSWORD?","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Because only a nerd would choose video games over banging hookers and facilitating organized crime.","score":73,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"or Go-karting","score":44,"comments":[]},{"body":"He’s got bad knees","score":28,"comments":[]},{"body":"You think that's gonna keep him away from his scamming fetish??? Dude would have absolutely killed it in runescape.\n\nHell, runescape is where I first learned about the \"you're buying I'm selling\" scam. Someone would say \n\n\"Buying [obscure item], 100k each\"\n\nSomeone else would be spamming\n\n\"Selling [obscure item], 30k each\"\n\nI only realized it was a scam by sheer luck because I happened to already have that obscure item. As soon as the buyer wasn't interested in buying it from me for way over market value, I put 2 and 2 together.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"For some people, life is the only video game worth playing","score":15,"comments":[]},{"body":"This sub is now r/okbuddychicanery","score":84,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I think Chuck might actually be my favorite character. [spoilers up to S3E10]","not_safe_for_work":false,"locked":false,"body":"This isn’t to say that Chuck is a good person or likeable or anything like that. But everything about the character, from the writing to the acting, is just incredible.\n\nRight off the bat, I love the brother dynamic between Chuck and Jimmy. They definitely feel like brothers with a complex history. Chuck was the better behaved kid, but Jimmy was the golden child. Nothing Chuck did could change that. Jimmy could steal from the store, and he was still the favorite because he just had people skills that Chuck lacked. Chuck was smarter and worked harder and followed the rules growing up, but Jimmy had more charisma so it didn’t matter.\n\nThe Chicanery speech is fantastic because it’s true. Chuck was scummy in trying to keep Mesa Verde as an HHM client, but Jimmy went to insane lengths to make Chuck look horrible. Chuck losing his shit at the Mesa Verde meeting on him, but he was still right. The papers he had said 1216. Jimmy did switch the numbers, he did get the kid at the copy store to lie for him. He cut corners to get what he wanted at full disregard for how it would affect others. Talking yourself up to retain a client that a former employee got for you is a bit gross, what Jimmy did was on another level. But at the end of the day, Jimmy’s charisma won again.\n\nAnd this isn’t even getting into the way this show portrays Chuck’s mental illness. So much of the time, the person freaking out about electricity is some homeless drug addict who society looks down on. Instead, Chuck is a smart and well respected individual. When he talks about how people didn’t know what AIDS was, he doesn’t sound crazy, he sounds like he has put serious thought and research into why it isn’t a diagnosis yet. When he’s in the hospital, the show makes his pain feel real. And his final breakdown in Lantern is done so well and so real. How it escalates from needing to turn off the breakers to tearing the walls apart trying to find the source that he believes is hurting him is done excellently.\n\nI could probably write be an hour long video essay about the character and I still wouldn’t be able to cover everything. It’s all done incredibly well, and while season 6 is my favorite, the show took a heavy hit with the loss of one of the greatest legal minds Howard knew.\n\nTL;DR Chuck was a horrible person but a fantastic character, you can’t change my mind.","score":34,"comments":[{"body":"His relationship with Jimmy is absurdly well written.","score":8,"comments":[]},{"body":"&gt;TL;DR Chuck was a horrible person but a fantastic character, you can’t change my mind.\n\nI think people confuse unlikeable with horrible. In the world of Breaking Bad, I really can't equate Chuck to people like Walt, Saul, Gus, Todd, Lydia, Hector, etc.\n\nChuck was intentionally made to be unlikeable because he was the antagonist to Jimmy. Much like how early Hank was to Walt. Like how Howard initially was before Chuck took that role. \n\nBB/BCS is a story from a villains perspective. The antagonist to a villain is a usually a hero.","score":9,"comments":[{"body":"I don’t think I would call him a hero, although if I were to reword it I meant more of horrible brother. I think he did enough negative outside of his relationship with Jimmy though that I don’t think I could call him a good person. Like I don’t think a good person essentially bankrupts their place of employment because they were asked to leave. But he’s definitely nowhere near as bad as the other villains of the show.","score":5,"comments":[{"body":"&gt;I don’t think I would call him a hero\n\nIf Chuck was successful in disbarring Chuck, the events after Season 3 don't happen.\n\nPeople like to point out that Chuck was responsible for Jimmy being bad by not letting him into HHM, but forget that Chuck getting Jimmy successfully disbarred accomplishes the same thing.\n\nIf Hank stops Walt soon enough, the actions of the series would not have happened. If Chuck stops Jimmy, the actions of both series never happen.","score":2,"comments":[]},{"body":"&gt;I meant more of horrible brother. \n\nI think that goes both ways. Jimmy is a horrible brother to Chuck as well. The only reason that Jimmy is taking care of Chuck is to fulfil the debt of Chuck saving him from jail time. Would Jimmy ever have even spoke to chuck anymore if Jimmy did not get into trouble? Chuck was in New Mexico and Jimmy was living the life of a scam artist. They had not seen each other for some time prior to that moment. \n\nThe tragedy of the McGill brothers is that they both had mutual jealousy of each other.","score":2,"comments":[]}]},{"body":"I really can’t equate Saul to the likes of Lydia, Gus, Hector, Walt and Todd either though","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I love and enjoy seeing posts like this. Thank you.","score":3,"comments":[]},{"body":"I agree with pretty much everything that you said, but I don't think that Chuck was actually a \"horrible person\", especially not compared to the other important characters in the BB/BCS world.","score":2,"comments":[]},{"body":"&gt; TL;DR Chuck was a horrible person but a fantastic character, you can’t change my mind.\n\nI wouldn't want to, because you're right\n\nThe issue is a lot of mfs on this sub believe he was a good person","score":3,"comments":[]}]},{"title":"Season One Episode One. If Jimmy had the right amount of stickers he would’ve left right away, he might never have hit the skateboard kids and never would’ve ended up at Tuco’s house. 🧐","not_safe_for_work":false,"locked":false,"body":"","score":3127,"comments":[{"body":"Some people tend to get their ass in trouble one way or another. And I'm pretty damn sure Saul is that type of a character.","score":777,"comments":[{"body":"“Kim you don’t know these assholes like I do. Rain or shine, these morons will be out there doing stupid shit and getting arrested for it”","score":202,"comments":[]},{"body":"This is a constant in the BrB and BCS universe. Saul and Walt are given outs repeatedly and choose to partake.\n\nWalt because of his ego, and Saul because of his addition to scamming/tricking people. MFers should have just gone to therapy.","score":153,"comments":[{"body":"That’s one of my favorite things about the shows.  When I heard the initial concept for BrBa it was easy to sympathize with Walt and feel like he was doing what he had to, but extremely early on it was made real clear he had other options.","score":86,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Mike and Jimmy bickering over stickers was so funny.","score":260,"comments":[{"body":"Just the two of them together in general and their banter was always great!","score":88,"comments":[]},{"body":"\"You're like a troll under a bridge. You must have the stickers or you won't pass!\"","score":81,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"“… And thank you for restoring my faith in the American Justice system.”","score":130,"comments":[]},{"body":"I can't believe they made him give his windbreaker back.","score":70,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The cinematography in this show is too fucking good","score":57,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Chuck trying his best","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[]},{"title":"Gene was found in December 2010","not_safe_for_work":false,"locked":false,"body":"Meaning he at-least would’ve been able to finish Breaking Bad Season 3, do you think Gene would’ve liked Breaking Bad, also is it possible he could’ve watched the rest in jail?","score":6,"comments":[]},{"title":"S4/E10: This was possibly one of the saddest scenes in the show.","not_safe_for_work":false,"locked":false,"body":"","score":410,"comments":[{"body":"Rewatching these eps makes me real emotional. Somewhat nostalgic too. Pure art tho","score":91,"comments":[{"body":"It really does make me nostalgic. This show feels like such a big part of my life for the years I spent watching it","score":24,"comments":[{"body":"Exactly the same for me. The show ending for me was like someone that a part of me is leaving and Im sad cuz It ends but also glad that it ever happened.","score":9,"comments":[]}]}]},{"body":"Chuck’s suicide was worse in my opinion. He genuinely believes there is nothing left in life for him. He had everything he could’ve ever wanted and then it was stripped from him, and he could never have it again, in his eyes. As always there’s still so much more to life and Chuck could’ve done anything. Every second of that scene had me mentally begging Chuck to just stop and calm down. There’s more out there Chuck. Every kick of his desk knocking the lantern over inch by inch, it’s absolutely gut wrenching. The silence as his house gets engulfed in flames. It didn’t have to be this way.","score":85,"comments":[{"body":"It’s kind of disturbing actually because of how long it takes for him to do the deed. It’s not like hanging himself or shooting himself in the head where it’s over quickly. With every kick, he had plenty of time to turn back, but he didn’t.","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"For Chuck, being a successful lawyer was his attempt to feel good enough. He felt rejected by his parents as they were more affectionatr towards Jimmy. This trauma lay dormant within him for decades. Without the law the trauma came rushing back.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Zzzzzziegler, now sleeping forever, zzzzz","score":38,"comments":[{"body":"man thinks he is on r/okbuddychicanery","score":20,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"You guys are cruel. Warner and his wife seems to have been deeply in love for years if not decades. He badly missed her, was in deep anxiety working for Gus, and thus made a stupid mistake. \n\nAdmittedly, he may not have worked for evil drug kingpins doing illegal things if he was too soft for such stuff. \n\nFact is, we don't know how Werner Ziegler, who seems to be  a gentle and smart guy, ended working for people like Mike and Gus. Was it greed ? or, like Walter, his talent not been fulfilled doing legal things ? \n\nRemember what Walt said to Skyler \"Okay, didn't do it for the family. I was good at drug chemistry, felt alive, loved it.\"\n\nMaybe it was the same for Warner \"I loved engineering Gus superlab. Digging a big hole below ABQ taking risks. I was good at it, so were my german boys, I felt alive.\" Well, then he died.","score":49,"comments":[{"body":"He wasn't cutout for a life of criminal construction &amp;  engineering.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Anyone see no point in rewatching (spoilers)","not_safe_for_work":false,"locked":false,"body":"For me the ending kinda ruined the whole show. I loved re watching it before the final season, but knowing that he’s going to rot away in prison, die there, while everyone moves on with their life. \n\nFor what? For Kim? \n\nHe could’ve taken the 7 years, done his time and tried to reconcile with her.\n\nThe whole ending is so pointless and so relentlessly depressing to me that it ruined the entire show.","score":0,"comments":[{"body":"It’s not really pointless, I mean what’s the point of rewatching breaking bad? Walt dies, Skylar got her deal, Jesse got away and everyone moves on with their life. Most finales can be viewed that way, it wrapped up the story, it’s about a man who made so many poor choices in his life and never faced them, he hid himself behind a persona, and turned down the chance to talk to people about his guilt, Chuck, Mike, Walt, and they’re dead, the only person on the earth that Jimmy still cares about that’s alive is Kim, and if he lies in that courtroom, he will go to prison for 7 years, never face his guilt, be realised and a repeat of S6E11-12 will play out, he can’t shake Slippin Jimmy, when hidden away in Omaha, he starts conning again because he can’t shake it, if he does the 7 years he’ll get out and nothing will change, but at his last chance to face it, he does, and faces his guilt, this wasn’t to exonerate Kim, his confession did nothing for her, it was to try and do the one thing his brother thought he never could, change.","score":14,"comments":[]},{"body":"Kim owned up to her mistakes. It inspired Jimmy to do the same. He was all in with his deal till he heard Kim had confessed about Howard. So he decided to follow her lead. She followed his lead into scamming and grifting, he followed her lead into honesty and redemption. It was his only way of apologizing for what he did to her. His time in jail is penance for how he corrupted her. It's not like she was going to take him back... That ship had sailed long ago. He did it for himself and so she would know he was full of regret.","score":12,"comments":[]},{"body":"If you think Kim would ever want anything to do with Jimmy if he had gone through with the lie that got him his plea deal, you really didn't understand the show at all.","score":6,"comments":[]},{"body":"This is about more than just redeeming himself. He was finally able to escape his own prison of being Saul Goodman, and he did it in front of Kim, the most important thing in his life. Yeah, he loved being Saul, but the baggage that came from it -- the agonising repression of all his guilt and grief and shortcomings -- was too much for him to bear any longer. And anyway, the glory days of Saul are over, and all that came from him becoming Saul again in Saul Gone or Nippy were mostly painful reminders, or at least those reminders outweighed the fleeting thrills he got from pulling cons. \n\nHe's in prison at the price of becoming himself again, rather than being a free man as an echo and a shadow that is Saul.","score":6,"comments":[]},{"body":"this is one of the worst takes I’ve seen in a while lol, shows a fundamental misunderstanding of what the whole show is about sorry man","score":5,"comments":[]},{"body":"I think it's weird to consider it \"pointless\" when the main character finally owns up to what he's done after he sees Kim has the capacity to, especially when he's spent his entire life doing the opposite, but to each their own.","score":10,"comments":[]},{"body":"He finally takes responsibility for his actions. It was for himself. \n\nHe finally lets himself be human and stopped listening to the Saul in him.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I know what you mean. I do understand why they chose the ending they did, and this is just personal to me - despite everything, I liked Jimmy and Kim a lot, and no matter how many good reasons for the ending people could pile on to tell me about, I already know, but to *me* the ending was really hopeless and bleak. \n\nNow I’d have to brace myself a bit for a rewatch, where as before the last season I used to rewatch often as a I found the show uplifting!","score":1,"comments":[]},{"body":"I think I agree with you.  I might be interested in re-watching the first 5.5 seasons in a year or so. I rewatched 1-5 preparing for 6, and was so into it. But yeah, the ending did kind of kill the fun for me.","score":0,"comments":[]},{"body":"i do agree, i wanted to rewatch after the finale but the ending completely killed that for me. but i dislike the ending for much different reasons than “i wanted happy ending!” i just did not think jimmy’s character deserved to be wrapped up with an abrupt, cheap, and underdeveloped crowd pleasing plot twist.","score":-1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"If you had to describe Lalo Salamanca in one word how would you do it?","not_safe_for_work":false,"locked":false,"body":"All I need is one word, that’s all","score":107,"comments":[{"body":"Suave","score":156,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cunning","score":59,"comments":[{"body":"*cumming","score":18,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Sexy","score":107,"comments":[]},{"body":"Charismatic","score":62,"comments":[]},{"body":"Nobody","score":99,"comments":[{"body":"The guy just wants to talk to his lawyers","score":44,"comments":[{"body":"He needs some advice, find better lawyers","score":15,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Flavorful","score":43,"comments":[]},{"body":"Ruthless","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Did Jimmy actually steal much from his father's store?","not_safe_for_work":false,"locked":false,"body":"Chuck tells the story of Jimmy in his dad's shop and tells Kim that he stole thousands from them over the years. I kinda took this as fact but looking back I think that might be just what Chuck assumed happened.\n\nSo, Jimmy did steal some. We saw him doing that.  We see later that he took interesting coins and put them in the ceiling for safe keeping. Thousands though? I'm not sure.\n\nWe see their dad hands out money frequently to strangers who are scamming him, also a known fact. Though I don't remember Chuck ever acknowledging this fact. I think he grouped the little Jimmy stole with the amount their dad gave away, then blamed it all on Jimmy.\n\n\nAm I getting this wrong? Did I miss anything? Am I reading too deep in it? Just something I've been thinking about.","score":9,"comments":[{"body":"Chuck wasn't even living in Cicero any longer. All he knew is that there was a lot of money unaccounted for. I think he was more upset that his parents believed in Jimmy. \"Not Jimmy, not our precious Jimmy.\"","score":13,"comments":[{"body":"I guess all the chicanery caught up with Chuck","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Personally I think it might be a combination, I can see Jimmy’s dad letting him have snacks and stuff while he’s working, I can see little Jimmy sneaking a couple bucks once in a while, and I can see Mr McGill not really seeing how far his little handouts have gone, and gaining a reputation for being easy to shoplift or get a quick handout from. Jimmy trying to explain to his dad that one guy was scamming him doesn’t scream “kid who doesn’t care if he or anyone else rips off his dad” to me, I think Chuck jumped to a lot of conclusions based on how he already felt about Jimmy and didn’t see just hot terrible his dad was at running a business, and how much trouble that alone can get someone into.","score":5,"comments":[]},{"body":"Chuck has a tendency to exaggerate, he is a lawyer. The whole medical condition getting better then worse shows his colors.","score":9,"comments":[{"body":"I really feel he just dislikes his brother. A lot. That he put their dad's shop failing on Jimmy not because it was his fault but because Chuck wanted it to be his fault.\n\nChuck thought highly of his father, I'm not sure he saw how gullible he was and how much money he threw away.","score":4,"comments":[{"body":"Their dad was a sucker, who probably was not  good at bookkeeping or inventory and he blamed it on Jimmy but was likely taken by many people.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Probably just enough pocket change to go out with his friends. Nowhere near enough to drive their family to financial ruin and not enough to be the main reason their dad killed himself as Chuck implies.","score":3,"comments":[]},{"body":"I think he probably nabbed ten bucks here and there for a movie and popcorn and bullshit like that but I don't think he actively caused the business to fail. You can see in the flashback that Jimmy's dad just isn't cut out to run a business and turn a good profit. Even if he wasn't actively giving things away, I'm sure he let people round down a dollar if they were short and things like that constantly. A few cents per transaction adds up a lot faster than ten bucks twice a week.\n\nIn reality, Jimmy probably took more than he believes that he did and his father probably frittered away much more than he thought that he did. It's left purposefully ambiguous but ripping off daddy's cash drawer doesn't seem like the type of scam Slippin' Jimmy got into in Cicero.\n\nWhen you see Jimmy and Marco have their little renaissance they're just tricking dumb-dumbs out of beer money. Jimmy's addiction is the fun and games and the love/friendship comes with it. There's no fun in skimming your parents register every night.","score":1,"comments":[]},{"body":"Thats how I saw it.  I assume Jimmy never told Chuck how their dad was an easy mark.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I think you are right","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]}]}