{"name":"chess","description":"The home of chess on Reddit.","subscribers":552174,"posts":[{"title":"Event: 2022 World Team Chess Championship","not_safe_for_work":false,"locked":false,"body":"####[**Official Website**](https://worldteams.fide.com/)\n\nFollow the games here: [Chess.com](https://www.chess.com/events/2022-fide-world-team-championship-pool-stage) | [Chess24](https://chess24.com/en/watch/live-tournaments/fide-world-team-championship-2022-pool-a) | [Lichess](https://lichess.org/broadcast/2022-world-team-championship/GrZWtZbh) | [Chessbomb](https://nxt.chessbomb.com/events/2022-fide-world-team-championship-pool-stage)\n\n***\n\n**JERUSALEM** - – The Israel Chess Federation is hosting the [World Team Championship](https://i.imgur.com/owESSlk.png), which will be held from 19 to 26 November with 12 teams from all continents. Some federations are coming with their top stars. Others are sending up-and-coming players. The tournament favourite is the team of Azerbaijan, with Shakhriyar Mamedyarov and Teimour Radjabov on the top boards. The Netherlands also come with a strong team and have Anish Giri and the van Foreest brothers on the top boards. Vidit plays on board one and though the Indian team is strong, it could have been stronger as Gukesh and Erigaisi do not play. France comes with Maxime Vachier-Lagrave but without Firouzja.\n\nPoland starts without Jan-Krzysztof Duda. Uzbekistan, the winner of the Olympiad 2022, bring almost the whole team that won gold in Chennai to Jerusalem, but Nodirbek Abdusattorov is missing. Spain is also fielding its A team, with Shirov on board three. Israel plays without Boris Gelfand and the US team, which is led by Hans Niemann, is missing its nominally best players. For the first time since 2019, China is back in an international competition, but also comes without its top players. The players from South Africa, the African champions, are still little known internationally.\n\nThe event, organized by FIDE and the Israel Chess Federation with the support of the Israel Ministry of Sport and Culture, will be held at the Mount Scopus Hall in the Dan Hotel in Jerusalem. The Chief Arbiter for the event will be Alex Holowczak (ENG), with Alon Shulman (ISR) as his Deputy, and M.S. Gopakumar (IND) as Fair Play officer. \n\n***\n\n####**Standings**\n\n**\\#** | **FED** | **Rtg.** | **MP** | **\\#** | **FED** | **Rtg.** | **MP**\n:---:|:---|:---:|:---:|:---:|:---|:---:|:---:\n1 | 🇨🇳 China | 2557 | **8** | 1 | 🇺🇿 Uzbekistan | 2524 | **6**\n2 | 🇫🇷 France | 2688 | **5** | 2 | 🇦🇿 Azerbaijan | 2662 | **5**\n3 | 🇺🇦 Ukraine | 2637 | **5** | 3 | 🇮🇱 Israel | 2589 | **4**\n4 | 🇪🇸 Spain | 2589 | **4** | 4 | 🇮🇳 India | 2611 | **4**\n5 | 🇳🇱 Holland | 2638 | **2** | 5 | 🇵🇱 Poland | 2566 | **3**\n6 | 🇿🇦 South Africa | 2261 | **0** | 6 | 🇺🇸 United States | 2643 | **2**\n\n\n***\n\n####**Format/Time Controls**\n\n* The participant countries will be split into two pools of similar strength, taking as a reference the rapid rating list for November 1st. The four best teams from each pool will advance to the knock-out stage, where they will play Quarter-finals, Semi-Finals, and Final, with each duel consisting of two matches between the teams.\n\n* The time control will be 45 minutes for the whole game with an increment of 10 seconds per move starting from move 1.\n\n***\n\n####**Schedule**\n\n*All rounds start at 15:00 local time (14:00 CET / 8:00 AM ET)*\n\n**Date** | **Time** | **Round**\n:---:|:---:|:---\n11/20 | 3:00 PM | Rounds 1 &amp; 2\n11/21 | 3:00 PM | Rounds 3 &amp; 4\n11/22 | 3:00 PM | Round 5\n11/23 | 3:00 PM | Quarterfinals\n11/24 | 3:00 PM | Semifinals\n11/25 | 2:00 PM | Finals\n\n***\n\n####**Live Coverage**\n\n* Live coverage of the event is available on FIDE's [YouTube](https://www.youtube.com/c/fidechannel) channel, with commentary by GM Viswanathan Anand and IM Almira Skripchenko.","score":25,"comments":[{"body":"Pool B's qualifying process for each team\n\nUzbekistan already qualified.\n\nAzerbaijan will qualify if they don't lose horribly in the last round, otherwise a draw is enough.\n\nA draw is enough for Israel and India if Uzbekistan beats Poland.\n\nIf Poland wins and someone between India or Israel needs to lose and they will qualify.\n\nUSA needs to beat India and then need Poland to lose.","score":3,"comments":[]},{"body":"A bit off-topic, but when is the speed chess championship starting?","score":3,"comments":[{"body":"[The first match is on Wednesday.](https://www.chess.com/events/2022-speed-chess-championship-main-event/schedule)","score":2,"comments":[]}]},{"body":"Is there another stream besides the FIDE one? When the Women’s Candidates was getting 400 views opposite the Fischer Random Championship, it made for a narrative that nobody watches women’s chess but when I checked the stream now, it only had 700 views and I don’t think it’s competing against a big event. Is it really just that Magnus and Hikaru are the only people who draw views? \n\nEven the presence of Hans hasn’t made much of an impact. In the US Championship thread here, I feel like it was always about Hans but now already the buzz about an event with Hans seems to have died down.","score":6,"comments":[{"body":"For me a team event isn't much interesting. Plus the time control with 45 minutes is rather odd. You do not get rating points for classical chess. Add a flimsy broadcast and there is not much left.","score":4,"comments":[]},{"body":"&gt;Even the presence of Hans hasn’t made much of an impact.\n\nI remember some times ago it was reported Hans demanded same amount of money in Europe Club Cup as Magnus and some of his fans believed that he deserves that much money because now he is as much big of a draw as Magnus. I wonder what those people gonna say now.","score":5,"comments":[{"body":"I openly think Hans got unfairly screwed by Magnus, and am rooting for him for the lolz. But if he honestly thinks he deserves Magnus money???? What a dope.","score":0,"comments":[]}]},{"body":"&gt;When the Women’s Candidates was getting 400 views opposite the Fischer Random Championship, it made for a narrative that nobody watches women’s chess but when I checked the stream now, it only had 700 views and I don’t think it’s competing against a big event.\n\nI see 4 streams for a total of about 2000 viewers. But candidates is a far more important tournament than this.","score":3,"comments":[]},{"body":"For me the problem is the audio quality of the fide stream is so poor! Very harsh noise canceling, really painful to listen to.","score":2,"comments":[]}]},{"body":"That blunder by Shakh against Vidit, oof. Vidit smiling while leaving the playing hall, going from losing game hard to winning it hard.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Funny tactic I got out of the opening. Black to move and win material","not_safe_for_work":false,"locked":false,"body":"","score":768,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=q3kbnr/1rppppp1/n7/8/Q6N/6P1/PP1PPP1P/RNB2RK1+b+k+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/q3kbnr/1rppppp1/n7/8/Q6N/6P1/PP1PPP1P/RNB2RK1_b_k_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Rook!&lt;, move: &gt;!Rb4!&lt;\n\n&gt; Evaluation: &gt;!Black is better -2.48!&lt;\n\n&gt; Best continuation: &gt;!1... Rb4 2. Qc2 Rhxh4 3. a3 Rb6 4. d3 Rh5 5. e4 g6 6. Be3 Rb8 7. d4 Bg7 8. Nc3 c6 9. b4!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"This position is anarchychess material","score":904,"comments":[{"body":"Looked like Fischer random for a sec","score":199,"comments":[]},{"body":"&gt;!I saw Rb4, I just didn’t like it!&lt;","score":175,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"What the fuck is this position?","score":124,"comments":[{"body":"[OP gave us a gif of the game!](https://lichess1.org/game/export/gif/black/vCnZdHWx.gif?theme=blue2&amp;piece=cburnett)","score":107,"comments":[{"body":"Did not expect those ratings to be so high. Must be some 2000+ prep day out my league.","score":73,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"My brother in Christ what the hell is going on here?","score":495,"comments":[{"body":"You don't fianchetto your rooks?","score":520,"comments":[{"body":"I should. Apparently it works out","score":61,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Chess is tough","not_safe_for_work":false,"locked":false,"body":"Recently I played in an Over the board tournament organized near my college (my first time OTB). I have to say that OTB is just a different ball game altogether. Till the third round I was doing decent like 2/3 but the 4th round was just a heart-breaker :( . I was a knight down from the opening and while I was busy collecting pawns I missed my opponent's queen was hanging. It was so fricking sad when I realized that few moves later. Seriously sitting there in front of the board for like 6 hours straight is painful and games like these tear you apart. After that I lost all my motivation and just lost the rest of the rounds in 20-30 moves. Huge salute to the guys who can make it look so easy while in reality its just a mental, emotional teardown.","score":118,"comments":[{"body":"I play in a local chess club at a library, with no stakes and it's still such an emotionally taxing process lol it makes no sense.","score":38,"comments":[]},{"body":"I got up to about 1400 rapid on chesscom during the pandemic and played my first OtB in like 10 years this summer. Definitely agree it is harder. Just little things like seeing the board in a different perspective were distracting. The board was also all brown and the only way to distinguish between squares was by the pattern of the wood. I wasn't even playing in a tournament, just something I noticed while playing some acquaintances. I can't imagine being somewhere for hours in a high pressure environment. I hung some pieces and tried to move pinned pieces a couple times!","score":8,"comments":[]},{"body":"Yeah, chess can be murder on your ego.  Bonus points if you feel your chess rating is some kind of intelligence test or validation of your worth as a human being or whatever. :)\n\nEvery time you lose (and you're going to lose, over and over again, as long as you keep playing) it's always 100% your fault.  Even when your opponent plays a great game.  Their killer moves weren't enough to win - if you hadn't made any mistakes you wouldn't have lost.\n\nIn a team sport/activity you can always blame someone else.  No matter how much you sucked, you can always tell yourself no, I was ok, it was that *other guy's* fault. :)","score":21,"comments":[]},{"body":"OTB is far more intense than online, because it's in-person. When you lise to some random username online, you don't care as much, because you're detached from the interpersonal experience of physically facing them. But when you're sat across from somebody, all of a sudden every move is critical, because if there's one thing nobody likes, it's to get beaten to a pulp in a cerebral game with zero luck or randomness factor by another human being who's 2 feet away from them.","score":5,"comments":[]},{"body":"Several studies have shown that some professional chess players burn about two pounds a day during a tournament just from stress, lack of sleep, *and lack of appetite.* Bobby Fischer was one of the first professionals to recognize the importance of physical fitness.\n\nThese days the best players may have personal dietitians, work out, and pay careful attention to how they sit and breath during their games. It's hard for older players to maintain their rankings not just because of mental acuity, but because of physical deterioration.\n\nMagnus Carlson is only 31, and has decided not to defend his world championship. Granted, he's said that's just due to lack of motivation and he's not retiring from tournament play. Gary Kasparov reached his peak rating at age 36, though.\n\n**Edit:** Some of you object because I guess there's a controversial study out there that suggests chess players burn 6000 calories a day at a tournament, as if they were running a marathon. That's *not* actually what I said, and I've edited my first sentence to clarify that loss of weight can also be due to lack of appetite. In addition, I go on to say modern players are aware of this issue and counter it, so they may *not* lose weight like their predecessors did. But the stress is undeniably tremendous, nevertheless, and can take a physical toll.","score":41,"comments":[{"body":"That first sentence is just straight up bullshit lol","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Exercise science chess player here. This has been debunked sorry. Although if you want, you can check willpower. It wanes down as we make more decisions.","score":3,"comments":[]},{"body":"Can you provide a source?","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"They dont call it the game of kings for nothing","score":2,"comments":[]},{"body":"The real devil of chess.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"White to move and gain advantage","not_safe_for_work":false,"locked":false,"body":"","score":91,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=r1b1k2r/pp2bppp/2n2n2/q7/Q3N3/6P1/PP2PPBP/R1BR2K1+w+kq+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r1b1k2r/pp2bppp/2n2n2/q7/Q3N3/6P1/PP2PPBP/R1BR2K1_w_kq_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Knight!&lt;, move: &gt;!Nxf6+!&lt;\n\n&gt; Evaluation: &gt;!White is winning +6.02!&lt;\n\n&gt; Best continuation: &gt;!1. Nxf6+ Kf8 2. Nd7+ Bxd7 3. Qxa5 Nxa5 4. Rxd7 Rd8 5. Rxd8+ Bxd8 6. Be3 Bb6 7. Rc1 Ke7 8. Bxb6 axb6!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Hear me out… gotta protect the king with bc2 /j","score":8,"comments":[]},{"body":"&gt;!Nxf6+ Bxf6!&lt;\n\n&gt;!Bxc6+ bxc6!&lt;\n\n&gt;!Qxc6+ and wins the rook!&lt;","score":12,"comments":[{"body":"Take the black queen instead of Qxc6+","score":40,"comments":[{"body":"Lol that's why I never prosper in chess","score":20,"comments":[{"body":"Don't worry, that happens","score":9,"comments":[]},{"body":"engine sees m7 after qxc6+ and it doesn't take the free queen either so good job i guess","score":6,"comments":[{"body":"Hmm, my engine didn't see m7 even at depth 29. But it did suggest Qxc6+","score":4,"comments":[{"body":"my lichess engine sees m7 on mobile immediately if black takes both pieces, weird that yours doesn't","score":4,"comments":[]}]},{"body":"It's mate in 7 only if black plays gxf6. If Bxf6, there is no mate.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Magnus Carlsen wins the Meltwater Champions Tour finals with incredible 20/21 score","not_safe_for_work":false,"locked":false,"body":"Liem Le was the only person to nick that one point off Magnus by forcing their match to go to tiebreaks.\n\n“w”esley “s”o was a distant second with 13/21","score":1397,"comments":[{"body":"Watch out Nepo and Ding, this kid's gonna be the world champ someday.","score":684,"comments":[]},{"body":"I mean there's a reason he's the world champion. Casually destroys all his competition","score":335,"comments":[{"body":"Destroying all competition sounds like a winning formula.","score":134,"comments":[{"body":"try this one simple trick","score":63,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"What was his performance rating?","score":252,"comments":[{"body":"2974 if you only count the rapid games and use the tour rating.\n\n2957 if you include the blitz tiebreaks.\n\nsource: https://chess.kivij.info/performance_calculator.shtml","score":135,"comments":[{"body":"holy bajoly 2974","score":63,"comments":[{"body":"That makes you wonder how seemingly impossible is to get to 3000 on a consistent basis","score":45,"comments":[{"body":"problem is that he's usually playing people 80-150 points lower than him, makes it harder to gain points.","score":37,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"I think just under 2900\n\nEdit: Carlsen's entire TOUR rating was just under 2900, but [/u/StrikingHearing8 calculated his TOURNAMENT rating to be over 2950.](https://www.reddit.com/r/chess/comments/z0jpvl/magnus_carlsen_wins_the_meltwater_champions_tour/ix73lei/) Sorry for the misunderstanding!","score":258,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Magnus meets Fischer’s Nephew","not_safe_for_work":false,"locked":false,"body":"Magnus met bobby Fischer’s nephew who included him in a small part of chess history he owns :)","score":617,"comments":[{"body":"*Fischer's nephew meets Magnus.","score":220,"comments":[]},{"body":"It's fun seeing the greatest chess player in history be still be so respectful of the old greats that he hesitates to do anything to something with their signatures on it.","score":33,"comments":[]},{"body":"Very cool","score":16,"comments":[]},{"body":"Wow he towers over Tania","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[full video and original tweet](https://twitter.com/champchesstour/status/1594479393597927424?s=46&amp;t=y2aBaQqCw9jMkGJRcKlmZQ)","score":13,"comments":[]},{"body":"Who was Joe Fischer?","score":33,"comments":[{"body":"Nick is Joan's son.   Joan was Bobby's sister.","score":63,"comments":[]},{"body":"Joe mama!","score":40,"comments":[{"body":"Got em","score":6,"comments":[]}]}]},{"body":"That's adorable","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"First OTB Tournament Report","not_safe_for_work":false,"locked":false,"body":"This past weekend I had an opportunity to play in an OTB tournament at a nearby high school in the u1400 section, which had 18 registrants. I'm unrated and didn't know what to expect getting into the tournament and was just excited to play some competitive chess over the board. The time control was 45 minutes with a 5 second increment. I annotated my games from each round.\n\n[Round 1](https://www.chess.com/analysis/library/4YEPfdSLKG): I'm paired against a ~900 rated young kid and I have the black pieces. It was a Caro-Kann exchange game and I was able to avoid getting blasted in the opening, despite some mistakes, and transition into a favorable position. However, I overextended and was lost with my knight stranded on h3 in enemy territory and my rooks tangled on the e-file. A mistake from my opponent allowed for a combination that I thought would win me the exchange, but more blunders from my opponent left me with a clean rook. I was under 1 minute by move 51, at which point I realized I wasn't getting the 5-second increment, at which point the TD allowed us to add it back to the clock. I messily converted the game into a checkmate with 30 seconds left on my clock. 1 point\n\n[Round 2](https://www.chess.com/analysis/library/2QKqnrXYa2): I'm paired against an adult who was rated around 1200 and I had the black pieces again. He opened with 1. d4 and I sat and thought for a solid 4 minutes before playing 1. ...d5. I tanked because I usually play the Dutch defense, but I was not well prepared in that opening and have pretty much neglected my 1. d4 defenses. This led into a QGD, which I'm very unfamiliar with, where I hung a knight on move 10 after erroneously pushing my b-pawn. The whole thing unraveled thereafter and I resign on move 17 after I got queen and king forked by a knight. 1 point still.\n\n[Round 3](https://www.chess.com/analysis/library/gAmVSjZqx): I'm paired against a high schooler rated around 850 and I have the white pieces. I open with 1. e4 and we play into an exchange French defense, but she goes with 3. ...Qxd5 rather than 3. ...exd5, which surprised me. I felt OK, though, since the position reminded me of a Scandinavian defense, so I just started harassing her queen, which she proceeded to blunder on move 7 after my minor pieces conspired to trap it. It was relatively smooth sailing thereafter, even though I blundered a bishop in the middlegame after overextending again. I end up mating her around move 35. 2 points out of 3.\n\n[Round 4](https://www.chess.com/analysis/library/CKMEoqfNW): I'm paired against another high schooler who's rated around 1120 and I have the white pieces again. We talked about how tired we both were at this point and I was pretty foggy compared to my earlier games. We play into an Italian and a premature ...d6 from my opponent locked in his dark-squared bishop, which made me feel confident about my chances. I build up an attack around my my advanced d-pawn and clumsily try to maintain my advantage. After some messy play in the middlegame, I transition into an endgame where my active pieces dominant his. He resigns after I get my rooks to his 7th rank and have mate in 1. \n\nI ended the day with 3 points out of 4, which was good enough to tie for second and netted me a third place finish after tiebreaks were calculated. My performance rating was 1224 and I was pretty amped about my performance overall.\n\nI guess the reason I decided to report on my performance in a small local tournament because I wanted to share about a small but significant achievement for me and ask for any tips about my play. I annotated my games based on [this post suggesting how to analyze games](https://www.reddit.com/r/chess/comments/y2b84o/guide_how_to_analyze_your_own_games/) and would love any feedback about either my performance or my analysis after the fact.","score":42,"comments":[{"body":"Round 2: classic mistake. Play what you usually play, the Dutch, even if you don't know it that well, because the alternative (playing something you don't usually play and also don't know) is always worse. \n\nRound 4: yeah, the last round is always... exciting. It's getting worse for me each year, frankly. \n\nOkay actual game comments: \n\ngame 1: Yeah, you need to be on the lookout for those Bf4 Nb5 ideas. Your opponent let you off easy. Later, I don't know why your opponent was so averse to playing a3, with a Queen on a5, this practically forces the trade and you have to think about whether you are better after that trade (probably not). I was hoping for a comment on 20....Bg4. Was it because you didn't like Nxf5 exf5? As it stands, you end up with f3 Bh5 Nxh5 Nxh5 and I think this is just worse than allowing Nxf5 exf5. White doesn't (or shouldn't) want to do Nxf5 because that just gives you the open file and potentially the e4 square. Yeah, cheap mate threats don't pay off. Oof, White really didn't want to do Rxf2. What a gift to you! I'll comment on your other games later maybe. I like how you comment on what you were thinking during the game, include even more thoughts, variations, and evaluations!","score":5,"comments":[{"body":"Yeah looking back at game 1, the bg4 idea was pretty hasty. I wanted to induce the f3 move, as I thought that'd be weakening when in fact it's pretty clearly solidifying for White's position. I didn't even consider the trade of their knight for my bishop opening up my rooks, I think I just wanted to keep my bishop on the board because I wanted the bishop around (not a great reason!). I think I was overly attached to ng4 ideas and got tunnel vision about that, as the e4 outpost looks pretty juicy there.\n\nThanks for the feedback!","score":2,"comments":[{"body":"It's good that you at least had a concrete positional idea there -- you thought keeping the bishop was better, which it often is (though in the end you don't get to keep the bishop, so that was short-sighted).","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I loved this post, true wholesome content! \n\n&gt; He opened with 1. d4 and I sat and thought for a solid 4 minutes before playing 1. ...d5.\n\nThis is fucking hilarious. 1. D4 double exclam!!","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What's your elo online? I've always been hesitant to play otb because I feel like I'm not highly ranked enough.","score":2,"comments":[{"body":"I'm high 1100s in rapid on Chesscom. I was hesitant about transitioning to OTB play, but I really enjoyed it. Playing OTB is the way chess really should be played, imo, as the social aspect and embodied experience really outshines just clicking around on a computer. I also was sure not to get too nervous about not performing well, as I took the approach that my losses could help me improve!","score":10,"comments":[{"body":"That's awesome. I'm like a 1300 rapid on chess.com and always thought you needed to be at least 1500 to find an otb tournament. I really enjoyed your recap.","score":2,"comments":[{"body":"The U1100, U1300, etc sections are usually pretty large in local tournaments. The average USCF rating is pretty close to 1k.  FIDE ratings don’t start until 1000, but what happens is that higher sections will be FIDE rated while lower sections are only rated by the national organization.(usually small local tournaments aren’t FIDE rated at all since becoming an arbiter has a couple extra hoops to jump through)\n\nUnless the player pool is both large and consistent, players usually have significantly lower ratings for their national or FIDE rating than online.  It varies due to the specific player pool.","score":8,"comments":[]},{"body":"Thank you! There was thankfully a U1400 section in this tournament and I think my state association likes to ensure that there's viable competition for all rating levels. I encourage you and everyone else to get after it!","score":1,"comments":[]}]}]},{"body":"You're strong enough.\n\nPlay Swiss tournaments. In North America, nearly all tournaments are Swiss tournaments. Winners play winners and losers play losers, so even if you're in the bottom 25% of players, you're frequently going to be matched with players of similar strength.\n\nTournament play will make you stronger. The losses are very instructive (more than the wins). It's worth collecting some losses, so that you can analyze them and improve.\n\nIt's going to push you in ways that you're maybe not used to. If you can sort out these weaknesses, that'll start reflecting itself in your results and your rating -\n\n* Playing too quickly\n* Playing moves that look good enough, sometimes without sufficient calculation, instead of trying to play best moves\n* Having an opening repertoire that's much more disappointing that you realized\n* Losing energy/concentration/motivation\n* Etc.\n\nEdit: Also, if you're used to playing in the pool, you'll have to adapt your mentality a bit that when you are matched with 1500s, 2000s, etc. that you're probably going to lose - but can still try to play a good chess game.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Carlsen completes near perfect finish to 2022 Champions Tour","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"He is alive","score":1,"comments":[]}]},{"title":"My best ever move. White to play.","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=r1b1kbnr/pp3ppp/1qP1p3/6B1/8/2p2N2/PPP2PPP/R2QKB1R+w+KQkq+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r1b1kbnr/pp3ppp/1qP1p3/6B1/8/2p2N2/PPP2PPP/R2QKB1R_w_KQkq_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Bishop!&lt;, move: &gt;!Bb5!&lt;\n\n&gt; Evaluation: &gt;!White is winning +12.85!&lt;\n\n&gt; Best continuation: &gt;!1. Bb5 f6 2. cxb7+ Qxb5 3. bxa8=Q Ne7 4. Be3 cxb2 5. Rb1 Qb7 6. Qxb7 Bxb7 7. Rxb2 Bxf3 8. Qxf3 Ng6!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Bishop to b5?","score":7,"comments":[]},{"body":"&gt;!Bb5!&lt; looks pretty good","score":7,"comments":[]},{"body":"I found the correct move for white, but not the right reply for black. I thought it was winning even more than it actually was.","score":3,"comments":[]},{"body":"Bb5?","score":2,"comments":[]},{"body":"I really wanted Qd2 to work :/","score":2,"comments":[]},{"body":"I was liking pushing the pawn to C7. Oh well.","score":1,"comments":[]}]},{"title":"Charlotte Chess Center Hosts Largest Norm Invitational in U.S. History","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"What can I do if I'm not named Norm?","score":1,"comments":[]}]},{"title":"Who do you think SinisterMagnus is?","not_safe_for_work":false,"locked":false,"body":"This anonymous account recently destroyed Wesley in blitz match. Who could it be? Very few people are capable of doing this.","score":305,"comments":[{"body":"Of the players with a higher blitz rating than So, maybe Giri? Sounds like his sense of humor. Alireza? But with a small sample there's probably several people who could have had a good night despite being lower rated.","score":161,"comments":[{"body":"Yeah, I think Giri might be a good guess. A similar chess.com rating and might be his kind of joke.","score":47,"comments":[]}]},{"body":"Max Deutsch finally finished his algorithm and he's out for revenge","score":162,"comments":[{"body":"This will never not be funny, crazy how he got to world champion level in a month then was only narrowly beaten in a sharp game.","score":66,"comments":[{"body":"He kept the WC on his seat for 9 moves! And then the unthinkable happened - he was winning!","score":42,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Sinister in Latin means left, as in left-handed. Magnus playing with his left hand?","score":353,"comments":[{"body":"“I know something you do not”\n\n“Which is?”\n\n“I am not Left handed”\n\n*switches to right hand*\n\n*gasp!*","score":150,"comments":[{"body":"*more fencing*\n\n“Neither am I” *flips saber to right hand*\n\n*gasp*","score":48,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"crazy he can beat other top 10 players playing left handed.","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"its hans niemann using the play magnus engine on max settings","score":459,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Settlement Reached in Stockfish v ChessBase","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"Send like stockfish took a very light handed approach to this. At the very least I was expecting them to seek reimbursement for their legal fees. I'm glad it was resolved but I hope their kindness doesn't come back to bite them.","score":3,"comments":[]},{"body":"&gt; The agreement also includes the necessity to hire a Free Software Compliance Officer to assure that further violations do not occur. \n\nThis has to be the sweetest gig on earth. \n\n&gt; Critically, the agreement includes no financial compensation for the Stockfish team, not even legal fees. There are fines for violating the settlement, but they would be paid to the Free Software Foundation Europe and not the Stockfish team.\n\n\"And they have to buy the full version of WinZip.\"","score":3,"comments":[]},{"body":"All that bluster and they settled for nothing.","score":2,"comments":[]}]},{"title":"A difficult to find mate in 5. Black to play","not_safe_for_work":false,"locked":false,"body":"","score":177,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=2Q2R2/3p2p1/4ppqk/7p/3P1KbP/3BP1P1/8/8+b+-+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/2Q2R2/3p2p1/4ppqk/7p/3P1KbP/3BP1P1/8/8_b_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Queen!&lt;, move: &gt;!Qe4+!&lt;\n\n&gt; Evaluation: &gt;!Black has mate in 5!&lt;\n\n&gt; Best continuation: &gt;!1... Qe4+ 2. Kxe4 d5+ 3. Kf4 e5+ 4. dxe5 g5+ 5. hxg5+ fxg5#!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"there is difficult and there is unplayable, this is the latter... Good luck guys","score":117,"comments":[{"body":"I wonder what game has the most sacs played to force a win.","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Even after the first move &gt;!Qe4+!&lt; it's still interesting to look for the continuation.","score":39,"comments":[{"body":"Why not Bxe4 after Qe4+…?\n\nOh wait nvm. The pawn attack still works as soon as e4 is not an escape square.","score":14,"comments":[{"body":"Same mating idea. After bxe4, there's e5+ dxe5 then g5+, leading to mate.","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Awesome mate","score":10,"comments":[{"body":"Ya that looks pretty cool. Especially with whites huge material advantage.","score":6,"comments":[]}]},{"body":"A few thoughts about this puzzle before we dive in. &gt;!(1) Every move by white has to be check. Black is threatening Rh8+ and mates. (2) We have stable control over the light squares and g5, which means that we'll need e5 shored up somehow. (3) Control over e4 and the light squares farther to the queenside are also in question, our queen likely will move somewhere for checkmate, so we'll have to figure out how to get control of e4 as well.!&lt;\n\n&gt;!I worked through a few lines, but then I settled on starting with 1... Qe4+. We need white to decide how we are going to deal with this e4-square. If 2. Bxe4, this is easier, 2... e5+ 3. dxe5 g5+ 4. hxg5 hxg5# wins. On the other hand, if 2. Kxe4, then 2... d5+ 3. Kf4 e5+ 4. dxe5 g5+ also leads to mate.!&lt;\n\nIt helps that this puzzle was posted a couple weeks ago, so I had the general idea of what to do already, I just had to recall the general idea, namely, &gt;!handle the e4-square and the light squares leading to the queenside.!&lt;","score":9,"comments":[]},{"body":"Me: this is easy just sack Qg5.\n\nAnalysis: mate in 5 \n\nMe: oh perfect…. Wait nvm","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Can you solve this obscenely difficult puzzle?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=8/1Pq1k3/8/8/2b5/8/2Q5/1K6+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/8/1Pq1k3/8/8/2b5/8/2Q5/1K6_w_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Queen!&lt;, move: &gt;!Qh7+!&lt;\n\n&gt; Evaluation: &gt;!White is winning +4.28!&lt;\n\n&gt; Best continuation: &gt;!1. Qh7+ Bf7 2. Qh4+ Ke6 3. Qh3+ Kd5 4. Qb3+ Kd4 5. b8=Q Bg6+!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Yes, I can","score":1,"comments":[]},{"body":"You’re flattering me by calling this obscenely difficult\n\nEdit: either that or I did it wrong","score":1,"comments":[]},{"body":"To win queen against queen you need to get the opponent to line of king and queen with one space between diagonally, or more than one horizontally.\n\nThe other option is to promote safely.\n\nWith this knowledge, the problem is not so hard.","score":1,"comments":[{"body":"If you're thinking Qh7+, then you may have overlooked the response which would be the bishop coming in to block on f7.\n\nI can't solve the puzzle or even figure out why the engine likes any particular move. It sort of seems like the engine is trying to force the king into a position where the queen can check on *either* the B file, or the A file (but only while forcing the king to the first rank).","score":1,"comments":[]}]},{"body":"Yes, I can","score":-5,"comments":[]}]},{"title":"TIL about the Nescafe© Frappe Variation","not_safe_for_work":false,"locked":false,"body":"In the Benko Gambit there exists a variation officially known as the Nescafe Frappe. It goes 1.d4 Nf6 2.c4 c5 3.d5 b5 4.cxb5 a6 5.Nc3 axb5 6.e4 b4 7.Nb5 d6 8.Bc4, although Lichess will say it before 8. Bc4.","score":36,"comments":[{"body":"As the story goes, a titled player who discovered this monstrosity showed it to another titled player, who told him \"You could only beat coffeehouse players with this garbage\".\n\nAs a Benko player, this is pretty playable. It disrupts a few key topical ideas. If I could get it on the board every time I play white, I'd switch to d4.","score":37,"comments":[{"body":"A similar story is behind the monkey's bum.\n\nFrom the wiki: \n&gt;Coates declared, \"If that works then I'm a monkey's bum!\" The name stuck.","score":14,"comments":[]},{"body":"Was your flair always the benko or did this post affect it","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"There are quite a few of those fun name: \n\nThere is also the intercontinental ballistic missile variation of the the Tennison Gambit,\n\nFrankenstein Dracula in the Vienna\n\nCorkscrew Countergambit in the Latvian gambit","score":17,"comments":[{"body":"Don't forget there's almost a whole zoo worth of openings as well.\n\nThe Hippopotamus system, polarbear system, giraffe attack, Kangaroo Defence, great snake variation, porcupine variation, The Black Lion defense, etc etc.","score":8,"comments":[]},{"body":"How about the Nut-tree variation in the semi-slav","score":2,"comments":[]},{"body":"King’s Pawn Opening, Bongcloud Variation","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"They used to go 8. Bf4 here, where black has 8...g5! 9. Bxg5 Nxe4 10. Bf4 Nf6! and black is better. It's all about capturing e4 safely.\n\nAfter 8. Bc4!? black can't take on e4 (8...Nxe4? 9. Qe2! Nf6 10. Bf4 and white is nearly winning), so this variation is actually pretty clever. Black usually just goes 8...Nbd7 9. Nf3 Nb6 and is fine.","score":4,"comments":[]},{"body":"This post has been parodied on r/AnarchyChess.\n\nRelevant r/AnarchyChess posts: \n\n[TIL about the Nescafe© Frappe](https://www.reddit.com/r/AnarchyChess/comments/z0smod/til_about_the_nescafe_frappe/) by VrebPasser\n\n[^(fmhall)](https://www.reddit.com/user/fmhall) ^| [^(github)](https://github.com/fmhall/relevant-post-bot)","score":2,"comments":[]},{"body":"There is not really such a thing as an \"official\" variation name.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"White is under a huge attack here, however the engine thinks this is equal. Find the only defensive idea in the position that saves the game for white. (White to play)","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=3r3k/2p2pp1/7p/1Q6/P3P3/1P2qP1P/3r1RP1/5RK1+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/3r3k/2p2pp1/7p/1Q6/P3P3/1P2qP1P/3r1RP1/5RK1_w_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Pawn!&lt;, move: &gt;!&amp;nbsp;&amp;nbsp;g3&amp;nbsp;&amp;nbsp;!&lt;\n\n&gt; Evaluation: &gt;!The game is equal 0.00!&lt;\n\n&gt; Best continuation: &gt;!1. g3 Rc2 2. Qf5 Rxf2 3. Rxf2 Rd1+ 4. Kg2 Qe1 5. Qc8+ Kh7 6. Qf5+ Kg8 7. Qc8+!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"The correct idea here is &gt;!g3 / g4. In the game however, the tricky Qf5 was played, black proceeded with the original combination ( Rxf2, Rxf2 and Rd1+) and the game ended by a draw via repetition. Black is completely winning after Qf5 though.!&lt;","score":4,"comments":[]},{"body":"A few thoughts about this position before I dive in: &gt;!(1) I'm either looking for some sort of heavy counterplay based on my a-pawn, or I'm looking for a perpetual based on black's relatively weak back rank and on the opening along the f5-h7 diagonal. (2) There doesn't appear to be a way for me to directly save this rook.!&lt;\n\nSo I eventually came up with &gt;!something like 1. Qb7, with the idea that 1... Rxf2 2. Rxf2 Rd1+ 3. Kh2 Qxf2 leads to 4. Qc8+ Kh7 5. Qf5+ and black cannot avoid a perpetual without giving back the rook (in which case I think black just gets a perpetual). If black isn't going to win this f2-rook, though, then black isn't really better in this position. Even with a move like 1... g6, I think 2. Qc6 might hold, threatening perpetual along e8 and f7. White is also getting ideas of Qf6+. 2. Qc6 Kg7 3. Qc1, and I believe the worst of it has passed, maybe.!&lt;\n\nEDIT: Well, my idea was wrong! Gotta figure out why!","score":5,"comments":[{"body":"I think after ||g6 Qc6 your idea of perpetual along e8 and f7 doesn’t work, because black can go Qe8 Kg7 Qe5 Kh7. I think it’s still very tricky for black to avoid perpetual after that but black is up a rook","score":3,"comments":[]}]}]},{"title":"Magnus Preparation","not_safe_for_work":false,"locked":false,"body":"I've been watching a lot of podcasts and interviews from chess players and have noticed something that I want to shine a spotlight on. \n\nIn an interview last year Fabi mentioned that Magnus's preparation was next level not because he would always find the best moves, but because [he would find moves that his opponent specifically isn't good at](https://youtu.be/mjcTKOfi1dg?t=2400) \n\nAs in he would look for positions that Fabi can't play as effectively. I didn't think much of it at the time, but later Hikaru made the same point.  \n\nHikaru mentioned the same thing in his Lex Fridman podcast interview. He said that after playing the 40 blitz game private match against him, Magnus figured out that Hikaru's opening theory knowledge wasn't on par with his other skills. From then on, [Magnus going forward was able to figure out lines where you have to be super precise, you cannot deviate](https://youtu.be/oJNvxYEcVAY?t=401) in order to get Hikaru into really bad positions. \n\nTo put it another way Fabi says [Magnus is the best prepared player in the world](https://youtu.be/FM-Qrg4Rka8)","score":939,"comments":[{"body":"Magnus was playing some bizarre stuff against Danya last night and giving him the business. Some variations in the Alapin Sicilian I hadn’t ever seen and 3. e5 against the Nimzowitsch","score":417,"comments":[{"body":"A lot of what Magnus seems to do is to try and get his opponents out of prep, because he knows they know it and will play the best moves. So if he plays something that is subpar, they may not be able to capitalize perfectly, but if it gets them out of prep he probably feels like he can outplay them from there.","score":259,"comments":[{"body":"I wonder if he also plays weird lines just out of sheer boredom","score":162,"comments":[{"body":"He 100% does. It's why a couple weeks ago, he was in the headlines for making an opponent resign after 1.g4. He was doing that opening all day.","score":228,"comments":[{"body":"It also plays into what I was talking about. The games were really short time controls, so getting opponents out of prep in the very beginning, or even just making them pause for a moment can be a huge advantage. Once there, Magnus is a better pure chess player, especially intuitively, than basically everyone. I think only Hikaru was able to beat him in that online event.","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Yeah, as Anish put it, Magnus isn’t scared of any person, he’s only scared of engines. Once he’s confident that he’s no longer playing against an engine (line), he knows that he’s the better player and can just force his opponent to try to outplay him with their own talents.","score":96,"comments":[{"body":"Wow, it must be incredibly hard to be dominant in chess in a post engine world. Not only do you have to play much better than everyone else, but you also have to play positions that put you at a disadvantage. If you play the best move you will just be playing the engine for the next 30 moves, presumably to a draw.","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This is a very interesting perspective on Magnus’ prep. As an amateur, I always took Magnus’ prep as making weird divergences from the main lines as a way for him to take opponents out of their prep and play positions that *he’s* very good at playing. But it actually goes another level deeper, where he’s not just playing weird positions that he’s good at, but weird positions that his opponent is not good at. Very impressive considering top players like Fabi and Hikaru really aren’t “bad” at playing any type of position. It must take some insane scrutiny to dissect their games like that and translate it into prep. It explains a lot about how he just destroys top players in these unfamiliar looking middle games\n\nOf course, can’t exclusively credit this to him. He also has a team of GMs helping him to prep but still","score":88,"comments":[]},{"body":"When it comes to chess and especially Classical chess format, Magnus simply has no discerning* weaknesses, which is insane if you think about it.","score":194,"comments":[{"body":"Occasionally, this quote will get posted on here with people asking for a modern equivalent: “Play the opening like Kasparov, the middle game like Tal, and the endgame like Capablanca.”\n\nIt seems that if you play the opening like Carlsen, the middle game like Carlsen, and the endgame like Carlsen, you will perform somewhat decently","score":324,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Recommendations for a tournament sized budget chess set in Canada?","not_safe_for_work":false,"locked":false,"body":"I spent a while watching youtube reviews of plastic chess sets and [this video](https://www.youtube.com/watch?v=nm5b408_4r0) from Al Su Chess had me quite interested in the premium chess combo set from House of Staunton, but to my dismay the $69 CAD set has a shipping cost of $61. Ordering 2 sets doesn't seem to qualify me for the free ground shipping on orders over $100, so I just can't justify the purchase.  \n  \nNow I'm leaning towards buying the 'best chess set ever' weighted set off Amazon(.ca) for around $50 CAD, but after watching so many review videos I somehow learned to care that the board it comes with is vinyl and not mouse pad, as well as how the bishop is purportedly very similar in height to the queen. I know beggars can't be choosers so I'll probably just end up getting this one, but I thought I'd ask here before buying in case there's something a little nicer for around $50-$80 CAD.","score":2,"comments":[{"body":"From what I've heard, House of Staunton has some terrible quality control. Don't know personally, and maybe they've fixed it, but I remember reading some truly atrocious reviews.","score":2,"comments":[{"body":"Well to be honest, the review video I linked has a section where the guy weighs the pieces, and there are significant differences in weight between black and white. It's kind of nit-picky stuff, but I do nit-pick, and it does suck.","score":3,"comments":[]}]},{"body":"Have you seen https://www.regencychess.ca/chess-sets/plastic?zenid=tfqd59qkfk69kjrtq923h516c2","score":1,"comments":[]},{"body":"You'll usually save with a domestic retailer once shipping is factored in.\n\nThere are lots of Canadian online chess retailers that will sell you the same set or similar.","score":1,"comments":[]},{"body":"I have a Best Chess Set Ever and I assure you the queen is shorter than the king, even not including the cross.\n\nAlso it is not vinyl, but silicone, so the pieces don't easily slide. Up to you if you like that. You can also buy a set of its quadruple weighted pieces on Amazon for $24 USD, but I have no idea how other sets compare.","score":1,"comments":[]}]},{"title":"Struggling Intermediate Player...send help?","not_safe_for_work":false,"locked":false,"body":"good morning fellow chess enthusiasts, \n\ni am a struggling intermediate player &amp; i seriously have no clue where to start in terms of progression. \n\ni paused on my 9999th blitz game on CDC to \"celebrate\" my 10k-th blitz game once i believe my chess skill have grown. below are my stats as i have self-promised myself to focus on rapid until i see improvement to my liking.\n\non CDC:\n-blitz...1900s (paused to focus on rapid)\n*ive briefly broken through 2k at times!\n-rapid...17-18ish (wanting to break 2k rapid)\n\n-puzzles...around 22oo-23oo\n-all other forms of chess i really dont invest in that much (bullet, etc)\n\nalso, do my stats even align as being an intermediate player? last i checked my USCF was 13-14ish😬 which may or may not be outdated?😅😬 *ALSO, i am open to online tutoring 1000 &amp; under/beginners/newbies*\n\n*no, i dont want to become a GM one day.\n*yes, id like to honor my chess coach who passed away by becoming a NM in my lifetime. (even if many say that the input may not be worth the output, *within the chess world)\n\n*to be fair, i am not online daily as i currently work for WDW &amp; i am completing my undergrad. ironically, i think once i am in grad school &amp; IDEALLY with a campus job that pays for my masters (yes ive looked into it &amp; itd be paid for), then ill have \" more\" adult hours to study better at my leisure-ish. (my age goes with the year)\n\ntysm in advance my fellow chess enthusiasts!","score":4,"comments":[{"body":"Sure, I'd say that's intermediate.\n\nI think if you're really struggling with progression, working with a coach long-term can help. Everybody is different and your mileage may vary, but it's good to have a stronger player work with you on the things they see that you can improve on - things you might not notice, understand, or be able to easily teach yourself.\n\nI think the most fundamental part of improving is playing longer games, analysing them, and trying to improve your play that way by reviewing and learning. A coach will improve the effectiveness of this process.\n\nEverybody is a bit different too. Some people just do some tactics, try harder, blunder less, and win more games - and they can achieve a very strong rating this way. A lot of us have to work on different parts of the game, including finding and learning openings/lines/positions that we feel comfortable in.","score":3,"comments":[]},{"body":"Hello! If you're looking to get better at chess, we have lots of resources for improvement in the /r/chess **[FAQ](https://www.reddit.com/r/chess/wiki/faq)** and/or **[Online Resources](https://www.reddit.com/r/chess/wiki/resources)** pages. Here is the relevant section you may be interested in:\r\n\r\n***\r\n\r\n**[How do I get better at chess?](https://www.reddit.com/r/chess/wiki/improve)**","score":2,"comments":[]},{"body":"Your 1900+ in blitz on chess.com is really good. It is surprising that your rapid rating is so low compared to it. You have the same rapid rating as me but my blitz rating is around 1500. Your puzzle rating is also incredibly low for your blitz strength.\n\nI have no doubt you'll be able to break 2k rapid in a few weeks easily. I have no advice, sorry lol but good luck for your NM title one day, that's another beast!","score":2,"comments":[{"body":"i started out on the account ONLY playing 3min blitz for the LONGEST. (hence why my online rapid rating may appear low compared to my online blitz rating) \n\ni figure my puzzles is so low bc:\nA=im not able to be on everyday🤦‍♂️\nB=im f2p, so i only do my handful (5-7ish each day im on)\n\nhonestly, i think my TRUE USCF rn is...MAYBE a weak 1500? idk🤦‍♂️ the road to NM is certainly another beast.","score":1,"comments":[]}]},{"body":"How is your rapid rating lower than your blitz? That’s really odd. At that blitz rating I’d expect your rapid to be between 2100 and 2300 somewhere.","score":2,"comments":[{"body":"i started my account on CDC by ONLY playing 3min blitz games up until recently when i played my 9999th 3min online blitz game. id also think my rapid would be higher yet ive only played a couple HUNDRED online rapid.\n\nat that moment, i took a step back &amp; remembered my future goals with chess. so i told myself i wouldnt play my 10k-th 3min online blitz game until i hit my 10k online rapid. you truly think for CDC ratings that RAPID is usually 200-400 HIGHER than BLITZ?\n\ntysm for taking the time to comment.🥲😅🙂","score":1,"comments":[{"body":"Yes, stronger players often play only blitz online, so the player pool in shorter time controls is much stronger. I’d say most players are 200-300 points higher rated in rapid than in blitz.","score":2,"comments":[{"body":"with an end goal of NM, i figured itd be best to step away from 3min for awhile &amp; focus on some rapid/10min for awhile. thoughts on CDC ratings in relation to USCF rating?","score":1,"comments":[]}]}]}]}]},{"title":"High stress level while playing chess?","not_safe_for_work":false,"locked":false,"body":"Hi Everybody, \n\nI wanted to inquire, does anybody suffer high stress levels while playing? I corroborated this by using a Garmin Watch. My stress level climbs to 80 to 100% while playing when by comparison I'm typically fairly relaxed the rest of the day. After a few hours of playing I'm exhausted. I read about it and seems common. I tried some copping mechanisms like slow breathing and using positive mind-sets but nothing seems to work. \n\nI'm at a loss because I love to play but I also love my health.. Does anybody have any insight? Will it get better? I started playing as a kid, including tournaments and a few decades later I restarted playing more often after the Queens Gambit was on.","score":1,"comments":[]},{"title":"Can anyone explain me this solution?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"Queen C1 is checkmate because of the bishop.","score":1,"comments":[{"body":"Ohh yaa i missed that","score":1,"comments":[]}]}]},{"title":"How rare are the chess.com brilliant moves?","not_safe_for_work":false,"locked":false,"body":"I am a casual player who started to try to improve in chess 8 months ago and never have I ever made a brilliant(double exclamation : !!) move up until 2 days ago. And after that I made another one yesterday. I tried to search the web to find out if these are rare or very common among casual players but didn't come across a satisfying answer. Can somebody elaborate?","score":1,"comments":[{"body":"They devalued it, so now everyone is getting one","score":2,"comments":[{"body":"Thank you. It makes sense.","score":2,"comments":[]}]},{"body":"All my moves are brilliant","score":1,"comments":[]},{"body":"I keep getting ??","score":1,"comments":[]}]},{"title":"What strategies do you look for after you control the center? How to take advantage from that?","not_safe_for_work":false,"locked":false,"body":"At this game(photo bellow) I was for some turns looking for controlling the center with pawns and bishop. After I achieved that I was a little like ok what do look for now. Tried to exchange some pieces and put some traps which went good. But I generally dont know how to take advantage from controlling the center, how do you use the center after you achieve it ?   \n\n\nhttps://preview.redd.it/tr8e9bnpub1a1.png?width=781&amp;format=png&amp;auto=webp&amp;s=29b2fd68d81f11802ae2bb0b3ac547acb9f609ee","score":5,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=r4rk1/ppqn1ppp/5n2/2bpp3/8/3PBN2/PPP2PPP/RN1QR1K1+b+-+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r4rk1/ppqn1ppp/5n2/2bpp3/8/3PBN2/PPP2PPP/RN1QR1K1_b_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Bishop!&lt;, move: &gt;!Bxe3!&lt;\n\n&gt; Evaluation: &gt;!Black is better -1.28!&lt;\n\n&gt; Best continuation: &gt;!1... Bxe3 2. Rxe3 Rac8 3. c3 e4 4. Ne1 Nc5 5. Nd2 Rfe8 6. h3 h6 7. Qc2 Nxd3 8. Nxd3 d4 9. Rg3!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Ok, why do we even want to have control over the center? What is the point of it?\n\nHaving a strong center essentially means that you have more space. And having more space is good for two reasons: because your pieces have more freedom to maneuver and because your opponent's pieces have less freedom to maneuver.\n\nBut this doesn't mean that you get an advantage automatically. All it means is that, potentially, you have better chances to regroup your pieces in such a way as to create pressure over the opponent's position - and then, potentially, your opponent will have a hard time to parry your threats, since their maneuvering possibilities are limited.\n\nYou still need to find out how to create problems for your opponent concretely. If you can find a weakness in your opponent's position and attack it, this will hopefully tie down some of their pieces to defend it, further limiting their mobility.\n\nYou are still playing chess - trying to improve your pieces to maximum, to achieve greater and greater activity, while preventing your opponent from doing the same.\n\nIn this position your pieces aren't all that great yet. Your rooks are still on closed files and your knight d7 is rather passive. So you haven't made a great use of your superior space yet. You need to find ways to make those pieces more active. You have a half-open file c, and you can potentially try to create some pressure on it, but that's a future task, as currently White can easily play c2-c3. Your first task is to improve your pieces and then start looking for potential targets.\n\nEssentially, you don't win games because of having more space (or center). You win games because of superior activity. This activity leads to tactical and attacking opportunities.\n\nBut you can use your space to achieve superior activity.","score":8,"comments":[{"body":"thanks for the commentary and game analysis! I think you clicked the part I have missing by connecting space+activity and control of the center.  Thanks a lot buddy, good games to you!  \n\n\nYes the rooks and should be on more active squares, it was the start of the middle game I had just castle irc.","score":2,"comments":[]},{"body":"Awesome response (and question).","score":1,"comments":[]}]},{"body":"Tactics flow from a superior position","score":0,"comments":[]}]},{"title":"Anybody randomly lose their chess vision?","not_safe_for_work":false,"locked":false,"body":"I'm trying to understand this issue that I have where I will go on a streak of a few days where I gain 30,40 50 Elo, and play solid to great...\n\n... then all of a sudden I go down 100 and can't calculate, or I'll hang pieces everywhere.\n\nAnybody else have this happen where you just stop playing to your level for (seemingly) no reason?\n\nAbout 1700 Lichess btw.","score":80,"comments":[{"body":"I think it's completely normal. In fact, I think it applies not just to chess but to all cognitive performance. There are lots of factors: sleep, mood, stress, diet, exercise, time of day. Playing too many games in one sitting can also be detrimental.","score":67,"comments":[{"body":"For some reason i got highest rating these days while i was in terrible mood and my sleep was terible and pretty non existant","score":10,"comments":[{"body":"That's interesting. I would be willing to bet you will play better and more consistently with good mood and sleep, though.\n\nI forgot to mention it, but there is also the fact of short term variance. You can't conclude too much from a small sample of games; long-term trends with hundreds or thousands of games will tell you the real story.","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Happens to me, too. I was 1660 rapid (chess.com) and all of a sudden, just lost it for some reason, went down to 1560. \n\nI think there are several possible reasons for this, and they definitely vary person to person. I was going through a stressful time in my life, that had to have affected my play. I was playing in the evening, which I know for a fact I play worse in the evening. I play much better in the middle of the day, or late morning. Currently, I’m only playing rated games in the optimal time, and I’m seeing my rating rise. Hopefully I’ll get back to 1660 one of these days.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Usually this happens to me when I play compulsively and start playing fast and reactionary moves without thinking, they can be straight blunders or just lead to weak positions.  At this point it means I need to take a break and do something else.  Also I have found not playing immediately after losing a game helps avoid taking additional loses since I tend to play worse immediately following a loss.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This post has been parodied on r/AnarchyChess.\n\nRelevant r/AnarchyChess posts: \n\n[Anybody randomly lose their vision?](https://www.reddit.com/r/AnarchyChess/comments/z0pm3p/anybody_randomly_lose_their_vision/) by OutsideScaresMe\n\n[Anybody randomly lose their chess vision?](https://www.reddit.com/r/AnarchyChess/comments/z0ue07/anybody_randomly_lose_their_chess_vision/) by Energia360\n\n[^(fmhall)](https://www.reddit.com/user/fmhall) ^| [^(github)](https://github.com/fmhall/relevant-post-bot)","score":2,"comments":[]},{"body":"it's easy to have streaks. sometimes how well you play chess is based on your mood. you notice this in even the best players- they have a bad day at some high stakes tournament and they're just unable to shake it off; the next matches they lose due to uncharacteristically bad play. look at the games in any tournament and you'll find at least one player that's going through it. people have different ways to attempt to shake it off, with various levels of success. some will meditate, some will play bullet chess some will play skittles chess, some will exercise, etc.\n\npersonally, i know i lose rating when i learn new things in chess, because i lose track of the nuances and caveats when focused on my new plan. so i try to switch to learning a few new concepts when i'm doing poorly, and know that i'm improving in some way even if my rating doesn't show it","score":2,"comments":[]},{"body":"Mentality may be at play. i cant play well when im thinking about other things, it distracts me, so i try not to play then","score":2,"comments":[]},{"body":"Keeping at your peak is tricky. I find visualization drills help me get in the right mindset.\n\nRecord yourself reading the moves from a game, then listen back to it with your eyes closed. Restart anytime you lose track of the position. Do that for 10 minutes before you play for the day. You’ll prime your brain to see things much more clearly, and that will help you play closer to your peak strength each session :)","score":2,"comments":[]},{"body":"I heard a GM Avetik Gregorian once say (in regards to online blitz) that the best way to increase your rating is to \"lose less\". Being that Chess is a martial art of the mind, like its real world physical counterpart your mind can get run down or tired. Blitz and bullet can be REALLY addicting. What tends to happen is you finish your game, click new game, play someone, rinse and repeat. If you look at the situation you realize that often you didn't give your mind a break, but instead kept on playing in a potentially weakened or tired state. Then before you know it you start getting emotional or upset at your losses and start playing not to play well, but to get your rating points back. This for many is the beginning of a tilt. Im not always perfect (I too get sucked into blitz/bullet black holes) but for me Ive found that focusing mostly on studying chess/ tactics in my free time (with a reduced amount of blitz) has done wonders for my rating.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"White forces mate or gains a decisive material advantage","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=1n3rk1/5pp1/r2Q3p/pp1R1P2/6q1/4B3/PPP3PP/4R1K1+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/1n3rk1/5pp1/r2Q3p/pp1R1P2/6q1/4B3/PPP3PP/4R1K1_w_-_-_0_1)\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=1n3rk1/5pp1/r2Q3p/pp1R1P2/6q1/4B3/PPP3PP/4R1K1+b+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/1n3rk1/5pp1/r2Q3p/pp1R1P2/6q1/4B3/PPP3PP/4R1K1_b_-_-_0_1)\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Qxf8+ forces mate if the king takes and allows further material gain if kh7\n\nMate being qxf8+ kxf8 rd8+ ke7 bg5#\n\nIf im not mistaken anyways","score":1,"comments":[{"body":"[deleted]","score":0,"comments":[{"body":"If you go bb6+, the king can escape to f6. The rook blocking is not an issue because the final checkmate is a double check from the rook on e1 as well as the bishop","score":1,"comments":[]}]}]}]},{"title":"Easy win for black... but can you spot the mate in 2?","not_safe_for_work":false,"locked":false,"body":"","score":532,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=8/6p1/3kPp1p/2q4P/2p1K3/2P5/8/8+b+-+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/8/6p1/3kPp1p/2q4P/2p1K3/2P5/8/8_b_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Queen!&lt;, move: &gt;!Qf2!&lt;\n\n&gt; Evaluation: &gt;!Black has mate in 2!&lt;\n\n&gt; Best continuation: &gt;!1... Qf2 2. e7 f5#!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Took a second,  but if you look for a way to attack all surrounding squares of the king, it becomes pretty clear.","score":156,"comments":[{"body":"Yeah same, I was looking for a way to stop the King simply returning to his own side of the board and only ||qf2|| does that","score":15,"comments":[{"body":"To your point it’s a really solid foundational mating net puzzle. Recognizing that the biggest limiting factor to mate is the escape path.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Same.  Once I knew this was a puzzle with mate in 2, I looked at how to restrict the king as much as possible.  There was 1 very clear move, given the king was currently wide open on the top left side of the board.  The next supported check was obvious as well.  \n\nI doubt I would have found this in game though. I probably would have taken the white pawn without hesitation, then proceeded to march a pawn up the board to gain a queen.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Figured this out pretty quick since it was presented as a puzzle.  In a game with the clock going?  &gt;!Qf2!&lt; wouldn't register as a move worth considering.","score":35,"comments":[{"body":"Same. No chance I'd even think of this.","score":13,"comments":[]}]},{"body":"Qf2 to stop the King from running away and then f5#.","score":89,"comments":[]},{"body":"Nifty","score":9,"comments":[]},{"body":"&gt;!1. ... Qf2 2. e7 f5#!&lt;","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Patterns that arise from algebraic analysis?","not_safe_for_work":false,"locked":false,"body":"If I didn't phrase the title clearly: are there any interesting or insightful patterns that arise in chess if you take an algebraic approach to looking at chess? That is, looking at moves as operations, or maybe looking at sets of moves and permutations of those sets and... seeing what happens, I guess.\n\nAn example of this kind of thing appears in sudoku, [demonstrating equality between certain cells of the sudoku grid via manipulation of the board, rows, and columns.](https://masteringsudoku.com/phistomefel-ring/)","score":1,"comments":[{"body":"RemindMe!","score":1,"comments":[{"body":"**Defaulted to one day.**\n\nI will be messaging you on [**2022-11-22 23:20:49 UTC**](http://www.wolframalpha.com/input/?i=2022-11-22%2023:20:49%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/chess/comments/z1bja5/patterns_that_arise_from_algebraic_analysis/ixacntj/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fchess%2Fcomments%2Fz1bja5%2Fpatterns_that_arise_from_algebraic_analysis%2Fixacntj%2F%5D%0A%0ARemindMe%21%202022-11-22%2023%3A20%3A49%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20z1bja5)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)|\n|-|-|-|-|","score":1,"comments":[]}]},{"body":"A couple of things like this I have heard of: Knights tour &amp; n-Queens problem.\n\nNot sure that's exactly what you're after, but something to search anyway.\n\nI think both are used in education on computer algorithms.","score":1,"comments":[]}]},{"title":"Looking for recommendations for a premium Chess set for my Dad for Christmas","not_safe_for_work":false,"locked":false,"body":"Hi all. Very much new here and have no idea what I'm doing, but thought this would be a good place to start. \n\nI've always struggled to find Christmas gifts for my Dad. He used to be a master woodworker who loved good food and a strong drink, but now he has Diabetes and Alzheimers and is unable to enjoy any of those things anymore. \n\nThat said, he recently took up Chess with my Mum. We are delighted because it's the best thing he could do to improve his brain health, and I would like to encourage his new interest with a really beautiful premium Chess set for Christmas. \n\nI considered going the handmade route (Etsy) and saw some gorgeous offerings there, but ultimately what I find pretty might be complete tat, whereas I'd like to get him \"the Rolex of Chess sets\" or something to that effect. I know these things can get quite pricy, and I'm sure we can't afford the very high-end options, but we can definitely afford something between 300 and 500€, which I hope can get us somewhere. Might even be able to go higher if I rope other family members in.\n\nSo I thought it would be best to put my question to people who know their stuff :) What make or maker would you recommend? What Chess set would blow your reindeer socks off if you found it under the Christmas tree :) ? \n\nThanks for reading x","score":12,"comments":[{"body":"[https://www.houseofstaunton.com/chess-sets/luxury-wood-chess-sets/the-reykjavik-ii-series-chess-set-and-board-combination-13338.html](https://www.houseofstaunton.com/chess-sets/luxury-wood-chess-sets/the-reykjavik-ii-series-chess-set-and-board-combination-13338.html)\n\nThis is one of the cleanest and best chess sets. It isnt the most expensive but definetly on the top of the chart for playable, good looking and high end sets","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"https://www.chesshouse.com/\n\nThis is where I bought my electronic chess set.  They have some amazing regular chess sets as well.","score":5,"comments":[{"body":"Thanks, I'll check the website out :)","score":1,"comments":[{"body":"Also check out Staunton Chess Website it is the “Premium” site for chess stuff.","score":1,"comments":[]}]}]},{"body":"https://www.purling.com/chess/chess-sets this is shop to buy the \"rolex\" of chess sets, but the lowest prices are higher than 500. It doesn't help to check it out tho, and good luck finding what you want","score":5,"comments":[{"body":"Scam right  here.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"You could try contacting a local carpenter/craftsman/woodworker and ask how much a customised chessboard might cost. You could then order the pieces online.","score":5,"comments":[{"body":"I thought about this! I just wasn't sure whether I was looking at it from an artsy standpoint and whether that'd make sense from a chess player's standpoint, so thanks for the recommendation, I'll look into it :)","score":3,"comments":[]}]},{"body":"DGT Boards are the official boards of the world championship and are in about that price range depending on the model.","score":2,"comments":[]},{"body":"This is worth checking with free shipping in UK/EU https://shop.worldchess.com/collections/chess-sets/products/world-chess-championship-set-wenge-board\n\nIt's a little out of your price range but you could buy a board separately from another shop at a lower price. Anything with 5-5.7cm squares.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"any connection between physical fitness and long otb games?","not_safe_for_work":false,"locked":false,"body":"I know magnus is quite fit, what about in the lower levels?","score":2,"comments":[{"body":"Helps a lot too. Obviously, a better player who’s less fit will still win against a fitter player who is worse at chess. But in a game between two equal players, physical fitness certainly helps when the game goes past the 3 hour mark. And in a tournament where you spend 10 hours a day on chess for a week, physical fitness most definitely helps keeping up some standard of play towards the latter stage.","score":2,"comments":[]},{"body":"https://www.cnbc.com/2019/09/22/chess-grandmasters-lose-weight-burn-calories-during-games.html","score":1,"comments":[]},{"body":"Very much so.\n\nIt's easily worth 100 rating points in general. If you are playing long games and long tournaments, it can be worth even more.","score":0,"comments":[]}]},{"title":"Can someone break down the move ratings for me?","not_safe_for_work":false,"locked":false,"body":"Got a brilliant and a great move on chess.com. What does that mean exactly? I assume they are situations where the game is turned to my advantage but I don’t really know.","score":0,"comments":[{"body":"https://support.chess.com/article/2965-how-are-moves-classified-what-is-a-blunder-or-brilliant-and-etc","score":2,"comments":[]}]},{"title":"After black plays Rc5… white to play and win - from chess.com daily grind :)","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=8/6kP/5rP1/5PK1/8/8/8/8+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/8/6kP/5rP1/5PK1/8/8/8/8_w_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Pawn!&lt;, move: &gt;!h8=Q+!&lt;\n\n&gt; Evaluation: &gt;!White has mate in 7!&lt;\n\n&gt; Best continuation: &gt;!1. h8=Q+ Kxh8 2. Kxf6 Kg8 3. g7 Kh7 4. Kf7 Kh6 5. g8=Q Kh5 6. Qg3 Kh6 7. Qh4#!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Did you mean after black plays 1... Rc6 from this position?","score":2,"comments":[{"body":"Yes","score":1,"comments":[]}]},{"body":"Note if you found f6+, black then plays Kh8","score":1,"comments":[{"body":"&gt;!f7, and then Kh6!&lt;?","score":1,"comments":[{"body":"After f7, Rxg6+","score":1,"comments":[]}]}]},{"body":"Is it f6 takes and then queen your pawn","score":1,"comments":[{"body":"After f6 check, Kh8","score":1,"comments":[]}]}]},{"title":"Black to Play and Win","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=6k1/5p2/5P1R/pp4pP/4K3/2P1B3/3r4/8+b+-+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/6k1/5p2/5P1R/pp4pP/4K3/2P1B3/3r4/8_b_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Rook!&lt;, move: &gt;!Re2!&lt;\n\n&gt; Evaluation: &gt;!Black is winning -10.10!&lt;\n\n&gt; Best continuation: &gt;!1... Re2 2. Kd3 Rxe3+ 3. Kc2 a4 4. Kd2 Rd3+ 5. Kc2 Rh3 6. Kb2 g4 7. Ka3 Rxc3+ 8. Kb4 Rb3+ 9. Kc5!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"I'm guessing Re2 and taking the bishop wins and you just push your pawns, preferably the a pawn\n\nwhite can try to sacrifice the rook to get connected pawns but that doesn't work out, so it's very simple","score":2,"comments":[]},{"body":"White’s rook is so lost… I would start by pinning the bishop though, we have time to get that rook.\n\nOnce it’s down to pawns only, black has a high chance of promoting and white, none.","score":1,"comments":[{"body":"There's no way for black to attack the rook, so its not lost. It is trapped though, so black can trade his rook for the bishop and promote the a pawn.","score":1,"comments":[{"body":"Hm, I meant lost in the sense that he doesn’t know where he is but I get what you mean ^^","score":1,"comments":[]}]}]}]},{"title":"Top quality guide on the Queen's Gambit","not_safe_for_work":false,"locked":false,"body":"https://youtu.be/mfLWVoXogKo\n\nFor those of you who are looking to adopt a d4 repertoire, this is an excellent place to start. I've been looking for a quality guide on the Queen's Gambit for a long time and I came across this yesterday. I think this would be a good resource for players below 1800\n\nPS: This is a very underrated channel imo and certainly deserves a shoutout as well.","score":11,"comments":[{"body":"This post has been parodied on r/AnarchyChess.\n\nRelevant r/AnarchyChess posts: \n\n[Top quality guide on the Queen’s Gambit](https://www.reddit.com/r/AnarchyChess/comments/z10xe1/top_quality_guide_on_the_queens_gambit/) by OutsideScaresMe\n\n[^(fmhall)](https://www.reddit.com/user/fmhall) ^| [^(github)](https://github.com/fmhall/relevant-post-bot)","score":3,"comments":[]}]},{"title":"Global Chess endgame gems","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[]},{"title":"Translation of Russian Chess Proverb","not_safe_for_work":false,"locked":false,"body":"Saw this posted on a game; Google translate isn’t doing it justice. Can anyone help:\n\nКто в шахматах не зевал - тот жизни не знавал! \n(народная мудрость)","score":4,"comments":[{"body":"\"Who did not blunder in chess - he did not know life!\" from google translate is pretty close to meaning.  \nIn original it sounds much more poetic...","score":7,"comments":[{"body":"Thanks. I got something about yawning from the translator. Your way makes much more sense.","score":2,"comments":[]}]}]},{"title":"Pixelart chess?","not_safe_for_work":false,"locked":false,"body":"Hey! I know this is a bit random, but could someone lead me in the right direction here? I'm just starting to get into chess again. I am looking for a chess game I can play on the browser or even an Iphone that's pixel art styled. Just classic chess with an AI to play. Nothing fancy, I just am not sure if any sites exist like this! Just thought it would look cool to play. Thanks a bunch for any help!!","score":2,"comments":[{"body":"You can load custom sets in lichess I believe. example: https://www.reddit.com/r/lichess/comments/mmson4/i_made_a_custom_cosmic_set_for_lichess/\n\nThe chess kids app is also pretty cartoony but not quite pixel.","score":5,"comments":[{"body":"You are awesome, thank you!","score":1,"comments":[{"body":"Both Lichess and chess.com have pixel art piece sets: explore the settings menu to pick a different style, and look for Pixel on Lichess and 8 Bit on chess.com.","score":1,"comments":[]}]}]}]},{"title":"World chess tourney kicks off in Jerusalem, featuring star accused of cheating","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"star? lol he isn't a star, and if he is its only because of the accusations","score":9,"comments":[{"body":"Depends how you look at it I guess. If he isn’t cheating he is 19-year old 2700 GM. That is decent - maybe not a *star* but certainly a top player.","score":28,"comments":[{"body":"Well technically not 2700. But yes still top player.","score":0,"comments":[]},{"body":"Definitely not a star. Chess stars are probably just Magnus and Hikaru among active players, in terms of wide recognition. Tons of other great players but there's no recognition for them (at least it off their respective countries).","score":-15,"comments":[{"body":"If you’ve ever tried to get an interview with a certain Mr. Anand and had to wait in line for 2 hours just to *ask* if he’d be available at some later point, you’d probably be of a different persuasion. To be fair I myself was ignorant to the true popularity of chess until that moment. I’m telling you Anand literally couldn’t walk more than one step before some new fan wanted a picture, an autograph or propose some business deal. Chess players may not be stars like the great footballers of our time, but they are much much much more famous than I was willing to believe until I saw it with my own eyes.","score":20,"comments":[]}]}]}]},{"body":"A star? Must be an imploding one...","score":-5,"comments":[{"body":"I agree that you can call him a star, but I would not go as far as saying that he outshines all the other stars in the galaxy (or that when the shining stops, what is left over is incredibly dense).\n\nEDIT: In case you didn't know, when stars implode they go supernova. Don't misuse physics metaphors when among nerds.","score":1,"comments":[]}]}]},{"title":"Interview with GM Hans Niemann, USA | World Team Championships -Round 4 |","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Was that interviewer looking for a swimming sound bite from Hans? What the heck was that at the beginning.","score":2,"comments":[]},{"body":"What questions were these god damn","score":2,"comments":[]},{"body":"go eat another burger cheater","score":-1,"comments":[]}]},{"title":"Black to play and find the only winning move.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=6k1/p5p1/1qp2p2/3b3p/P6P/2pB1P2/2P3KQ/R1B1r3+b+-+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/6k1/p5p1/1qp2p2/3b3p/P6P/2pB1P2/2P3KQ/R1B1r3_b_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Pawn!&lt;, move: &gt;!&amp;nbsp;&amp;nbsp;a5&amp;nbsp;&amp;nbsp;!&lt;\n\n&gt; Evaluation: &gt;!Black is winning -7.47!&lt;\n\n&gt; Best continuation: &gt;!1... a5 2. Ra3 Rxc1 3. Rxc3 Rd1 4. Be2 Re1 5. Bf1 Qb1 6. Qg1 Qb4 7. Qe3 Qg4+ 8. Kf2 Qxh4+ 9. Kg2!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Crazy! Love it.","score":2,"comments":[]},{"body":"My god, a5 is zugzwang!","score":2,"comments":[{"body":"Yes it is","score":1,"comments":[]}]}]},{"title":"Can you find mate in 10? White to move.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=1r1q2kr/pbppp1bN/1p3n2/8/5Q2/2P1P3/PPB2P1P/RN2K1R1+w+Q+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/1r1q2kr/pbppp1bN/1p3n2/8/5Q2/2P1P3/PPB2P1P/RN2K1R1_w_Q_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Rook!&lt;, move: &gt;!Rxg7+!&lt;\n\n&gt; Evaluation: &gt;!White has mate in 10!&lt;\n\n&gt; Best continuation: &gt;!1. Rxg7+ Kxg7 2. Qg3+ Kf7 3. Bg6+ Ke6 4. Ng5+ Kd5 5. Qf3+ Ne4 6. Qxe4+ Kd6 7. Nf7+ Kc5 8. Qd4+ Kb5!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"No","score":3,"comments":[]},{"body":"On a good day i can find mate in 1","score":2,"comments":[]},{"body":"This is something that I'm like, hehe easy peasy, then fail to find in a 10 minute match","score":1,"comments":[]},{"body":"I didn't look much, Rxg7 is obvious but cannot see the complete mate, I would just take it and play through the mate","score":1,"comments":[]}]},{"title":"Can nootropics help to play better chess?","not_safe_for_work":false,"locked":false,"body":"I'm curious what the research is out there about nootropics and other such drugs helping to play chess? And also what is the laws on those drugs? I'm assuming they're not allowed in any competitions or what not.","score":0,"comments":[{"body":"Nootropic is a broad term incorporating everything from caffeine, to nicotine to meth. If you banned caffeine and/or nicotine you would upset a large portion of chess players :)\n\nI assume you are thinking more along the lines of Ritalin, Modofinil, etc.","score":3,"comments":[]},{"body":"- - -\n* [Proven: Performance-enhancing drugs for chess](https://en.chessbase.com/post/proven-performance-enhancing-drugs-for-chess)\n\n* Modafinil: [\"I'm SURE that the top players are doing it\"](https://www.youtube.com/watch?v=0Czvr0-6wPI&amp;t=405s) - GM Jesse Kraai\n\n- - -","score":3,"comments":[{"body":"Personal anecdotes: Adderall helped me play longer, I could see benefits in terms of prolonged focus. My chess moves didn't get better per se, but being more focused reduces blunders, helps finds tactics, etc. So, certainly some benefit, but didn't help me find moves I could not typically find. I have always find this butchered saying most accurate for adderall: Adderall doesn't make you smart, it helps you think fast and long. \n\nModafinil et al: Bupkis.","score":1,"comments":[{"body":"Adderall didn't change or help my chess at all","score":1,"comments":[]}]}]},{"body":"It's an interesting question. First thing to note is that caffeine is a \"nootropic\", and I can't imagine that they prevent people from drinking coffee. I would be very curious to know if top players find coffee beneficial.  \n\n\nIn classical games where endurance is a big factor, one would assume any drug which can prevent fatigue would be an advatage. As for improving the \"quality\" of your thinking / cognition, that would be a harder question to answer with clarity. Try playing 10 games before a coffee and 10 games after? I tend to play better after my morning coffee \\^\\_\\^  \n\n\nTo answer the question on laws, I found this link:  \n\n\n[https://www.fide.com/FIDE/handbook/WADA%20Anti%20Doping.pdf](https://www.fide.com/FIDE/handbook/WADA%20Anti%20Doping.pdf)  \n\n\nThis link also sends you here: [https://www.wada-ama.org/](https://www.wada-ama.org/)   \n\n\nUnsurprisingly, amphetamines and related substances are banned.  \n\n\nModafinil is banned, this is one of the most widely used nootropics.  \n\n\nInterestingly it says caffeine is not prohibited but it is potentially \"monitored\" at competition level and above a certain level might be considered illegal. Unsure if I'm interpreting it correctly and don't have time to work it out right now (if someone else wants to chime in?)","score":3,"comments":[{"body":"Caffeine wouldn't be productive for a tournament I wouldn't think. You'd boss the first game then want to nap for the remainder. You'd need something with a prolonged experience (like amphetamine based meds).\n\nNoopept always felt like caffeine to me without the jitters. I found it easier to read text books (IT documentation, CCNA etc) with it, never experimented with chess though.","score":1,"comments":[]}]}]},{"title":"Can the Scotch take me to 17/1800 on chess.com?","not_safe_for_work":false,"locked":false,"body":"Currently 1400 solely playing the London. \n\nFinding it a bit soulless now, keen to play e4. Is the scotch game solid enough to play until I reach around 1800? I like the look of some of the lines. Or should I be playing Ruy Lopez instead?\n\nI do expect to plummet in rating as I transition!","score":0,"comments":[{"body":"I believe you are overthinking the importance of one opening over the other. Certainly you should play something different if you are bored. But don’t expect it to skyrocket (or tank) your ratings.","score":5,"comments":[]},{"body":"I have been using the scotch opening from about 1000 to 2000 chess com rapid. I think it’s great and probably the most underrated e4 opening so yeah I recommend it","score":5,"comments":[]},{"body":"I think it's possible to reach very high ELO even with unpopular openings (Carlsen uses the BongCloud against the top players on the world and still wins even though it's a reqlly bad opening). Having said that I think at that rating it's important to explore diferent openings for the sake of learning new tricks and see different patterns in the game. I am now using the central gambit which is a rather bad opening and I'm at 1800 in chess.com but I want to keep changing it to explore different game styles","score":4,"comments":[{"body":"Carlsen has high rating despite playing trashy openings at times, not because he is playing trashy openings at times. For 99% of the chess population, his rather shady occasional opening choices won't work.","score":1,"comments":[]}]},{"body":"I played Four Knights from Keep It Simple E4 to 1900 [Chess.com](https://Chess.com) / 2100 Lichess and still have wins right out of opening theory.","score":2,"comments":[]},{"body":"The scotch is a perfectly legitimate opening even into master level play, albeit a bit drawish. The Spanish or the Italian are also good options if you want to get into 1. E5. Have something to play when you’re greeted with the Sicilian.","score":1,"comments":[]},{"body":"The problem with the scotch is that a lot of lines (especially in the 4...Nf6 5. Nxc6 bxc6 6. e5 line) are very unnatural. There's a lot of lines where you have complete lack of development and a king on d1. I therefore definitely wouldn't recommend playing it to anyone at your level. Switching to e4 is a good idea in terms of your chess improvement (you'll learn a lot from playing the open games), but you should stick to the Ruy Lopez or the Italian (I personally prefer the Ruy as some italian move order finesses can be hard to grasp).","score":0,"comments":[]},{"body":"It will take you as far as you need to go, it is one of most well established openings.","score":1,"comments":[]},{"body":"Why are you losing your games? Can you answer that question? Is it because if the London? I doubt it. Most openings will take you wherever you want to go in chess. Solving your other issues is probably a faster track than changing your opening to reach a certain rating.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Foreground: Magnus solves chess puzzle. Background: Anish giving classic funny interview. What a room to be in! Btw the amount of ELO that appeared in the frame in this short clip was just amazing.","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[]},{"title":"Bullet vs Blitz Rating Discrepancy ?","not_safe_for_work":false,"locked":false,"body":"Historically Ive been mostly a classic, rapid, and blitz player. However I started playing a bit more bullet lately (for fun). After playing approx 200 bullet games rating has landed between 1350 - 1400 (Lichess).   Whats interesting to me is that my blitz rating floats consistently around 1800. Is it normal to have a bullet rating 400 points lower than ones blitz rating? Seems a bit odd. Maybe I'm still getting used to the time control.","score":0,"comments":[{"body":"Seems pretty within reason to me, especially for just 200 games in. Bullet is a very different animal. Especially something like 1+0 vs 3+2, the lack of increment with 1+0 completely changes what effective time management looks like.\n\nI think you would probably consistently climb up to 1800 or so if you give it another thousand games to acclimate to the time control and naturally pick up tips/tricks and time management skills particular to bullet.","score":2,"comments":[]},{"body":"If you want to get better at bullet, play more bullet. Of course you're gonna be worse at it if you just started.","score":1,"comments":[]}]},{"title":"Punish black's mistake in Sicilian Pin Variation!","not_safe_for_work":false,"locked":false,"body":"","score":474,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=rnb1k2r/pp1p1ppp/4pn2/q3P3/1b1N4/2N5/PPP2PPP/R1BQKB1R+w+KQkq+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/rnb1k2r/pp1p1ppp/4pn2/q3P3/1b1N4/2N5/PPP2PPP/R1BQKB1R_w_KQkq_-_0_1) | The position occurred in 5 games. [Link to the games](https://www.chess.com/games/search?opening=&amp;openingId=&amp;p1=&amp;p2=&amp;mr=&amp;lsty=1&amp;year=&amp;lstMoves=1&amp;moves=&amp;fen=rnb1k2r/pp1p1ppp/4pn2/q3P3/1b1N4/2N5/PPP2PPP/R1BQKB1R+w+KQkq+-+0+1&amp;ref_id=23962172)\n\n**Videos:**\n\n&gt; I found [1 video](https://chessvision.ai/video-search/5744839113048064) with this position.\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Pawn!&lt;, move: &gt;!exf6!&lt;\n\n&gt; Evaluation: &gt;!White is winning +5.72!&lt;\n\n&gt; Best continuation: &gt;!1. exf6 Qe5+ 2. Be2 Qxf6 3. O-O O-O 4. Ne4 Qg6 5. Ng3 Nc6!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Man.. like I got the right idea but the variation goes for so long and the responses are so sharp. Only one move works on most of black's responses.","score":101,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I would beat him up and tell him not to bring his queen out early","score":316,"comments":[{"body":"i would bust his kneecaps just in case","score":58,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"\\[*1.e4 c5 2.Nf3 e6 3.d4 cxd4 4.Nxd4 Nf6 5.Nc3 Bb4 6.e5 Qa5??*\\] **7.exf6 Bxc3+ 8.bxc3 Qxc3+ 9.Qd2 Qxa1 10.c3!** (10.fxg7 transposes) **10...Qb1** (otherwise 11.Nb3 Qb1 12.Bd3 traps the black queen) **11.Bd3 Qb6 12.fxg7 Rg8 13.Qh6** (13.Qg5 Qd8 13.Qh6 transposes) **13...Qc7** (13...Qc5 is similar) **14.0-0 Qe5 15.Bxh7 Rxg7 16.f4 Rxh7 17.Qxh7 Qc5 18.f5** and white is winning.\n\nEdit: If you want to try the \"Pin variation\", be sure to play **6...Nd5**, although white is still better after 7.Qg4 g6 (7...Kf8!?) 8.Bd2 (8.Qg3!?) 8...Nxc3 9.bxc3 Be7 10.Nb5! Nc6 11.Qg3.\n\nNote that **6...Ne4?** is a bad mistake because of 7.Qg4! Nxc3 8.Qxg7 Rf8 9.a3! Nb5+ (9...Ba5 loses to 10.Bh6 Qe7 11.Nb3! winning back the piece) 10.axb4 Nxd4 11.Bg5! (11.Bh6 Qe7 is less clear) 11...Qb6 (11...Qc7 12.Bh6 and black can't defend the rook) 12.Bh6 Qxb4+ (12...Nxc2+ 13.Kd1 Qxb4 14.Kxc2 is winning) 13.c3 Nf5 14.cxb4 Nxg7 15.Bxg7 Rg8 16.Bf6 and white has a big advantage.","score":168,"comments":[{"body":"Bro turned into wikichess","score":296,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Posts like these are always so high value to the sub. Very humbling when you see that this position has been hit twice in masters games(‘76, ‘21) and black won both(I know lichess masters isn’t the most complete and possibly exploitative preparation). And overall on the site black is winning 51%. That number falls pretty quick if you filter for higher rating/slower playtimes. Of the 8 blitz games played above the 2500 tier, black found wins in 3 of them. Including a 2500 beating a 2700.\n\nThank you for sharing OP :) sicilian content makes me giddy","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Is there some reason why I should assume that trading the pawn for a knight is a bad move? Feel like I am missing something.\n\nI see that he can mess your pawn structure up but that seems like a favorable trade.\n\nEdit: Okay I see now that you either hang the knight or the rook, and you can trap the queen down the line if he does take the rook.","score":45,"comments":[{"body":"It's more than mess up the pawn structure. It appears if black can regain the material because after bishop takes either the rook or knight will hang in the end.","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Drink his beer, kick his dog and steal his woman.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Chess software to set up custom boards","not_safe_for_work":false,"locked":false,"body":"Does anyone know of any software or apps where you can set the board up with a custom set up and then save the games or play them back to be screen recorded?","score":0,"comments":[{"body":"I think most chess gui's will let you set up a position.  So you could use chessbase, chessbase light, probably tarrasch gui, arena gui.  You could probably do it online on lichess or chess.com as well.","score":1,"comments":[]}]},{"title":"Mike Boyd's Chess Cheating Butt Plug Evades Metal Detector","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Seems persuasive","score":5,"comments":[]},{"body":"I'm not sure on how low speck hardware you can effectively run stockfish on these days, but I wonder if you could make such a device that is completely self-contained, and doesn't require any wireless connection.\n\nSo instead of using a third party to keep track of the match, the user signals the taken moves to the device via discrete butt squeezes. This would require a lot more effort and training to pull off, but doesn't sound impossible.","score":6,"comments":[{"body":"&gt; I wonder if you could make such a device that is completely self-contained, and doesn't require any wireless connection.\n\nYou absolutely can (and with something more sensible than a butt plug if we ignore the \"lol sex stuff!\" aspect for a second). The problem becomes size and detection once you get to that kind of thing though. Just a receiving device can be pretty small but a battery together with your computer and your input/output devices all adds up to a larger size and while you can keep those small enough to hide within clothes I'm not sure the tech is there yet to make it small/discrete enough to defeat metal detection and other basic detection methods. \n\nI think in theory you could get an engine to run with really small computers and batteries but actually having one run long enough at a sufficient level of depth to be useful is probably going to be your limiting factor.","score":3,"comments":[]},{"body":"That's gonna be a butt clenching game.","score":0,"comments":[]}]},{"body":"I wonder how different the \"cheap one\" he bought is compared to the supposedly 10k one at some huge time fide tournaments","score":2,"comments":[{"body":"The $10k+ device is a nonlinear junction detector, not a metal detector. \n\nI would hope that the NLJD picks up some thing like this though.","score":1,"comments":[]}]},{"body":"[deleted]","score":1,"comments":[{"body":"I really disagree that this is a meme or joke. It's a genuine demonstration that evading metal detection is seemingly easily possible with a device able to assist in chess.","score":1,"comments":[]}]},{"body":"Agadmator?","score":1,"comments":[]},{"body":"I think we should just admit to one another that all GMs had/have stock fish up their ass and just kind of move on.","score":1,"comments":[]}]},{"title":"How to progress as an intermediate player?","not_safe_for_work":false,"locked":false,"body":"I wouldn’t say im good but im definitely not a beginner, i’ve been playing on chess.com for like 3 years now and i’m only rated in the 700s\n\ni have a friend who’s really good and just hit 1700, and we play a lot cause i one of his only friends who plays chess, and i sometimes do good\n\nwhen i actually really concentrate or i’m in a good or something i play really good and that friend said, after a pretty close game, that i just played like a 1100 but im only rated in 700s\n\nand i’ve been stuck in 700s for so long, so how do i progress and get out of this hardstuck rating like how do i analyze my games\n\ni play puzzles a lot and look over most of my games but i don’t what to look for or change when i do\n\nand i haven’t really gotten any better in a while so what’s a good way to consistently get better at the game?","score":9,"comments":[{"body":"700 is very much still beginner level. intermediate starts at like 1100 or 1200. you will easily win most of your games at 700 just by making principle moves and recognizing when your opponent makes a blunder. basically every game is won/lost at 700 by one player just straight up blundering a piece. if you look through the analysis of the games you lose i’m sure you’ll find that either you’re making a huge blunder or your opponent makes a huge blunder and you miss it or both every single match.","score":36,"comments":[{"body":"to be fair, for blitz this description applies even up to [edit:] low 2ks (maybe higher but i cant speak for that). It’s insane how many of my games are decided by straight piece drops.\n\nof course you can argue the piece drops become more and more subtle. But get someone 400 pts higher than me to look at my games, and I’d bet they’ll say “you’ll find that either you’re making a huge blunder or your opponent makes a huge blunder and you miss it or both every single match”","score":7,"comments":[{"body":"How you cant speak on that if your flair says 2200","score":4,"comments":[]},{"body":"i disagree. even if at your level most games are decided by a piece blunder you still need to make a lot of smart moves to put yourself in a good position. at 700 you pretty much need to develop your pieces and then shuffle them back and  forth while you wait for your opponent to inevitably blunder. at 700 even if most of your moves make no sense as long as you don’t blunder and you recognize when your opponent does you win.","score":1,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Hello there! Consider looking through some of these resources for chess improvement.\n\nGeneral advice: [https://www.reddit.com/r/chess/wiki/improve/](https://www.reddit.com/r/chess/wiki/improve/)\n\nBook suggestions: [https://www.reddit.com/r/chess/wiki/books/](https://www.reddit.com/r/chess/wiki/books/)\n\nVarious online resources: [https://www.reddit.com/r/chess/wiki/improve/](https://www.reddit.com/r/chess/wiki/improve/)\n\nAlso check out r/chessintermediates","score":5,"comments":[]},{"body":"Yeah something is wrong if you're taking chess seriously for 3 years and you're at 700. I would guess you're being lazy at puzzles and not taking the time to fully understand each puzzle after you finish it.","score":12,"comments":[]},{"body":"I climbed to 1200 just by watching Naroditsky's speedrun..","score":4,"comments":[]},{"body":"Play only slow games. 30 min games are fine. Before you make your move, go through a list: 1) What are my checks 2} What are my captures. 3) What are my opponents threats. Then before you move, visualize your piece on the new square and go through the list again. If you do this every move you will stop making blunders that drop pieces to simple captures. As you get better you can add more items to the checklist and refine it.","score":4,"comments":[]},{"body":"Vanilla training advice applies.","score":1,"comments":[]},{"body":"Review your games and correct your mistakes. Playing dubious openings? Learn the lines. Missing a bunch of simple tactics in games? Practice with puzzles. Lost an endgame that should of been a win? Learn the endgame theory and technique. You should be able to get to 2k+ rating easy if you approach the game with this mindset.","score":0,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Choosing a Black Opening - help!","not_safe_for_work":false,"locked":false,"body":"I am about to graduate with my Masters and have decided to invest a decent amount of time into chess - coincidentally I have been given access to \\~200 books on chess (everything from tactics to openings and endgames) from reputable authors between 1920's and early 2010's. As such, I have spent time considering the path I want to take in developing my understanding of openings.\n\nAfte reading *The Complete Book of Chess Strategy: Grandmaster Techinques from A to Z* by IM Jeremy Silvan, I have discovered a unique interest in the Dutch, Caro-Kann, and Sicilian defenses. I have, then, explored briefly the various mainline of these defenses in *Fundamental Chess Openings* by Paul Van Der Sterren and have found that all three of these openings have progressively dominant opportunities and tactical ideas - more than I could have originally fathomed. I am dedicating time and study to chess, so the potential amount of time needed to study is a non-concern when considering which defense to invest into.\n\nSo, from your experience and knowledge, which of these defenses are worth investing into? I plan to begin playing online primarily with aspirations of OTB competitions (likely through the St Louis club).\n\n&amp;#x200B;\n\nOr, simply put, which defense (Dutch, Caro-Kann, or Sicilian) is best for dedicated, but new, players?","score":1,"comments":[{"body":"Well, you will need openings vs both d4 and e4 to start. The Dutch goes against d4 so you can definitely count that as one of your options, and only have to choose between Caro-Kann or Sicilian as your e4 response","score":3,"comments":[{"body":"Part of IM Jeremy Silvan's book mentioned that many openings can be played regardless of e4 or d4 due to delaying the more confrontational moves. For example, something along the lines of the Dutch may delay d5 into an e4 opening by first playing nf6, e6, f5, etc... Is this an accurate approach to making openings more versatile? Or is it best to utilize other openings?","score":1,"comments":[{"body":"It is possible for d4 and e4 lines to transpose to each other, but not something you can rely on to happen regularly. As black you can't force that to happen, there are ways for white to play that will have distinctly e4 and distinctly d4 qualities regardless of what you as black do. You're going to need different responses to each of those main starting moves.","score":2,"comments":[]}]}]},{"body":"Long term: Sicilian.\n\nIt's by far the most played at the highest levels, and one of the most popular in general. It gives Black plenty of opportunities and options to play incredibly active chess (which is something quite rare for a Black opening). Of course White can steer the game towards more \"controlled\" middlegames, but Black still gets out of the opening with good chances.\n\nCaro-Kann and especially Dutch are not nearly as popular, nor \"reputable\".\n\nMedium term: any of the above.\n\nThey are all playable, and if you get familiar with any of them, you should be able to navigate your way out of the opening without any issues at any level below master. You just need to find the one you prefer in terms of \"feel\" of the position, because at low-intermediate level games are usually not decided by \"which opening is most reputable\", but by the number of mistakes players make.\n\nShort term: any of the above, but with some caveats.\n\nTo start a repertoire as Black you need 2 openings: one against e4 and one against d4. The Dutch is against d4, so you're good there. But both the Sicilian and the Caro-Kann are against e4, and if you want to be efficient with your study you should only study one of them. The Sicilian has more theory, because you have to choose an Open Sicilian (e.g., I play the Sveshnikov) and you also have to prepare a line against all the anti-Open Sicilian moves White can play, which are quite a lot. The Caro-Kann has less theory in that sense, but still it can't be called \"theory-light\".","score":4,"comments":[{"body":"Thanks for your thoughts! A few questions...\n\n1. At what elo demarcation would you estimate the short term benefits falloff versus the middle or late term advantages of the Sicilian?\n2. A few people mentioned the importance of having a Black opening in response to e4 and d4. What opening would you suggest, in the late term, pairing with the Sicilian to address d4?\n3. In addition to #2, part of IM Jeremy Silvan's book mentioned that many openings can be played regardless of e4 or d4 due to delaying the more confrontational moves. For example, something along the lines of the Dutch may delay d5 into an e4 opening by first playing nf6, e6, f5, etc... Is this an accurate approach to making openings more versatile? Or is it best to utilize other openings?\n4. Frankly speaking - would it be best to forgo the short-term and mid-term and just focus on developing my Sicilian understanding? Or is there benefit in spending time in the Caro + Dutch that I wouldn't otherwise find in prioritizing the Sicilian?","score":1,"comments":[]}]},{"body":"Given your interest in the Caro-Kann, I would recommend a repertoire based off of c6 d5. That would mean the Semi-Slav defense against d4, which is fairly solid, and the Caro-Kann. Both have fairly similar ideas, and are very rich positions. Hope this helps :)","score":2,"comments":[{"body":"As they have similar ideas, would it be best to learn both (even if only just to understand their main positional ideas) so that I can transpose as needed? Or would this be irrelevant if I prioritized one opening?","score":1,"comments":[{"body":"They don't have many similar ideas and have very few transpositions, maybe just a pawn structure or two in common, and the first couple of moves in common. They might be a good pairing but e4 and d4 openings should be thought of differently and it's generally not a good idea to try and find one thing and morph it to fit both openings. There are quite few openings you can play this way and they are not very good in general nor good for beginners.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"As a beginner, playing any of these openings isn't a good investment long-term. They are strategically very complex and hard to understand. If you haven't played chess seriously before, 99% of your games will be decided by tactics rather than superior strategic understanding. It's therefore a good idea to play openings that are strategically rather easy to understand (and where you'll get to see a lot of typical tactical motives). You'll benefit the most from playing open games (1.e4 as white and answering e4 with e5 as black). If white starts with anything other than d4, it's again best to play openings with easy, logical development: Answer 1. d4 with d5, 1. Nf3 with d5 and c4 with either c5, e6-d5 or e5 (depending on your preferences).","score":1,"comments":[]},{"body":"Unpopular opinion: pick one. It doesn’t matter too much. If you are a new player, put the majority of your study time elsewhere.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Mate in 6 for white","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=4QR2/8/1Rprr3/3kq3/8/3P4/3K4/6N1+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/4QR2/8/1Rprr3/3kq3/8/3P4/3K4/6N1_w_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Rook!&lt;, move: &gt;!Rb5+!&lt;\n\n&gt; Evaluation: &gt;!White has mate in 6!&lt;\n\n&gt; Best continuation: &gt;!1. Rb5+ c5 2. Qa8+ Rc6 3. Rd8+ Qd6 4. Rxc5+ Kd4 5. Nf3+ Kxc5 6. Qa5#!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Is this an original composition? I feel like the knight on g1 and the pawn on d3 are kinda inelegant; it feels like if you removed them, replaced the black queen with a black bishop, and put the white king on d3 instead, you'd get a more compact mate in five.","score":1,"comments":[]},{"body":"Really nice combination, for me it was difficult to find all the defending moves.","score":1,"comments":[]}]},{"title":"How much is Chess.com actually worth?","not_safe_for_work":false,"locked":false,"body":"As someone who enjoyed the game of chess and has a background in finance and valuation, I thought it would be fun to attempt and value the [Chess.com](https://Chess.com) website. Not the entire company (that includes Play Magnus, Chessable, their social media platforms, etc), but only the website.\n\nI did my best to estimate the active users on the platform, the split between free and premium users, the revenue that the website generates from each, and the profit margin. Feel free to make assumptions that are significantly different than mine and to share insights that could help in the process.\n\nAs it is a private company, with limited public information available, this has been a lot of fun! I hope that is being appreciated here.\n\nThe link is here and below you can find the analysis in written form for those who prefer to read: [https://youtu.be/GlqgOLSdrlA](https://youtu.be/GlqgOLSdrlA)\n\nIn a nutshell, the websites generate money both from the free users (through ads) and the premium users (through the subscription).\n\nHowever, these numbers aren't available anywhere.\n\n&amp;#x200B;\n\n**The number of users**\n\nBased on Wikipedia, [Chess.com](https://Chess.com) has over 95m members. Can this be trusted? Not really, there's no source and it doesn't point out to the **active** users. The inactive ones are irrelevant for understanding the value of the website as they don't generate any revenue.\n\nBased on a simple Google search, I got two results, both coming from the website:\n\n1. A sponsored Google ad where the website is the place to meet over **40m** chess players\n2. The [Chess.com](https://Chess.com) website itself that mentions there are over **50m** members from around the world.\n\nNot only that the Wikipedia numbers are too high, but the [Chess.com](https://Chess.com) website also isn't aligned internally. It is either that the Google ad has been on autopilot since they had 40m users, or there are 10m who just don't want to meet you.\n\nIn any case, none of this points out to the active users, which is what is most important.\n\nSo, I looked into the online players and noted the numbers down at different times of the day. The average was around 240k. That means, on average, there are 240k users who play chess on the platform. Of course, this is at a point in time. How can we get to the total? Also, someone who plays 60 blitz games a day is more valuable than someone who plays fa ew games a week. So many variables! So, what can be done?\n\nI looked at a poll on how much time per day is being spent playing/studying chess. The average was around 1 hour. That helps with the equation. Basically, if 240k is the average number of online players and on average they play for an hour, there are 5,760,000 active users on any given day (240k multiplied by 24 hours).\n\nI looked at a few tournaments to identify how many of the users have a flair (pointing out that they are premium members) and noticed that I get somewhere between 10 and 11%. However, the premium users have the option to not use a flair. I would assume that these are the minority, so my split between free and premium users was 88% - 12%.\n\nThat leads to 5,068,800 free users and 691,200 premium users active on average during a day.\n\nThere aren't that many ads on the website, so it is definitely not the case that the website makes lots of money through that. I estimated that at $1 per member per year. That assumes around 400/500 ads seen by an active member (that's logging every day), between 1 and 2 a day.\n\nAs for the premium users, there are various packages, so I assumed the average is around $7/month.\n\nThis seems logical, however, the number of premium users is currently understated if I multiply them with the subscription, basically, it means that the same 691,200 users are online every day, which isn't the case. The 691,200 premium users are the average that I estimated to be online on a given day. Chess, as many will agree, is a pretty addictive game. So, I assumed that on average, 50% of the premium users are online on any given day, doubling the # of premium users to 1,382,400.\n\n**The financials**\n\nTaking the numbers above, the revenue of [Chess.com](https://Chess.com) in any given year is $121,190,400. A company in this industry has a net profit margin of anywhere between 15% and 25%. Assuming theirs is 20%, the estimated yearly profit is around $24,238,080.\n\nBased on the fundamentals of the company (and some data coming from Google Trends), I expect that the # of members slowly increases over time (&lt;5% a year), hence I'm using a so-called \"P/E multiple\" of 14.\n\nThis brings the valuation of the website to $339,333,120.\n\nCould I be wrong? Absolutely! Look at all the assumptions that I made. \n\n**What if?**\n\nIf I overstated the # of premium users, combined with the average premium subscription of $7 and the profit margin and the P/E ratio, then the valuation could decrease to **$155m.**\n\nOn the other hand, if I underestimated them, the valuation could go as high as **$672m.**\n\n&amp;#x200B;\n\n**Hans Niemann's lawsuit**\n\nOne segment in the lawsuit refers to [Chess.com](https://Chess.com) as a \"multi-billion dollar behemoth\".\n\nBased on my analysis, I cannot justify a valuation even to $1bn, let alone over $2bn.\n\nFor this to be the case, the website needs to have over 6m premium users which, if we reverse engineer the formula, means that only 14% of the premium users are online on any given day. This, I find too low, taking into account the addictiveness of chess.\n\n&amp;#x200B;\n\nI hope you enjoyed this!","score":85,"comments":[{"body":"\"For those who prefer to read\" 🖐thank you!","score":58,"comments":[{"body":"You're very welcome!","score":13,"comments":[]}]},{"body":"Nice, but you might want to round your result number a bit to avoid [false precision](https://en.wikipedia.org/wiki/False_precision?wprov=sfti1).","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Perhaps Play Magnus Group's valuation in the recent acquisition ($82.9 million) could give us a good idea of the ballpark on [Chess.com](https://Chess.com)'s valuation? What would be the valuation you get from that? My opinion is it should be similar to the figures you got here.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"About tree fiddy","score":24,"comments":[]},{"body":"I appreciate that you’re working with very limited data and that this is an impossible question to answer without inside info, but this isn’t an analysis anyone should take as any indication as to what chess.com is potentially worth, even directionally.\n\nFor starters, companies in comparable industries can have widely variable profit margins depending on a number of factors, such as scale. The profit margins also dramatically vary depending on who you consider to be a competitor, so it feels like your assumptions are incredibly arbitrary on this topic (also, how are you defining profit margin in this context?).\n\nAlso, for aaS companies their subscription base, churn rates, and ARR are by FAR the most important metrics used to determine its valuation. Depending on scale, revenue multiples and valuation estimates tied to what I just mentioned are more likely an appropriate measure than a P/E multiple. Typically P/E multiples are more appropriate for companies in mature and steady industries, while it seems unlikely that chess.com would be considered that. If P/E multiples were used to value every company, you would never see companies with a current net operating loss be worth anything, despite in practice many of them being some of the most valuable companies in the world.\n\nAnd while on the topic of P/E multiples, even if we assume that P/E multiple are the appropriate valuation approach, you did not clarify how you derived a multiple or 14 at all. Companies in the same industry can have hugely variable multiples and valuation multiples are by far the most sensitive input into your calculation and we have no idea what kind of sensitivity on the assumption might be appropriate for a company like chess.com\n\nAnd all none of that even touches on issues in the assumptions you used to derive your inputs for things like DAU, ARR, time spent in the platform etc. \n\nI could go on, but you get the jist. This is an interesting analysis for someone to try in their spare time to see what they get, but it isn’t close to what a reasonable professional valuation of chess.com would look like.","score":12,"comments":[{"body":"Oh absolutely, I fully agree with you. This post was purely for entertainment/educational purposes. I would love to have the actual financials and see how far my analysis is :)","score":6,"comments":[]}]},{"body":"I am mostly interested in the value of the domain name.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'm surprised there's 600k premium users tbh, that's several times more than I'd have expected","score":2,"comments":[{"body":"That's an estimate, I could be wrong in both directions.","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I beat stockfish in a 2 game match!","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"This ain't r/AnarchyChess","score":1,"comments":[{"body":"r/anarchychess users would have lost that position as black.  It's harder than you think.","score":2,"comments":[]}]}]},{"title":"Chessable Discussion","not_safe_for_work":false,"locked":false,"body":"I regularly use Chessable and I love being able to support my favourite chess content creators in ways I otherwise wouldn't be able to do.\n\n***What is Chessable good for?***\n\nI find memorising a lot of lines is great before a competition game (similar to memorising before a school test), but shortly after this information gets lost. Unless you're a pro player or Magnus Carlsen you'll inevitably forget the detailed variations. It is more worthwhile to try understand the middlegame positions. Once you have a good grasp work backwards and use Chessable to understand how we got to those middlegames.\n\nChessable will show you a lot of variations you otherwise might not have known about. This is great when you want to gain breadth in a particular opening. If I'm playing white I can choose the Dutch, and quickly see how lines of the Leningrad or Stonewall variations develop into their respective middlegames. If I find variations that look problematic I can jot them down and drill these at a later time.\n\nHowever there are a few cons, both with the way people use it and the way Chessable conducts their business.\n\n***Problems with Long Term Understanding***\n\nThis is an element chessable lacks if you use it as your main study tool. It makes you great in the positions it teaches, but the moment you have an unfamiliar position the skill of evaluating strengths, weaknesses and plans are all underdeveloped. You need to do cross-training and self analysis in order to think for yourself, which you won't get if you're just reviewing Chessable moves.\n\nI believe if you overly rely on Chessable you risk not being a well rounded player. This is generally the risk of trying to be an opening specialist and not focusing on the rest of your game. Being 2200 in the opening but 1800 elsewhere will mean you have inherent weaknesses that can be exploited by prepared opponents.\n\n**Overly Aggressive Marketing**\n\nChessable's whole marketing ploy is focused on opening memorisation. It didn't used to be this way, but overtime they realised that opening courses sell best. You can see it on their front page now:\n\n&gt;You're Never Forgetting Your Chess Openings Again\n\nNote how this is different to their old motto:\n\n&gt;Bringing Chess Books to Life\n\nThe old chessable was focused on creating an interactive experience for chess books, and improving profits for aspiring authors. Publishers would often take a huge chunk of the profit that authors would make so Chessable helps cut out that middleman. This is great news, and it can be seen with many top players having financial incentives to write LTR (Lifetime Repertoire) books on chessable.\n\nThe current state is aggressive marketing to sell as many books as possible. Video courses that sell for over $200? There are sales constantly where you can get over 60% off, meaning why were you charging such a high price to begin with? This is predatory sales tactics.\n\n***Inaccurate Course Descriptions and Target Audience***\n\nThere are a lot of courses with the \"Beginner\" and \"Casual\" tag that are clearly not targeted towards these crowds. Key examples are the LTR books which have hundreds of variations. Casual players would be hard pressed to remember a few dozen variations. It's not a fair advertisement when these books are clearly intended for serious players to give you \"A Repertoire that lasts a Lifetime\".\n\nThere are great books that are truly targeted towards beginners and casual players such as the Beginner series by IM Andreas Toth. It's sad that this is level of accuracy can't be held for all books.\n\nThe course descriptions often have big over-promises that are written by the marketing team and not the original Author. Quiet opening courses you will stop your opponent dead in their tracks. Aggressive opening courses you'll be a killer and wipe them off the board. Unsound openings will be novelties your opponent has to play perfectly to gain an advantage.\n\nI understand this is how marketing works but I just want a normal objective description so I know what's actually in the course. I find to get an accurate idea of what a course will actually entail you need to research the opening before you buy it.\n\nPlease feel free to add to this discussion or disagree with anything. Happy to hear all opinions :).","score":7,"comments":[{"body":"I like Chessable a lot, but chess study involves a lot more than just clicking through (opening) variations. The understanding part no author can do for you, you have to do it yourself. Obviously, a good course has ample text or video showing the ideas. You still have to diligently check some lines and ask yourself about moves that your opponents played or could play.\n\nI do agree that the marketing of the courses is often times unrealistic. Totally agree that eg. searching for \"beginner\" or \"casual\" gives far too many courses and books that are too high level.\n\nAlso, the declaration of the level of support is often wrong, certainly with the LTR's. The only course author I know that regularly chimes in and gives feedback is Gawain Jones in his splendid KID course. \n\nDisclaimer: I do not own every LTR and can only judge for the one's I own including So, Sethuraman, Giri and Jones. \n\nOf course many user posts are asine and not very well considered - which partially goes back to inappropriate (too high-level) courses being sold indiscriminately.\n\nIn summary I think Chessable is worth it, but as a user you have to manage your own expectations and still do dirty work yourself. I do believe Chessable should be more realistic in their marketing, especially with the heavy courses. I know there is the 30-day refund option but this should not be an excuse for unrealistic marketing.","score":3,"comments":[]},{"body":"&gt;This is an element chessable lacks if you use it as your main study tool. It makes you great in the positions it teaches, but the moment you have an unfamiliar position the skill of evaluating strengths, weaknesses and plans are all underdeveloped.\n\nDepends on the course. Some good courses will show you key ideas and thematic moves and are based on understanding those rather than memorization. \n\n&gt;Being 2200 in the opening but 1800 elsewhere will mean you have inherent weaknesses that can be exploited by prepared opponents.\n\nNo. You won't be '1800 elsewhere' because you don't play 'elsewhere' assuming you're also prepped in breadth rather than depth.\n\n&gt;Inaccurate Course Descriptions and Target Audience\n\nI experienced this with the book 'Coffee house repertoire Vol. 1/2' from Gawain Jones. There's nothing 'coffee house' about that. I'm not exaggerating when I say it's a serious grandmaster repertoire. I tried learning that 2. Nc3 Sicilian, but it's as subtle as the Catalan and I gave up on it. So this can also happen with hardcopy books.\n\nBuying chessable courses you'll often atleast have an idea of what you're getting into because of it's S&amp;S versions. Even when a course doesn't have that, the lines that will be covered are shown at the side and a video is given where the author sometimes shows which lines of what variation they'll get into.\n\nI'd also like to mention a great underrated feature of chessable are it's course reviews. There you'll often see an accurate and unbiased description of what the course truely is like.\n\nBit off-topic: The one thing I would like both chessable and (hardcopy) chess book authors do more is explain why they choose certain opening moves within a variation over other alternatives. Especially around roughly moves 5 to 9. This is often where truely is decided what you're getting into imo. Why did you decide to not cover the other popular 5th move instead?","score":1,"comments":[]},{"body":"My experience with Chessable (which is a prominent part of my chess study) is basically:\n\n- When it's a pre-existing book, especially a tactics book (something like Winning Chess Tactics), I think the software and the interface is fantastic. It's so well suited for drilling puzzles, especially with how it shuffles them for you when you review.\n\n- When it's a niche topic (The Master's Hand: Capablanca's Endgame Technique, for example) it can be great, especially when it's something the author really cares about. The mix of lecture and book style could blend a little better, but I like it. As someone who likes the lecture style chess Youtube content and has limited space for physical books, I like it. I'd like to be able to turn off the move train features for some of these though, as I don't think it's super necessery for conceptual stuff.\n\n- Opening stuff. I know this is a huge part of Chessable's marketing, but I've never found an opening course I've fallen in love with (although I'm sure other people have). I honestly think it's more to do with presentation than the fact that they seem to be over stuffed with lines. When I open the course and I see 34 with titles that aren't necesserily that clear if you're coming back to it to refresh 2/3 months later. It's a little exhausting to interface with (which is why I tend to move lines over to a Lichess study so I can lay it out better for my brain). On the Movetrainer aspect? I'm not totally sold that it's the solution to memorizing openings, I think experience is better at that than just repitition. But overall I'm glad there's curated opening study that's modern and more in depth than what I'd get if I tried to do it myself and better quality than a 15 minute youtube video.","score":1,"comments":[]}]},{"title":"Crazy position from a daily game… black to move and win material","not_safe_for_work":false,"locked":false,"body":"","score":33,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=r2k3r/pRp1q1pp/3P1p2/1B2n3/4Q2n/2P5/P4PPP/4K2R+b+K+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r2k3r/pRp1q1pp/3P1p2/1B2n3/4Q2n/2P5/P4PPP/4K2R_b_K_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Knight!&lt;, move: &gt;!Nef3+!&lt;\n\n&gt; Evaluation: &gt;!Black is winning -13.30!&lt;\n\n&gt; Best continuation: &gt;!1... Nef3+ 2. gxf3 Nxf3+ 3. Kd1 Qxe4 4. dxc7+ Kc8 5. Rb8+ Rxb8 6. cxb8=Q+ Kxb8 7. Kc1 Qe5 8. Kc2 Qxb5 9. Rb1!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"I DEMAND SACRIFICES, MY KNIGHTS","score":28,"comments":[]},{"body":"From daily? You’d think they would have seen it, given that it’s really simple","score":3,"comments":[{"body":"You would think so, but some people don’t take a lot of time in daily. Also I haven’t played much daily so I’m about 1100 daily even though I’m over 1800 rapid. Just started playing it and working on grinding that rating up.","score":2,"comments":[]}]},{"body":"Nef3","score":2,"comments":[]},{"body":"But what if king moves instead of pawn takes?","score":3,"comments":[{"body":"Then just take his queen with yours.","score":15,"comments":[{"body":"I am stupid. Yes.","score":6,"comments":[]}]}]},{"body":"1. - N5f3+ 2. gxf Nxf3+ and Qxe4","score":1,"comments":[]},{"body":"Wyld","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Where do I play online chess with money on steak?","not_safe_for_work":false,"locked":false,"body":"Are there any recommendations you have? Would be nice if I could use paypal or so for loading money to my account.","score":0,"comments":[{"body":"White to move and win a ribeye","score":30,"comments":[{"body":"White to mooooove","score":3,"comments":[]}]},{"body":"It's barely workable because of the potential (and incentive) for cheating and the very high skill ceiling of chess.\n\nIf you want to win money playing chess, go to an over-the-board tournament and win your section.","score":13,"comments":[]},{"body":"I'm pretty sure no such legit services exist and if any non-legit ones exist you would be an idiot to play them. Best case scenario you manage to out-cheat someone who is also cheating. Cheating is just WAY too easy in online chess to make gambling on the game workable except maybe the very highest level tournaments where they put at least some anti-cheating measures in place (and if you were good enough to play in those you wouldn't be asking questions like this here).","score":4,"comments":[]},{"body":"I love how blunt this post is\n\n\"Me want money\" lmao","score":9,"comments":[]},{"body":"You can go to union park in New York and play for 20-30 dollar 60 sec bullet. But those dudes will fuck you up. And if they lose they absolutely shut down and don’t want to play again ever.","score":1,"comments":[{"body":"Has one of them ever not paid if you beat them?","score":2,"comments":[{"body":"So I always play chess against people when there is a chance when I travel for work.\n\nI played in Moscow, Athens and New York.\n\nI always lose, it’s always super fast 60 second games and that’s now what I usually play. And they talk so much and make noises and stuff to through you off. \n\nThey make you pay upfront (usually) The one time I played 5 min instead of 60 seconds I won. The guy was talking so much shit and basically walked in to a shit position by playing his moves super fast to embarrass me (he said he would not take 5 min as a boast).\n\nHe then pointed it out said some shit about how it won’t work and then he got quiet as I was about to mate him. Which he did not do and just ended the game. \n\nHe then gave me just my $20 back. I said thanks but I won money and he owed me 20. He seemed super pissed and wanted to for sure not pay me but I’m also 6’5 and 230 pounds. So he did reach in his pocket and paid me. \n\nHe then literally pouted and turned around in his chair so he did not see me. Other dudes were laughing at him.","score":2,"comments":[{"body":"Thanks for the story and answer :)","score":1,"comments":[]}]}]}]}]},{"title":"Found this mate in 5 in one of my daily games","not_safe_for_work":false,"locked":false,"body":"","score":29,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=r4knr/pN3ppp/1p6/2p1B3/4P3/2Q5/qPP2PPP/2KR1B1R+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r4knr/pN3ppp/1p6/2p1B3/4P3/2Q5/qPP2PPP/2KR1B1R_w_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Bishop!&lt;, move: &gt;!Bxg7+!&lt;\n\n&gt; Evaluation: &gt;!White has mate in 5!&lt;\n\n&gt; Best continuation: &gt;!1. Bxg7+ Ke7 2. Qe5+ Qe6 3. Qc7+ Ke8 4. Bb5+ Qd7 5. Qxd7#!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Everything is like +20 though","score":6,"comments":[]}]},{"title":"White to play and win. Don't be too hasty.","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=4q1r1/5p1k/4pQpP/p2pP1B1/P2P4/4R3/2r2PK1/8+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/4q1r1/5p1k/4pQpP/p2pP1B1/P2P4/4R3/2r2PK1/8_w_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Rook!&lt;, move: &gt;!Rh3!&lt;\n\n&gt; Evaluation: &gt;!White has mate in 7!&lt;\n\n&gt; Best continuation: &gt;!1. Rh3 Rc3 2. Rxc3 Qf8 3. Rh3 Qd8 4. Qxf7+ Kh8 5. Bxd8 g5 6. Bf6+ Rg7 7. Qxg7#!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"It looks like the tempting &gt;!1. Qg7+ Rxg7 2. hxg7!&lt; fails to &gt;!2... Qg8! 3. Rh3+ Kxg7 4. Bf6+ Kf8 5. Rh8 Qxh8 6. Bxh8, when black is better. Even if after 2... Qg8 white tries 3. Bf6, then 3... Qxg7! 4. Bxg7 Kxg7 and black has an extra pawn and the more active rook in this rook endgame.!&lt;\n\nInstead, if white starts with &gt;!1. Rh3, black has nothing good against Qg7+. Black can try 1... Qf8 2. Qg7+ Rxg7, but now 3. hxg7+ is check, so 3... Kxg7 4. Bf6+ Kg8 5. Rh8# is forced. Black can't stave off checkmate with 3... Kg8, as 4. Rh8+ Kxg7 5. Bf6# is also painful.!&lt;\n\nAt least, that's sort of what my analysis looked like.","score":5,"comments":[]},{"body":"Rh3 with the idea of Qg7+ Rxg7 hxg7+ Kxg7 Bf6+ and Rh8# is unstoppable.","score":2,"comments":[]},{"body":"1. Rh3 Qf8 2. Qg7+ Rxg7 3. hxg+ Kxg7 4. Bf6# or 1. - Qd8 2. Qg7+ Rxg7 3. hxg Kxg7 4. Bxd8 and Bf6","score":2,"comments":[{"body":"Or 1. Rh3 Qf8 2. Qg7+ Qxg7 3. hxg+ Kxg7 4. Bh6+ Kh8 5. Bf8#","score":2,"comments":[{"body":"Or 2. - Rxg7 3. hxg7+ Kg8 4. Rh8+ Kxg7 5. Bf6#","score":1,"comments":[]}]}]},{"body":"Wow this will definitely pop up in one of my blitz games eventually, thanks for sharing.","score":1,"comments":[]},{"body":"OP: “don’t be too hasty” \n\nMe: ITS QG7 QG7!!!","score":1,"comments":[]}]},{"title":"What’s it to be talented in Chess?","not_safe_for_work":false,"locked":false,"body":"What is it to be talented in Chess? Hinweis the relation between being smart and being good in chess? How much % is it talent and how much is it studying ? \n\nJust to get a general feeling. Started to play 3 Months ago and struggling to break the 1000 Bareer","score":0,"comments":[{"body":"Truly talented people likely improve faster than untalented.  Probably you need some real talent to get to upper-GM levels.\n\nNobody is getting held back from improving at the 1000 level because of talent or lack thereof.   Anybody can go way past that.","score":5,"comments":[{"body":"iirc if you're not a GM by the age of... 17? You're probably never gonna be one. \n\nIt was something crazy like that.","score":1,"comments":[{"body":"Probably close to the truth but that's more about youth vs. old , rather than talented vs. untalented.\n\nBut to tie it into the talent discussion.   There are lots of kids who take chess super serious through their entire childhood (exactly what you're supposed to do) and still never make GM.","score":2,"comments":[{"body":"That's kind of what I was getting at. At the top levels, it's not just \"study super hard and you'll get there\", it's \"you have to be built for chess *and* you have to dedicate yourself to it\". It's like training to be in the Olympics.","score":2,"comments":[]}]}]}]},{"body":"If two people train the same way, the more \"talented\", the naturally smarter one, will improve quicker\n\nTalent does not replace hard work, but enhances it\n\nMost chess players are smarter than average, because chess is a mind game and an interest in it implies an interest in exercising your brain in general","score":2,"comments":[]},{"body":"&gt; relation between being smart and being good in chess?\n\nAlmost zero, except perhaps a higher likelihood to pick up the game at all.\n\n&gt; How much % is it talent and how much is it studying ?\n\n99.9% studying","score":3,"comments":[{"body":"Well, you can actually be talented in studying chess patterns - and that's rather what distinguishes a \"talented\" player from an average player.","score":3,"comments":[]},{"body":"&gt; 99.9% studying\n\nThis percentage depends on the level of chess we are talking about. Carlsen definitely has more talent than a lot of strong 2600s. But at a lower level, hard work can replace talent.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Hikaru once said you need to be smart to be a good chess player but that doesn't mean every smart person has to play chess.\n\nI see some comments saying it's 99% studying, and I strongly disagree. Chess is a game of patterns and positional understanding, the higher your puzzle solving skill and your visual memory the better player you'll be.\n\nIf you want to start chess and have a relatively low IQ, and/or an average visual memory you will struggle greatly. Jordan Peterson said something about the correlation between being smart and the speed at which you can effectively do tasks.  \n\nSo that's my take on your question, overall it is studying of course, with that being said if you have a fear of heights I wouldn't advise you to take mountain climbing as your main hobby.\n\nEdit: my comment probably fits best when we're talking about high ratings, 1800+ on chess.com. Im sure you could take chess chill and get to a certain level by just having fun.","score":-4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"ok, seems you've heard quite a lot of stories","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"White to play, mate in 5","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=r2qnrk1/1pp3pp/p2b2pP/3N1b2/2Q2B2/4P3/PPP2P2/R3K1NR+w+KQ+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r2qnrk1/1pp3pp/p2b2pP/3N1b2/2Q2B2/4P3/PPP2P2/R3K1NR_w_KQ_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Knight!&lt;, move: &gt;!Nf6+!&lt;\n\n&gt; Evaluation: &gt;!White has mate in 5!&lt;\n\n&gt; Best continuation: &gt;!1. Nf6+ Kh8 2. hxg7+ Kxg7 3. Rxh7+ Kxf6 4. Bg5+ Kxg5 5. Qh4#!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Very nice combination!\n\nThanks for sharing OP","score":1,"comments":[]},{"body":"This post has been parodied on r/AnarchyChess.\n\nRelevant r/AnarchyChess posts: \n\n[White to move, mate in one](https://www.reddit.com/r/AnarchyChess/comments/z1a9iu/white_to_move_mate_in_one/) by Beruka01\n\n[^(fmhall)](https://www.reddit.com/user/fmhall) ^| [^(github)](https://github.com/fmhall/relevant-post-bot)","score":1,"comments":[]}]},{"title":"Congratulations to @MagnusCarlsen on winning the @Meltwater Champions Chess Tour Finals with a round to spare — he's won all 6 matches so far!","not_safe_for_work":false,"locked":false,"body":"","score":788,"comments":[{"body":"It's really cool how Magnus tries his best to win every game even when it would be technically smarter to play it safe given the tournament situation. For example in the game 1 against Pragg, he could have taken repetition, but instead he deviated in a very double edged position.","score":281,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"We need Wesley in this tour again. Magnus stomped everyone the whole season. It wasn’t entertaining anymore.","score":121,"comments":[{"body":"would be nice to see alireza as well.","score":80,"comments":[]},{"body":"Absolutely.\n\nNo Hikaru. No Fabi. No MVL. No Wesley until the Tour Finals. No Russian players after the first event (Nepo, Artemiev, Grischuk, Dubov, Andreikin etc.). Only one participation of Alireza. Ding at least played 3x, but often at inconvenient times.\n\nMost of the best players in fast time controls were nowhere to be seen. This season was much duller than the first, hopefully they can get a stronger field for the next season.","score":69,"comments":[]},{"body":"Well Wesley didn't want to participate because he likes over the board chess more. He said that he participated in this tournament because it was in a hybrid format i.e. playing online but at a physical location. He said that playing online is lonely. I agree with him hundred percent. Maybe the CCT people can announce more hybrid tournaments in the next year's tour. That would be awesome because I really felt Wesley's absence.","score":9,"comments":[]}]},{"body":"Magnus showing that he is still the best player in the world and has no peers at his level","score":74,"comments":[{"body":"Helps when few of his peers are in the tournament","score":109,"comments":[]},{"body":"Chill, he had no competition this tournament. \n\nIn blitz/rapid time controls, Magnus is the best in the world but only slightly. Hikaru and Alireza are pretty close behind. I wouldn't say he's in a league of his own.\n\nIn classical though I wholeheartedly agree he's in a league of his own.","score":36,"comments":[{"body":"Hikaru and Firouzja would be close in Blitz, but in rapid Magnus is definitely still the clear favourite. His closest competition there would probably be Wesley and Ding.","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"What a shocker","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Magnus, Cheating Accusations, and Greatness","not_safe_for_work":false,"locked":false,"body":"Hey everyone, looks like Magnus Carlsen, a top chess player, has accused GM Hans Niemann of cheating. Do you all think there is any merit to these accusations?\n\nSo surprising to hear this information from a player like Magnus. He’s been so dominant that people are starting to consider him as potentially a top player of all time. Do you all think he could really be as good as people say he is?","score":0,"comments":[{"body":"internet explorer type of mf over here","score":14,"comments":[]},{"body":"Wow, i think this is huge news, do you have a source? Really surprised this has never been covered here.","score":11,"comments":[{"body":"Me too","score":-11,"comments":[]}]},{"body":"This has to be the most low effort bait I‘ve seen in my entire life lol","score":8,"comments":[]},{"body":"This reads like a bot programmed to post a thread about the Magnus/Hans drama that's vague enough to post at any time and make sense, in order to keep one of them relevant.","score":12,"comments":[{"body":"Hikaru Nakamura was talking about it on a stream and he’s also a GM","score":-6,"comments":[]}]},{"body":"&gt;Hey everyone, looks like Magnus Carlsen, a top chess player, has accused GM Hans Niemann of cheating\n\nReally? Where did you read this? That news around here","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You’re late to the party man. That happened a month ago or more. Haha. Sorry to be so blunt about it but you are quite behind the times.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Google “Hans Niemann cheating scandal” and it should come up","score":-8,"comments":[]}]},{"title":"There are two moves that keep the white advantage. One is slightly better according to the engine, but rather boring. The other one is entertaining. Which one do you choose and why?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Without seeing the entire board you can't know the best move...","score":2,"comments":[{"body":"If you actually follow the link you'll see the whole board.","score":0,"comments":[{"body":"What link?","score":1,"comments":[{"body":"https://imgur.com/3jqu1Vq, the post is literally a link to that URL. Maybe an issue with whatever app you're using.","score":1,"comments":[]}]}]},{"body":"That's just the preview. No idea why it's been cropped that way. Maybe an issue with my reddit app.","score":1,"comments":[]}]},{"body":"This post has been parodied on r/AnarchyChess.\n\nRelevant r/AnarchyChess posts: \n\n[There are two moves that keep the white advantage. One is slightly better according to the engine, but rather boring. The other one is entertaining. Which one do you choose and why?](https://www.reddit.com/r/AnarchyChess/comments/z10wda/there_are_two_moves_that_keep_the_white_advantage/) by Thomas_William_Kench\n\n[^(fmhall)](https://www.reddit.com/user/fmhall) ^| [^(github)](https://github.com/fmhall/relevant-post-bot)","score":0,"comments":[]}]},{"title":"Cristiano Ronaldo &amp; Lionel Messi in new shoot for Louis Vuitton","not_safe_for_work":false,"locked":false,"body":"","score":1244,"comments":[{"body":"[For those who can't see the picture](https://i.imgur.com/izpicWf.png).","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[This is the position](https://lichess.org/analysis/8/4R2p/6pk/3P4/1P5q/5p2/r4P2/4QBK1_b_-_-_0_1?color=white) for anyone wondering","score":92,"comments":[{"body":"I love that they used an actual game, instead of some of the Mickey Mouse positions a lot of chess-inspired media ends up with.","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"The position resembles the one from Carlsen v Nakamura exactly, but the problem is that they are playing on a Louis Vuitton suitcase that has way more “ranks” than a traditional chessboard. Additionally, the game between Carlsen and Nakamura ends in a draw, which is a perfect metaphor for the rivalry between arguably the two best football players to ever play.","score":678,"comments":[{"body":"Can you give me the link for the match between carlsen and nakamura","score":38,"comments":[{"body":"Magnus has you: https://twitter.com/MagnusCarlsen/status/1594051303176810496","score":80,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Damn. Thats so true. I love that they put that in the photo, that it ends in a draw! so cool","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Football is like chess without the dice.","score":180,"comments":[{"body":"And the Jacks are higher than the Kingpin","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Tried to set this up to analyse but I can’t because there’s nine ranks 💀","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Do you ever play chess by yourself?","not_safe_for_work":false,"locked":false,"body":"How do you actually prepare your mind for that, and is it even effective?\nWhenever I do it, I always loose, it is like he can read my mind. /s","score":4,"comments":[{"body":"* I set up a board at home (black is facing the wall)\n* I play white's move\n* Then I rotate the board so black is facing me\n* I walk away\n* The next day, I play black's move\n* Then I rotate the board again\n\nIt's like postal chess","score":6,"comments":[]},{"body":"I do it sometimes, mostly in my head as visualization practice, the key though is to do strange moves in the first few moves. This means you’re not just rehashing opening prep, and actually have to think in each move.\n\nP.S. giggled at “he can read my mind”","score":1,"comments":[{"body":":D","score":1,"comments":[]}]},{"body":"Absolutely not","score":1,"comments":[]},{"body":"I always play by myself, because I don't like dealing with other people.\n\nThe trick is that I allow one side of me to cheat with an engine.","score":1,"comments":[{"body":"It is only cheating if you both agreed to it as not allowed.\n\nInto the rabbit hole we go.","score":1,"comments":[]}]}]},{"title":"Why is this endgame winning for black?","not_safe_for_work":false,"locked":false,"body":"","score":212,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=8/pp3pkp/2p1b3/6p1/4P1P1/P6P/1P5K/3N4+b+-+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/8/pp3pkp/2p1b3/6p1/4P1P1/P6P/1P5K/3N4_b_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!King!&lt;, move: &gt;!Kf6!&lt;\n\n&gt; Evaluation: &gt;!Black is winning -6.71!&lt;\n\n&gt; Best continuation: &gt;!1... Kf6 2. Kg3 Ke5 3. Nc3 Kd4 4. h4 gxh4+ 5. Kxh4 Kc4 6. e5 Kb3 7. Ne4 Kxb2 8. Kg5 Kxa3 9. Kf6!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"More pawns, better structure and bishop v knight in an open endgame with fighting on both sides.","score":283,"comments":[{"body":"Most importantly - white's kingside pawns are frozen on light squares while black has a LSB.","score":51,"comments":[]},{"body":"Also better king position.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Because 6 pawns is more than 5 pawns","score":146,"comments":[]},{"body":"Position is lost for White. If it's Black to move, White has a very difficult time stopping the Black king from getting to white's queenside pawns via f6-e5-d4-d3/c4, as well as trying to protect the e4 pawn.","score":36,"comments":[{"body":"I guess it does come down to that king race, though it is actually white to move.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Bishop better than knight on largely open board, and when have pawns on both sides of board. Weak pawn e4. Pawns on white square on kingside, can be easily attacked when white king moves away.\n\nAdd it up, and it’s an easy win for an 1800+","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Let's count up the positional plusses.\n\nBlack's LSB can always attack White's pawns on light squares. That means White has to stay near them.\n\nBlack's pawns are safe and his king is free to move to f6-e5 and beyond to attack White pawns.\n\nWhite's knight doesn't have many great ways to maneuver, but the Black LSB can defend and zoom across the board to attack too.\n\nBlack has fewer pawn islands to guard.\n\nThese add up to a large advantage for Black, but calling it a win would require looking at a few variations to be sure the general evaluations holds up longer than 1 move.","score":18,"comments":[]},{"body":"White has 2 seconds remaining","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Why is Rb1 a blunder here? Why is Be2 better? Why is c5 the best move for black instead of Bxa1 if I did play Be2? The analysis just stops at c5.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=rrb2rk1/pp3ppp/1qp1p3/3p2P1/3PrB1P/1Pb1PR2/P1PR1P2/1R1QKB1R+b+K+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/rrb2rk1/pp3ppp/1qp1p3/3p2P1/3PrB1P/1Pb1PR2/P1PR1P2/1R1QKB1R_b_K_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Pawn!&lt;, move: &gt;!&amp;nbsp;&amp;nbsp;e5&amp;nbsp;&amp;nbsp;!&lt;\n\n&gt; Evaluation: &gt;!Black is winning -3.86!&lt;\n\n&gt; Best continuation: &gt;!1... e5 2. Bxe5 Rxe5 3. dxe5 Bg4 4. Ke2 Bxd2 5. Qxd2 Rbe8 6. Qd4 Bh5 7. Rh3 Qa5 8. a3 Qxa3 9. Ra1!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Black has a winning tactic after Rb1: e5, followed by Bg4 regardless of recapture, and white cannot stop black from playing Bxf3 followed by taking the knight on d2. After Be2, if black tries the same line, I suppose white could play Kf1 after Bg4 to unpin the d2 knight.\n\nAnd if black takes the rook, they release a lot of the pressure on white, allowing white to continue to build up pressure on the kingside. It’s much better to not cash in immediately, because white is so tied down","score":5,"comments":[{"body":"Thanks.  This makes sense.  I did not see the Bg4 follow on (I should have, that's a damn common attack).  I do wish there was a way to see this via the analysis board.  It's great at showing me follow ups for moves I did play and follow ups to suggested moves, but only shows you the move history for mistakes you leave on the board. My opponent missed this and abandoned the game for one reason or another a few moves later.","score":1,"comments":[{"body":"Phj already explained how black could play, I want to add a few things about white. First, I would be “ok-ish” as white if bxa1 bcs then Qxa1 with the idea of exchanging  knights on e4 - then your other knight will jump imediately on e5. If you are wondering why I think this is good, after all this, look at blacks position, all his pieces are frozen after that one move then you can continue the attack on the king-side immediately with the prospect of playing c4 to open up that queen or maybe fianchetto your black bishop on the queen side. (See how you want to win with the attack here and consider not even castling) Ofc, black has a move after Qxa1, but maybe what I am saying makes sense?","score":1,"comments":[]},{"body":"Play on lichess","score":0,"comments":[{"body":"This is from Lichess.","score":1,"comments":[]}]}]}]},{"body":"Black is pressuring both knights and you will have to give a knight this way.\n\nThe engine says giving up the exchange and releasing a lot of pressure while doing, the rook hasnt moved while the bishop is an active piece is way less bad than losing a knight that you blundered.\n\nYou are worse in both lines.","score":1,"comments":[]},{"body":"you're gonna get smacked with e5 assuming Bxe5 Bg4 Be2 Bxf3 Bxf3 Nxd2.\n\nBe2 \"just\" loses an exchange instead. your rook is trash so why keep it anyway? don't tell me you think that your rook is doing any better than his bishop. your weakness is pretty clear here, it's too much materialistic thinking","score":0,"comments":[]}]},{"title":"Wild position in game: White to move and win material/advantage","not_safe_for_work":false,"locked":false,"body":"**How would you approach this position** \n\nhttps://preview.redd.it/7ury98nys81a1.png?width=799&amp;format=png&amp;auto=webp&amp;s=7683687b68299193970f0d380ca37746b44743be","score":0,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=1k1r1b1r/p2bp1pp/np1p1nqP/3N1pN1/1PPQ4/P3B2R/5PP1/R3KB2+w+Q+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/1k1r1b1r/p2bp1pp/np1p1nqP/3N1pN1/1PPQ4/P3B2R/5PP1/R3KB2_w_Q_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Knight!&lt;, move: &gt;!Nf4!&lt;\n\n&gt; Evaluation: &gt;!White is better +1.47!&lt;\n\n&gt; Best continuation: &gt;!1. Nf4 Qxg5 2. Ne6 Qg6 3. Nxd8 e5 4. Qd3 Be7 5. c5 Rxd8 6. cxb6 Bc8 7. bxa7+ Ka8 8. Rg3 Ng4!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"If it's blitz, then Nxb6","score":1,"comments":[{"body":"Free pawn is free pawn\n\nAlso my SF evaluates that as the best move on low depth","score":1,"comments":[]}]}]},{"title":"Greatest modern chess player?","not_safe_for_work":false,"locked":false,"body":"Who do you guys think is the greatest modern chess player? Based off of maybe accolades and other things. Also who do you guys think is the best young player.","score":0,"comments":[{"body":"What does 'modern' mean?\n\nThe answer to greatest modern chess player (and slightly more arguably just greatest chess player) is obviously Magnus Carlsen. It's not even really up for debate unless for some reason your definition of modern would exclude him.\n\nWould also be helpful for you to define what \"young\" player means but as he's still a teenager I think Alireza still takes that title if he meets the cut. There are some exciting prospects in the even younger age bracket but none have shown as much as he has quite yet.","score":17,"comments":[{"body":"Kasparov is arguable over Magnus. His peak rating is 30 points lower but he has more WCs, more super tournament wins, and a longer reign as #1.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Best young player is undoubtedly Nodirbek. He's already a world champion (Rapid) and won an Olympiad. He broke Gukesh's streak with an iron will and never give up attitude. He is the best young player in my book.","score":5,"comments":[{"body":"Alireza crossed 2800 and was no2 in rankings and played the candidates and so much more he is the best young player.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You should have asked who is the second best modern player. The greatest modern chess player and arguably the greatest of all time is Magnus Carlsen, the only other person who has a claim on the goat title is Garry Kasparov.","score":4,"comments":[{"body":"If you go for peak, domination, being ahead of their peers etc and don't focus so much on longevity, long-term consistency and those kind of things Bobby Fischer also comes into the GOAT discussion. Most put him 3rd, maybe rightfully so, because of his shorter career (and maybe other aspects outside of chess that make him less desirable) but Bobby's dominance relative to his peers in his era is unmatched even by either of the big 2 - his ELO gap to 2nd is still the record, his straight win streak in candidates level matches is unlikely to ever be matched etc. You can't settle such arguments, all 3 can be argued for in their own ways with each being stronger in some respects than the others, but Bobby can definitely belong in the conversation especially for people who value peak rather than consistency.","score":1,"comments":[{"body":"Coming at top for once is not the same for staying there almost your entire career. In every sports goat is considered who is at the top consistently not for 2-3 years. In tennis big 3 (Roger, Rafa and Novak are ruling for last 15-16 yrs) . Consistency matters.","score":1,"comments":[{"body":"Fischer will always be in the conversation. Keep in mind he chose to not continue his chess career, and his skill did not just fizzle away into obscurity after he peaked.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Say what you will about standing on the shoulders of giants and modern engines but Magnus really does have a claim to the greatest player ever.","score":1,"comments":[{"body":"As a WC he does have a claim, but that’s about it.","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Pro bullet/blitz tip!!! Avoid knight forks by making sure your pieces are on different colored squares","not_safe_for_work":false,"locked":false,"body":"**For beginner/immediate players**: An incredibly simple, yet very time efficient way to avoid getting forked by a knight: *all of a knight's legal moves are to squares of one color*. If it's on a light square, it can only move to dark squares, and vice versa.\n\n**If you're in a time crunch, you can avoid knight forks by quickly checking that your two pieces are not on the same color squares.** If your two pieces are on different colored squares, a knight can't attack both of them at once! When you only have fractions of a second, you can check this visually without needing to calculate.\n\nThis has helped me prevent blunders during time pressure -- 1000-1750 in a year!","score":3,"comments":[]},{"title":"I deleted my old chess.com account but my profile is still visible","not_safe_for_work":false,"locked":false,"body":"I recently found out when I followed a friend who followed me on my old account. I cannot log into that account anymore which means it got deleted right, but then why is my profile still visible? I deleted it months ago","score":38,"comments":[{"body":"It seems like chess.com doesn't remove profiles once an account is deleted (also happened to me). It's probably tough to completely remove all traces of it because it still links to all the games played against other people, visible on their profiles. I think they could hide the profile itself though like lichess does (just says \"this account is closed\"). Although the question then is why bother?","score":51,"comments":[{"body":"They have to remove personal identifiable information if requested, otherwise the are not GDPR compliant which is required by law if they want to serve to EU users. See https://gdpr-info.eu/art-17-gdpr/","score":22,"comments":[{"body":"Does this apply to non EU users? So if a website isn’t GDPR compliant for users outside the EU, can they still operate in it?","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I hate that they don't. My online gamer tag that I have had since I was 5 I cant use on Chess.com because my friend intentionally opened an account under my name, played 2 games, then closed it. \n\nHonestly very aggravating.","score":15,"comments":[{"body":"[They let premium users request inactive usernames](https://support.chess.com/article/3877-how-do-i-request-an-inactive-username)","score":20,"comments":[{"body":"I did it without being a premium member","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Check the privacy policy (which you have agreed to when you signed up). Depending on where you live you may ask that the identifying information and data to be permanently deleted.","score":10,"comments":[]},{"body":"if you go to the login page and press shift+X, it will bring up restore a deleted acount, enter your details and get back in","score":3,"comments":[]},{"body":"Same here. Now i look like one of those people who cheated and got silently banned hhhh","score":3,"comments":[]},{"body":"You can email support and ask them to remove the profile picture.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Varuzhan Akobian playing for the US World Team..","not_safe_for_work":false,"locked":false,"body":"Anyone else a big surprised at this considering he admitted to be a cheater? Surprised the US team is endorsing this type of behavior","score":0,"comments":[{"body":"Important note: As far as I know, the only source which claimed that Akobian is a confessed cheater was a random twitter account pretending to be Hans Neimann.\n\nLink to tweet here: [https://twitter.com/GMHansNiemann/status/1578135318762602497](https://twitter.com/GMHansNiemann/status/1578135318762602497)\n\nTweet by GMHansNiemann\n\nHan's actual account is [HansMokeNiemann](https://twitter.com/HansMokeNiemann).","score":1,"comments":[]},{"body":"Can you share where you got this information? as far as i know akobian is clean, a cursory google search got me no results.","score":2,"comments":[{"body":"The spreadsheet of some chesscom cheaters was shared on this sub at the peak of the drama","score":-2,"comments":[{"body":"ohh, i see this list: [https://twitter.com/GMHansNiemann/status/1578135318762602497/photo/1](https://twitter.com/GMHansNiemann/status/1578135318762602497/photo/1)\n\nFrom that list, there is half of the uzbekistan team, hans himself. Right now fair play violations in [chess.com](https://chess.com) which is a private site are not shared with fide, so they don't have any restriction to play the tournament, we don't know the details of those violations.\n\nNote that this list is provided by hans and is without sources, is not official information.","score":-1,"comments":[{"body":"Just letting you know that the GMHansNiemann account is fake. The real one is HansMokeNiemann. So I would not trust that list.","score":6,"comments":[{"body":"Ohh, then the allegations that the OP makes are baseless. i knew it because akobian is a well known and respected player and coach.","score":2,"comments":[]}]}]}]}]}]},{"title":"Players who beat World Champion Magnus Carlsen with the black pieces in classical","not_safe_for_work":false,"locked":false,"body":"Player|x\n---|---\nAronian|2\nTopalov|2\nBu Xiangzhi|1\nCaruana|1\nGrischuk|1\nKarjakin|1\nNaiditsch|1\nNakamura|1\nNepomniachtchi|1\nNiemann|1\nPelletier|1\nRadjabov|1\nVachier-Lagrave|1\n\n(this is since Nov 2013 when Carlsen became WC)\n\n*Players who never won with Black against the World Champion in classical*:  \nAdams, Anand, Andreikin, Ding Liren, Dominguez Perez, Duda, Eljanov, Firouzja, Gashimov, Gelfand, Giri, Harikrishna, Ivanchuk, Jakovenko, Kamsky, Kramnik, Le Quang Liem, Leko, Li Chao, Mamedyarov, Morozevich, Naiditsch, Ponomariov, Rapport, Rozman, So, Svidler, Tomashevsky, Vitiugov, Wang Hao, Wei Yi, Wojtaszek, Yu Yangyi","score":860,"comments":[{"body":"How does Naiditsch make it into both lists?","score":355,"comments":[{"body":"He swings both ways","score":207,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He plays both sides so he always comes out on top","score":146,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"How many classical games has Carlsen played during that time, approximately?","score":191,"comments":[{"body":"A lot lol \n\nFor a more serious answer according to Fide: \n\nMagnus with White in Classical format: \n\nWon 238 Drew 226 Lost 39 (Total  503)\n\nMagnus with Black: \n\nWon 121 Drew 330 Lost 44 (Total 495)\n\nSource https://ratings.fide.com/profile/1503014/statistics","score":311,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Bobby Fischer never won with Black against Magnus.","score":895,"comments":[{"body":"But he never lost to him either.","score":242,"comments":[{"body":"All those damn Fischer-Carlson draws","score":194,"comments":[{"body":"Pontus is a tough opponent","score":28,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Funny how Hikaru’s only win against Magnus in classical was with the black pieces","score":169,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"From a blitz game. White to move and win.","not_safe_for_work":false,"locked":false,"body":"&amp;#x200B;\n\nhttps://preview.redd.it/4cp3096er61a1.png?width=672&amp;format=png&amp;auto=webp&amp;s=a2c9ef101b2903dd6f5a4367f32d10eb30bbe483","score":2,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=r2k3r/1pp3b1/p1np1pp1/5q1p/P2PN3/1BP3Q1/1P4PP/R3R1K1+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r2k3r/1pp3b1/p1np1pp1/5q1p/P2PN3/1BP3Q1/1P4PP/R3R1K1_w_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Knight!&lt;, move: &gt;!Nxd6!&lt;\n\n&gt; Evaluation: &gt;!White is winning +7.28!&lt;\n\n&gt; Best continuation: &gt;!1. Nxd6 h4 2. Nxb7+ Kc8 3. Nd6+ Kb8 4. Nxf5 hxg3 5. Nxg7 Na5 6. Bc2 gxh2+ 7. Kh1 f5 8. Ne6 Nb7!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Got it, and I'm feeling smug about it.\n\n&gt;!Nxd6 and if fxd6 then Be6 wins. Black's queen can't help her king and prevent Qxd6+ and it's all over. !&lt;","score":2,"comments":[{"body":"Well done! I consider this the main line, although the computer response ends up being interesting too.","score":1,"comments":[]}]}]},{"title":"xmas is coming... is DGT Pegasus still have App issues?","not_safe_for_work":false,"locked":false,"body":"Hi!\n\nI read here that people had some issues with DGT Pegasus &amp; [Chess.com](https://Chess.com).\n\nis this still a problem?\n\n&amp;#x200B;\n\nThanks!","score":3,"comments":[{"body":"Yes ans it seems to be hardware problems. Occasionally it's not registering pawns. Only if you keep pressing it down to the square or you hard reset the board. But this happens way too often and I am very disappointed . I will sell mine and buy one from a competitor","score":1,"comments":[]}]},{"title":"Arena Chess GUI help","not_safe_for_work":false,"locked":false,"body":"I just downloaded the arena chess GUI., but i don't know how to open it. Can someone helpp me please?","score":1,"comments":[{"body":"Arena 3.5.1 comes in two version, install and archive. If install version, you will find shortcut in menu. If archive, unzip first (7 zip is common archive software) then find Arena.exe","score":5,"comments":[]}]},{"title":"Danya &amp; Classical Chess","not_safe_for_work":false,"locked":false,"body":"I am watching his recent video where he is attempting to qualify for the Speed Chess Championship. I believe he is perhaps top10 in the world in Blitz, or at least top 25, and probably even higher in Bullet. \n\nIt got me thinking--because I remember last year or so he played a classical game vs Fabi over the board and won. I was curious if he had mentioned why he doesn't play in too many classical tournaments any longer? Right now he's ranked around 160 in the world, but I truly believe he could crack the top 50 in a year or two if he started playing classical again. Also, I think he would have a devoted fan base, given that he easily provides the best chess content on Youtube (imho). \n\nThe video where he analyzes his game vs Fabi is perhaps one of the most enlightening videos I've ever seen. Of cours Naka is a stronger player, but Danya is an incredible teacher. \n\n&amp;#x200B;","score":0,"comments":[{"body":"I'm not sure it's the exact answer but it's also very difficult to be good at all time formats. That's one of the reasons people like Magnus and Hikaru are so impressive. For Danya it may be that he simply prefers faster time controls and would rather focus on improving there rather then dedicating time to classical and perhaps not being as good in bullet.","score":4,"comments":[]},{"body":"He went to some university and that's the reason he doesn't play classical. It takes too much time for debut preparation. So he plays blitz and bullet.","score":1,"comments":[]},{"body":"It would require way too much time and effort for virtually no reward. He's way more successful as a content creator.","score":1,"comments":[]},{"body":"He's playing classical in the US Chess Masters tourney this weekend. \n\nI'll be playing there as unrated in a low elo division, at least for a couple games. After I dominate a couple games and submit to rectal imaging I'm sure they will move me to the Masters where I will face Danya. I'll let him know that you're pulling for him to improve his classical standing while I mercilessly destroy his position.","score":1,"comments":[]}]},{"title":"Why isn't LiChess employing the concept of \"safe move\" in analysis?","not_safe_for_work":false,"locked":false,"body":"A safe move of course would be one, for  which the following ones (of the same player) have multiple moves which are not blunders; viceversa, an unsafe move would be one for which subsequently there would be only one good move. Why isn't this concept employed in LiChess analysis?","score":0,"comments":[{"body":"I am new to chess and have not heard about \"safe move\" before ?","score":12,"comments":[{"body":"Long-time chess player here.\n\nOP is making shit up","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I haven’t heard of it either, but it basically sounds like “what move would avoid getting into a sharp position here?”, which doesn’t seem like an unreasonable move question to ask the engine.","score":6,"comments":[]}]},{"body":"https://github.com/lichess-org/lila/issues — you can suggest it as a feature and perhaps somebody would be interested in picking it up.\n\nIt sounds like a good feature to me. I would definitely be interested in “what move could I have played here that would be boring but safe?” since I dislike sharp positions.","score":11,"comments":[{"body":"Sure, I'll do it, thanks for the link","score":3,"comments":[]}]},{"body":"I assume it isn’t there because the concept doesn’t make much sense to me. By your categorization, any move that offers a piece trade is an “unsafe move”, because after your opponent takes your piece, usually taking back immediately is the only move that is not a blunder. Yet, I would claim that such a simple exchange operation should not be classified as “unsafe”.\n\nFurthermore, how far down would you want to go? What if White makes a move to which Black has four decent replies? Black’s preferred reply by the computer will give White three decent options, but Black’s second, third and fourth strongest option each give White only one good response. Should White’s move be classified as safe or unsafe?\n\nI feel this would soon get unmanageable.","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"An interesting idea. Perhaps the concept of \"sharpness\" could be numerically quantified with a formula that takes into account the ratio of subsequent good moves to bad ones combined with exactly how bad it would be if a player chooses a suboptimal continuation. This is something we do intuitively, but it would be cool if the engine also told us.","score":2,"comments":[]},{"body":"Because there is always one best move. Engines don't care about how safe and easy a position is to play, the only care about playing best moves.\n\nIt's up to you to decide whether you want to play it safe or go into a tactical shootout.","score":2,"comments":[]},{"body":"I got pissed at people suggesting that sharpness evaluation is not useful, so I went ahead and actually googled it.\n\n1. Apparently this exists: https://chessinsights.org/analysis/. It tells you the probability of blundering, given the position and your ELO. Not exactly what is needed here, but better than nothing.\n\n2. The Leela engine has win/draw/loss evaluation, which lets you distinguish between \"dead draw\" moves and \"high probability of win, high probability of loss\" moves.\n\n3. Apparently Power Fritz 18 (ಠ_ಠ) can evaluate sharpness. It's not a free engine though.","score":5,"comments":[]},{"body":"It is not employing the concept because it doesn’t exist. If move candidates result in an equal position, for example through transposition, then they already have an equal score in analysis.\n\nMissing a tactic and making “safe move” instead is just a blunder.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Legal talk aside, does anybody actually deny that Carlsen, Hikaru and chess.com are trying to ruin Hans Niemann's chess career?","not_safe_for_work":false,"locked":false,"body":"All I hear is people talking about \"proof\" and legal stuff and documents and all this nonsense. You don't need to be a lawyer to see who's right and wrong here.\n\nThese three parties, all millionaires btw, have done everything in their power to derail 19 year old Hans Niemanns career. This is simply undeniable, regardless of how the lawsuit pans out. It's disgusting.","score":0,"comments":[{"body":"Its not illegal to think someone is cheating.","score":30,"comments":[{"body":"OP isn't asking about legality, nor about cheating","score":8,"comments":[{"body":"Point was its illegal to spread lies to ruin someones career, its not wrong or illegal if someone really believes he is cheating, which is the case.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"However it is  illegal to imply someone is cheating if the person making the implication has a [reckless disregard for the truth](https://www.nolo.com/legal-encyclopedia/defamation-libel-slander-key-elements-claim.html) and the implication causes damages.","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I doubt Hikaru really cares about Hans career. He just wants content and views. He played the situation like you would if you wanted traffic and few show up for some nuanced take with a lot of couching &amp; uncertainty.\n\nCarlsen clearly thinks he cheated OTB and wants his career ended. Evidence is too weak for me on OTB cheating and his handling looked impulsive and ill-thought out but I don't think he acted out of some unjustifiable malice towards Hans.\n\nI genuinely have no idea what chess/com or Danny want and their behavior has struck me as the most bizarre. They handled the controversy in probably the most unprofessional way and waded into territory and commentary they had no business doing - it's unworthy of a serious company who is a major player in the industry - they should've put out a simple few paragraph statement the day of the interview and been done with it.","score":10,"comments":[]},{"body":"\"Is there really anybody who disagrees with my super biased opinions?!\"\n\nUhhh, yeah man.","score":15,"comments":[]},{"body":"i mean a lot of people think his career should be ruined. no place for cheaters in chess imo","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I don't see how Hikaru has done anything to bring down Hans Neimann's career when all he did was report on the situation. That'd be like saying that NBC did 9/11 because The Today Show cut to the footage and they started talking about what happened after the planes flew into the towers.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yes, they try. But why? Because they know Hans cheated.","score":6,"comments":[{"body":"Why are they so mad about Hans cheating online two years ago?","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"How will Na5 stop mate?","not_safe_for_work":false,"locked":false,"body":"From the Soviet Chess Primer.","score":16,"comments":[{"body":"The bishop on g4 covers e6, so white can't mate with Qe6 in that line...\n\nHowever, black is still a lot worse","score":16,"comments":[{"body":"Makes sense! Thanks. It's not the knight, but keeping the bishop there that stops mate.","score":5,"comments":[]},{"body":"Bg4 is indeed just a mistake, famously so from the opera game.","score":2,"comments":[{"body":"Bg4 wasn't a mistake here, maybe an inaccuracy. What got black into real trouble was Nc6, but after Qb3 Qd7 the world is not ending yet, see my comment.\n\nIn the opera game, Bg4 was a straight up tactical blunder because instead of Bc4, d4 was played and so Bg4 ran head first into dxe5, which forced black to immediately trade the only developed piece and gave white a huge initiative.","score":2,"comments":[]}]}]},{"body":"Genuine question, do you at least put the position on the board before you ask questions like that?","score":12,"comments":[{"body":"I did, I was so focused on the knight that I missed something pretty obvious.\n\nIt was the wording, \"He had to...\"\n\nAlso, obviously a beginner.","score":1,"comments":[]}]},{"body":"Na5 lets the g4-bishop still defend e6, while the knight attacks the queen on b3 as well as defends b7.\n\nNote that the analysis of this game was a bit sloppy, I don't think Na5 is forced. I mean, it didn't deserve much analysis because black played terribly, but I think up to Bxf3 the position was not even completely terrible. I claim with a bit of checking for tactics with the engine, that 5. ..Qd7 is playable. It defends f7, the \"drawback\" is that it allows 6. Qxb7 but 6. ..Rb8 7. Qa6 Bxf3 8. gxf3 Nf6 we are a pawn down and we are not even close to having compensation for the pawn, but we are finishing development, we have a safe king, we have a center pawn break with d5, and we have a potential weakness on the f-file to exploit with our knights. For sure white is better, but up until a certain rating range I would claim that white isn't nearly safe enough to be playing for 2 results here. There is room to mess this up very easily, as seen by the one master game in the database. I think it's a good example of a trend breaking move to stop the initiative at the cost of a pawn.","score":1,"comments":[]},{"body":"This post has been parodied on r/AnarchyChess.\n\nRelevant r/AnarchyChess posts: \n\n[How will Na5 stop mate?](https://www.reddit.com/r/AnarchyChess/comments/z0h2jk/how_will_na5_stop_mate/) by GMDeepBlue\n\n[^(fmhall)](https://www.reddit.com/user/fmhall) ^| [^(github)](https://github.com/fmhall/relevant-post-bot)","score":1,"comments":[]}]},{"title":"Why is Rg8+ not the correct move? According to lichess, Ne7 &gt; Rg8+","not_safe_for_work":false,"locked":false,"body":"","score":426,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=4R3/5pkp/2rp1pq1/3N4/1p3B2/1P4Pb/P4P2/3R2K1+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/4R3/5pkp/2rp1pq1/3N4/1p3B2/1P4Pb/P4P2/3R2K1_w_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Knight!&lt;, move: &gt;!Ne7!&lt;\n\n&gt; Evaluation: &gt;!White is winning +6.83!&lt;\n\n&gt; Best continuation: &gt;!1. Ne7 Rc8 2. Rxc8 Bxc8 3. Nxg6 hxg6 4. Bxd6 Kh6 5. Bxb4 f5 6. Rd4 f6 7. Bd2+ Kg7 8. Bc3 Ba6!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Ask yourself what the threat is\n\nNe7 threat is Rg8 checkmate. After black avoids checkmate with move like h5 you pick up the queen with Rg8+ followed by Rook takes queen, now you didnt lose a knight in the process so its an improvement of your move","score":344,"comments":[{"body":"If h5 you just do Nxg6, no need for Rg8.","score":67,"comments":[{"body":"h5 Nxg6 after black recapture white would be up a rook.\n\nh5 Rg8 Kh7 Rxg6 fxg6 Nxc6 White is up a rook and knight.","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"You are trading a rook and a knight for a Queen which isn't all that impressive. While with ne7 you are forking the rook and the queen (and threatening checkmate if he tries something weird like Qc2)","score":257,"comments":[{"body":"Just take the rook instead of the queen you win the rook. You aren’t losing any material, still threatening the queen AND checkmate","score":47,"comments":[{"body":"Honestly you get the queen too, the only way to get out of checkmate is to move the f or h pawn","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Why would Rg8+ be winning? Work out the variations till the end and count material.","score":44,"comments":[]},{"body":"ne7 wins the queen but trades fewer pieces for it.","score":4,"comments":[]},{"body":"Because Ne7 threatens mate and you'll be up with a Rook.  \nWith Rg8+, Kxg8, Ne7... you will win the Queen for a Rook and a Knight but the position will be equal.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I can't get any better than 1500","not_safe_for_work":false,"locked":false,"body":"I just can't. A year ago I decided to learn, watch videos, learn openings and so on my spare time. I was already a 1500, after a few months didn't get any better, eventually I stopped playing because of work. Now I started playing again after a year or so, and I'm still a 1500. I forgot basically all the opening I learnt but still a 1500.\n\nIs there any way to get better without having to spend tons of hours? I play maybe an hour a day or something like that. Unfortunately I can't spend more time.\n\nI think it has to do with me only playing 5 minutes match, I feel like 5 minutes is not enough to calculate positions, learn patterns, etc.","score":0,"comments":[{"body":"An hour a day is plenty, but yes 5 minute matches aren’t going to be super helpful to improvement. Ideally you should reduce game volume in favour of longer time format e.g. one game every other day, and some analysis afterwards. Then you can have days where instead of playing you do puzzles or read a chess-related book.","score":6,"comments":[]},{"body":"Well that's 500 better than me as I've been stuck at around 1,000 for ages lol","score":3,"comments":[]},{"body":"It's a number, it doesn't matter.\n\nWhether you stall at 1,500, 1,700, or 2,000, you *will* stall and you will ***never*** get passed that point unless you commit to chess as a full time job.\n\nDo you want to do that?  No?  Neither do I.  So stop worrying about your rating and have fun.","score":3,"comments":[{"body":"What you said is true in some sense but it misses the point. There are better and worse ways to spend your study time that will affect your rating ceiling positively or negatively. Just because there is some theoretical ceiling doesn't mean you shouldn't try to improve.","score":7,"comments":[]},{"body":"For many Chess players, improvement IS what’s fun about Chess. We get to test ourselves and feel like we’re growing. If improvement is a large part of the fun, plateaus are painful. Rating doesn’t matter, but the feeling of improvement does :)","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"The way to break a plateau is to do something differently. You can break 1500, but the methods are clearly not serving you. And you don’t need to spend hours and hours. Take a step back, pretend you don’t know anything about “how to get better at Chess” and look at it fresh. Fundamentally change how you’re approaching the game and see where that takes you. \n\nWhen I did that, I discovered that visualization is a Chess superpower, developed a way to train it, and haven’t looked back since. You may find success doing a similar thing.\n\nIf you’re not getting results at good speeds, the problem is not with you. It’s with your learning method :)","score":2,"comments":[]},{"body":"What percent of your time is spent playing vs. studying? If you're only playing 5 minute games that will definitely limit you. You could try playing at least one 15+10 game per day or 30 minutes of tactics per day and see where it gets you after a couple months.","score":2,"comments":[]},{"body":"1500 Fide Elo or what kind of rating is this?","score":2,"comments":[]},{"body":"1500 is the usual plateau of most players. Unfortunately to get better you have to put in the work atleast 5 hours a week of studying all aspects and review your games.","score":3,"comments":[{"body":"Lol what","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Only good move, black to play (and white's best response?)","not_safe_for_work":false,"locked":false,"body":"","score":26,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=r1bqk2r/p1p1b1p1/2p5/5p2/6P1/P1NN2p1/1P2PP2/R1BQ1RK1+b+kq+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r1bqk2r/p1p1b1p1/2p5/5p2/6P1/P1NN2p1/1P2PP2/R1BQ1RK1_b_kq_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Bishop!&lt;, move: &gt;!Bc5!&lt;\n\n&gt; Evaluation: &gt;!The game is equal +0.12!&lt;\n\n&gt; Best continuation: &gt;!1... Bc5 2. g5 f4 3. Ne4 Qd7 4. Nxf4 gxf2+ 5. Kg2 Qg4+ 6. Ng3!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"&gt;!After Bc5, White can't take the bishop because then Qh4 is a massive checkmate threat and white will lose their queen. White has to instead play g5 to continue the game with a slight advantage, and the position remains extremely sharp for both sides. Qa4 also exists, but after Rh1, if Kxh1, a long perpetual exists with some precise moves needed for both sides. If king doesn't take, the rook just checks repeatedly. I played gxf2, which is losing but I somehow won, https://lichess.org/NO94rErY!&lt;","score":13,"comments":[{"body":"Nice puzzle","score":1,"comments":[]}]},{"body":"Me sees check me checks","score":5,"comments":[{"body":"Never miss a check it might be mate","score":2,"comments":[]}]},{"body":"It helps a lot to know that there's no win in this position, I'd be wasting my time for sure to look for more than what's in the position.","score":1,"comments":[{"body":"Should we add a flair for when the anal beads aren't activated?","score":3,"comments":[{"body":"What?","score":1,"comments":[]}]}]}]},{"title":"How do you keep up with Chessable courses?","not_safe_for_work":false,"locked":false,"body":"I have been doing some courses over the past few months and I always have tons of moves to review (1000+).\n\nI try to practice 30 min of chessable every day but still it's almost impossible to get it all done and I only have 2 courses.\n\nIt looks like it's almost impossible to progress with the courses since there is always a tons of moves to review.","score":8,"comments":[{"body":"I think this is common among chessable users (I did it, too, in the beginning). Learning 80 variations on the first day because you are bored and curious. Then get overwhelmed when the reviews come tickling in.\n\nMy solution (or what I did): Pause learning new stuff until the the workload becomes manageable again. Consider pausing a view chapters. Then when you caught up and have free time again just learn one or two new variations/puzzles per day. The reviews tickling in after a view days will keep you busy ;) .","score":10,"comments":[]},{"body":"Which courses do you have ? \nMaybe don't learn new things everyday. It's difficult to say with so little info but I have like 10 courses and I don't have this issues. \nSome of them are on cyclical review because it doesn't make sense to know tactics so at times I have a lot but not everyday.","score":7,"comments":[{"body":"Checkmate patterns manual and 1001 exercises for club players","score":1,"comments":[{"body":"Knowing how much material there is in the Checkmate Patterns Manual, I wouldn’t really recommend doing it alongside another tactics course. Also, if you are having 1000+ moves to review every day, you’re likely getting a ton of the exercises wrong (if not, then chip away at it about 50-100 moves per day, and your queue will go down eventually). I’m doing the Checkmate Patterns Manual right now and if I work on it every day and regularly learn new chapters, I have like 50 or less moves in my queue per day. I’d suggest pausing a few of the chapters and making sure you have the variations more or less down pat before adding more.\n\nEdit: spelling","score":8,"comments":[{"body":"I've done multiple tactics books on Chessable, and am working my way through Checkmate Patterns now. I'm doing it the same way I did the others: do one chapter, or maybe two if they're short, then give it about a week for the reps to reach a more spaced-out schedule, then do another chapter...\n\nIt's going to take a while, but I feel like the same approach already paid off -- I did that all the way through Peter Giannatos' tactics workbook, and then all the way through Yasser's \"Winning Chess Tactics\", and I know my tactical vision improved (if nothing else, my puzzle rating went up something like a thousand points). So I'll just slow-and-steady my way through Checkmate Patterns, too.","score":3,"comments":[]}]},{"body":"I have checkmate pattern too and in my opinion it's better to do this with cycle. I think with the usual way you could learn puzzle and not the pattern themselves. I try to work it in a woodpecker way. I'll put this one every 4 weeks and if at first I learned a ton I try to not learn anything new until I have 100% review. I have it tomorrow and I have 700 moves. \n\nBut I can understand if you'll only have these course you won't be able to work on chessable everyday with this method. Maybe one or two S&amp;S ?","score":4,"comments":[]}]}]},{"body":"I just ignore it and review at my own pace.","score":3,"comments":[]},{"body":"1000+ moves quickly turns into &lt;50 a day if you get always get them right. If you aren't always getting them right you need to pause some variations until you are.","score":2,"comments":[]},{"body":"I only learn new moves when I have less than 200 to review within 24 hours.\n\nThat's the main idea, find what works for you, 100 or 300 -- the point is simple enough: if you have too much already, _stop learning more_.","score":2,"comments":[]},{"body":"Don't bite off more than you can chew. Don't blindly log in every day and try to memorise whole repertoires.\n\nDon't buy lifetime repertoire courses if they're too advanced. Pause lines and variations you're not interested in. Some lines you don't need to memorise and should only review every now and then.","score":0,"comments":[]}]},{"title":"Candid online post match (Carlsen vs Pragg) interview of Magnus Carlsen by Sagar, Chessbase India.","not_safe_for_work":false,"locked":false,"body":"","score":45,"comments":[{"body":"I love Sagar's interviews. No bs, cuts straight to the chess.","score":19,"comments":[{"body":"And such a genuine warmth comes across. I wonder if he meditates a lot. He seems so centered!","score":6,"comments":[]}]},{"body":"Magnus won't play the Tata steel tournament next year? Wow","score":3,"comments":[{"body":"I assume he means the TATA steel rapid and blitz in India, and not TATA steel Wijk aan Zee in January.","score":16,"comments":[{"body":"Oh, that makes sense. Wow, I was shocked for a moment. Thank you","score":4,"comments":[]},{"body":"Oh yeah, that makes sense, I thought it was weird he mentioned tata steel when Sagar asked talked about India, didn't even know about the rapid and blitz tourney","score":4,"comments":[]}]},{"body":"&gt;Magnus won't play the Tata steel tournament next year? Wow\n\nIt's this one - [the rapid and blitz tournament in India](https://tatasteelchess.in), that's also sponsored by Tata Steel and starts soon. It used to be part of the Grand Chess Tour, but not this year.\n\nFor Tata Steel Masters in Wijk an Zee, the ones I've found announced already are Anish Giri, Jorden van Foreest, Nodirbek Abdusattorov,  Wesley So, Gukesh, and Arjun Erigaisi.","score":3,"comments":[]}]}]},{"title":"Anya Taylor-Joy Still Gets Fans Asking Her To Play Chess","not_safe_for_work":false,"locked":false,"body":"","score":236,"comments":[{"body":"beth harmon supergm 2790","score":105,"comments":[]},{"body":"Haven't seen this show. How realistic was her character's strength? Not some unbeatable superhuman?","score":58,"comments":[{"body":"She lost games in the show. The show had input from Kasparov for realism with respect to professional chess so it was pretty good in that end","score":269,"comments":[{"body":"Magnus also praises it, he put up a YouTube video on his channel talking about it (in an interview)","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Thanks. I will see it then","score":28,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Most realistic portrait of a super GM ever on film in my opinion. Carlsen noted that she got used to tournaments and the level of play in her time period too quickly - that sort of thing was only really possible in Morphy’s day. But all in all the show took chess VERY seriously and it was incredibly well made.","score":44,"comments":[{"body":"And it seemed intended as a part of her character. Like the focus on the \"touch move rule\", when they highlighted mentioning it to her you could've thought it'll come into play later, but no, she said ok and that's it.","score":16,"comments":[]}]},{"body":"The main character in the book was inspired by Bobby Fischer. In the show she wins what I assume was the World Championship or something to that level.","score":57,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"She has an interesting accent. Spanish is her first language but no Spanish accent shows up in her English, and when she speaks English it sounds like a mix of a British and American accent","score":37,"comments":[{"body":"She has no “Spanish” accent anyway because she’s not spanish but Argentinian, but I get what you mean. Also she learned English at the same time as Spanish and has lived basically her entire life in America and England","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Black blundered, what is white's best move ?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=r3kb1r/2qb1p2/p1pp1ppp/5N2/4P3/2N5/PPP2PPP/R2QR1K1+w+kq+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r3kb1r/2qb1p2/p1pp1ppp/5N2/4P3/2N5/PPP2PPP/R2QR1K1_w_kq_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Queen!&lt;, move: &gt;!Qd4!&lt;\n\n&gt; Evaluation: &gt;!White is winning +3.09!&lt;\n\n&gt; Best continuation: &gt;!1. Qd4 Be7 2. Nxe7 Kxe7 3. Rad1 Be6 4. Rd3 Rhe8 5. Rf3 Kf8 6. Qxf6 Kg8 7. Qf4 Kg7 8. Rd1 Rad8!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"hard to find a good defense for black after Qd4","score":1,"comments":[]}]},{"title":"My favorite “Oh no my queen” moment","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=r2qkbnr/ppp2ppp/3p4/4N3/2BnP1b1/2NP4/PPP2PPP/R1BQK2R+b+KQkq+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r2qkbnr/ppp2ppp/3p4/4N3/2BnP1b1/2NP4/PPP2PPP/R1BQK2R_b_KQkq_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Pawn!&lt;, move: &gt;!dxe5!&lt;\n\n&gt; Evaluation: &gt;!Black is better -2.76!&lt;\n\n&gt; Best continuation: &gt;!1... dxe5 2. Qxg4 Nxc2+ 3. Kd1 Nxa1 4. f4 Nf6 5. Qf5 Qd7 6. fxe5!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"You’re supposed to play h3 first, now it’s just a free knight because black can fork c7 after you take the bishop.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The funny thing is that this is still losing for white.","score":2,"comments":[{"body":"Yes, but sub 1500 players are greedy in the short term, so 99.99999% that the enemy picks up the Queen, which is a mate in 2.","score":0,"comments":[{"body":"But why rely on your opponent being low elo to miss an advantage and blunder forced mate? Why not just play properly?","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"What do you do when black takes your Queen, I don’t see it.","score":1,"comments":[{"body":"Although, if he takes my Knight instead, black is clearly better, but it is a cheeky fun line, and lower rated players take a “free” Queen anytime.","score":3,"comments":[]},{"body":"If black takes the bait white has mate in 2 with Bxf7+.","score":2,"comments":[]},{"body":"It's a trap","score":2,"comments":[]},{"body":"If black takes my Queen (Bxd1), than I give check with my light square Bishop (Bxf7+), than after black moves his King (Ke7) which in this case his only option btw, I give checkmate with my Knight (Nd5#).","score":2,"comments":[]}]}]},{"title":"Online skill to OTB skill","not_safe_for_work":false,"locked":false,"body":"So I've noticed that I can play really well online, but over the board, for some reason, I play like 300 points lowers than online. Anyone know how to translate skill online to OTB?","score":1,"comments":[{"body":"When I play slow games online I put them on a real board and pretend is an OTB game.","score":2,"comments":[{"body":"I do the same playing bots","score":2,"comments":[]}]},{"body":"Online ratings tend to be inflated compared to FIDE, often by hundreds of points. Most people have higher online ratings, especially at lower levels. It's possible that your two ratings do reflect the same skill level even though they aren't the same.\n\n&amp;#x200B;\n\nIf you really feel like you play a lot worse I would practice playing with the time controls you play OTB if they're much longer than you play online. I would also practice using a board, maybe using it for games in person or tactics. That can help improve your otb vision.","score":1,"comments":[]},{"body":"Here is a good link for comparisons. https://chessgoals.com/rating-comparison/","score":1,"comments":[]},{"body":"Have you played OTB often? I don't know why, but OTB it's the real deal, experience matters a lot.","score":1,"comments":[]},{"body":"Not sure exactly what question you are trying to ask.\n\nIf your question is \"I feel I am not as good when I play OTB as I am online\" that's pretty common for people who learned online. I have the same issue...my board vision is just garbage OTB. I believe it's just a matter of practice and getting used to it.\n\nYour question could also be interpreted as something like \"I play just as well OTB as I do online but my rating OTB is like 300 points lower than my chesscom rating\" Which can be explained by player-pool strength. ELO systems measure your relative strength IN THE POOL of players. Seems reasonable to say that the people who play enough chess and care about it enough to go play OTB rated tournaments is a stronger field than the pool of players who just install chesscom app and play for fun, ya know? So it makes sense to have a higher rating in the more recreational pool of online chess than in the much more competitive pool of OTB tournaments.","score":1,"comments":[]},{"body":"play more otb, thats all you can do","score":1,"comments":[]}]},{"title":"Tactics training in context of a full game?","not_safe_for_work":false,"locked":false,"body":"Are there any sites / tools that let you play a game against the computer from the opening and give you a little “nudge” to look for a tactical advantage in a position where there’s a tactical motif on the board? I would love to be able to play such a training method.","score":2,"comments":[{"body":"I have not see one but I have heard of Chesstempo might be something to investigate. Personally I just ran trough the 7 Circles program. - take 1200 or so problems. Do 20-40 a day for two months. When compete Then half the time and double the amount for circle 2. 40 problems a day for a month. 80 a day for 2-3 weeks. 160 a day for a week. 320 a day for 4 days for circle 5. Then 640 a day for 2 days and then all 1200 or so on the final day. Those last two or three weeks is rough. I guarantee you’ll improve your tactical vision. I’ll be starting this again next week. \n\nFor example of how successful it is, I have been stuck at the 1350-1450 USCF rating most of my adult life. This last tournament I beat a 1750, drew a 1500, 1650 and a 1900. My rating jumped from 1344 to 1492 And I expect it to raise more even. This works. It’s hard and challenging but it works if you commit to it.","score":3,"comments":[{"body":"Also there is this on Lichess. Check this out. https://lichess.org/training/openings","score":1,"comments":[]}]},{"body":"Not quite what you're asking for, but Lichess puzzles are from real games and you can look up the game so you can analyse how to reach positions where the tactic in question can happen. Not sure if there's a service that's what you descibed.","score":1,"comments":[{"body":"I was doing lichess puzzles and had this thought haha. I’ve seen enough positions that are similar enough to games I’ve had that it would be nice to have a ping that says “hey! You’re in a puzzle position”","score":1,"comments":[]}]}]},{"title":"Is there a good app for practicing openings and gambits?","not_safe_for_work":false,"locked":false,"body":"Looking for a phone app that I can practice new openings and gambits depending on a variety of scenarios.","score":0,"comments":[{"body":"Chesstempo","score":2,"comments":[]},{"body":"Chessable is amazing for this and it has courses and it is free","score":1,"comments":[]},{"body":"Lichess studies works well too.","score":1,"comments":[]}]},{"title":"Can someone find the best move?","not_safe_for_work":false,"locked":false,"body":"I was playing chess and we get into this position we accept a draw but i am curious if i could win this (i am white) black on move","score":0,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **White to play**: [chess.com](https://chess.com/analysis?fen=r5k1/4Rppp/p7/1p6/2p5/2N1P3/PP3PbP/6K1+w+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r5k1/4Rppp/p7/1p6/2p5/2N1P3/PP3PbP/6K1_w_-_-_0_1)\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=r5k1/4Rppp/p7/1p6/2p5/2N1P3/PP3PbP/6K1+b+-+-+0+1&amp;flip=false&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r5k1/4Rppp/p7/1p6/2p5/2N1P3/PP3PbP/6K1_b_-_-_0_1)\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"Did you consider taking the hanging bishop?","score":6,"comments":[]},{"body":"Kf1","score":2,"comments":[{"body":"No better is kc2","score":1,"comments":[]}]},{"body":"Ne8#…","score":0,"comments":[{"body":"Uh","score":1,"comments":[]}]}]},{"title":"Can someone explain to me how plateauing works and also are there some ratings in which it is more likely to happen?","not_safe_for_work":false,"locked":false,"body":"I have been playing chess on and off for about 2.5 years and I keep hearing the term \"plateau\". What I don't understand is how It is  possible for someone to stop improving even if you study and play. Also What factors may contribute in the plateau?","score":6,"comments":[{"body":"For me, I played around 2300 got a coach (GM Zaragatski) hit 2400, hit 2500 (\"by the fingertips only\" ) and have been bouncing around 2450 for the last 8 months. I think to advance to say 2600 I would have to improve quite a few things. \n\nIn particular \n\nMy open prep is super weak and I basically just play stuff to avoid main lines.\n\nMy endgame skills need massive improvement; e.g. R+ pawn vs B and N positions or when to start king walks. \n\nI need to improve upstanding of being active and positional (i.e., when there are not a lot of dynamics).\n\nSo in general I think 1) people put a lot of work in the wrong things because they are fun. and 2) people can put a lot of work in the right things but not see any advancement because they need to put a lot of work in other things as well.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNote all ratings are online blitz/ rapid (spoilers I am not a professional player and def not a  super GM; just some standard asshole with a bit of time and cash for chess lessons)","score":4,"comments":[]},{"body":"\"What I don't understand is how It is possible for someone to stop improving even if you study and play.\".\n\nMy suggestion is you advertise your services to the best players in the world. Many of whom appear to have reached their peak. And you can help them continue to improve to levels hitherto unmatched by any human in the history of chess. Pretty sure you'll get well paid for this :)\n\nMore seriously - my suspicion is temporary plateaus occur in your chess development when you reach the natural limit of your current focus.\n\nSo as a total beginner, you will win most games by learning to literally never leave a piece en prise. There's no need to get past that until you \"plateau\". At which point you'll start to learn the basics of plans, setting tactical traps. And then you'll plateau when you reach opponents that basically never fall for your traps. And then you learn longer-term term strategies. And so on.\n\nI don't think of them as plateaus - I think the natural development of chess players is to beat what's in front of them, and so \"plateauing\" is, in my opinion, the name given for the phenomenon of discovering you've maxed out on optimising your current chess understanding","score":11,"comments":[{"body":"\n&gt;So as a total beginner, you will win most games by learning to literally never leave a piece en prise.\n\nThis will get you a lot farther than just beginner status, especially in shorter time controls. Not hanging your pieces will put you at 1900 lichess or so in blitz.","score":-1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Chess isn't a school subject where you just have to study and get grades based on how well you did that. \n\nChess is a _skill_, it's about finding the best move in positions _you have never seen before_, in match conditions.\n\nYes, after the game you can see what you did wrong. But you're never going to have those exact positions again. What matters is _why_ you make those mistakes, then how you can train to not do that next time. \n\nThe problem for adults is that it's often not about learning new things, but about _unlearning_ bad thinking habits.\n\nAll in all, improvement isn't constant. It's a repeating process of finding the next thing you need to do to improve.","score":4,"comments":[]},{"body":"Maybe you’re maxed out already and can’t improve further. Just resign now 🙊 just kidding! It’ll come with time and patience. Maybe try different approaches to how you study. More focused studying, hire a coach. Maybe take a look at non chess related issues which could help like improving your diet, sleep and water intake. Give the brain the best environment to thrive in! Good luck mate","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"An example from another sport, running. Unless you train to improve your pace by mixing tougher speed workouts into your routine, you will at best stagnate if you do only comfortable runs, or lose fitness &amp; start running slower if you're not running enough.\n\nIn chess if you mostly play without attempting to improve (Prophet Danya speedruns, puzzles, long games, post mortem analysis), you will plateau indefinitely.","score":2,"comments":[]},{"body":"it generally applies to people who play but dont study (i dont really study and am still improving at 1600)\n\nit  is a real thing, basically if someone plays 3min blitz and they use the same opening, and they play the same way, never adding new concepts, and if they dont analyze they can plateau \n\ni imagine ~2000 is the strongest you could get without study","score":1,"comments":[]},{"body":"Because in many subjects, you have to get *worse* before you can get better. Something about the player's understanding of the game is wrong, and if they destroy that belief and rebuild, their ELO will go down in the short term which is painful and most people want to avoid that.","score":1,"comments":[]},{"body":"chess skill is a combination of many micro skills.\n\nfor example getting to 1000 means not hanging a piece in 1 move. preventing hanging pieces is a series of micro skills such as (not mis-)counting defenders, not removing defenders for no reason, remembering that some pieces can move backwards, or checking whether your piece can be captured at wherever you want to put it.\n\nimagine these micro skills all being small batteries. you charge them up, and once they are fully loaded you have stabilized this skill level. \n\nbut further charging fully loaded batteries does not help anymore. to get stronger you have to charge up the next set of batteries. people who plateau do not work on new batteries, they keep charging fully loaded old ones.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What chess.com rank is considered decent?","not_safe_for_work":false,"locked":false,"body":"I'm 1200 but im uncomfortable telling anyone about my account cause I don't want them to think I'm really bad at the game.","score":0,"comments":[{"body":"161660","score":4,"comments":[]},{"body":"If you're any rating around 800-900 Blitz, you're already better than half the population of chess.com at any given time.","score":2,"comments":[{"body":"Damn, half? I didn’t know that","score":1,"comments":[]}]},{"body":"Like Aman says, you can say you have the number of digits as Magnus","score":2,"comments":[]},{"body":"It's all relative. 1200 wouldn't be remarkable for anyone that's really into chess as a hobby, but it would definitely be better than the vast majority of the general public.","score":1,"comments":[]},{"body":"Your elo+1","score":1,"comments":[]},{"body":"I heard 2000 blitz, but im 2100 and i disagree","score":1,"comments":[{"body":"yeah we are trash","score":2,"comments":[]}]},{"body":"I think people consider their chess ability too closely linked with their intelligence. You shouldn’t feel bad about any rating, and certainly not one that is better than half of all the people that are actively playing online!","score":1,"comments":[]},{"body":"3197 blitz, 3342 bullet","score":1,"comments":[]}]},{"title":"Beautiful mate in 6 I found today in a blitz game. Black to play and win.","not_safe_for_work":false,"locked":false,"body":"","score":143,"comments":[{"body":"I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n&gt; **Black to play**: [chess.com](https://chess.com/analysis?fen=2kr1b1r/pp3pp1/2n2np1/8/N5P1/3Pq2P/2P3B1/R2Q1R1K+b+-+-+0+1&amp;flip=true&amp;ref_id=23962172) | [lichess.org](https://lichess.org/analysis/2kr1b1r/pp3pp1/2n2np1/8/N5P1/3Pq2P/2P3B1/R2Q1R1K_b_-_-_0_1)\n\n**My solution:**\n\n&gt; Hints: piece: &gt;!Rook!&lt;, move: &gt;!Rxh3+!&lt;\n\n&gt; Evaluation: &gt;!Black has mate in 6!&lt;\n\n&gt; Best continuation: &gt;!1... Rxh3+ 2. Bxh3 Qxh3+ 3. Kg1 Bc5+ 4. Rf2 Qg3+ 5. Kh1 Rh8+ 6. Rh2 Rxh2#!&lt;\n\n---\n\n^(I'm a bot written by ) [^(u/pkacprzak )](https://www.reddit.com/u/pkacprzak) ^(| get me as ) [^(Chess eBook Reader )](https://ebook.chessvision.ai?utm_source=reddit&amp;utm_medium=bot) ^(|) [^(Chrome Extension )](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^(|) [^(iOS App )](https://apps.apple.com/us/app/id1574933453) ^(|) [^(Android App )](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^(to scan and analyze positions | Website: ) [^(Chessvision.ai)](https://chessvision.ai)","score":1,"comments":[]},{"body":"The first two moves are pretty obvious, but if you saw the bishop clearance sacrifice from this position in a blitz game, that's a nice find. \n\nIn blitz I'd probably play the first two moves and then stop to look for the finish, but at that position the B sac is much easier to find.","score":43,"comments":[{"body":"&gt;but if you saw the bishop clearance sacrifice from this position in a blitz game, that's a nice find. \n\nJokes on you, I saw the bishop move but didn't realize it was a sack because I didn't notice the knight","score":19,"comments":[{"body":"Love it when that happens in a game, where you go from yo I just played a brilliant move, to oh shit it's a blunder, back to it actually being a brilliant move","score":6,"comments":[]}]}]},{"body":"Without fully calculating I'm guessing, sac the rook, check with queen, kb1 is forced and a dark square, bishop check to clear the path for rook h8 then I think white has some options but he's getting mated with the queen on G3 and the rook down the h file.","score":36,"comments":[{"body":"Yeah pretty much calculated the whole line lol","score":19,"comments":[]},{"body":"Bishop C5+ knight just takes…","score":-11,"comments":[{"body":"Point being threat of Rh8, clearance sac","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Why doesn’t the night take the bishop on C5?","score":2,"comments":[{"body":"This lets Black mate in 5:\n\n1... Rxh3+ 2. Bxh3 Qxh3+ 3. Kg1 Bc5+ 4. Nxc5 Qg3+ 5. Kh1 Rh8#","score":4,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What’s your take on chess as a metaphorical war game? Do you think it’s still applicable today?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"If chess really wanted to be like a war game you would need to provide adequate supply lines to your units so they can eat, have clothes and weapons. You would need to award your pieces medals after. In the modern theatre one would need to have robust cryptographic communications such that your opponent couldn’t interfere with the communication of commands.","score":10,"comments":[{"body":"Chess is about a battle more than it is a war. Whatever wider manoeuvres brought us to this point, the game begins when both kings and their retinues arrive at the same battlefield: at this point it's too late, the engagement will be decisive long before supplies or reinforcements can arrive to make a difference.\n\nI'd say that the failing of chess in these terms is that it is a game of perfect information, in which both sides always know the entire state of the board. Warfare is full of ruses; of camouflage and secrecy, deceptions aimed at making units seem stronger or weaker than they truly are, and attempts to take the enemy in a surprise ambush. If chess were to be redesigned along these lines, it might look a lot like Stratego.","score":3,"comments":[]},{"body":"It’s called bughouse. Look it up. You can reinforce your pieces!","score":1,"comments":[]}]},{"body":"Absolutely 100% still valid.  I'm 2,000 rated, so would obviously be great at leading mid-sized battalions into battle.  🙄","score":6,"comments":[]},{"body":"The only thing that being good at chess means is that you're good at chess","score":2,"comments":[{"body":"Nobody said being good at chess makes you a war expert, chess is clearly a war inspired game though.","score":3,"comments":[]}]},{"body":"If Tal was a general, he'd be down for giving up the queen for 2 elephants.","score":2,"comments":[]},{"body":"It can be taken as a metaphor for a war, but there are obviously major differences between chess and war.","score":1,"comments":[]},{"body":"I think it would be cool if the pieces shot/stabbed each other like wizard chess from Harry Potter or that game they played in star wars where the pieces each each other lol\n\nAlso I find it interesting that in the army they reference the infantry as the Queen of battle and field artillery as the King of the battlefield.","score":1,"comments":[]},{"body":"Never. Chess is too complicated. It's is deep to the a certain point, comparing chess to anything is irrelevant.","score":-3,"comments":[]}]},{"title":"Classical Gas: A Duet for Chess Lovers (music video)","not_safe_for_work":false,"locked":false,"body":"A music video for chess lovers and message for World Peace.\n\n[https://youtu.be/Ths6tc6HSbw](https://youtu.be/Ths6tc6HSbw)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/umcji55g851a1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7e441f2601af956f1e957de916da260d06d4ed28","score":0,"comments":[]},{"title":"NBA superstar Luka Doncic says he prefers Chess to Twitter","not_safe_for_work":false,"locked":false,"body":"","score":1009,"comments":[{"body":"The world would be a much better place if more people indulged their hobbies than yelling at each other in 280 characters at a time.","score":373,"comments":[{"body":"You clearly haven’t gotten a lichess message telling you that you play like a brain damaged sea sponge","score":203,"comments":[{"body":"I've played on Lichess for years and have never gotten such a message","score":46,"comments":[{"body":"That means you aren't a brain damaged sea sponge.","score":62,"comments":[{"body":"Nice!  \n\nToday's gonna be a good day with news like that","score":18,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"My worlds are colliding \n\nr/mavericks has an entire thread wondering if we should hire Magnus as an assistant coach lmao","score":188,"comments":[{"body":"Luka out there playing the slovenian gambit","score":44,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Who doesn’t ?","score":41,"comments":[{"body":"Some people find chess too simple to be useful: a mere 8 by 8 grid, no fog of war, no technology tree, no random map or spawn position, only 2 players, both sides exact same pieces, etc.\n\nPolytopia addresses these limitations.","score":110,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"They should host a chess match between him and Christian Pulisic.","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Chess.com leagues","not_safe_for_work":false,"locked":false,"body":"Does anyone know what the prizes are in Legend League?","score":0,"comments":[{"body":"https://www.chess.com/article/view/chesscom-legends-arena-2022","score":2,"comments":[]},{"body":"https://lichess.org/@/Chessy64/blog/chesscom-scammed-me-out-of-winning-10000usd-in-players-leagues/dtvoWuGc","score":1,"comments":[]}]},{"title":"Tips for improving at hyper bullet chess?","not_safe_for_work":false,"locked":false,"body":"Yeah so imo the most underrated form of chess is hyper bullet (30s). Probably because tik tok has destroyed my attention span but anyways… I’m currently 1400 on chess.com and looking to improve. Any suggestions to get better at this form of chess?","score":0,"comments":[{"body":"Thanks for your question. Make sure to read our [guide on how to get better at chess](https://www.reddit.com/r/chess/wiki/improve); there are lots of tools and tips here for players looking to improve their game. In addition, feel free to visit our sister subreddit /r/chessbeginners for more information.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/chess) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"You've got to get through the opening very fast, so either play a set-up based opening e.g KIA/KID, Nimzo-larsen, 1.g3 systems etc. or play your main repertoire with confidence. Play aggressively, pre-move all forced captures and go full flag-mode when under 5 seconds.","score":8,"comments":[{"body":"I would add that under 2 seconds, sacking pieces for checks will win you lots of games.","score":8,"comments":[]}]},{"body":"Get off tik toc.","score":18,"comments":[{"body":"Get off chess.c*m as well","score":3,"comments":[]}]},{"body":"I've always been thought that bullet is the gambling/cocain of chess. As a 1700 bullet I can't even see the enjoyment in playing 30 seconds except maybe shots of adrenaline.","score":3,"comments":[]},{"body":"My bullet rating went up when I stopped playing on full screen and made the browser window smaller:))\n\nPlaying openings and endgames very fast, so a strong opening repertoire (most of the games I play are Queens Gambit and some weird Taimanov Sicilian that the engine doesn't like, but no one below 2200 plays the right moves so I get away with it and it complicates stuff for white); also endgames can be played very fast if you know when to sack your rook for a pawn storm etc. Taking time in the middle game has been the key for me; anyway it boils down to time management really, as you can still stalemate or even win on time with knight and some pawns even with stronger players.\n\nIf you're into improving your rating and not chess abilities in general – as most people playing online are:P, not saying I'm not vain at all – playing tournaments, not your own rating pool, is the way to go. Winning with much higher rated players is definitely easier due to some randomness/speed in bullet.\n\nPS. And the fianchetto trap is fun. But what I absolutely hate about it is when people resign when it doesn't work – come on, own the mistake and play on, it's bullet and everything can happen.","score":2,"comments":[]},{"body":"I recommend picking system openings, so as White that looks like 1.Nf3 2.g3 3.Bg2 4.0-0 5.d3 6.Nbd2 and as Black something like 1.c6 2.d5 (premoved, no opening can premove trick the Caro-Kann) 3.Nf6 4.g6 5.Bg7 6.0-0, this way you save time in the opening.\n\nMaking sure to \"hover move\" is also really important. An example is imagine you have the White pieces - hold and drag your Knight that's on b1, to hover it over c3 ready to place it down as soon as your opponent makes a move. This way you make your moves fast but you can't get premove tricked. Andrew Tang does this very nicely, watching his hyperbullet youtube videos helps a lot to understand. The top skilled hyperbullet players understand to \"hover move\" rather than premove 5 times in a row to not get premove tricked. Hope this helps!","score":1,"comments":[]}]},{"title":"Chess.com to USCF rating","not_safe_for_work":false,"locked":false,"body":"I’m an 1850 rapid on chess.com and I’m going to register for an upcoming tournament that’s pretty big. I also have some classical and otb experience so there wouldn't be too much of a learning curve to this, I'm unfamiliar with the difficulty and conversion of Chess.com to USCF. Should I register for u1800 or u2000? the u2000 is mostly 1700-1800 players and u1800 is mostly 1500 rated players.","score":0,"comments":[{"body":"If it’s your first experience OTB, go for the u1800. It takes time to get used to the physical pieces, the OTB rules, the time control and everything else. You might eke out some wins even in the u2000 section, but you’d have a more pleasant experience in the u1800 one","score":5,"comments":[{"body":"Thank you for the response! I do have some otb and classical experience which I probably should've included in the post. I'm going to go back and edit that in lol. Thank you for your time and advice!","score":2,"comments":[]}]},{"body":"This is a good comparison link. https://chessgoals.com/rating-comparison/ use it with a grainy of salt however. Just a rough estimate really.","score":2,"comments":[]},{"body":"Around 1400 USCF","score":2,"comments":[]},{"body":"[deleted]","score":1,"comments":[{"body":"There is no one who is rated uscf 3000+ but there is one in chesscom blitz. Chesscom rating is clearly inflated.","score":1,"comments":[]}]},{"body":"Go with the u1800 section.\n\nSource: Lichess 2050 (peak 2150) getting 1700 PR in OTB blitz events and being happy because I had a great tournament.","score":1,"comments":[]},{"body":"I had my first OTB tournament last month. I’m around 1400 chesscom blitz but registered for the open section. Played 4 games went 1-3 against an 1800 average but the best part was the post mortems with stronger players. I learned a lot about what I should work on. I can see arguments for the u1800 section as well, but if you can take a couple of losses here and there go for the u2000 and take the opportunity to learn.","score":1,"comments":[]},{"body":"1850 chesscom would be like ~1600 USCF and like ~1400-1500 FIDE or so","score":1,"comments":[]}]},{"title":"Woman in Chess, not the best?","not_safe_for_work":false,"locked":false,"body":"Usually when it comes to Sports feminists always claim that men sports is getting more attention and the facilities are way better for men therefore woman don’t have a chance because they don’t have the best conditions.\n\nBut what is it coming down to chess?\n\nI looked up the world rankings and the first woman appears at place #95. \n\nSo why is it that woman are not even in the top 50 worldwide in a sport that doesn’t need that much of „Attention“\n\nThis post is not to hate on woman but to understand. Big Jennifer Yu Fan btw.","score":0,"comments":[{"body":"&gt;Usually when it comes to Sports feminists always claim that men sports is getting more attention and the facilities are way better for men therefore woman don’t have a chance because they don’t have the best conditions.\n\nMust admit that I have never really heard this argument before. In most physical sports, it is quite clear that there are biological reasons why the female body e.g. can't run as fast as a well-trained male body. \n\n&gt;So why is it that woman are not even in the top 50 worldwide in a sport that doesn’t need that much of „Attention“\r  \n\r\n\nI feel you have it the other way around. Chess requires quite a lot of attention. If you don't play chess already in your childhood, you are very unlikely to achieve a high rating as an adult. This means you generally need supportive parents, who encourage you to play the game. This is different from many other sports, where you could potentially train your body to a competitive level later (especially if you are already in a good shape). That is not the case for chess. This is btw. also one of the reasons that certain countries are repeatedly dominant on the international stage (e.g. Russia), while other countries (all of Africa) have very few top players. The reason is that if you don't have a culture that encourages children to play chess (and that allows them to spend time on devoting themselves to chess) you will not have any top players. \n\nIn a lot of cultures around the world, women are not encouraged to play chess. That was even more so the case a few decades back, when the players who are right now competing at the highest level grew up. You just need to walk into any scholastic chess club to see the massive lack of girls. On top of this, the chess community has been quite toxic towards women, often claiming that women just can't play chess. This means that even those girls that has taken an initial interest in chess will for obvious reasons have changed to other sports/hobbies that are more welcoming for girls. \n\nWe know that it is not impossible for women to compete at high level chess. Judit Polgár was trained as a child and reached a peak ranking of eighth in the world. At the time, she was also the youngest to ever become GM (breaking Fischer's earlier record) and the youngest to reach top 100. Looking at how few women play chess in general, the fact that she achieved this makes it unlikely that there should be some biological reasons that a woman shouldn't one day be able to reach no. 1.","score":18,"comments":[{"body":"This is your answer. Women are as good as men at every level of chess, but gettin to the top 50 in the world required dedication from a young age and opportunity to play. This has not been encouraged for young girls historically, so it’ll take a while longer. It’s already been shown that when it’s encouraged from an early age, you get women making it to the top 10,  beating world champions on a regular basis.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"gr8 b8 m8 8/8","score":12,"comments":[{"body":"I hate the internet sometimes","score":2,"comments":[]}]},{"body":"Two possible reasons: \n- There are less women learning chess at a young age. \n- As in other sports durability/stamina could be an advantage making the sport more suitable for men (This is just a possibility that comes to my mind and not a fact, I don’t mean any offence and would appreciate a scientific explanation)","score":2,"comments":[{"body":"A wgm i know says this is a big part of it \n\nWhen it comes down to the 9nth round of a tournament, she's more likely to suffer from the tiredness than a guy her age","score":1,"comments":[{"body":"This is nonsense, how does she know how tired another person is?","score":1,"comments":[]}]},{"body":"Actually, there is nothing to back up your 2nd hypothesis. Chessbase has a great article comparing the numbers, look it up","score":1,"comments":[]}]},{"body":"Because men and women are biologically different","score":-6,"comments":[]},{"body":"","score":0,"comments":[]}]}]}