{"name":"delusionalartists","description":"Bad art and worse artists","subscribers":517022,"posts":[{"title":"A little reminder of the rules","not_safe_for_work":false,"locked":true,"body":"Been seeing a few more people than usual posting their own work lately. Just a reminder that we do not allow your own work to be posted here, even if that cat you sculpted in 4th grade really does look like a penis. If you wish to post your own atrocious art abortions, please do so over at r/badart. If you’re selling something, r/artstore is the place for those posts.\n\nAlso, if you’re not quite sure if something you’ve found in the wild counts as delusional, please filter by the Mod’s Choice flair to see some great examples of things that do. We apply it to submissions that do a great job of fitting the bill of delusional art. Posts that are not delusional are the ones most often reported and removed here, would be super to whittle that down a bit.","score":410,"comments":[]},{"title":"We're reaching delusion levels never thought possible.","not_safe_for_work":false,"locked":false,"body":"","score":3471,"comments":[{"body":"feels like a joke or satire to me","score":1128,"comments":[{"body":"May be a reference to that author who was saying that the sentiment that good authors read a lot is ableist.","score":151,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"As an artist with executive dysfunction who really really wants to make art but very often can't it definitely felt like a joke about that sort of experience to me.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"me when going through the burnout phase again","score":240,"comments":[{"body":"Uggghh same here","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This sounds satirical","score":386,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Clearly satire.","score":33,"comments":[]},{"body":"I'm pretty sure this is a joke","score":303,"comments":[]},{"body":"She’s literally just making a joke","score":52,"comments":[]},{"body":"Redditors really loves intentionally not recognizing jokes so they can make ragebait.","score":40,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Wanted to buy this glass of water but I only had $3000.0100000000001","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[]},{"title":"Ugly box for sale","not_safe_for_work":false,"locked":false,"body":"","score":366,"comments":[{"body":"I’m going to make the obligatory annoying comment of I don’t think it’s over priced, if you take into account material and time. \n\nHowever, that’s one ugly dust collector for sale!","score":92,"comments":[{"body":"I could see a child maybe using it, there's countless tacky knick-knacks that I loved as a kid. I had the same thought about materials cost. To me, a delusional artist is someone doing beginner-level work but seeking a high end rate. This is beginner level work priced at a more-or-less beginner level rate, even if the piece itself is pretty bad.","score":26,"comments":[]},{"body":"Imagine getting dust off the glued-pebble topper? Not fun","score":3,"comments":[]},{"body":"You beat me to the punch, I also think this doesn't fit delusional. It's like people forgot the meaning of the word","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Wonder how long its been around, art is pretty neat but the stones could’ve probably been bigger","score":11,"comments":[{"body":"I thought so too, but looking a bit closer the art looks like paper cutouts to me","score":7,"comments":[{"body":"That is what decoupage is - a collage glued on to something. It was quite popular in the 90s.","score":8,"comments":[{"body":"Oh I see!! Thank you","score":4,"comments":[]}]}]}]},{"body":"It would look ok if the stones were put into a pattern of some kind.  Having that Egyptian theme already on there, it was hard to go wrong.","score":4,"comments":[]},{"body":"It's nicely done anyway...","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"45 dollars for shek","not_safe_for_work":false,"locked":false,"body":"","score":633,"comments":[{"body":"I’m just mad that they didn’t write “Merry Shrekmas”","score":89,"comments":[{"body":"Han Drawing too","score":14,"comments":[{"body":"Excuse me, it clearly says \"Hand Rawing.\"","score":9,"comments":[]}]}]},{"body":"You're lying if you wouldn't buy this","score":27,"comments":[{"body":"im genuinely thinking of buying it as a gag gift for my friend (the one who showed it and all the other drawings this lady did to me)","score":26,"comments":[{"body":"That is actually a pretty great idea.","score":11,"comments":[]},{"body":"Do it. You should also see if the artist will do a portrait of your friend as well.","score":10,"comments":[{"body":"LMFAO YES THANKS FOR THE IDEA","score":7,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Shrek was never that happy; did the artist even watch the movie??","score":15,"comments":[]},{"body":"Luckily, they put \"hand drawing\" there. Would've mistaken it for an original print.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"this instead is money laundering i guess, right? more than 80k usd lol... nft markets can be a never ending resource for this subreddit","not_safe_for_work":false,"locked":false,"body":"","score":292,"comments":[{"body":"The dumbest thing about nfts is that the ones who sell them don't even have to be the artists. I see a lot of artists who absolutely distance themselves from nfts but get their art stolen and sold anyways. It's nuts.","score":47,"comments":[]},{"body":"Careful. If somebody is stupid enough to buy the link to this image, they might ask you to take down your post.","score":16,"comments":[{"body":"they'd be right to ask, with all the money they spent for this right lol","score":3,"comments":[]}]},{"body":"Are they really delusional if people buy this shit?","score":5,"comments":[{"body":"I think the NFT ship has sailed already. Most of these prices are the creators making fake bids to pump their numbers up, that or using art sales as some tax right off scheme.\n\n There's something about art purchases and their donation to public venues that rich people us to get huge tax returns, transfering some of that stolen tax money to their artist friend, both making a killing at the expense of your average worker's tax dollars","score":8,"comments":[{"body":"yes thats what i think too, must be something to do with taxes and cleaning money, as even trying to pump their numbers wouldnt help with sales cuz nobody cares","score":2,"comments":[]}]}]},{"body":"i dont understand what is that? what are nfts?","score":1,"comments":[{"body":"You basically buy a link to an image so you can brag about owning it and hopefully sell it for more","score":3,"comments":[]},{"body":"good for you, its crappy stuff dont even bother googling it","score":2,"comments":[]}]}]},{"title":"$600 for a poorly done replica of a famous painting… yikes","not_safe_for_work":false,"locked":false,"body":"","score":661,"comments":[{"body":"These look remarkably similar to the end products of a “paint and sip” party.","score":274,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"And she's saying it's half off, so she was asking $1200 for it before?? It's not a bad replica but it PALES in comparison to the amount of detail and color in the original. The fact that she has such a huge canvas and didn't use that scale to add more detail is a shame. Definitely not worth $600, much less $1200. It looks more like a high school art assignment that you'd sell to a relative for like 100 bucks.","score":170,"comments":[{"body":"At this point, printing it at [full resolution](https://zoomviewer.toolforge.org/index.php?f=Van_Gogh_-_Starry_Night_-_Google_Art_Project.jpg&amp;flash=no) at your local print shop would look better.","score":39,"comments":[]},{"body":"Yeh the original is way smaller and that’s what makes it so powerful imho. So much energy packed into a fairly small canvas - it almost vibrates","score":18,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"two months???","score":34,"comments":[{"body":"Every day she only spent 3 minutes working on it 🤷‍♀️","score":40,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"These are the types of paintings that end up at Goodwill","score":22,"comments":[]},{"body":"Girl it's cute for like a hundred max but ain't no one hanging this anywhere lol","score":113,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oh wow. I recognize the garden she’s displaying it in and this has to be from the Art in the Garden event in Lincoln, NE. Delusional is the correct word here.","score":13,"comments":[]},{"body":"I mean... It's not a bad imitation, and it does look nice. But $600? Yeah, no.","score":30,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Insta post of a girl I know. She’s charging around forty dollars for that.","not_safe_for_work":false,"locked":false,"body":"","score":545,"comments":[{"body":"Lemme just negotiate against my self real quick…”asking $150 max but I’ll take $85”.","score":122,"comments":[{"body":"Maybe she’s playing 4d chess.  She knows it’s worth a lot less, only really expects to get $20, but if she says the lowest she’ll go is $85 then people might offer $85, and she can buy over 4 times the amount of drugs!","score":32,"comments":[{"body":"Big brain stuff right here","score":20,"comments":[]}]},{"body":"FYI the prices are not in dollars, if u were to convert the price to $ it would come to around $40 as mentioned in title. The minimum price she would take would be approx $23.","score":32,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"It took 2 hours because she was very careful to not color through the lines","score":37,"comments":[]},{"body":"she's not good.","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Looks bunk. Didn't even bother to dry them so weight is off, also I don't see any bruising, 80 to 150 is a little pricey for an 8th of shrooms imo","score":28,"comments":[]},{"body":"People who do acid or shrooms will get high and paint only one thing in one style every time. I’ve seen this before. The “starving artist” is most true with this kind of person as their drugs budget is too large.","score":50,"comments":[{"body":"Like when you’re trying to think of a word but your brain will only give you a different word over and over again, but you’re high and instead of frustration you think you’re amazing for having that thought over and over","score":12,"comments":[]},{"body":"I was that artist for a while, totally consumed a year out of my life. At least what I had going for me was the ability to recover and the fact that my art actually looked good","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Just looking for some Christmas gifts on Etsy…","not_safe_for_work":false,"locked":false,"body":"","score":73,"comments":[{"body":"Artist hovering the cursor over the box you check for rare items.\n\n\"Well, theres only one of it.....so\"\n\n*click*","score":6,"comments":[]},{"body":"Don’t love the background but actually don’t hate the face, it’s kinda unique","score":10,"comments":[{"body":"Yeah the artist has a clear style and I think it could be really good work if they practiced more… in its current state though, maybe not","score":5,"comments":[]}]},{"body":"Background looks like shit, but the actual drawing is pretty good. I’d say it a fair price if that background weren’t there.","score":2,"comments":[]},{"body":"I'd say it captures his eyes and inner desolation pretty well.","score":2,"comments":[]},{"body":"Not only is their shading absolute shit they obviously are just trying to make a quick buck, the way they made the logo backdrop screams inexperienced and their materials are subpar, most likely crayola or even cra-Z-art if they stooped that low. Their like art and facial work is ok though.","score":2,"comments":[]},{"body":"If you haven't already, look for Stranger Things fanart on Twitter. There's a ton of artists there and a bunch have commissions open on top of prints, keychains, pins, etc.  You have to do a bit more searching, but it usually yields better results than Etsy (plus you'll likely pay the artist an actual decent amount instead of the pittance they get from Etsy listings).","score":2,"comments":[]},{"body":"Looks good to me","score":1,"comments":[]}]},{"title":"Oh nooo…","not_safe_for_work":false,"locked":false,"body":"","score":54,"comments":[{"body":"I'm not interested but at least it's well priced for the work they put into it. I'm used to seeing these with more zeroes","score":2,"comments":[]},{"body":"It's a little creepy, but honestly not bad.","score":1,"comments":[{"body":"Price point isn’t outrageous, I’m more concerned that she said it was for a child’s or baby room because it’s a little haunting","score":1,"comments":[]}]},{"body":"That looks suspiciously like my sister. Now I might have to buy this for her.","score":1,"comments":[]}]},{"title":"fuck it let me show u what my abusive ex-boss thought was good pottery. he only did the left third of the first plate, if you couldn't tell. of course, the work in these pics sits on the shelf untouched by any customer.","not_safe_for_work":false,"locked":false,"body":"why yes their studio did violate every safety precaution that's standard to ceramics, how could you tell? the owners know so little about ceramics, I saw them tell multiple children wrong \"facts\" about the most basic things, like the stages of clay.","score":1236,"comments":[{"body":"Live. Laugh. Menstrual pad.","score":413,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I really love pinch pots. They're small, sweet, and simple. But $22 for a mini pinch pot? Is he out of his mind? Those take so little time and so little clay to make","score":127,"comments":[{"body":"Most people get a pinch pot from their kid's first clay art class.","score":63,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"agreed! I like them too, but it's just ridiculous. he's extremely full of himself lol","score":28,"comments":[]}]},{"body":"This is a rare delusionalartists and antiwork twofer. He would've been better off leaving the first one unfinished.","score":293,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Whinny the pooh out here looking like he just came","score":41,"comments":[{"body":"oh no I can't look at it the same now","score":15,"comments":[]}]},{"body":"Not enough commentary on the plate and saucer that literally look like they were drawn on an etchasketch. I would buy those and leave them plain to keep as ironic funny decor in my home","score":24,"comments":[]},{"body":"Those look great . . . If youre a freshman in high school in your first pottery class.","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"People like this must be in on the joke, no?","not_safe_for_work":false,"locked":false,"body":"","score":1072,"comments":[{"body":"Without reading what the product was i assumed it was a huge wax ball made from hundreds of candles that melted on top and i thought ok maybe i get the price , but then i realized its just halloweaster","score":92,"comments":[{"body":"Haha right? $1k for “art” that will rot in a month.","score":49,"comments":[{"body":"It's a statement on the fleeting nature of consumerism\n\n...or something idk I'm bad at symbolism.","score":24,"comments":[]},{"body":"If it were at least good, it might be worth it. Plenty of people spend hundreds of dollars on flowers for an event, and those will rot just as quickly. Or a professionally made fruit carving or fancy catering displays that no one's gonna actually eat. \n\nThe issue here isn't that some art is fleeting, but rather that this is shit.","score":7,"comments":[]}]}]},{"body":"I'm fairly certain it's a joke. \"I what I've got so come correct\" is basically a meme and I wouldn't be surprised if the person who posted it would fit right in as a user on this sub.","score":45,"comments":[{"body":"I think you accidentally a word.","score":19,"comments":[]}]},{"body":"Tbh the casual \"i know what ive got\" tells me its a joke.","score":18,"comments":[]},{"body":"They meant Pollock but regardless should have called it Van Ghost, and yes it sucks.","score":27,"comments":[]},{"body":"Jackson Bollock","score":8,"comments":[]},{"body":"Pumpkin fresh from a clown bukkake gathering","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I have no words","not_safe_for_work":false,"locked":false,"body":"","score":626,"comments":[{"body":"Lmao. Is that Styrofoam inside the snow globes for snow? Also those are totally cheap plastic rhinestones,  not actual crystal.","score":167,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I laughed so hard at the snow globe, the fact that the snow settles to the top, like it’s all so manifestly wrong that they couldn’t even get the gravity right…","score":138,"comments":[{"body":"It's styrofoam I think lmao and the Patriots snow globe got me.. it's written in fucking sharpie, I could do that myself","score":65,"comments":[{"body":"But why when you could pay $75 whole dollars for a custom job??? /s","score":26,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"high order volume\n\n&amp;#x200B;\n\nit's definitely not the order volume that's high","score":129,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"this is just sad xD I mean, the business idea is just fine.... the idea of customizing specific types of pieces of great\n\n&amp;#x200B;\n\nbut good grief, idk if I'm crazy but I can't find this person's artistic eye in these pieces at all. No clue who they're marketing to, lol","score":61,"comments":[{"body":"Found on my local nextdoor…so far no takers","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Surely that is Colombian pesos and not USD!!!!! jaysus that's some ridiculous prices for that crime!","score":28,"comments":[]},{"body":"I had a stroke looking at these. Thanks I hate it","score":21,"comments":[]},{"body":"They've actually managed to make something of negative value as they'd have to pay me to take any of this stuff, not to be mean but that is just straight up garbage","score":21,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"They captured the receding hairline well","not_safe_for_work":false,"locked":false,"body":"","score":628,"comments":[{"body":"It looks just like him lol","score":129,"comments":[]},{"body":"Well, I recognise him so that's at least something.","score":89,"comments":[{"body":"Right? Without reading the text, I recognized immediately who it was supposed to be.","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"The account gets deleted lol","score":46,"comments":[]},{"body":"Elon has one of those 'easy to draw faces'.","score":32,"comments":[{"body":"Flat and rectangular","score":16,"comments":[]}]},{"body":"I bet the shading on the upper lip took forever","score":12,"comments":[]},{"body":"I think it's purposefully bad, but also really fuckin funny. I'd buy it.","score":9,"comments":[]},{"body":"It's not absolutely terrible! Better than I can do! If it was on sale yeah it would belong here.","score":8,"comments":[]},{"body":"I give it an 8.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"May the chain be with you","not_safe_for_work":false,"locked":false,"body":"","score":892,"comments":[{"body":"I think they should rename it ***Danger; 5 minute craft***","score":75,"comments":[]},{"body":"why is the nail 3d, but the crown is not? And why is the nail bloody? Do chains bleed?","score":70,"comments":[{"body":"It's the nail that went through Jesus' hand (assumably), which would probably be bloody, going through a hand and all.","score":41,"comments":[{"body":"But only the tip of the nail was in his hand apparently","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"*Presumably? Assumingly? Or seemingly?","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Terrible drawing: -$90\n\nBad picture for advertising: -$5\n\nReligious art that’s not made by a artist who studied religious art: -$5 and my time. \n\nGive me my time back.","score":23,"comments":[]},{"body":"Pro tip: if you need to explain what your artwork is meant to be, you probably did it wrong","score":84,"comments":[]},{"body":"This angle looks like they took the picture sitting on the toilet","score":14,"comments":[]},{"body":"Could they have taken a worse picture of it, dya reckon?","score":9,"comments":[]},{"body":"Buttplug bondage?","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"found this wonderful piece in the wild on my road trip home","not_safe_for_work":false,"locked":false,"body":"","score":83,"comments":[{"body":"Is the artist actually delusional if they haven’t claimed their art is top notch. This is just amateur art","score":20,"comments":[]},{"body":"The shading on the flag is great though","score":13,"comments":[{"body":"Ikr? I was wondering how the flag was so competent but the Eagle looks like it just flew into a glass door","score":3,"comments":[]},{"body":"The scale is a little off. It looks super long.","score":1,"comments":[]}]},{"body":"You should probably leave, looks like 6th Street territory.","score":8,"comments":[]},{"body":"I like it","score":5,"comments":[]},{"body":"If only the artist could paint birds as well as they can paint flags.","score":5,"comments":[]},{"body":"Pretty decent, I'd rather see that than a generic tag","score":5,"comments":[]},{"body":"This isnt too bad","score":10,"comments":[]}]},{"title":"I think it was supposed to be “Jawn”?","not_safe_for_work":false,"locked":false,"body":"","score":82,"comments":[{"body":"I think this is super funny as it is an unintentional reference. I don't know if the slang in PA includes \"Jawn\" but in rural NM/AZ on the reservation it is synonymous with \"Glonnie\" which is another regionalism meaning \"town drunk\"","score":21,"comments":[{"body":"Interesting, around Philly/eastern seaboard area jawn means “thing” but I did not know that about NM/AZ","score":12,"comments":[{"body":"It's Navajo in origin","score":5,"comments":[]}]}]},{"body":"W looks like a molar","score":1,"comments":[]}]},{"title":"stunning lion king tattoo","not_safe_for_work":false,"locked":false,"body":"","score":2628,"comments":[{"body":"Oh Jesus christ please tell me it's not a tattoo and just Crayola.. please..","score":276,"comments":[{"body":"It’s not a tattoo, it’s just Crayola","score":164,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Their expressions look like they're looking at this shitty tattoo","score":164,"comments":[{"body":"The light grows... dimba","score":96,"comments":[]}]},{"body":"This is so bad I almost find it morbid. Like I genuinely feel terrible for the person who had this done to themself. I almost feel like it should be a crime for someone with this much lack of talent to even be able to give someone a tattoo.","score":231,"comments":[{"body":"It's looks like they tried to do it to themself, with how bad it is. Lol","score":56,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I wish we could see it in healed too! The owner of this masterpiece is probably too ashamed to ever show his back ever again, sadly.","score":68,"comments":[{"body":"I dunno...\n\nI don't have any tattoos as of yet, but having a girlfriend who loves them I see quite a lot of dogshit tattoos as she shows me her latest finds and the owners of them tend to love them whilst the tattoo \"\"\"\"\"artist\"\"\"\"\" also tends to have nothing but praise in reviews.\n\nI don't understand why exactly so many people are seemingly 100% happy with absolute shit tattoos.\n\nOne train of thought is maybe they're just in denial. They're permanent and not cheap. It's gotta be hard to admit you're not happy with something that's going to cost even more to correct or get rid of.\n\nAnother as somebody into the arts (drawing and music specifically), people who don't do \"the thing\" most often hugely overestimate how hard or impressive (I can't think if a better word) something is to do. As an exaggerated example, somebody might look at a picture of square and think \"remarkable, that must have taken infinate talent. I could never do that\" whereas as somebody who can draw, I know it just takes a ruler and basic measurement. They'll be over the moon about it, I'll be wondering why when it's not even a square, it's actually a parallelogram because the artist fucked up the measurements.\n\nThey might be happy with this dogshit tattoo because they're in denial alongside thinking the image is the most difficult thing in the world and that it would cost thousands to get somebody capable of replicating the artstyle properly.","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Simba trying to wake up Mufasa who just did crack.","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Both of them look they share the expression of \"How the fuck did we get here\".","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"$12.5k for art I could have made in kindergarten","not_safe_for_work":false,"locked":false,"body":"","score":79,"comments":[{"body":"This is Katherine Bernhardts work, the scale and process of her work is what’s important!! She’s awesome, don’t just judge her based off of this print!","score":5,"comments":[{"body":"...but all her stuff looks like this?","score":5,"comments":[{"body":"Ive seen a few of her paintings and im judging.","score":4,"comments":[{"body":"Just looked her up and a majority of the paintings was a three year olds work, saw 2 that looked okay but they didn’t seem like at all the same style","score":2,"comments":[{"body":"I feel like these quotes sum up the kind of deep thoughts going into her work. /s\n\nhttps://www.culturedmag.com/article/2020/01/16/katherine-bernhardt\n\nYes, obviously your paintings are full of scattered objects and things. What's your relationship to materiality and thing-ness?\n\"I mean, I love things. I love things from the ’80's. I love design.\"\n\nAnd is there a significance when the Xanax pills and the E.T. merge in certain paintings?\n\"Kind of—well, not really. They're pretty separate. It's my whole thing with the pattern paintings: putting things together that have nothing to do with each other.\"","score":0,"comments":[]}]}]}]},{"body":"Your delusional. This fucking blows","score":5,"comments":[]},{"body":"You are the reason shitty artists get this much money","score":1,"comments":[]}]},{"body":"I swear some people are just trolling rich folks","score":5,"comments":[]},{"body":"I'm pretty sure I made that in kindergarten.","score":3,"comments":[]}]},{"title":"A few paint blobs priced more than AAA games.","not_safe_for_work":false,"locked":false,"body":"","score":82,"comments":[{"body":"I like how the one is $699 implying the artist felt it took 10 times the effort as the $69 one lmao","score":9,"comments":[]},{"body":"There will absolutely be some troll or someone who knows fuck all about art claiming these are pretty good and worth the price.","score":20,"comments":[{"body":"69 dollars ( ͡° ͜ʖ ͡°) is pretty normal for an a4 handmade painting.\n\nDepending on the size of the canvas 700 could also make sense for the kind of unoriginal work that gets hung in cafes to cover ugly walls.\n\nThe prices aren't delusional. Whether they're worth it or not is subjective.","score":15,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"A small price to pay for juicy swoosh","score":6,"comments":[]},{"body":"I actually like the bottom left but I wouldn’t pay $20 for it","score":3,"comments":[]},{"body":"I mean, prices are a bit overblown, but it takes real skill to emulate smears of paint like that. They look like real \"paint blobs\", and not just flat drawings.","score":5,"comments":[{"body":"I’m pretty sure they are real pain blobs…","score":14,"comments":[{"body":"Yeah but I wonder how they keep it from mixing any more than necessary. Just enough to create the gradient. I’d be interested to see how they make these.","score":4,"comments":[{"body":"its modeled and then spray painted","score":10,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Hence it says “textured” in the titles","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Some tattoos a friend got from the \"best\" tattoo place in the area","not_safe_for_work":false,"locked":false,"body":"","score":156,"comments":[{"body":"That shoulder and neck area…. Good gravy","score":21,"comments":[{"body":"Thanks, it's just brown and water.","score":12,"comments":[]}]},{"body":"My question is did your friend get them done all at once or did they keep going back hoping for improvement out of brand loyalty? Because after the first i would have shut that shit down.","score":22,"comments":[{"body":"He got them one at a time, shockingly, so he had time to look at these turds and think \"yea, I want another monstrosity\". He has more shit tattoos, I just can't get a decent picture without asking (which makes it obvious I'm mocking him somehow) but rest assured his body is like a gallery of absolute dogshit tattoos. He doesn't have a single one that isn't objectively  total shit.\n\nThese are from a while ago and they sprang to mind when I saw another post, but he still very much thinks they're really good. I personally would skip a cover up or laser removal and go straight to removing the limb. I have the highly deformed Tifa tattoo always nearby because its funny as well as a reminder to show people they should properly research where they get tattoos from (being that its a local example of a high rated place).\n\nThe tattooist who did them also seemed very proud as he did the usual social media rounds posting it and got very angry when I called them shit, as did the many followers who presumably also got shit tattoos from him and apparently have severe visual impairments. They all told me there's a reason he's the best but I'm yet to be told what that reason is...I'm also banned from the shop. Never been in but been told my custom isn't welcome. Oh no, I guess.","score":31,"comments":[{"body":"I think we're witnessing the effects of mass hallucinations or something. On the bright side, this has inspired me to finish my book and those drawings I've been too scared to complete. If this guy has people who like his stuff then imma go for gold and have a trash human following of my own! Peace out, gonna go make shitty content, brb.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"It’s a vocational training program for the visually impaired.","score":16,"comments":[]},{"body":"Okay, I haven't tattooed anyone before, but I'm a decent illustrator. This is garbage art.\n\nI know for a fact not all tattoo artists can draw amazing stuff, many just know how to use the eqiupment and trace over the stencil.\n\nI'd say this dude needs some stencils, but even his freehand lines look shaky and blurry.\n\nSome of these feel like the cringe doodles a friend of mine used to let me \"tattoo\" on him with a ballpoint pen at the start of highschool.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"i would hate to see the worst in your area","score":10,"comments":[]},{"body":"Was the place prison?","score":6,"comments":[]},{"body":"The original game still looks better than this","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"honestly not bad, but $80 for that? ☠️","not_safe_for_work":false,"locked":false,"body":"","score":76,"comments":[{"body":"I thought the hoodie's front pocket was supposed to be her mid-drift there for awhile.","score":22,"comments":[]},{"body":"Damn I need to start charging more","score":11,"comments":[]},{"body":"Looks like they started with the left eye and then got impatient to make money so they forgot to actually art","score":9,"comments":[{"body":"It took me like 3 hours to do the shading on your upper lip.","score":3,"comments":[]}]},{"body":"Ermmm I’d say pretty bad","score":24,"comments":[]},{"body":"Love that they sat the energy drink on the paper, too.  Don’t mind the drink ring!  It’s just art.","score":5,"comments":[]},{"body":"Honestly bad","score":4,"comments":[]},{"body":"Idk $80 for full upper body realism doesn't seem that bad. Idk what's going on with all the names and the drink on the paper feels mad disrespectful so maybe 65-70 if that's how they're gonna be treating a commission but art take awhile man","score":-10,"comments":[{"body":"I wouldn't exactly call that realism. Not as like, because it's not great, but just in general, it's not really realism. All facial features are defined by hard lines rather than being rendered out. The closest attempt at realism I see is maybe the attempt at the hair? But even that just looks achieved by nonsensical squiggles.","score":24,"comments":[]},{"body":"Is this you? Lol","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"title":"I just found this subreddit… dunno if this has been posted yet","not_safe_for_work":false,"locked":false,"body":"","score":1036,"comments":[{"body":"Lonk","score":73,"comments":[{"body":"Hopefully he rescue Zorldo.","score":18,"comments":[]}]},{"body":"POV: you are a moblin trying to attack link while he takes a shit behind a bush","score":52,"comments":[]},{"body":"It looks like a repurposed The Hunchback of Notre Dame figure!","score":132,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Honestly, I kind of like it with the weird-ass pose.\n\nNot $200 like it, mind you.","score":75,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Legend of Zelda: Battle for Chernobyl","score":17,"comments":[]},{"body":"Quasizeldo","score":17,"comments":[]},{"body":"Hunchback of Hyrule","score":10,"comments":[]},{"body":"Link throwing it back for the shopkeep","score":7,"comments":[]},{"body":"more like footmade","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"£8,200. The artist better be a five year old with a heartwarming backstory","not_safe_for_work":false,"locked":false,"body":"","score":751,"comments":[{"body":"She's a known artist and all of her stuff kinda looks like this. \n\nI honestly don't see the appeal.","score":129,"comments":[{"body":"This sort of work is why I'm detached from the contemporary art scene because of how bullshitty it is and unjust and exploitative.\n\nIt's likely her stuff will be forgotten in time, if she's basically doing commercial unlicensed fan art.","score":38,"comments":[{"body":"Stuff like this makes me want to figure out how to get into the scene. You’re telling me I just have to convince people something that took little to no effort is art and I can make thousands off of like an hour of work? Most of that time being getting the supplies? Sign me up.","score":14,"comments":[{"body":"People skills help. Having connections help. Having financial security or immune to nihilism helps. Throw in luck too.\n\nIt's very hard to be professional artist since the capitalist world is hostile to the creative process. So bullshitting or lucking helps a lot.","score":13,"comments":[]}]}]},{"body":"How do you get known for something like this?","score":37,"comments":[{"body":"Connections, connections, connections","score":30,"comments":[]},{"body":"Luck. Connections. Money safety net.","score":14,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Nah that’s Chris Chans jail art XD","score":24,"comments":[]},{"body":"They better have taken over 400 hours to paint.","score":6,"comments":[{"body":"If you look up her art, they are enormous. This is likely mural size.","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"How do I start a conversation with this artist about the ethics of this sort of thing?","not_safe_for_work":false,"locked":false,"body":"","score":618,"comments":[{"body":"Reverse image search his source photos and send them to him anonymously.","score":566,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You don’t.  You let them fail.  They’ll impress their family and a few friends but probably end up selling nothing.","score":322,"comments":[]},{"body":"This might earn them a kiosk in the mall for the holidays , but it isnt worth your time to discuss the ethics of it. Like what do you think would be achieved by doing so. Some profound enlightenment, and the clouds part,  and this evilness is evaporated out of them? They know damn well what they are doing. If it pays, it pays. That's what they are seeing.","score":618,"comments":[{"body":"&gt;Like what do you think would be achieved by doing so.\n\nFirst I'll say \"Let's discuss the ethics of this.\" And then they'll be like \"I'm a fraud! Nobody else noticed except you, the smartest person in the world!\" And then they'll sob and the president will step out and say \"I sentence you to death!\" and then they'll get taken away. And then everyone will clap and the president will shake my hand and say \"Congratulations OP, you're the president now.\" And then in my first act as president I'll declare peace on earth and that cancer is cure and everyone in the world clapped and the president gave me $100","score":267,"comments":[{"body":"Wait, the old president gave you $100, or did you give yourself the $100?","score":59,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I’ve talked to a guy about this shit and he was very pissed off at me.","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Congratulations! We want to feature your art in our show, you keep 100% of the sales… after the $500 entry deposit clears of course.","score":165,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"OK so... what am I not getting here?\n\nAre they selling photos of paintings?","score":20,"comments":[{"body":"They're stock photos with filters","score":20,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"What's the issue? A description would be nice.","score":268,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"You are also paying per letter of explanation.","not_safe_for_work":false,"locked":false,"body":"","score":580,"comments":[{"body":"That shit is UNREADABLE. But what also bothers me is that every letter is uppercase except the Ls. Did they use an I stencil by accident??","score":255,"comments":[{"body":"&gt;Did they use an I stencil by accident??\n\nI think they planned the spacing poorly and swapped the characters to make things fit. They probably cut before actually measuring the width of the stenciled lettering. Notice that \"Stay Spooky\" is more-or-less correctly centered but the placement of the top text makes no sense.\n\nEven by subreddit standards, this is just an appalling piece. The wood would be worth more if they'd left it alone. I can't get over how poor the charred effect is. Was this their first try? I've literally seen boy scouts do better work. This would be right at home on r/CrackheadCraigslist too.","score":103,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It sold for $300, according to seller.","score":56,"comments":[{"body":"Buyer was their mom.","score":54,"comments":[{"body":"I think it was a family member / friend.","score":21,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"\"YOU CAN'T EVEN IMAGINE WHAT I'M CAPABLE OF! I'M LIKE A GOD IN HUMAN CLOTHING! THUNDERBOLTS SHOOT FROM MY FINGERTIPS!\"","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Haiioween","score":33,"comments":[]},{"body":"This is truly the essence of this subreddit. Great post.","score":30,"comments":[]},{"body":"You can tell it's art because the creator is explaining the price in the first sentence of the description.","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I started reading and thought, \"$500 for a custom sign? That doesn't sound too bad, depending on size and materials. They have a good point about supporting real people in your local community. People in this sub seem to think that someone's labour should only be worth like $3.00 an hour.\"\n\nThen I saw the sign. It's unreadable!!! Yikes.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Brug","not_safe_for_work":false,"locked":false,"body":"","score":365,"comments":[{"body":"Brug","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I always wonder if any of these ever sell. Like, I’d be tempted to pump out like 500 in a week to just float them out there. If even like 10% sold that’d be pushing $10k lol.","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"...is that a guy with his pants down and a very small member on display?","score":23,"comments":[{"body":"*average to shockingly large","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This is actually pretty decent abstract work, despite it being simple. €170 is probably a bit steep if it’s not framed, but not that extreme compared to the going rate of original art. I wouldn’t call this delusional","score":113,"comments":[{"body":"Yeah, tbh kinda like the color combination.","score":17,"comments":[]},{"body":"Yeah this subreddit has a weird grudge against abstract art. It not anything amazing but $100-200 for a painting from a small artist, even if it’s mid, is fairly standard. I wouldn’t buy this painting, but I think this is hardly proof of them being ‘delusional’","score":11,"comments":[]},{"body":"Nice try, Jane Pryor","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I thought this was a wooden hanging sculpture and was going to say 170 isn’t bad at all, but a paper collage I’m gonna say nahhhhh. The color choices, layering, and texture are great though.","score":7,"comments":[]},{"body":"I like it. Maybe I’ll buy it.","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Looks like it’s made from chair crumbs","not_safe_for_work":false,"locked":false,"body":"","score":903,"comments":[{"body":"I fucking love that you said \"chair crumbs\" and I knew exactly what you meant.","score":116,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This looks like a kid made it in arts and crafts","score":46,"comments":[{"body":"I love that they felt the need to clarify that it is hand made.","score":27,"comments":[{"body":"You mean you don't have a machine cranking those out by the hundreds? Amazing","score":13,"comments":[]}]}]},{"body":"I thought it was a rice crispy treat concoction","score":30,"comments":[]},{"body":"They really just dipped that stand in some modge podge and then dropped it in the crack of the couch 😂😂😂","score":11,"comments":[]},{"body":"genuinely what the fuck were they going for","score":41,"comments":[{"body":"Ikr, I thought it was a failed gingerbread house at first","score":32,"comments":[]},{"body":"Elmer Glue and cereal.","score":18,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Manassas. Yup. That tracks.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"$600 for a bowl of jellybeans","not_safe_for_work":false,"locked":false,"body":"","score":190,"comments":[{"body":"Mmm, hundreds of dollars of stale jellybeans. Bonus if some lint &amp; various debris or even a bit of humidity is mixed in!","score":55,"comments":[]},{"body":"Do you want ants? Because that's how you get ants.","score":40,"comments":[]},{"body":"I didn't know my snacking habits were really deep and meaningful pieces of art.","score":17,"comments":[]},{"body":"Are they selling jelly beans or roasting their husband?","score":10,"comments":[]},{"body":"So its a jellybean bowl that represents... a jellybean bowl?","score":10,"comments":[]},{"body":"Love the text lol. However I can only think of how rotten the beans will be after a while","score":6,"comments":[]},{"body":"If the entire bowl was filled to the brim, then all poured and set with crystal clear resin. And inset perfectly into a coffee table as an inset centre piece. This would be a thing.","score":8,"comments":[]},{"body":"So… the bowl is big &amp; fat like her husband…? Probably not how I would sell stuff, but I do not have a 300lb bowl of jelly beans to sell so…","score":19,"comments":[]},{"body":"seller should put a board in for filler then just put the jbs' on top and shellack or epoxy them.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Joker chair","not_safe_for_work":false,"locked":false,"body":"","score":494,"comments":[{"body":"Oh....I need to start dragging stuff out of alleyways...I'll be able to retire early.","score":53,"comments":[]},{"body":"“Definitely NOT just taken out of a crack house and put up for sale”","score":47,"comments":[{"body":"r/crackheadcraigslist","score":12,"comments":[]}]},{"body":"Where can I find such a thron?","score":14,"comments":[{"body":"I think disney got it last time i checked","score":7,"comments":[]}]},{"body":"I'd watch a YouTube video of someone buying it, fully restoring it, and selling it for a profit.\n\nYes I would. yes I would.","score":13,"comments":[]},{"body":"Sometimes you need a conversation starter for the formal living room.","score":8,"comments":[]},{"body":"suicide squad 2016 joker","score":6,"comments":[]},{"body":"its almost good lol","score":16,"comments":[]},{"body":"$100 for a high back wing chair is tagged as HIGH PRICE? The fuck.","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I think I'll pass","not_safe_for_work":false,"locked":false,"body":"","score":79,"comments":[{"body":"This will happen video game\n\nYou just got a weird Mushroom!\nDescription: Taste and looks weird, but you will consume it anyway because of how helpful it is!","score":3,"comments":[]},{"body":"$80 for glitter on some ripped up foam? My 7 year old can, and does, do that.","score":2,"comments":[]},{"body":"Looks like a bad date.","score":2,"comments":[]},{"body":"would be slightly less egregious if it were more 3d and not just flat","score":2,"comments":[]},{"body":"Awww, the artists made a decorative foam nuke. I've got better art in my cutlery draw.","score":2,"comments":[]}]},{"title":"$300 is fair when it’s an original American Girl doll AND the artist’s other stuff sold in days right?","not_safe_for_work":false,"locked":false,"body":"","score":54,"comments":[{"body":"They couldn’t even brush her hair?","score":9,"comments":[]},{"body":"Tbh, I believe that someone will buy this.","score":5,"comments":[]},{"body":"This is terrifying","score":2,"comments":[]}]},{"title":"Carpentry is an art that not all are good at","not_safe_for_work":false,"locked":false,"body":"","score":1025,"comments":[{"body":"Can't wait to put a mug down in the wrong spot and dump coffee all over the carpet!","score":159,"comments":[{"body":"I mean this is ugly but if you wanted to make it so that it wouldn’t be a spill hazard it seems like you could fill in those lower areas with resin. It would still keep the overall ….I don’t fucking know rustic look, that they’re going for and then also be more usable.","score":54,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I’d love to know the creative process","score":64,"comments":[{"body":"Apparently lumber scraps they found layered on to plywood","score":59,"comments":[{"body":"So it was a proper plywood table and they ruined it, that's even worse","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I'd say about 12, maybe 16 beers and some wood.","score":30,"comments":[{"body":"That’s just a run of the mill project if you ask me. I think this is at least a 20 beer job.","score":8,"comments":[]}]}]},{"body":"It's the MDF later that the planks are glued onto that does it for me.","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"50$ is actually not a bad price to buy that thing and break it down for parts. Those legs alone are worth around $25, and those top boards are really nice.","score":35,"comments":[{"body":"Yeah it’s a shame those boards were used for…this","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Roughly £35 for crayon based BATIM fanart…","not_safe_for_work":false,"locked":false,"body":"","score":303,"comments":[{"body":"This is bad art, not a high price. £35 is cheap as fuck, and they aren't even asking that, they're asking £10.","score":17,"comments":[{"body":"£35 is cheap for that ?? What ?? I mean I’m no art connoisseur but how is that cheap?? Especially since my country is in financial crisis, our new prime minister has managed to crash our the entire economy within a week of being prime minister, and our old prime minister thinks an apple and half a loaf of bread is going to help a child eat a fulfilling lunch for a week","score":-2,"comments":[{"body":"It's cheap for *any* art. If you don't think so, just go try to have a commission done. Even from a truly shitty DeviantArt artist, it'll cost you well over that, especially if you want the original rather than a print.","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"It’s only 35 bc of your location lmao. Also this is marker. Idk, it’s obviously just a clueless kid.","score":46,"comments":[{"body":"I agree, when I was a young artist I would try and sell my art too, lol. Surprisingly I actually sold some!","score":14,"comments":[{"body":"They’ve got two sales already. I feel like it’s just family tying to make them happy lmao.","score":8,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I'd buy it and commission more. We have to encourage the kids, art must live on.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This doesn’t even belong here","score":6,"comments":[]},{"body":"I dunno, it’s kinda cute to me...","score":4,"comments":[]},{"body":"Vagina mouth ? Really unsettling","score":2,"comments":[]}]},{"title":"Found this in the wild.","not_safe_for_work":false,"locked":false,"body":"","score":585,"comments":[{"body":"Dude looks like he had a Bong Hit Transplant","score":72,"comments":[{"body":"America has truly been made innate again","score":17,"comments":[{"body":"Have you been drinking paint?","score":5,"comments":[]}]}]},{"body":"Sissy Spacek lookin gooooood lol","score":16,"comments":[]},{"body":"Should’ve added a yeah \n‘Maryland,\nbut Uhhhhh’","score":15,"comments":[]},{"body":"Shutting down the original /r/cumtown will go down as a greater tragedy than the burning of the library of Alexandria","score":11,"comments":[]},{"body":"Wait until I tell my best friends Nick and Adam about this, we talk every day and I knew them before you did.","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Lmao.. this is absolutely amazing","score":5,"comments":[]},{"body":"Kinda homophobic to disrespect Adam’s art like this tbh","score":18,"comments":[]},{"body":"Hey, Cumwizard69420 is a legend and has been featured in NYC galleries","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Artist’s website lists it as sold for £400k… but works priced at 1.25% of that amount remain unsold","not_safe_for_work":false,"locked":false,"body":"","score":446,"comments":[{"body":"you never know about what happens during the checkout process! just found out about one artist i follow - he has paintings listed for $$$$$$$$ and he sends his “fans” discount codes for 99% off. \n\ni bought $20k worth of artwork for less than $200. \n\non his website it shows the $7k+ paintings that are SOLD!","score":28,"comments":[{"body":"Genius!","score":7,"comments":[]}]},{"body":"The incessant use of dollar signs really sells it for me.","score":13,"comments":[]},{"body":"Oh that makes me want to cry. I cannot sell my beadwork at all, not even for $50 but this sells? I am crying","score":74,"comments":[{"body":"Please don’t let this discourage you! If you check out [the artist’s website](https://www.dollarsandart.com/collections/intergalactics-collection-originals-2014) it will quickly become apparent that this is likely a case of money laundering, someone exploiting connections or people buying favour (or maybe just a typo? But the rest of their portfolio and push for NFTs suggests the former).\n\nYou are no-doubt talented in your own right and I’m sure the art of creation brings you so much joy. Don’t let the pursuit of wealth take that joy away from you!\n\nMaking money in art (legitimately) is never easy, sadly, but can be had with perseverance, a willingness to improve, the right networking/promotion and (annoyingly) a whole lot of luck. Keep at it, expect nothing, make what you like and are proud of, and just maybe the stars will align one day.","score":81,"comments":[]},{"body":"After a quick glance at this dude's bio, it has to be one of two things.  \n\nHe either put a ridiculously high price tag on it and pretended like it sold in a desperate attempt to increase the value of his other work.  Basically he sold it to himself.  Or, based on his background of managing construction companies in Dubai or whatever, he got caught breaking the law and can't continue to work at his other job, so he's pretending to paint in order to launder his money that he embezzled.\n\nOr could be both?","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"View the full series here: https://www.dollarsandart.com/collections/intergalactics-collection-originals-2014","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"the more you look at it the less art it is and more just random stuff glued to a canvas","score":49,"comments":[{"body":"Saw the series ([which is all along the same lines](https://www.dollarsandart.com/collections/intergalactics-collection-originals-2014)) in some vlogger’s tour of the QE2 hotel in Dubai. Their entire commentary was along the lines of ‘oh cool, an old Atari… an old Polaroid camera… it’s Star Wars…’\n\nSurely this one’s either money laundering, an attempt to elevate his profile through a fake deal or the result of a r/delusionalbuyer","score":18,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"But it’s stated $OLD?! 😂","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"$1,000 for a customized breyer horse - she got mods to turn off comments after people said her price is unrealistic","not_safe_for_work":false,"locked":false,"body":"","score":806,"comments":[{"body":"There are absolutely breyers that can command a price tag over a grand, but this is not one of them.","score":155,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I am a part of the model horse hobby, it's actually my full time job to sculpt and sell model horses. Some CAN and DO sell for upwards of $1000, depending on rarity and artistry. Google \"Breyerfest 2022 auction prices\" if you want to shit yourselves.  However, this person is delusional lol. This custom is worth maybe $40. (And that's the price for the blank sculpture ready to be repainted basically.) There's no artistry or skill to the work. This is a beginner highly over valuing their work.","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Okay full disclosure I did not know what a Breyer horse was and I thought it was a full-size painted statue at first, in which case if anything $1,000 would be cheap…but a MINIATURE TOY?!\n\n(Yes I only read the title of the post at first… the $15 shipping would have tipped me off 😂)","score":122,"comments":[{"body":"Some Breyers are 12”collectibles, highly detailed off the shelf. I’ve seen one artist customize them  for her clients to look like their real life animals, with made from scratch leather tack. She charged quite a bit for commissions. This is not that.","score":89,"comments":[{"body":"My mom has a few still in box, and at least one signed by the horse it was based on's trainer or owner or both.","score":22,"comments":[{"body":"I prefer to get mine signed by the horse","score":46,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"If Blanca from Street Fighter was a horse.","score":48,"comments":[{"body":"That's electric...","score":13,"comments":[{"body":"Boogie-oogie-oogie","score":9,"comments":[]}]}]},{"body":"never thought i’d see my niche hobby hit a sub like this! she is absolutely delusion. some model artists work is absolutely worth $1k, but she is VERY amateur.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The price doesn't even include shipping","not_safe_for_work":false,"locked":false,"body":"","score":1023,"comments":[{"body":"W..whats the shipping price?","score":135,"comments":[{"body":"About 300€ domestically...","score":115,"comments":[{"body":"OH HELL NAW","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"I love the classic \"hands behind the back\" pose to hide that the artist can't draw hands","score":129,"comments":[{"body":"As an artist the biggest tells of inexperience for me are:\n\n1. Hidden hands: hands are extremely hard even the AI machines that can outperform masters can’t get them right. \n\n2. Cyclops: making two identical eyes is hard. Something a bit easier is one good eye and an eyepatch or long bangs \n\n3. Spaghetti helmet hair: no elaboration \n\n4. Must show everything: ironically it’s hard to know when you shouldn’t draw something. Contorted characters who are showing both arms and legs and all 10 fingers to the camera aren’t found in real life but are very common for drawings","score":53,"comments":[]}]},{"body":"\"the witch fo the jews\" ? \"inspired by a dream\" , for \"people who want to know more\" ??\n\nby \"outside of normality\" I assume they mean conspiracy theorist (*at best*)","score":172,"comments":[{"body":"Oh 100%. This reeks of antisemitic dog whistles.","score":41,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I want this level of confidence","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Just cause they put paint on a canvas doesn't mean they're an artist","score":111,"comments":[{"body":"I don't think it's even on canvas, it looks like paper to me","score":76,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"If this is a pig, I’m prince charles","not_safe_for_work":false,"locked":false,"body":"","score":816,"comments":[{"body":"[It's supposed to be this.](https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Arkansas_Razorbacks_logo.svg/1200px-Arkansas_Razorbacks_logo.svg.png)\n\n\n\n\nSo just squint until they're the same.","score":78,"comments":[{"body":"And squinting at OP also helps to make them look like Charles so the claim is full circle!","score":22,"comments":[]},{"body":"It’s definitely more resemblant of the vintage razorback logo from the late 60’s","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"King Charles.","score":45,"comments":[]},{"body":"Arkansas razorback logo. Not super, but immediately recognizable, Your Majesty.","score":101,"comments":[{"body":"I immediately recognized the poor rendition of Tusk. I have one in my office that I painted myself.","score":19,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Woo Pie.","score":16,"comments":[]},{"body":"I'm getting more burnt Thanksgiving turkey","score":10,"comments":[]},{"body":"I see a pig. But not what other posters say. The left side looks like a face. Two darker black spots are his nostrils. Then one flappy ear and the black line on the left is a second ear. Looks like he is foraging.","score":7,"comments":[]},{"body":"Woo I love it, that hideous pig","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Seashell Jordans","not_safe_for_work":false,"locked":false,"body":"","score":1022,"comments":[{"body":"Pot was def involved.","score":68,"comments":[{"body":"You could put your weed in there!","score":6,"comments":[]}]},{"body":"*Shore*-dans","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I would like it more if the laces weren't made of baloney.","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Why would anyone think this is a great look? He sells sea shell shoes, sheesh!","score":50,"comments":[]},{"body":"Bootstrap Bill wants to know the location","score":12,"comments":[]},{"body":"That is definitely an interesting piece of art. You absolutely couldn't wear that or the second the shoe bent it would all come apart...","score":36,"comments":[{"body":"It’s a pot.","score":14,"comments":[{"body":"Oh shit I thought they were just so unhinged they put the word pot on at the end for eldritch reasons","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"The laces are making me irrationally upset. It's not even LACED, just glued on.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I mean, I still kinda want it","not_safe_for_work":false,"locked":false,"body":"","score":1920,"comments":[{"body":"Jack Black as the Tenacious J.C.","score":191,"comments":[{"body":"This is not the best painting in the world, this is just a tribute","score":83,"comments":[{"body":"Came here for this comment. Would have been terribly disappointed if it wasn’t here","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Switch place on the comma and the period and we can begin the bargaining.","score":40,"comments":[{"body":"Ya no lie, I might pay $50 for this without feeling too bad about it haha","score":31,"comments":[]}]},{"body":"Actually good art, but that price...","score":146,"comments":[{"body":"that's the *valuation*. talk to the artist, give them 100 dollars, donate the artwork to your local museum, tell the tax man it was valued at 50k, profit.\n\nI mean, they're not going to let *you or me* get away with this lmao, they'd clearly smell that this is fraud, but be a millionaire and find a name brand artist who has been doing this sort of thing with millionaires for years, and you'll be golden.","score":68,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"So, this proves Jesus is Black?","score":18,"comments":[]},{"body":"He looks like Manson but slightly less rational.","score":11,"comments":[]},{"body":"It's not $50k good, but it's still pretty damn good","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"It will be yours for only $50","not_safe_for_work":false,"locked":false,"body":"","score":62,"comments":[{"body":"[deleted]","score":5,"comments":[{"body":"[deleted]","score":1,"comments":[{"body":"Yeah its not bad and the price is reasonable","score":1,"comments":[]}]}]},{"body":"Wait, isn’t this by some outsider artist who only did portraits, and then at a certain point made the same portrait every day for like, years? Or something like that? I think I saw a YouTube video on it...","score":1,"comments":[{"body":"Probably not","score":1,"comments":[]}]},{"body":"Dang, Plank grew up to be a stunner.","score":1,"comments":[]},{"body":"E.T. Home Phone","score":1,"comments":[]}]},{"title":"Top notch car aerography (Pirates of the Caribbean). Would you request refund if it was your car?","not_safe_for_work":false,"locked":false,"body":"","score":1513,"comments":[{"body":"The yassification of Jack Sparrow","score":427,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"These look like the actors that would be in the porn remake","score":106,"comments":[{"body":"I was thinking jack spearow with a heavy Snapchat filter","score":18,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Why does this look like the art on the side of a traveling carnival’s funhouse?","score":282,"comments":[{"body":"Big brand characters they definitely don't have the rights to, blurrily airbrushed with an inexpert hand and little attention to proportions?","score":108,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"They might not be able to copy people's faces but they draw better than most people in this sub","score":150,"comments":[{"body":"The shading is kind if alright, good even in places.\n\nIt's just, yano, &lt;gestures at everything else&gt;.","score":55,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Johnny Derp","score":21,"comments":[]},{"body":"No, I'd take it a a lesson not to be a fucking idiot in the first place!\n\nMoney well spent!","score":62,"comments":[]},{"body":"OK but why is Princess Fiona in there?","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Didn't know pen doodles on engineering papers are worth that much","not_safe_for_work":false,"locked":false,"body":"","score":515,"comments":[{"body":"Wtf this is an ad for drugs. Even if you for a second thought otherwise, there’s quotes around drawing.","score":140,"comments":[{"body":"It says \"Drawing comes with characters in drawing\". Pretty obvious imo","score":75,"comments":[{"body":"Last laugh is on the seller when the buyer opens up the box and instead of shrooms gets one big dildo and two smaller ones.","score":15,"comments":[]}]}]},{"body":"It's a drug ad hahahah","score":34,"comments":[]},{"body":"They’re selling penis envy mushrooms you nonce","score":8,"comments":[]},{"body":"oh lord there’s penice","score":16,"comments":[]},{"body":"Questionably placed quotation marks","score":5,"comments":[{"body":"No I think they placed them exactly where they wanted them to be this is drugs.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'm just annoyed that the left quotation marks are quotes and the right ones are two accents","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"$2500 deal for the enterprise","not_safe_for_work":false,"locked":false,"body":"","score":560,"comments":[{"body":"These are the voyages of the starship... colander.","score":53,"comments":[{"body":"For real, it looks like a painting of an alternative pots and pans sculpture of the Enterprise.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"That's not the Enterprise. That's the NCC-07, and it's a _perfect_ rendering.","score":21,"comments":[]},{"body":"Jean Luc Picasso","score":22,"comments":[]},{"body":"As I saw the post looking out of the context, this seemed very absurd. But I read the article\n\nhttps://www.newhavenarts.org/arts-paper/articles/sylvia-yanez-keeps-breathing-with-downtown-art-show\n\nHer pieces are usually abstract art and she did this for her uncle.\n\nI’m pretty anal when it come to art, kinda always believe “fundamentals, anatomies, techniques first” \nHowever, if she has good clientele with fair amount of interest in her story and her art, the value can be very subjective and I can’t really shit on it.","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It's...crumpled. Ran into something for sure.","score":4,"comments":[]},{"body":"I can't sell a commission for fifty, but this goes for 2.5K? Idk if I should be impressed that people can get away with that, or if I should just be jealous","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They didn't even add enough paint to cover the whole canvas.","score":3,"comments":[]},{"body":"Not even a whole Enterprise, its 2,5K for just a slice!","score":3,"comments":[]},{"body":"The saucer section looks really wacky","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The Five Faces of Michael Jackson. A steal on FB Marketplace at only $200.","not_safe_for_work":false,"locked":false,"body":"","score":1335,"comments":[{"body":"plus a bonus sixth face!","score":138,"comments":[{"body":"Technically, there is no face on the yellow suit with the hat.  Maybe that's how they counted 5.","score":65,"comments":[{"body":"idk man, i definitely see lips and hints of a nose. that's at least half a face","score":34,"comments":[{"body":"Buy 5, get 0.6 free!","score":19,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Merkle Jetson","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The piece is good in concept, just proportioning is all wonky.\n\nWonky is fine, but not if you are going for realism of someones likeness it should be accurate.","score":44,"comments":[{"body":"It’s like some people are colorblind, but spatially","score":18,"comments":[]}]},{"body":"I love the top left one lol","score":16,"comments":[{"body":"Bottom left is my favorite","score":13,"comments":[{"body":"[Reminds me of this meme](https://i.imgur.com/wUDQoXW.jpg)","score":15,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Is…is that a potato?","not_safe_for_work":false,"locked":false,"body":"At least it’s only $20, I guess.","score":109,"comments":[{"body":"A potato with a few human toes attached. Mixed media.","score":24,"comments":[{"body":"I thought so too 😂","score":6,"comments":[]}]},{"body":"This looks like a Delia Deetz sculpture","score":6,"comments":[{"body":"THAT’s what it reminds me of! I couldn’t for the life of me think of it lol. We just need it to be full sized now","score":2,"comments":[]}]},{"body":"I think I threw up in my mouth a little. This will haunt my nightmares.","score":5,"comments":[{"body":"It looks like throw up now that you mention it","score":2,"comments":[]}]},{"body":"Looks like a decomposing foot","score":4,"comments":[]},{"body":"Looks like a flesh-tone burrito.","score":2,"comments":[]},{"body":"That is a gangrinous foot lol","score":2,"comments":[]},{"body":"thats a cyst","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Local buy and sell, at least they aren't asking for money","not_safe_for_work":false,"locked":false,"body":"","score":461,"comments":[{"body":"My brain can’t process what’s going on here","score":70,"comments":[{"body":"They were rolling epoxy with a paint roller, likely for something like a garage floor. They had a little left over and put the roller in the same container when they finished. The epoxy cured and they posted it trying to be funny.","score":78,"comments":[{"body":"Yes, you can tell its a joke because it's for \"trade not sale\" and the price is 123456","score":13,"comments":[]}]}]},{"body":"Will you accept this wad of belly button lint and a partially eaten Starburst in trade?","score":23,"comments":[{"body":"Will it get me high?","score":7,"comments":[{"body":"Aren’t you already?","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Conversation goes as follows:\n- What the hell is this pipe thing?!?!\n- Have no idea, but I bought it.","score":8,"comments":[{"body":"*traded it*","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"That… looks like it might be used for… other things","score":27,"comments":[{"body":"Painfully, maybe","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"A local Facebook marketplace Halloween costume","not_safe_for_work":false,"locked":false,"body":"Thankfully I’m the description he clarified it was custom made. I’d have never guessed","score":546,"comments":[{"body":"They didn't even get the proportions of the package right.","score":31,"comments":[]},{"body":"A kid in my kindergarten class dressed as a pack of Lucky Strikes. Even in the ‘60s, it caused a bit of talk.","score":17,"comments":[]},{"body":"I used to wear lazy costumes like these. T shirt with the lucky strike logo and fishnets like how really old ads would have random stuff walking around on legs. My dude wore a white shirt and red Dickies once. He was Tylenol. Should of sold those to this guy","score":7,"comments":[{"body":"We had poison Tylenol capsules at a party I had in college.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Bad taste and bad execution, the perfect combo.","score":6,"comments":[]},{"body":"Saved by 81 other shoppers?!","score":5,"comments":[{"body":"I’d save it just to show to family and friends to laugh at.","score":2,"comments":[]}]},{"body":"Ah hell yeah. This will go great with the Copenhagen costume I got last year.","score":5,"comments":[]},{"body":"The half assed lettering and paint job make it worse than the costume itself lol.","score":5,"comments":[]},{"body":"Sold.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Found in a hipster market - “Chaos is the natural order $900”","not_safe_for_work":false,"locked":false,"body":"","score":1953,"comments":[{"body":"Judging from the crumples i wouldn't be surprised if that price tag was cut from the same piece of paper","score":313,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Extremely pretentious to price it like that. Acting like it’s good abstract art. Just because it is abstract or you place some “societal implications, man” bullshit to it does not make it a nice piece. This looks like something a child would make for a parent to put on the fridge","score":339,"comments":[{"body":"This is not fridge worthy! This is \"too nice\", daddy is gonna store it safely in a drawer in the garage so we don't lose it.","score":173,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Christ on a bike. And I thought my art was bad","score":201,"comments":[{"body":"Oh, it is. This is just worse.","score":80,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Hi everyone! I'm the person who framed this when I worked at Rhino Market here in Charlotte, NC! The owner's daughter drew that while she was visiting with him at the store and I told her it was a work of art and framed it for her like you'd see in a gallery. It was obvious tongue-in-cheek but it was to make her smile more than anything else and whomever else would get a kick out of it knowing the owner's last name  :)","score":107,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"My Kid Ruined This Canvas\"","score":31,"comments":[{"body":"&gt;\"My Kid Ruined This ~~Canvas~~ piece of printer paper\"","score":18,"comments":[]}]},{"body":"Simply exquisite. Note the use of Sharpie to translate the artist’s lack of talent into a piece that is simultaneously both ugly and meaningless. A stunning achievement.","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"There’s a way to do this and make it work. This is not one of those ways.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"found in an antique store in gettysburg","not_safe_for_work":false,"locked":false,"body":"","score":1120,"comments":[{"body":"Well thank goodness they wrote JOKER in all caps, I might’ve missed the subtle subtext","score":169,"comments":[{"body":"#HA HA HA","score":55,"comments":[]}]},{"body":"Any bets on the artist only learned proportions from anime or those really old comic books?\n\nEdit: fixed wrong words tense","score":86,"comments":[{"body":"I’d take that bet any day, the OC clearly hasn’t learnt proportions from anywhere lol","score":16,"comments":[]}]},{"body":"Looks like Yzma from Emperors New Groove","score":60,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Asking $100 would seem like they were being reasonably delusional. This is just too much.","score":56,"comments":[{"body":"Came to say the same. The arts not impossibly bad but the price is.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"That’s nine dollars and fifty cents, right?\n\nRight?","score":149,"comments":[{"body":"Yes, but it’s FIRM.","score":21,"comments":[]}]},{"body":"Does this joker have a bbl?!","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Found on a local buy/sell site","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"Honestly not too bad, depends on the size of the canvas really","score":17,"comments":[]},{"body":"I actually like this","score":8,"comments":[]},{"body":"I like this. I’d buy it.","score":7,"comments":[]},{"body":"I honestly like it","score":6,"comments":[]},{"body":"but the canvas was stretched by hand","score":5,"comments":[]},{"body":"All the comments saying \"I actually like this\" has made me realise I don't actually need to improve my art before I open an Etsy shop. Apparently plenty of people are willing to pay for really poorly executed art.","score":9,"comments":[]},{"body":"Definitely one of the least terrible ones on this sub, still wouldn’t pay £80 for it (granted I use USD so I don’t have any pounds on me 🤪)","score":2,"comments":[]},{"body":"Is this the cover from The Princess Bride VHS?","score":1,"comments":[]}]},{"title":"Small collection of a profile I stumbled across","not_safe_for_work":false,"locked":false,"body":"","score":1040,"comments":[{"body":"A child made these, right??","score":131,"comments":[{"body":"Nope! :D","score":56,"comments":[]},{"body":"As shitty as this art is, it may just be an equally as shitty attempt at money laundering.","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"[removed]","score":85,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Sun and Moon coulda been an early 80s album cover.","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Imagine if Persian girl was real with those proportions? She wouldn't be able to stand up or sit down. T-rex arms.","score":29,"comments":[]},{"body":"Sun and moon hits a little hard ngl","score":17,"comments":[]},{"body":"I'll take Persian girl venmo or paypall?","score":50,"comments":[{"body":"First 2 made me cringe, Persian Girl made me burst out laughing.","score":25,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Ehhhhhhhhhhhhh","not_safe_for_work":false,"locked":false,"body":"","score":144,"comments":[{"body":"Eh, I kinda like it but it shouldn’t have a three digit price tag.","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It’s shaped like a predatory Christmas tree","score":11,"comments":[{"body":"10/10 would die being eaten by a christmas tree","score":3,"comments":[]}]},{"body":"If that’s handmade and have real opal slices in it, I can absolutely see and justify that price tag. It also sorta looks like the greatful dead lightening bolt, And in that kind of communities hand made jewelry in the hundreds to thousands range is super common.","score":11,"comments":[{"body":"Well aware, I am a deadhead 🙃\n\n In any case, it feels almost cartoonish and strange to have come up while I was poking around for opal jewelry. I’m not seeing where the opals really apply in this piece.","score":4,"comments":[{"body":"Grateful Dead bolt should have 13 points too and this is only 12.","score":2,"comments":[]}]}]},{"body":"Looks like junk to me and the price is truly absurd.","score":3,"comments":[]},{"body":"MENS unisex🤔","score":3,"comments":[{"body":"Men of any gender. Wait...","score":2,"comments":[]}]},{"body":"If you’re gonna use opal, at least make it visible","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"It’s a blurry photo!","not_safe_for_work":false,"locked":false,"body":"","score":1386,"comments":[{"body":"It is literally full of compression artefacts","score":250,"comments":[{"body":"Well duuuhh she obviously had take a picture of the watercolor to upload it. Haven't you seen the horrible compression artifacts Facebook has to use???","score":42,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"She reckons it’s watercolour and she studied art in the UK. Piss off. No you didn’t. That’s a blurry photo like the rest of the blurry photos she’s posted in the bird photo group! As a watercolour artist I’m so fucken mad right now. Why lie!? Why. Why though.","score":353,"comments":[{"body":"I hope you enjoy this reply, I wrote it in watercolour.","score":66,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It’s not even Impressionism ;( ugh my brain","score":204,"comments":[{"body":"Compressionism, via Window's Photo Viewer.","score":270,"comments":[{"body":"Compressionism!! Man I wish I wrote that before she turned off comments","score":104,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Please post more I'm invested and just as mad as you now","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"oh my god I have a story to tell. My 7th grade history teacher used to do this shit ALL the time. He got the school to put his \"prints\" into prize raffles. He'd sign the bottom right hand corner with his name in some weird almost Jokerman font, but claimed he used digital art software to watercolor it. My mom won the raffle and that shitty picture was in our house for years for some reason. Idk why. He was also our neighbor and I've seen his nuts because he liked to skinny dip in the Jacuzzi in his backyard. I couldn't sit on my back porch most evenings because he'd be back there naked in a tub. This dude would also choose where people sat in his class. I noticed him checking out my classmates a lot. He would make sure the girls with bigger butts sat in the back so he could watch them walk back there and the girls with bigger breasts in the front so he could watch them during his bullshit lectures. He taught us how to draw a map of the world which literally revolved around the fact that Italy is shaped like a fucking boot. That was seriously the only thing that made our globe drawings recognized as earth. He made a spectacle of some girl that was never taught how to read an analog clock so she'd stop asking what time it was. Random shit that just was fucken weird. I can't believe this man has taught for generations.","score":87,"comments":[{"body":"Ick, I feel gross just reading that comment vomit 🤢🤮","score":33,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Some more works of art from this lunatic for sale at $65+","not_safe_for_work":false,"locked":false,"body":"","score":118,"comments":[{"body":"I love the spokes on the bike wheels. Like, sure, let's just have one horizontally, that's how it works.","score":12,"comments":[]},{"body":"So bad it's funny!","score":10,"comments":[]},{"body":"The third one looks like [boomer Wojak](https://i.kym-cdn.com/photos/images/newsfeed/001/716/052/bda.png)","score":6,"comments":[]},{"body":"At least the first isn't overly sexualized anime titties.","score":6,"comments":[]},{"body":"I'm going to assume that the artist is under 13, and is doing this without their parents' permission here. \n\nThe first one's chest:bikini anatomy is off, the hair looks like it's falling off, and the hands are a dead giveaway that a kid drew it.\n\nThe second picture is \"Sunil\" from \"littelest pet shop\", a show based off a toy franchise owned by the same company as \"My Little Pony\".\n\nAs for the third one, the majority of adults don't just casually draw people on motorcycles the way kids do.\n\nMy man spent so much time perfecting their signature over their art lmao.","score":4,"comments":[{"body":"The “artist”is almost 37 years old…. And that motorcycle “picture” he made up is from the movie easy rider. The “artist” is a lunatic. But people buy it, so…..","score":9,"comments":[{"body":"What kind of 37 year old watches littlest pet shop!?!? lmao.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"The hell is happening with the first one\n\nDid he try to draw her hella skinny and saw it didnt look good so added a bigger torso....but didnt remove the old one","score":3,"comments":[]},{"body":"That's Marjorie Taylor Greene, isn't it?  Looks spot on to me.","score":3,"comments":[{"body":"It’s actually a sketch of an actual photo of the girl who paid him to do this.","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I heard there’s a wait list.","not_safe_for_work":false,"locked":false,"body":"","score":62,"comments":[{"body":"Showed this to my wife. Her response: “are those two snails fucking? I don’t know…!”","score":8,"comments":[{"body":"I see two snails getting it on or cowboy boots for a bow-legged person.","score":1,"comments":[]}]},{"body":"As a artist i can conidently say....i have no fucking clue what they were trying to do","score":2,"comments":[]},{"body":"We only have to guess 3 numbers since Floridas area code is 407!  Now I can finally buy from a REAL artist! /s","score":1,"comments":[]}]},{"title":"Some guy hired an “artist” to paint a pier","not_safe_for_work":false,"locked":false,"body":"","score":128,"comments":[{"body":"Did the person who hired the artist even look at the artist's previous paintings? This is what happens when someone blindly hires \"artists\" who only boast that they can paint.","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yeah that's a penis","score":23,"comments":[{"body":"My thoughts exactly","score":5,"comments":[]}]},{"body":"the waves r really cool to be fair","score":18,"comments":[{"body":"It's like the opposite of Hitler, should focus on recreating surrealist works like the Scream rather than architecture.","score":8,"comments":[]}]},{"body":"I see a whale breaching next to an oil rig with some giant mushrooms in front.","score":4,"comments":[]},{"body":"I like it","score":11,"comments":[]},{"body":"Ill give then a gold star for effort","score":3,"comments":[]},{"body":"It's called two point perspective. Mans needs a ruler and an art class.","score":3,"comments":[]},{"body":"I assume this is the first time for a guy to draw something. First time using acrylic.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Quite a reasonable price.","not_safe_for_work":false,"locked":false,"body":"","score":774,"comments":[{"body":"She looks like a bratz doll","score":132,"comments":[{"body":"Bratz + Warhammer 40k Sisters","score":43,"comments":[]},{"body":"Also it looks like it was drawn on paper and colored with markers.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I was literally about to comment this, lmao","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This looks like something straight out of deviantart","score":30,"comments":[]},{"body":"Is this by that guy who wrote Empress Theresa?","score":24,"comments":[]},{"body":"If Joan of Arc was an Instagrammer","score":18,"comments":[]},{"body":"Well I have been looking to add to my historical magic marker collection. I’m gonna go all in.","score":14,"comments":[]},{"body":"Joan of Arc had a BBL?","score":8,"comments":[]},{"body":"I know what I’ve got and what I’m worth. Ugh people are just too cheap to pay for homemade art these days &gt;:-(","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"[repost] This dude is accusing Paramore of plagiarizing his photo... the photo in question is a recreation of another artist's work","not_safe_for_work":false,"locked":false,"body":"","score":450,"comments":[{"body":"It’s literally smooshing your face on glass. I don’t think anyone can claim that’s their thing, I think we’ve all done it before.","score":348,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They all stole this from my childhood","score":147,"comments":[]},{"body":"This guy must think he's really something special to believe paramore knows of his existence/ would steal from him.","score":142,"comments":[{"body":"If anyone should know of his existence, it would be Zachary Gray, the photographer who took this photo, usually musicians just validate the inspirations before starting the photo shoot. But given that Daniel's Instagram post has fairly low visibility, it's more likely to be a coincidence.","score":16,"comments":[]}]},{"body":"Also appears on a pretty well known Neil Young album cover... From 1977. https://en.m.wikipedia.org/wiki/American_Stars_%27n_Bars","score":49,"comments":[{"body":"...and on I would guess literally millions of people's phones right now from drunken nights on the town, kids being silly, etc.","score":29,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Also who hasn’t taken a photo like that at least once in their life","score":36,"comments":[{"body":"Shhhhh.  You don't want to get sued do you?","score":10,"comments":[]}]},{"body":"It’s like when Trump tried to trademark ‘you’re fired’.","score":10,"comments":[]},{"body":"Also like the entirety of Jenny Saville’s work","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Quite the price tag for a massive canvas of Markle.","not_safe_for_work":false,"locked":false,"body":"","score":636,"comments":[{"body":"Oil on canvas? They sure about that?","score":66,"comments":[{"body":"It’s SO well made that the artist rendered the piece to appear as paper.","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That nose is fucked","score":32,"comments":[]},{"body":"It’s like someone designed a sims character to be Meghan markle. \n\nAlso the light green shading in the background from dragging the chalk(?) unfortunately looks like mold instead of a filler texture.\n\nEDIT: sorry hard to see on the phone. Could be textured paper","score":79,"comments":[]},{"body":"Meghan would not approve of the lack of freckles and her lip mole","score":63,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You should put in the missing decimal point","score":19,"comments":[]},{"body":"Looks like a painting of a random Hispanic lady in the 1920s but nothing like Meghan Markle.","score":14,"comments":[]},{"body":"She kinda looks like she should be married to a commander in The Handmaid’s Tale.","score":10,"comments":[]},{"body":"Am I the only one who gets \"Empress Theresa\" vibes from this.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Merghan Michael","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Danica Patrick \"You Have to Keep Thinking, 'I Can Do Better'\" - $15 on Etsy","not_safe_for_work":false,"locked":false,"body":"","score":251,"comments":[{"body":"Is it odd that I like it in a completely ironic way?","score":49,"comments":[{"body":"I do too actually, it feels stylized kinda","score":20,"comments":[]},{"body":"Especially if you consider many people did think Danica could do better.","score":6,"comments":[]}]},{"body":"I mean, the quote is accurate","score":22,"comments":[]},{"body":"I mean, it's only 15 dollars and could certainly be worse. That being said, I will say it gives MJ vibes.","score":55,"comments":[]},{"body":"$15 isn't too bad. The hair is actually rendered pretty well, I'm guessing this is a learning/young artist who is proud of this piece and thought it might be good enough to sell for a tiny bit of cash. I wouldn't say this artist is delusional, though I doubt anyone is buying it lol","score":49,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It's fifteen bucks, how delusional can you be for fifteen bucks. Doesn't belong here for me.","score":32,"comments":[{"body":"If we really want to properly value art, even if we agree this isn’t good, we should probably view $15 as underpriced. Absolutely not right for this sub.","score":6,"comments":[]}]},{"body":"Very bold of this artist to draw her using 2000’s Michael Jackson as the reference.","score":5,"comments":[]},{"body":"\"F*** you Danica!\"","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"a mural at an ice cream parlor","not_safe_for_work":false,"locked":false,"body":"","score":26,"comments":[{"body":"They didn’t finish the man’s face.","score":26,"comments":[{"body":"Or his trousers....","score":12,"comments":[]},{"body":"Maybe it's supposed to be a young Slenderman. Slenderyoungman.","score":10,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"To be fair I think murals aren't necessarily about trying to delude yourself as a Great Artist, more just about having nice colours and quirky interest in the cafe, and about the fact that anyone can make a mural.\n\nThis looks more interesting than the blank white wall it covers so I think they've done the job ok?","score":59,"comments":[{"body":"Right.  Someone was given their shot at a local *checks notes* ice cream parlor.  It's honestly not bad. Kinda fun.  Colors are right, 2d to 3d all over the place,  and like someone said unfinished.","score":20,"comments":[]}]},{"body":"I think that’s the charm","score":30,"comments":[{"body":"slightly terrifying to see irl","score":-2,"comments":[]}]},{"body":"It does fit the ice cream parlor vibe, but it looks like as he's pulling on her hand, her head is about to come off.","score":4,"comments":[]},{"body":"The flagrant disregard for perspective is the only thing that really bothers me","score":4,"comments":[{"body":"Same, makes me feel nauseous looking at it","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"For $83 you can purchase this piece that takes $5 and a trip to the Dollar Tree to make.","not_safe_for_work":false,"locked":false,"body":"","score":748,"comments":[{"body":"I've been seeing a fair bit of decent but overpriced art posted here lately. But this is dogshit that's overpriced. Actual good post","score":171,"comments":[]},{"body":"Clippy on acid","score":46,"comments":[{"body":"If he named it like that, it would probably be worth a bit more tbh","score":17,"comments":[{"body":"Biblically accurate clippy","score":11,"comments":[]}]}]},{"body":"Take this garbage home for 83 bucks","score":25,"comments":[]},{"body":"r/sadcringe","score":23,"comments":[]},{"body":"r/biblicallyaccurateclippy","score":20,"comments":[]},{"body":"Why do the eyes in paintings always seem to follow you?","score":27,"comments":[{"body":"Because they fell off and got stuck to your shoe","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This looks like something my four y/o niece would make omg","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"At the bargain price of just $3,800 you could be the proud owner of an 8ft tall nightmare-fuel trash mermaid","not_safe_for_work":false,"locked":false,"body":"","score":417,"comments":[{"body":"No. I’m scared. And that’s cursed. But at 8ft that took effort and time so hope someone buys it. Far far away from me.","score":28,"comments":[]},{"body":"\"custom-made\n\nMade according to the specifications of a particular individual\"\n\nSo, did the client back out, or what?","score":23,"comments":[{"body":"They died. Their soul is now trapped inside the statue.","score":29,"comments":[]}]},{"body":"Phoebe from Friends is at it again.","score":17,"comments":[]},{"body":"I weirdly like this, but couldn’t afford it.","score":10,"comments":[]},{"body":"this looks like it comes alive at night and turns peoples skin inside out","score":10,"comments":[]},{"body":"0/10 taste, but 10/10 creativity","score":23,"comments":[]},{"body":"I actually kinda like it. But not at that price.","score":8,"comments":[]},{"body":"Cynthia from rug rats vibes","score":6,"comments":[]},{"body":"That is so fucking wrong.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"For 165 plus tax you can get a small shitty pencil crayon drawing from one of the city's worst tattoo \"artists\".","not_safe_for_work":false,"locked":false,"body":"","score":417,"comments":[{"body":"I really like the one on the left, actually. Wouldn't pay 165 for it, but I like it a lot","score":233,"comments":[{"body":"Same here, and the frames! I want that black frame lol.","score":47,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"For context, I've been following this person on instagram for a while now. They're a tattooist (tattooer?) that does some real shoddy work. They've been working in the local scene for almost eleven years now and they have not improved. [Here's a link to some of the stuff they deemed good enough to showcase](https://imgur.com/a/cK0OSQ1)\n\nOn top of that, I found the frame on amazon. It's 16 bucks Canadian. So they're charging ~$149 for a 4x4 pencil crayon drawing.","score":84,"comments":[{"body":"The first three I was “oh they’re not the best but not THAT bad”…then saw that poor deformed wolf….","score":98,"comments":[{"body":"Those were my thougts!","score":19,"comments":[]}]},{"body":"God those are so fucking awful","score":53,"comments":[{"body":"Every time she posts something new I think \"she can't keep getting away with it.\"","score":50,"comments":[]}]},{"body":"Wow that last one.. I hope she can get a good cover up. I would hate to have that on my chest forever.","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"holy shit the last two, especially...","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That Zeus is unironically some big lez shit wtf","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Complete horizon lines are for losers.","not_safe_for_work":false,"locked":false,"body":"","score":2334,"comments":[{"body":"I like how the horizon is super crooked, but she's holding the painting at an angle and it evens out.","score":445,"comments":[{"body":"Which once again proves that that earth isn't flat..it's crooked","score":108,"comments":[]},{"body":"It's spec art for Zero Horizon Dawn. Nailed it. Can't wait to see Aloy swinging through a world of absolutely madness. The sun is too hot? Probably because the sun is your next grip point while climbing into deeper insanity.","score":24,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"There is absolutely no shame in being an inexperienced artist, everybody's always learning\n\nBut having the gall to pretend to be able to teach others, when your own shit looks like this... lmao","score":624,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This wins the sub. Best one yet.","score":136,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nah this lighthouse doubles as a hydroelectric dam, to prevent boats cruising into the spillway","score":119,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Maybe the lighthouse is at the very edge of a giant waterfall.","score":84,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Look how massive that tree is on that distant island in the background","score":61,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Here's a link to the video on YouTube. https://m.youtube.com/watch?v=Wjd63v8n2Hg","score":36,"comments":[{"body":"This is great, the intro is exactly how I would want it to be, haha. I didn't watch the whole thing but when she begins, she skips the first step!! This is a step by step painting and she explains an initial process and says \"we're gonna skip that part\". Fucken great. \n\nShe also misspells odorless thinner as orderless thinner when listing out the supplies. And \"easle\" too!\n\nAlso, you think she's on location when she is painting but she isn't.\n\nAs my grandmother would say, bless her heart.","score":56,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I thought these were buttcheeks","not_safe_for_work":false,"locked":false,"body":"","score":266,"comments":[{"body":"Why two, though? It just doesn't seem like something you'd visualize in your head and then be like, \"I gotta put that on canvas...\"","score":18,"comments":[]},{"body":"Grey beef patties.","score":12,"comments":[]},{"body":"Only the most accomplished artists used Modge Podge.","score":7,"comments":[]},{"body":"Well Beavis, you know how like when you pull your pants down and show your butt to someone; And you like, show them your moon?","score":3,"comments":[]},{"body":"Lmao $45 ok","score":1,"comments":[]},{"body":"should be put on some legs and called \"mooning\"","score":2,"comments":[]},{"body":"Lmao $45 ok","score":1,"comments":[]},{"body":"Here I go thinking it was influenced by Powerman 5000","score":1,"comments":[]},{"body":"Smeary grey pancakes!?","score":1,"comments":[]},{"body":"I actually think this really good and believe it's fully worth $45","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"It’s “rustic”.","not_safe_for_work":false,"locked":false,"body":"","score":1622,"comments":[{"body":"Oh man it's so close to being actually super cute. I think the color is off, should be a brighter orange. Also should have used a much thicker wire, probably a few wires twined together, and a metal leaf to top it off.\n\nGood idea, terrible execution.","score":467,"comments":[{"body":"You nailed the issues with it, and I fully agree the idea is there, it just needs some work.","score":111,"comments":[]},{"body":"I feel like that's what they saw and tried to copy","score":40,"comments":[]},{"body":"That was my first thought was  “wow this guy is actually pretty close to something the lifelaughlove crowd would gobble up.","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Could even stencil a Jack O'Lantern face","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Minecraft","score":116,"comments":[]},{"body":"With the current price of lumber and roofing spikes this is a good deal","score":83,"comments":[]},{"body":"I mean, it’s kinda cute, couldn’t tell what it was supposed to be before I read the word “pumpkin”, but if it was painted orange with a pumpkin pattern I’d think it’d be almost worth it","score":82,"comments":[]},{"body":"I think they need to be a bit more orange to see they're supposed to be pumpkins. Not really my style, but I think some people could find these cute. \n\nAnd I also think that with the current cost of building supplies, these are very fairly priced.","score":22,"comments":[]},{"body":"Typical Forest Lake, haven't met a single person from there that I've tolerated 😒","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Met a guy at a bar who told me he was an artist and then said he wanted to draw me","not_safe_for_work":false,"locked":false,"body":"","score":2491,"comments":[{"body":"I'm not sure what the complaint here is, this is clearly your spitting image. It's got everything: right cheekbone protrusion, broken nose, whisker moustache, and your characteristic giant left eyebrow. He nailed it.","score":723,"comments":[{"body":"Not to mention the unfilled heart tattoo on the tip of the nose. The likeness is uncanny.","score":202,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You might want to take this down for security reasons","score":210,"comments":[{"body":"He made it to unlock her phone's facial recognition","score":122,"comments":[]}]},{"body":"Well, he never said he was a good artist.","score":296,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"i spent like 3 hours shading the upper lip","score":175,"comments":[{"body":"It's probably the best drawing I've ever done.","score":60,"comments":[]}]},{"body":"I thought he might be kidding but his whole Instagram was art like this (and a fair amount of women posing with drawings he had done of them). I think he blocked me though - even after he surprise kissed me goodbye on the mouth, I was never interested so stopped talking to him immediately and never accepted his friend request. I wanted to post a screen grab for you all 😭","score":247,"comments":[{"body":"That kiss sounds very cringe-y","score":133,"comments":[{"body":"My friend and I told him we were heading to meet friends at another bar. I was saying a quick goodbye and \"it was nice to meet you!\" and it seemed like an appropriate time for a hug but he went for a kiss. Ooof, i'm far too polite","score":108,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"BLVAK selling a dented barrel for… *checks papers* …way more than is conceivable.","not_safe_for_work":false,"locked":false,"body":"","score":61,"comments":[{"body":"Gotta love that I immediately got the company name wrong in the title…","score":18,"comments":[]},{"body":"Just when you thought the replacing a vowel with V craze was over..","score":9,"comments":[{"body":"Bluck","score":2,"comments":[]}]},{"body":"Yes let's call it a 'Monogram' because nothing about this is a monogram.","score":7,"comments":[{"body":"To be fair, it *is* monogrammed","score":1,"comments":[]}]},{"body":"\"1/25\" means they'll be extremely lucky if they sell that many.","score":4,"comments":[]},{"body":"what's inside?","score":2,"comments":[]}]},{"title":"I'm hoping these are a joke but they jumpscared me when I was checking marketplace.","not_safe_for_work":false,"locked":false,"body":"","score":1071,"comments":[{"body":"I’m Old Greeeggggggg","score":54,"comments":[{"body":"Ever drink baileys from an old shoe","score":12,"comments":[{"body":"Do ya love me?","score":6,"comments":[]}]}]},{"body":"the feeling of rust against my salad fingers...😏","score":48,"comments":[{"body":"Same thing I thought LOL","score":8,"comments":[]}]},{"body":"Holy crap. That's a steal!","score":10,"comments":[]},{"body":"Eyelash Elvis has my heart","score":12,"comments":[]},{"body":"Salad fingers","score":9,"comments":[]},{"body":"The feeling of rusty spoons 🥄, etc.","score":7,"comments":[]},{"body":"as i fast scrolled, i thought this was a post from an scp subreddit not here","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"This cat tree, which is actually a piece of drift wood, could be yours for the low low price of 3k!!!","not_safe_for_work":false,"locked":false,"body":"","score":211,"comments":[{"body":"I would love to watch someone pay 3 grand for that stupid branch, take it to their house, have the cat walk up to it and sniff it, then walk away and never acknowledge it again.","score":33,"comments":[]},{"body":"Now that’s a bargain! 🤌🏼🤌🏼","score":7,"comments":[]},{"body":"It really looks like the dude/girl just bought a regular branch made for parrots and now advertise it as a \"luxury cat tree\" lol","score":5,"comments":[]},{"body":"So it's a cat tree that you just lean against the wall?  I mean, I'd pay $2k for that, but not almost three.","score":1,"comments":[]}]},{"title":"\"Gilgalad Gives Galadriel the Last of the Mallorn Seeds\"","not_safe_for_work":false,"locked":false,"body":"Not sure whether to choose the Bad, Deluded or High Price flair with this one... 😳","score":432,"comments":[{"body":"The artist seemed to forget that Galadriel is Gil-galad’s great aunt. Why’s she a child while he’s a grown man?","score":129,"comments":[{"body":"Fucking wreckd him with that lore knowledge","score":46,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I misread that as Gigachad.","score":139,"comments":[{"body":"I misread it as GigaLAD like British version of chad","score":26,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"No one going to comment on how it looks like she is jerking him off but the artist edited that out? I mean, look at the back of his pants … his ass his hanging out, or the artist didn’t know where a pants line should start when ripping off the pose.","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Dave Mustaine is looking good for his age","score":30,"comments":[{"body":"My first impression was that it was a painting of Dave and a happy ending.","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Gilgalad has the face of Martin Clunes. It's very unnerving.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Got a face like Wyatt from Ozark.","score":12,"comments":[]},{"body":"Dude has a ginormous head, based on the hair. Either that, or he’s wearing a 50’s-era bouffant.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Finally found one in the wild","not_safe_for_work":false,"locked":false,"body":"","score":420,"comments":[{"body":"Yeah I mean I wouldn’t buy this personally. But in no way is this delusional pricing or artwork.","score":262,"comments":[]},{"body":"For the price and size of it, price of materials, time, getting it to you. They're barely making minimum wage doing it. It's not offensively bad, just mediocre. But like that's mediocre art price.","score":383,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Considering the proportions aren't wrong, there's an effort in composition, shading, the overall painting, as well as no seemingly arrogant phrasing in the description, and the $150 price tag (which is not very high considering art supplies' price) I'd say this is not a delusional artist. OP just hates beginners.","score":74,"comments":[{"body":"I can see a few problems with proportions but with how it’s done it could be stylistic, especially since getting to the uncanny valley would be pretty desirable in this context IMO","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I think you just don’t like the art","score":250,"comments":[{"body":"It’s horror art so it’s doing its job.\n\nBut for real it’s pretty decent for that size and price. The concept is good and while it is lacking I color I believe that is the art choice for effect.","score":59,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"150? That’s it? I feel like this really isn’t that egregious","score":20,"comments":[]},{"body":"How is this delusional? It’s creepy and advertised as such","score":14,"comments":[]},{"body":"This is not even remotely bad or overpriced. OP is the delusional one.","score":227,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Honestly, 150$ seems pretty reasonable for this. It’s original art on a respectfully-sized canvas. It’s not a Van Gogh, but it’s got some detail, some shading, and the art isn’t the worst I’ve seen. The price tag is not outlandish for what it is.","score":156,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"\"Trump Rally,\" featuring a strangely Putin-looking FPOTUS and... a full cast of Jeff Dunham's puppets in the audience? Take it home for $300","not_safe_for_work":false,"locked":false,"body":"The face over the left shoulder will fucking haunt me","score":962,"comments":[{"body":"How much for Pocket Lint Eastwood?","score":68,"comments":[{"body":"*get off my pants!*","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"At least he got the scale right on the hand","score":140,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I like the baby fist. I wouldn't pay $300 for it, but they captured how dumb he looks pretty well.","score":17,"comments":[]},{"body":"Why does the bottom left hand corner painting look like the one that hitler painted that got rejected from art school?","score":11,"comments":[]},{"body":"Why is FPOTUS wearing a helmet?","score":9,"comments":[]},{"body":"It's so bad that I love it","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"For $300 it better come with some classified docs behind it.","score":28,"comments":[]},{"body":"I like to buy really shitty art because it encourages the artist who had no talent to give up other pursuits. By the time they realize it’s too late. /s","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Is that a fuckin taxidermied baby turtle?","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"CEO of game studio passes AI generated art as his own and wins a competition, and his fb contacts are eating it up. (article in comments)","not_safe_for_work":false,"locked":false,"body":"","score":1156,"comments":[{"body":"This is not a deluded artist, he knows exactly what he is doing. Only weird thing is that this is digital art that has been printed, printed art don't usually go for $750. But that might just be \"normal\" price for something that won the state fair thingy \n\nWe have clearly reached the point where computer tools are getting so good what competitions need to specify that fully computer aided submissions are not allowed.","score":348,"comments":[{"body":"&gt; fully computer aided\n\n\"Fully aided\" is a pretty funny term.","score":83,"comments":[{"body":"Automaided?","score":12,"comments":[]},{"body":"Full blown aided?","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This seems so disheartening, just browse the art sub and see how many ai’s you can spot they never state it’s ai in the title. There’s so many wonderful talented artist who are completely being overlooked because of the mass produced ai’s. \nI do think the ai images are incredible and it’s fascinating to see how far we’ve come but claiming that you’ve made something when you’re putting in prompts and filters compared to someone who has spent years practicing and learning. Saw a couple trying to sell their ai generated art to people who could do the same thing in ten minutes.","score":640,"comments":[{"body":"I expect more Ai paintings will be sold, but it’ll just make the actual painters more valued. You’d pretty much expect that beautiful original oil paintings will just continue to rise in price","score":152,"comments":[{"body":"Ai paintings can't be copyrighted and I think that's going to be key in keeping a market for real artists","score":56,"comments":[{"body":"Wouldn't all it take was for a human to have at least a small part in the process to make it copyrightable? Like in this example where a human put together the image","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Alright, fuck it. Time to go back to oil paintings and wood burnings.","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Question- is there a legal and non plagiarism method to use AI generated art in media. Like if want AI art to use as my album cover or company logo? How would I give credit/ pay the license to use the art?","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"\"My husband is really going to miss this one!\"","not_safe_for_work":false,"locked":false,"body":"","score":429,"comments":[{"body":"The first one is almost great, but the hand is absolutely *fucked*.","score":153,"comments":[{"body":"[deleted]","score":94,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"There really is enough detail in places I felt bad critiquing it but that baby arm just shoots out of the shoulder and it made me laugh. The big cat is kinda cool in a flat stylized way but the rest just look like prison sketches.","score":36,"comments":[{"body":"Baby arm is great, but have you ever stared into the abyss of her open pit mine ear?","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Number 4 seems a bit too personal to be selling…","score":26,"comments":[]},{"body":"Oof, had a hard time enjoying this after seeing the Childhood Memories one. The technique is bad but that one just bummed me out.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The first one looks like an alien starting to remove its Taylor Swift mask","score":18,"comments":[]},{"body":"I can see there is some level of skill it’s just a shame some bits fuck them up","score":49,"comments":[{"body":"It's not the skill that makes this Delusional. This is pretty standard for people who are exploring new styles and learning how to draw or paint, it's more that they're trying to charge $1000+ for stuff that they're making while trying to learn","score":10,"comments":[]}]},{"body":"There’s clearly time spent on making these im sure with time and maybe fundamental lessons they could be really awesome","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Apparently Trisha Paytas has a Poshmark store — only $400!","not_safe_for_work":false,"locked":false,"body":"","score":1102,"comments":[{"body":"Shoulda spent a little more time shading the upper lip.","score":159,"comments":[{"body":"Ironic how the name of the character is the same.  Even the look.","score":32,"comments":[]},{"body":"Napoleon!","score":6,"comments":[]}]},{"body":"Who..?","score":52,"comments":[{"body":"A professional histrionic who finds any way to cling to fame, operates under a level of feigned stupidity as accountable deniability. She grifts and grifts as much attention as possible through any means, wether it be positive or negative. Recently she is going to take on her biggest grift yet: a family channel.","score":69,"comments":[]},{"body":"They’re an old YouTuber and not anyone worth looking up if you’ve been able to go this long without having to know they exist lol \n\nIgnorance is bliss as they say!","score":84,"comments":[{"body":"Fucking frenemies. I could have gone my whole life in ignorance.  Its like a car crash. I can't look away.","score":15,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"I thought Poshmark was for clothes. Does anything go now?","score":29,"comments":[{"body":"No clue! I don’t use the site, just creeped on her store and sorted price high to low which is how I found this masterpiece","score":13,"comments":[]}]},{"body":"Even by outsider art standards this would be shit. Is this a troll?","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"the likeness is uncanny","not_safe_for_work":false,"locked":false,"body":"","score":417,"comments":[{"body":"The ass on that drawing haha this is great. I wanna see some more of this artist!","score":131,"comments":[{"body":"I want to see more of that ass but also the tile lines in the drawing are straighter than the ones in the actual photo WTH?!","score":27,"comments":[{"body":"Haha it’s hilarious the more I look the better it gets. The trashbin XD and the eyes such a masterpiece","score":9,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The top one is so bad it’s awesome. The bottom ones are just bad.","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The person's got a consistent style at least.","score":41,"comments":[]},{"body":"Now that's art.","score":28,"comments":[]},{"body":"I follow this guy on Instagram! I love him so much, he's always a good laugh and he makes people happy. Good for him.","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I love that first one. It’s so fucking funny.","score":34,"comments":[]},{"body":"If they practice a bit more, they could be a decent cartoonist. The faces, especially the blonde in the top drawing, actually shows a hint of potential.","score":8,"comments":[]},{"body":"I fucking love it","score":19,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Description literally says this painting is unfinished and it’s her first time painting.","not_safe_for_work":false,"locked":false,"body":"She’s also selling her second attempt at painting for the same price, and the second attempt is also a “unfinished piece I’m very attached too and am only selling because I’m in need of cash”\nHer marketplace profile is filled with a bunch of poorly done homemade crafts that are all labeled as one of her first attempts for a criminally large asking price.","score":636,"comments":[{"body":"There are two sources of light in the picture...","score":41,"comments":[]},{"body":"Not too bad, but yeah, $300 dollars? I'd pay about 2 dollars.","score":124,"comments":[{"body":"Still more than I’d pay for unfinished work 😅","score":37,"comments":[]},{"body":"I'd pay $5 because you could just paint over it and boom, brand new blank canvas.\n\nThat's called being responsible with your finances.","score":27,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Delusional yes. But let’s not pretend there’s worse stuff being sold for much more.","score":56,"comments":[]},{"body":"People literally paint squiggles or a few lines, call it “art” and sell it for thousands. \n\nThis person is just trying to cover rent. Very overpriced, but can’t blame them for trying. It’s a struggle out here right now","score":79,"comments":[{"body":"At least she promised a second piece, too.","score":22,"comments":[]}]},{"body":"The people that are saying it’s not bad… it is bad. The goal was to follow Bob Ross which paints realistic landscapes. This looks like there was no fine motor skills involved, paintbrush was clenched in a fist, no mixing mediums, and painted the oil on too thick. The sky is a blue line on top with cotton ball clouds. Globby mountains, looks like there’s a hair stuck to it right in the middle. Plus it’s unfinished… and for $300.","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The water isn't horrible. It could be ok if she worked on it.","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This person is just trying to beg with dignity, give them a break. They recognize this is low quality- not delusional, just desperate.","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Description is “price is firm”","not_safe_for_work":false,"locked":false,"body":"","score":273,"comments":[{"body":"0/10. Sun does not have a smiley face on it.","score":18,"comments":[]},{"body":"Desire not to purchase it is also firm.","score":16,"comments":[]},{"body":"Listen, I love helping artist…but that’s a high price to pay. Maybe $20 might be better for this one.","score":7,"comments":[]},{"body":"Are you kidding me? I love it","score":7,"comments":[]},{"body":"i somehow like this... but not enough pay $700+","score":6,"comments":[]},{"body":"Not the worst peice I've ever seen. I wouldn't buy it, let alone put it in my house, but still.","score":2,"comments":[]},{"body":"I was on a whole another level of painting when i was 5. And i suck at painting and drawing. If you saw something i drew you would think i'm slightly retarded.","score":1,"comments":[]}]},{"title":"They thought this would be a good title for their instrumental","not_safe_for_work":true,"locked":false,"body":"","score":0,"comments":[{"body":"What’s delusional about this? Sounds like you just don’t like their music.","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This kinda sounds a lot like John Frusciante's heroin phase. I'd guess that maybe the title is a reference to Your Pussy's Glued to a Building on Fire.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not even close to delusional. Honestly it's kind of just... funny? Clearly they're not taking themselves as seriously as OP is. Tons of incredibly talented musicians name their shit all kinds of wild nonsense and this example doesn't even come close to shit I've seen or listened to.","score":16,"comments":[]},{"body":"It's very deliberate.\n\nIt's like Nigel Tufnell playing the piano, the interviewer says, \"that's pretty, what do you call this?\"\n\n[\"Lick my love pump\".](https://youtu.be/H7vk5keNbRc)","score":9,"comments":[]},{"body":"It’s funny, and it sounds awesome! \nMade me think of a band in Denmark called “drengene fra angora” they made satirical songs that is still pretty popular here. Nothing delusional about this.","score":5,"comments":[]},{"body":"[deleted]","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It's fine? Musical groups usually have really stupid names, one of my favorite is \"revolting cocks\" like, revolutionary roosters.","score":1,"comments":[{"body":"Been a while since I encountered a Revolting Cocks fan","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"https://youtu.be/LdjlpvOSGhs\n\nThis song they did is the real proof","score":0,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"For the parents who want their babies to look like they're smeared with diarrhea :)","not_safe_for_work":false,"locked":false,"body":"","score":724,"comments":[{"body":"I'm impressed at how she can pick the most absolutely revolting colors and textures to go together. Her passion should be in horror effects, not baby clothing.","score":290,"comments":[]},{"body":"Is that... supposed to be...tie dye?","score":84,"comments":[{"body":"It looks like an all natural dye technique where you squish flowers on the fabric to dye it.","score":74,"comments":[{"body":"It is not a good technique.","score":81,"comments":[{"body":"It's called eco printing and it can look really cool, but you have to know what plants you've got and how they will actually stain. Even pink, blue, purple flowers usually turn poopy yellow on fabric.","score":34,"comments":[{"body":"I'll have to Google it so I can see what it looks like when it's done properly. But if I saw a baby wearing that particular onesie, I would definitely think that was poo.","score":14,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I just assumed they were showing off the results of massive blow outs","score":76,"comments":[]},{"body":"\"For the mother who wants to lose their child to CPS\"","score":57,"comments":[]},{"body":"\"I found my new passion.\" No no, ma'am, shitting on onesies isn't a passion.","score":49,"comments":[{"body":"I dunno, my son is pretty passionate about it","score":23,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"found on Mercari","not_safe_for_work":true,"locked":false,"body":"","score":37,"comments":[{"body":"These are straight up tracings of a figure and a cosplayer. So not only is it bad, it's also scummy.","score":27,"comments":[]},{"body":"Digital artist here.\n\nThat shit is traced as fuck.","score":19,"comments":[]},{"body":"my very first attempt at digital art (done in paint.net with a mouse and zero clue what i was doing) looked about as proficient as these. i was just tracing a photo and very sloppily cell shading it.\n\nim 90% sure these are tracings that have been colored and shaded freehand, i dont even have to hunt for the original images to know that. i highly doubt anyone could be that technically skilled at anatomy/sketching and still have shading, linework, and coloring that sloppy.","score":10,"comments":[]},{"body":"\"Digitally handmade\" i mean... technically, yes...","score":7,"comments":[]},{"body":"Lol I’m watching Charlie while seeing this.","score":3,"comments":[]},{"body":"I wanted to be tracer, but clearly they're already tracer","score":2,"comments":[]},{"body":"Did you vance your youtube? :)","score":1,"comments":[]}]},{"title":"RiP Bambi","not_safe_for_work":false,"locked":false,"body":"","score":142,"comments":[{"body":"This guy Isn’t delusional he’s just mentally depraved","score":47,"comments":[]},{"body":"This has to be satirical","score":37,"comments":[]},{"body":"There’s actually some sick people who would probably want to buy this. I’ve heard about people buying used underwear on eBay before.","score":22,"comments":[{"body":"Honestly the price is about right for someone who wore the panties for 2 weeks straight if they had “inclusions” &amp; also were sold immediately after. \nSource: I’m a SWer","score":8,"comments":[{"body":"Someone reselling them after she died &amp; after they aren’t “fresh” anymore would make them undesirable for that price. Alongside the whole dream-catcher part. Although if an indigenous SWer made a print of this for a reasonable price I’d buy it lol","score":6,"comments":[]}]}]},{"body":"Hilarious, has to be satire","score":21,"comments":[]},{"body":"Well that’s just fucking terrifying","score":10,"comments":[]},{"body":"Points for creativity AND provenance.","score":10,"comments":[]},{"body":"Ah yes, trying to knock on people's sympathy and pity in order to buy 'their work'","score":2,"comments":[]},{"body":"r/ihavesex","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"A Groovy Skull","not_safe_for_work":false,"locked":false,"body":"","score":611,"comments":[{"body":"It is indeed a groovy skull.","score":117,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I like it but wouldn't pay that much","score":69,"comments":[]},{"body":"That skull is indeed groovy and I dig it. Not over $300 of groovy, mind, but I could see myself buying this.","score":95,"comments":[]},{"body":"How big is it?","score":15,"comments":[]},{"body":"They are groovy tho.","score":8,"comments":[]},{"body":"Not delusional","score":23,"comments":[]},{"body":"I'd pay that. I'm apparently a delusional art buyer. Probably took 3-6 hours and probably at least $50 in materials.","score":34,"comments":[{"body":"And posting it online, and packing it for shipping, and (maybe) paying for shipping, and driving it to the shipping center. Maybe the artist ends up making $30/hr. That's not crazy at all.","score":29,"comments":[{"body":"I guess only being able to afford prints makes people forget what goes in to originals.  Marketing art after the fact is a bitch and a whole ass job in itself.  Photographing it, adding it to the website, writing descriptions.  OP and most of the people here complaining are choosy beggars","score":21,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"I mean it's cool but I'm not a fan of the Sponge painted background that doesn't even teach the skulls edge.","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Someone had an epiphany for the price of their art","not_safe_for_work":false,"locked":false,"body":"","score":831,"comments":[{"body":"Mayne it's supposed to be $75 with \"small\" zeros","score":170,"comments":[{"body":"Yeah that's certainly what it looks like to me.","score":46,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Yeah I'm pretty sure that meant 75.00","score":74,"comments":[]},{"body":"Twist: $55 is the original price, but It wasn’t selling, so they made a fake price and put a clearance tag to make it seem like you’re getting a bargain.","score":96,"comments":[{"body":"Or, considering the lack of decimal point, it was discounted from $7,500 to $5,500.","score":25,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"That looks like 75 dollars to 55 dollars to me.","score":14,"comments":[]},{"body":"Nobody:  I've always wanted a church painted with shit, blood, spit and piss.\n\n\"Artist\": Say no more fam","score":8,"comments":[]},{"body":"The perspective is so fucked lmao","score":7,"comments":[]},{"body":"It’s somehow terrifying","score":5,"comments":[]},{"body":"That's actually very nice, and well worth the 75 imo","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Chainsaw Emoji Art- $75 ea or take both for $100😀","not_safe_for_work":false,"locked":false,"body":"","score":610,"comments":[{"body":"if these were little drink coasters I would probably think they were kinda cute, but- wtf are you supposed to do with that fuckin thing? Hang it in your bedroom?","score":86,"comments":[{"body":"I mean, you'd never sleep through an alarm again. Mostly because you wouldn't be able to sleep at all, but the point still stands.","score":37,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"First one is kinda cool. Gives me horror movie vibes.","score":24,"comments":[]},{"body":"If they posted it as Prattling Pate from Elden Ring they might get a taker.","score":14,"comments":[{"body":"My first thought. Use this to tell Boc he’s beautiful.","score":4,"comments":[]}]},{"body":"Anyone remember Tubby Toast from the Teletubbies","score":8,"comments":[]},{"body":"Would be hard to make one yourself tho.","score":4,"comments":[{"body":"You're right, these pieces would have been a lot easier to make with normal wood burning tools instead of a chainsaw. This is like using a snow shovel to spread jelly on toast.","score":7,"comments":[]}]},{"body":"The first one has creep-value. The second… eh","score":3,"comments":[]},{"body":"Guaranteed to protect your house from break ins if hung outside","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Interesting take on stranger things","not_safe_for_work":false,"locked":false,"body":"","score":1263,"comments":[{"body":"the Demogorgon legitimately looks great, idk what the fuck happened to those poor folks though","score":575,"comments":[{"body":"Dude is a good artist that can't do faces. It's actually very common and the reason many artists (even famous ones) opt to simply not do faces in their paintings.\n\nLook at Mike here, the anatomy and detail in his hand is spot on, so good that it makes his face look even worse in contrast.","score":383,"comments":[{"body":"Ok so as someone with no artistic ability and someone who would never do what I’m suggesting because I can’t take my own advice I have to ask. Why wouldn’t someone like this with lots of talent spend a long time doing just faces until they improve significantly. Keep doing the same face until it’s legitimately good and then modify it slightly in new paintings to expand on the number of faces they can do?","score":65,"comments":[{"body":"There could be a few reasons. The simplest explanation could be that they don’t realize how off their faces are, and maybe haven’t had it pointed out. It’s pretty common when you’re learning as an artist, to only realize how bad you were in hindsight. \n\nAnother solid possibility is that, given that they’re clearly skilled otherwise, maybe they’re getting consistent enough work at the things they ARE good at, that they don’t get around to practicing the things they aren’t. It sucks, but money talks, and there’s only so many hours in a day.","score":39,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"How can one develop a well established feel for shading and yet still be trash with human faces? It's kinda puzzling","score":179,"comments":[{"body":"I know, there’s certainly skill here, but it’s like an uncanny valley version of the original","score":93,"comments":[{"body":"Looks like they all got swarmed by bees on their faces","score":30,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I forgot Tupac played Lucas","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"How is this so good, but also the worst thing I have ever seen.","score":113,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Something quite compelling about this. It's like carnival ride artwork.","score":97,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I still can't see the turtle...","not_safe_for_work":false,"locked":false,"body":"","score":65,"comments":[{"body":"It's kinda cute","score":25,"comments":[]},{"body":"You really can’t see the turtle?  The light green being the shell?","score":21,"comments":[{"body":"OP has never seen a turtle","score":11,"comments":[]}]},{"body":"Maybe get your eyes checked out?","score":13,"comments":[]},{"body":"They're also possibly the local catalytic converter thief from the looks of it.","score":12,"comments":[]},{"body":"Its goes hard","score":11,"comments":[]},{"body":"Honestly? This doesn’t belong here, maybe not $50 but if I saw this in a store for $5, I’d buy it for a joke","score":8,"comments":[]},{"body":"The big green part is his shell, and the little green spots are his eyes. The little silver pieces are his cute little legs and the silver piece with the little green spots is his head. \n\nHope that helps!","score":5,"comments":[]},{"body":"This is actually fire","score":3,"comments":[]},{"body":"I love muffler men (we have one bought right from a muffler shop) but this is a pretty sorry execution of the art form.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"a wine bottle that unzips to reveal ... pennies?","not_safe_for_work":false,"locked":false,"body":"","score":597,"comments":[{"body":"I mean at least that took a little skill to create. Someone would probably pay $7.99 for it in a Ross, and that’s not nothing.","score":129,"comments":[{"body":"That's true,  it's not hideous. But a little pricy considering the bottle is empty.","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"bucciarati","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Its kinda interesting but waaayyy too high of a price","score":14,"comments":[]},{"body":"If there is $251 or more in pennies, then worth it!","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Looks like something someone would make as part of a community college design project for their fine arts associates degree. It’s…. creative… Not $250 creative. I would not pay for this. But if my kid made it, I’d probably display it, on top of the kitchen cabinets.","score":7,"comments":[]},{"body":"Cool but worth maybe 40","score":4,"comments":[]},{"body":"27 bucks... tops.  40 in a delusionally posh basement mass ave scrappy botique.","score":6,"comments":[]},{"body":"I miss Regretsy.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I mean probably the first thing someone has posted that I would have in my house . Be it on a shelf out of site with some lights behind it . Also paying a maximum of a fiver considering the coins are real","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Didn't want to waste it. $50 to take it.","not_safe_for_work":false,"locked":false,"body":"","score":61,"comments":[{"body":"know what sure why not","score":19,"comments":[]},{"body":"I've seen worse for more, id pay for that honestly.","score":11,"comments":[]},{"body":"Oh.  A custom. Meaning somebody commissioned him to paint a ufo painting? Customer took one glance at it and said \"I'm not hanging that on my wall dude.\" and now artist is humbled if not devastated? Or... perhaps vaingloriously plotting their next masterpiece?\n\nEdit: which they should plot their next masterpiece; never give up! Never surrender!","score":7,"comments":[]},{"body":"Sounds good","score":4,"comments":[]},{"body":"Kinda thought it was a parakeet flying the ufo, which made me really want it","score":4,"comments":[]},{"body":"The background is really good at least. It's the ufo and bird that look like shit.","score":3,"comments":[]}]},{"title":"Oh I didn’t know ray charles was an artwork appraiser","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"That's not a bad price for that. A tad steep maybe but it's not ridiculous.","score":14,"comments":[]},{"body":"is that blake lively?","score":2,"comments":[]}]},{"title":"Is it delusional to make a movie about dressing up as Batman and actually murdering Salman Rushdie?","not_safe_for_work":false,"locked":false,"body":"","score":162,"comments":[{"body":"There's a battle for the soul of this subreddit between \"here's someone charging way more for their art than anyone would be willing to pay\" and \"here's some art I think is bad\".","score":27,"comments":[]},{"body":"I think you got the subreddits wrong, you see this server is for bad art at a high price, meanwhile this shit is gold and free this belongs on r/art","score":15,"comments":[]},{"body":"*International Guerillas*. The way the plot was described to me made the Salman Rushdie character seem like a total badass who could only be taken out by divine intervention.","score":3,"comments":[{"body":"Surprisingly, that's exactly what he is in the film. He's a megalomaniacal Blofeld type villain who thwarts assassins at every turn.","score":1,"comments":[]}]},{"body":"Holy shit, that was a great watch, really funny and informative. Subscribed immediately.","score":4,"comments":[]},{"body":"Note: Felt this was pertinent as Rushdie was legitimately stabbed multiple times a few days ago.","score":19,"comments":[]},{"body":"It's not delusional. Its someone expressing themself.","score":3,"comments":[]},{"body":"[International Gorillay (1990)](https://youtu.be/KAQlYGeprhk)\n\nI can’t be the only one.","score":1,"comments":[]}]},{"title":"What a steal for this masterpiece","not_safe_for_work":true,"locked":false,"body":"","score":294,"comments":[{"body":"They are definitely selling drugs of some kind and using this as a covert way to advertise it. Only thing that makes sense.","score":81,"comments":[]},{"body":"They drew Lola as if she was a volleyball player.","score":23,"comments":[]},{"body":"let me just start sketching this out.  and.... i ran out of room for the ears, so now bugs bunny is bugs batty. \n\nabra ca pocus. \n\nhttps://youtu.be/NoSVnc-7eTk","score":14,"comments":[]},{"body":"Sorry bro you are about 12 years late.","score":8,"comments":[]},{"body":"r/CartoonGangsters","score":8,"comments":[]},{"body":"Bugs is trans?","score":5,"comments":[]},{"body":"Lola was spanked a few times before her doc appointment 🙃","score":18,"comments":[]},{"body":"I wouldn't pay 500 for it, but I would hang it on my wall.\n\nMaybe I'm delusional too.","score":7,"comments":[]},{"body":"As trite as this is, the same concept with wayyyyyyy better execution would be okay.","score":3,"comments":[]},{"body":"Looks like some decent Supermega merch to me","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"“Black Timmy Turner”","not_safe_for_work":false,"locked":false,"body":"","score":1085,"comments":[{"body":"since wen he a fairy","score":243,"comments":[{"body":"The third live-action movie, I think.","score":47,"comments":[{"body":"Don't. Don't speak such evils into existence.","score":33,"comments":[]}]}]},{"body":"Wait. Timmy Turner was white?!?","score":35,"comments":[{"body":"He was an \"Average kid\" therefore he couldn't [be black, or yellow, or brown](https://i.imgur.com/iPcyuom.jpg).","score":30,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"This seems like something butch hartman would actually draw","score":84,"comments":[{"body":"That’s what I’m saying, but the price is too low especially for what looks to be some sort of NFT?","score":17,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Gold teeth and a burglar's sack of cash. Not racist at all!","score":127,"comments":[{"body":"I want so badly for this to have actually been done by Butch Hartmann because fucking yikes","score":28,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"is that one of those nicktoon NFTS?","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This artist with a famous dad who makes lazy ‘art’ and then sells it for a ridiculous price","not_safe_for_work":false,"locked":false,"body":"","score":83,"comments":[{"body":"They’re cute but jeez those prices","score":38,"comments":[]},{"body":"Price aside, there's something fun there...it's a pricing issue.","score":21,"comments":[]},{"body":"I would buy this for £41 but definitely not anything over that.","score":8,"comments":[]},{"body":"Frame your child drawings and start making money","score":6,"comments":[]},{"body":"Who’s the famous dad?","score":7,"comments":[{"body":"Daniel Johnson? Just a guess","score":4,"comments":[]}]},{"body":"If you find yourself spending that amount of money on this bullshit you need fucking therapy.","score":3,"comments":[]},{"body":"It would be so cute but it’s so overpriced","score":2,"comments":[]},{"body":"Mister police. You could have saved her. I gave you all the clues","score":1,"comments":[]}]},{"title":"Did they even watch the movie?!","not_safe_for_work":false,"locked":false,"body":"","score":84,"comments":[{"body":"Piss ocean.","score":52,"comments":[{"body":"Remember Disney before they went Pea Sea?","score":12,"comments":[]}]},{"body":"When pee in the ocean","score":8,"comments":[]},{"body":"Good skill and clearly detailed. IMO given a better topic subject this artist would have done excellently","score":10,"comments":[{"body":"I don’t disagree","score":4,"comments":[]}]},{"body":"I’m very confused… isn’t this referencing a scene from the movie?","score":7,"comments":[{"body":"It’s depicting Ariel mourning Ursula","score":7,"comments":[{"body":"oh sorry I assumed that was her thinking of when she lost her voice","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"What a poor unfortunate soul.","score":8,"comments":[]},{"body":"Ariel is sad because Prince Eric has drowned in that lake of honey mustard.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Found my first one in the wild","not_safe_for_work":false,"locked":false,"body":"","score":73,"comments":[{"body":"[deleted]","score":23,"comments":[{"body":"Bro even criminals know to stay away from that shit","score":3,"comments":[{"body":"The person posting it will probably make a fake account and buy it that way they can turn dirty money into taxable clean income.","score":2,"comments":[{"body":"Pretty sure you’re not gonna get income out of-  oohhh wait I get it now.","score":1,"comments":[]}]}]}]},{"body":"They know what they have","score":7,"comments":[]},{"body":"Looks like a pepper drawn as Greg heffly","score":7,"comments":[]},{"body":"Instant download Lfmao what","score":3,"comments":[]},{"body":"Very fine masterpiece","score":1,"comments":[]}]},{"title":"so overpriced for a few simple brush strokes","not_safe_for_work":false,"locked":false,"body":"","score":29,"comments":[{"body":"thats def a little more than just “simple brush strokes” to create that texture in the cloud","score":21,"comments":[]},{"body":"Depending on size, that price is a steal for someone’s original, non derivative art. I feel like you just don’t like it?","score":14,"comments":[]},{"body":"I've been waiting for this moment,  for all my life.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"All the comments under this make my head hurt so much","score":3,"comments":[]},{"body":"Love how shipping is free. What a steal","score":2,"comments":[]},{"body":"Well at least they acknowledge in the title they don’t know what the fuck it is either","score":2,"comments":[]},{"body":"I actually kind of like this. The picture is set to a flurry of green strokes in the backdrop. This element of the picture alludes to how we inundate the earth with our greed. The grey part as a whole is obviously supposed to represent pollution in the air. However, the texture in the vertical column part  of the gray evokes notions of tornados. It juxtaposes man-made causes next to their natural-disaster effects—notably within one unitary element of the picture. Actions and their implications are one and the same. And, as the overall tone of the picture suggests: There will be a reckoning.","score":2,"comments":[]},{"body":"I like it","score":2,"comments":[]},{"body":"Beauty is in the eye of the beholder.","score":1,"comments":[]},{"body":"I like the textures, but I would prefer less muted colours.","score":1,"comments":[]}]}]}