{"name":"democrats","description":"The Democratic Party is building a better future for everyone and you can help.\n\nJoin us today and help elect more Democrats nationwide!\n\nThis sub offers daily news updates, policy analysis, links, and opportunities to participate in the political process. We are here to get Democrats elected up and down the ballot.","subscribers":431800,"posts":[{"title":"2022 Midterms Election Discussion Thread","not_safe_for_work":false,"locked":false,"body":"# It's Election Day!\n\n#####If you haven't voted yet, please make sure to vote. If you've already voted, try to convince your friends and family to vote too. In a democracy, the bucks stop with us.\n\nAs long as you can get in line before polls close, they have to let you vote!\n\n**Voting Resources:**\n\n* General information: [https://www.vote.org/](https://www.vote.org/) &amp; [https://www.vote411.org/](https://www.vote411.org/)\n* Find your polling place: [https://gttp.votinginfoproject.org/](https://gttp.votinginfoproject.org/)\n\n**If you see voter intimidation, call the Election Protection Hotline:**\n\n* English: 866-687-8683\n* Spanish: 888-839-8682\n* Bengali, Cantonese, Hindi, Urdu, Korean, Mandarin, Tagalog, or Vietnamese: 888-274-8683\n* Arabic: 844-925-5287\n* Or check: [https://866ourvote.org/](https://866ourvote.org/)\n\n**Results:** \n\n * [AP Advanced Votes Count](https://apnews.com/hub/2022-advanced-vote-count)\n * [PBS](https://www.pbs.org/newshour/elections-2022/results) | [Politico](https://www.politico.com/2022-election/results/) | [CNN](https://edition.cnn.com/election/2022)\n\n**Live Updates:**\n\n * [WaPo](https://www.washingtonpost.com/politics/2022/11/08/election-live-results-updates-2022/) | [NYT](https://www.nytimes.com/live/2022/11/08/us/election-midterms) | [CNBC](https://www.cnbc.com/2022/11/08/midterm-elections-2022-live-updates.html)\n * [r/politics Live Thread](https://www.reddit.com/live/19ou5cq6ex2vh)\n * [r/VoteDEM Live Thread](https://www.reddit.com/live/19ylr47b550d5/)\n\n**Election Day Live Coverage:**\n\n * [Reuters](https://youtu.be/PvTmeIq0-7o) | [NBC](https://youtu.be/MJWgLWe9dzs) | [CNN](https://edition.cnn.com/specials/live-video-0)\n\n**Election Night Live Streams:**\n\n * [PBS](https://youtu.be/qiklAfBdinw) (5:30pm)\n * [NBC](https://youtu.be/qqlTM78PtG4)  (6:00pm)\n * [WaPo](https://youtu.be/czuu6s0gew4) (7:00pm)\n * [C-span Results &amp; Speeches](https://www.c-span.org/video/?523602-1/election-night-results-speeches) (8:00pm)","score":126,"comments":[{"body":"Any updates on Bobo? Is it looking like we might squeeze the win here?","score":1,"comments":[]},{"body":"Just hearing that the Democrats actually had a chance at retaining the House majority. \n\nBut apparently, the Democratic Party of New York was too sure that they would win that they didn't bother spending money on more advertising in some districts. \n\nIn NY, Dems went from a 19-8 majority down to a 15-11 majority. Considering that Republicans control the House currently by fewer than ten votes, losing the 4 seats in NY is detrimental and has hurt the Democratic Party badly!","score":2,"comments":[]},{"body":"Can the current House (Dem controlled) introduce a bunch of bills, but hold off sending it to the Senate until next year when the Dems control the Senate?","score":6,"comments":[{"body":"Thats a million dollar question, but I guess no.","score":4,"comments":[{"body":"Do it and ask for forgiveness.","score":1,"comments":[]}]}]},{"body":"It’s completely vindicating that months after the GOP preemptively bragged about a “red wave”, the democrats not only managed to keep the senate but most likely even expand their majority by 1 seat in a midterm election where the dems were at a disadvantage.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Democrats keep control of the Senate","not_safe_for_work":false,"locked":false,"body":"","score":750,"comments":[{"body":"This is amazing news❤️🤍💙\nThanks to everyone who got out and VOTED!! In Nevada and everywhere else. We did it✊","score":108,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Good. Biden can keep un-ratfucking the Judiciary branch.","score":92,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"WOOOOHOOOO!!!!!!!!!!!!!","score":27,"comments":[]},{"body":"WOOHOO! Great news! Wish my state had helped contribute to this victory!","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Remember this in 2024. DO NOT LISTEN TO THE FUCKING FALSE POLLS. ORGANIZE AND VOTE.\n\nTo the people saying polls were accurate, they were not. Everyone was saying red wave and it’s a tactic to try to get people to not go vote by mentally defeating them before the game even starts.\n\nhttps://nymag.com/intelligencer/article/election-results-midterms-polls-right.html\n\nhttps://www.wral.com/the-red-wave-that-wasn-t-experts-explain-how-the-polls-got-the-midterm-elections-wrong/20570678/\n\nhttps://www.nytimes.com/2022/11/10/opinion/letters/midterm-elections-democracy.html","score":129,"comments":[{"body":"[removed]","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Just imagine what if D had kept those 4 flipped NY seat and 1 NJ seat that's quite unexpected... \n\nD could have kept both Senate and House.","score":54,"comments":[]},{"body":"Red wave huh lmfao","score":45,"comments":[{"body":"Well it was a wave… a wave of MAGA tears lol","score":19,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"[removed]","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Found this on Instagram","not_safe_for_work":false,"locked":false,"body":"","score":541,"comments":[{"body":"Hey, whatta bout that time when Obama wore a tan suit?","score":1,"comments":[{"body":"Remember when he had Dijon mustard?","score":1,"comments":[]}]},{"body":"Benghazi all over again.","score":1,"comments":[{"body":"Groundhog Day","score":1,"comments":[]}]},{"body":"Have at it","score":1,"comments":[]},{"body":"Hasn’t it already been investigated and they proved nothing?","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Republican voters: Is this what you voted for?","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Truth. Now make everyone realize this and holds their politicians accountable.","score":1,"comments":[]},{"body":"Republicans don’t know how to govern.  They only know how to obstruct.","score":1,"comments":[]},{"body":"I almost forgot the pedophiles in the basement.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Former Anti-Abortion Leader Reveals Another Supreme Court Breach — Leak Came From Friend of Arch-Conservative Justice Samuel Alito","not_safe_for_work":false,"locked":false,"body":"","score":441,"comments":[{"body":"Free paywall workaround:\n\nhttps://archive.ph/VUqvO","score":1,"comments":[]},{"body":"Proof that the right wing of the court is corrupt","score":98,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The court is compromised. Justice Roberts is a wimp.","score":87,"comments":[]},{"body":"So Alito is talking to friends about confidential SCOTUS information? Got it.","score":95,"comments":[{"body":"And he wonders why people have lost confidence in the court.","score":54,"comments":[{"body":"I doubt he wonders.  It’s a necessary reaction by a right wing Zealot playing the game, the game…”I am a highly respected human in a highly respected institution, therefore I must be angered at this, even though I know wholeheartedly that, I, myself am to blame.”","score":22,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"The truth is we knew that the Roe versus Wade Leak came from the conservative side when you suddenly heard stop talking about Investigating it.","score":32,"comments":[]},{"body":"Sounds like Alito is the leak to me","score":26,"comments":[]},{"body":"Alito, earlier this year: “It was a grave betrayal of trust by somebody.”","score":14,"comments":[]},{"body":"This is so interesting. I think it’s proof that Alito is completely corrupt.","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Conservative group sues FDA to revoke approval of abortion pill","not_safe_for_work":false,"locked":false,"body":"","score":359,"comments":[{"body":"The don’t tread on me people can’t stop treading on other people.","score":288,"comments":[{"body":"Don’t tread on me*\n\n*Some limitations apply. Offer only reciprocated if you are white, male, heterosexual, Christian, gun-owning member of the Republican or Libertarian party.","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They get to tread on you. No one gets to tread on *them*.","score":74,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Conservative group relentlessly attempts to drag America backwards","score":63,"comments":[{"body":"Make America 1890 again.","score":24,"comments":[]}]},{"body":"Outlaw Viagra. If you can't get it up, then that is God's will.","score":140,"comments":[{"body":"1000 up votes!","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Conservative group files lawsuit for a national ban on the abortion pill.\n\nWayback Machine archive of post: [http://web.archive.org/web/20221119022058/https://www.washingtonpost.com/business/2022/11/18/abortion-pill-lawsuit/](http://web.archive.org/web/20221119022058/https://www.washingtonpost.com/business/2022/11/18/abortion-pill-lawsuit/)","score":36,"comments":[]},{"body":"This isn't solely an abortion pill, which is why it's so fucked. It's a steroid used for hyperglycemia in the setting of Cushing's sydrome and for uterine leiomyomas. It can even be used in women whose pregnancies have gone beyond term to help induce labor.","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This part of a larger tactic used by Conservatives, wherein they’re using the court system to legislate what they can’t get passed through legislatures and the normal democratic process.","score":93,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Herschel Walker Called on Biden to Take a Mental Fitness Exam. But He Won’t Do the Same.","not_safe_for_work":false,"locked":false,"body":"","score":76,"comments":[{"body":"Herschel Walker sounds like a guy talking to you in a foreign language but he's drunk and you're also drunk\n\nHerschel Walker sounds like the Quentin Tarantino remake of the grandfather clock from Captain Kangaroo\n\nHerschel Walker is cosplaying the last three chapters of Flowers for Algernon\n\nEvery time I see Herschel Walker campaigning in public, I imagine his mama backstage sobbing into the arms of someone from Make-A-Wish","score":1,"comments":[]},{"body":"He should be tested for CTE.  Too bad that can’t be done while he is alive.  Seriously.","score":1,"comments":[{"body":"Yeah, there’s no way he doesn’t have CTE.","score":1,"comments":[]}]},{"body":"From the article:\n&gt;his ex-wife says he once held an ex-gun to his head.\n\nI didn't know you could divorce a gun.","score":1,"comments":[]},{"body":"Has Herschel taken a drug test lately??","score":1,"comments":[{"body":"All the \"smart pills\" in the world can't fix what's broke inside that skull. That man \"ain't right.\"","score":1,"comments":[{"body":"lol...... agreed!!","score":1,"comments":[]}]}]},{"body":"When asked to spell the word dumb, Herschel barked out \"D U M.\" \n\nTHIS is 'senator material' for Georgia?! The GOP is working a scam on millions of people, folks. The man may have been strong as an ox for football, but he has only a damaged ox brain for a CNS.","score":1,"comments":[]},{"body":"Herschel should have an abortion to see what he's made countless women do.","score":1,"comments":[]}]},{"title":"Key Evangelical Figures Turn On Trump: 'He Used Us'","not_safe_for_work":false,"locked":false,"body":"","score":47,"comments":[{"body":"BULLSHIT. \n\nIf anyone was using anyone, Evangelicals used Trump to steal the Supreme Court and turn it into a religious council.  They got their abortion ruling, now they are ready to move on only because he no longer has the power to do their bidding.  \n\nMake no mistake, their guy was Mike Pence, who would not have won a single primary. Not. One.  \n\nIt’s true Trump could not have won without evangelical support, but they are the ones that had to swallow their pride and embrace “grab em by the pussy”.","score":1,"comments":[{"body":"I agree Absolutely hypocritical","score":1,"comments":[]}]},{"body":"Notice that the ministers who were mentioned in this article were not against Trump for moral or ethical reasons, rather, they no longer see him as an effective candidate capable of moving their political/theocratic agenda forward.","score":1,"comments":[]},{"body":"Doh!  or Duh?","score":1,"comments":[]},{"body":"Lol, ya right. You both got into bed together. You're both dangerous. The founding fathers knew! The third quote down is right on the money! \n\n\n\nThe Founding Fathers made it pretty clear what they thought about religion.\n\n\"The government of the United States is not, in any sense, founded on the Christian religion\"\n- Treaty of Tripoli\n\n\"Religious bondage shackles and debilitates the mind and unfits it for every noble enterprise.\"\n- James Madison\n\n\"In every country and in every age, the priest has been hostile to liberty. He is always in alliance with the despot, abetting his abuses in return for protection to his own.\"\n- Thomas Jefferson\n\n\"Have you considered that system of holy lies and pious frauds that has raged and triumphed for 1,500 years?\"\n-John Adams\n\n\"And the day will come when the mystical generation of Jesus, by the supreme being as his father in the womb of a virgin will be classed with the fable of the generation of Minerva in the brain of Jupiter.\"\n- Thomas Jefferson\n\n\"This would be the best of all possible worlds, if there were no religion in it.\"\n- John Adams\n\n\"Christianity neither is, nor ever was a part of the common law.\"\n- Thomas Jefferson\n\n\"Experience witnesseth that ecclesiastical establishments, instead of maintaining the purity and efficacy of religion, have had a contrary operation. During almost fifteen centuries has the legal establishment of Christianity been on trial. What has been its fruits? More or less, in all places, pride and indolence in the clergy; ignorance and servility in the laity; in both, superstition, bigotry and persecution.\"\n- James Madison\n\n\"The purpose of separation of church and state is to keep forever from these shores the ceaseless strife that has soaked the soil of Europe in blood for centuries.\"\n- James Madison\n\n\"Whenever we read the obscene stories, the voluptuous debaucheries, the cruel and torturous executions, the unrelenting vindictiveness, with which more than half of the Bible is filled, it would be more consistent that we call it the word of a demon than the word of God. It is a history of wickedness that has served to corrupt and brutalize mankind.\"\n- Thomas Paine\n\n\"All national institutions of churches, whether Jewish, Christian or Turkish, appear to me no other than human inventions, set up to terrify and enslave mankind, and monopolize power and profit.\"\n- Thomas Paine\n\n\"There is not one redeeming feature in our superstition of Christianity. It has made one half the world fools, and the other half hypocrites.\"\n- Thomas Jefferson","score":1,"comments":[{"body":"Fantastic, thank you","score":1,"comments":[]}]},{"body":"The Use was mutual.","score":1,"comments":[]},{"body":"they both used each other and both deserve each other\n\nand everyone knows that once Trump wins the nomination, they'll fall in line","score":1,"comments":[]},{"body":"Uh, are y'all looking for forgiveness?  You yourselves said there is none....sorry..","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Yet...","not_safe_for_work":false,"locked":false,"body":"","score":576,"comments":[{"body":"Jail comes after trial, trial comes after charges are pressed, charges are pressed after a prosecutor feels confident they have enough evidence to definitively prove a crime.  \n  \nThings like evidence gathering and case building happen behind the scenes, and we sure as shit don't want to bring Trump to trial only to be found not guilty - *because the case against him was rushed.* That would suck.  A lot.","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"At least 87 million people in this country are asking!","score":58,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oh a lot of people are asking it. There's just a quiet answer we all know.\n\nTurns out the rich really are completely above the law","score":15,"comments":[{"body":"Yes.  They get to negotiate if they have to testify.","score":7,"comments":[]}]},{"body":"Because our world is failing.. and our species is dying. Social media distracts us, our lives distract us, we’re living through the fifth mass extinction that we’ve induced. Our nation continues to see 70% of our wealth accumulate in the hands of 3% of our population, and everyone who is not in that group is suffering. Many old people say “thank goodness I won’t be around much longer to see the world burn” and many young people say “No, I won’t have kids, I won’t put them through the apocalypse that climate change will bring”…. So not many care, even if he is one of the worst people of our time. \n\nI believe it can be saved, and many of us, young and old, are working to help us become the society that we should be… but the world is in a really, really bad place and everything is happening very, very quickly.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[removed]","score":12,"comments":[{"body":"He is rich, yeah, but our justice system has problems and is corrupted.","score":9,"comments":[{"body":"We don't have a justice system. We have a court system.","score":4,"comments":[]},{"body":"Why Dave Chapelles SNL opening monologue was on point about the honest liar part.","score":3,"comments":[]}]}]},{"body":"Everyone is asking that","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Nevada is 1 of 5 states with over 10% Asian Americans. Both parties courted vote, but Dems won out.","not_safe_for_work":false,"locked":false,"body":"","score":62,"comments":[{"body":"The parties use different pitches to woo Asian-Americans:\n\nDemocrats: \"Join us, and together we will fight discrimination in all of its forms!\"\n\nRepublicans: \"Hey, you wanna help us hate on black people, Hispanics, and gays?\"","score":14,"comments":[{"body":"Yeah, you don't know how older Asian generations are 100% on board with being against black people, Hispanics, and LGBT.\n\nJust glad that Asian Americans in NV aren't as hard-headed as the rest of the Asian community.","score":1,"comments":[{"body":"Sounds like you're stereotyping Asians. I understand that older people in general are more likely to be racist than younger people, but I think it's unfair to say that Asians are more racist than the general population.","score":1,"comments":[]}]}]},{"body":"That's because the few Republicans that actually think COVID is real blame them for it","score":1,"comments":[]},{"body":"\"damn Gus, we need to bring back them Japanese internment camps like they had back in the war\"","score":1,"comments":[]}]},{"title":"Fox’s coverage of violent crime dropped after the midterms","not_safe_for_work":false,"locked":false,"body":"","score":841,"comments":[{"body":"So electing Democrats reduced crime?","score":144,"comments":[{"body":"Thanks Obama!","score":65,"comments":[{"body":"Obama is the best!","score":20,"comments":[]}]}]},{"body":"Are they still taking about the caravan?","score":50,"comments":[{"body":"Do you know how many times I saw the SAME EXACT footage of the same exact immigrants over and over and over again on Fox News lol\n\nIt's like they managed to find 1 video of immigrants crossing the border and just re-ran that footage a thousand times, yet every single week there was supposedly a brand new caravan coming to INVADE America lol\n\nFox is a trash tabloid channel. No different than tabloid magazines that used to say the queen is a mutant alien vampire and stalks the streets of London at night feeding on the innocent.\n\nFox doesn't do facts. They sell fantasies.","score":50,"comments":[{"body":"&gt;Do you know how many times I saw the SAME EXACT footage of the same exact immigrants over and over and over again on Fox News lol  \nIt's like they managed to find 1 video of immigrants crossing the border and just re-ran that footage a thousand times, yet every single week there was supposedly a brand new caravan coming to INVADE America lol\n\nThey did the same thing with their segments on the so-called \"New Black Panthers\", always showing the same 3-4 Black dudes hanging around a random polling place.","score":11,"comments":[{"body":"And then there was the Black Hammer. Conservatives had a field day with that one where they screeched about blm because \"muh communists waaaah! blm are all communists who want to destroy the world and america!\"\n\nAnd then it was revealed that it was actually funded by Russia. After that they sided with the fucking *proud boys* to oppose vaccine mandates.\n\nit's a joke. everything Conservatives are outraged about is manufactured by them","score":9,"comments":[]}]}]},{"body":"Last I hard about the caravan was the day of the 2018 midterms. It just went ‘poof’ after that","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Gas prices has dropped too... very curiously.","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Imagine that. A bunch of repugs also ran on an anti crime platform. But, alas, they are now off in conspiracy land chasing imaginary foes. Smh.","score":61,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Obama: Democrats 'thumped' election deniers in key midterm races","not_safe_for_work":false,"locked":false,"body":"","score":64,"comments":[{"body":"Lol","score":3,"comments":[]},{"body":"To me, whether the Republicans have 218 or 238 seats doesn't matter as long as they are in charge of the House.  They are gonna do everything they can to extract revenge on the Democrats.  The only good thing about 218 or 219 or 221 is that there are enough of them who don't like McCarthy, that he might actually not become Speaker.  That would be nice, but other than that, I don't see \"thumping the election deniers,\" as that big of a win.  I suppose in the SOS races, it's a good thing though.","score":2,"comments":[]},{"body":"Indeed President Obama. You might even say they took..a shellacking?","score":1,"comments":[]},{"body":"Then there is Ohio, who chose one over Tim Ryan. Jeez.","score":1,"comments":[]}]},{"title":"Opinion | Nancy Pelosi, Badass","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"This article may be behind a paywall. You can add 2-4 paragraphs as a quote in a comment. *Do not post the text for the entire article.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"“Ms. Pelosi is an original, and we are unlikely to see another leader of her ilk any time soon. She elbowed her way to the tippy top of the congressional boys’ club, then set about distinguishing herself as the most formidable, most effective House leader since the middle of the last century. Love her or hate her, you have to acknowledge the fundamental badassery.”","score":11,"comments":[]},{"body":"The G.O.A.T.","score":1,"comments":[]},{"body":"Archive link: \n\nhttps://web.archive.org/web/20221117181252/https://www.nytimes.com/2022/11/17/opinion/pelosi-speaker.html","score":2,"comments":[]},{"body":"[removed]","score":1,"comments":[{"body":"How’s the weather in Russia?","score":1,"comments":[{"body":"[removed]","score":1,"comments":[]}]}]},{"body":"[removed]","score":1,"comments":[{"body":"Russian talking point.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"title":"Opinion | Democrats Need to Realize How Much Dobbs Mattered","not_safe_for_work":false,"locked":false,"body":"","score":62,"comments":[{"body":"This article may be behind a paywall. You can add 2-4 paragraphs as a quote in a comment. *Do not post the text for the entire article.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"“\nBesides the grandmother in the ad, there are young adult grandchildren to credit for the midterm results. The generation for whom the overturning of Roe v. Wade will mark a defining political moment showed up in force to vote. Early estimates show 27 percent of young people turned out — the second highest percentage for a midterm in the past 30 years, after a record year in 2018 following Donald Trump’s election — and 63 percent of them voted for Democratic House candidates.\n\nThe effort to restore abortion rights through a coalition that includes voters who supported right-wing candidates won’t be easy or uncomplicated — but the midterm results show it is well underway.\n\n“It took 50 years for people to undo Roe,” Virginia Kase Solomón, C.E.O. of the League of Women Voters, said. “We’re hoping that it’s not going to take that long to restore it, but we know that we have a road ahead of us.”","score":3,"comments":[]},{"body":"We do, it's *you* NYT (and yes, I do see you flailing for attention Sen. Sanders) who not only discounted its impact, but posted near fault \"DeMs In DiSaRrAy\" articles.","score":1,"comments":[]}]},{"title":"Get Ready For Bigger Paychecks: Record High Increases Expected In 2023","not_safe_for_work":false,"locked":false,"body":"","score":43,"comments":[{"body":"Don’t do that. Don’t give me hope.","score":11,"comments":[]},{"body":"Lol yeah ok. I’ll believe it when I start making a living wage.","score":10,"comments":[]},{"body":"\"Certain jobs will get a disproportionate share\"  Yeah.. CEO's, upper management.. The rest of us .. nothing happening here but fluff to make rich people feel better.","score":7,"comments":[]},{"body":"RemindMe! 90 Days","score":3,"comments":[]},{"body":"I actually found out yesterday that my department is getting about a $3 an hour raise starting next pay period. I just about fainted. Still not enough to live on my own but a lot better.","score":3,"comments":[]},{"body":"Please tell my boss this","score":2,"comments":[]},{"body":"Yeah I doubt that’s happening. No raises since 2019, but I’m at the top of the pay scale the company is willing to pay for my position, and I can’t find anything else nearby for more.","score":2,"comments":[]},{"body":"I know it’s not for everyone, but this is why you go into sales.\n\nMy degree was not attained for sales, but I saw the righting on the wall, and made the commitment to be good at it\n\nAside from that, promotions and salary increases come from moving to other companies from what I have seen… if your company isn’t paying you, perhaps someone else will","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What this means in reality:\nCertain jobs ( in demand) will get wage increases, many won't do as well or get one at all.\nCompanies will make that up somehow - either  by raising prices or reducing headcount.or a combination","score":1,"comments":[]}]},{"title":"Trump faces potential fundraising problem as megadonors jump ship","not_safe_for_work":false,"locked":false,"body":"","score":30,"comments":[{"body":"This won’t slow him down. He’s gonna take one more wild ride with this party and I think it’s gonna be like watching an untied balloon thrashing around the room in a spectacular frenzy, until it abruptly drops to the floor, wheezing it’s last limp breath into the carpet fibers of a dark corner, still damp by the time the room has emptied and most are already denying they were ever there.","score":1,"comments":[]}]},{"title":"How beating up Big Oil helped Dems hold the Senate","not_safe_for_work":false,"locked":false,"body":"","score":17,"comments":[{"body":"Good, now windfall tax the shit out of them.","score":1,"comments":[]},{"body":"I didn't hear any 'beating up big oil'... I'd have pointed out that they were taking in huge profits while gas prices were rising.. then I wouldn't have received campaign funds by them.. maybe that why Dems didn't make a bigger deal out of it?..","score":1,"comments":[]}]},{"title":"Judge says Georgia law allows Saturday voting for runoff","not_safe_for_work":false,"locked":false,"body":"","score":424,"comments":[{"body":"This whole thing is blatantly political voter suppression. The republican secretary of state says counties are **not allowed** to hold Saturday voting. The argument against him is not that they **must**, but simply that they **may**. Most counties still won't. The big counties (read: Democrat) probably will.","score":12,"comments":[{"body":"Sounds like they're only handicapping themselves then","score":6,"comments":[]}]},{"body":"As long as there is only one voter per car. Or bike. Or taxi.","score":16,"comments":[{"body":"And the car only has two wheels, the bike has no handle bars and the taxi is from the UK.","score":9,"comments":[]},{"body":"If your a single woman under the age of 31 you can’t vote.","score":5,"comments":[]}]}]},{"title":"Democracy’s Dunkirk","not_safe_for_work":false,"locked":false,"body":"","score":36,"comments":[{"body":"[removed]","score":2,"comments":[{"body":"Democrats have flipped the Minnesota Senate, Michigan Senate, Michigan House of Representatives, and Pennsylvania House of Representatives from Republican control.   With the exception of Wisconsin, which has a Democratic Governor, you basically have an electoral map that even if -**if  -** the worst case scenario of electoral governance was given entirely to state legislatures, there are enough split and Democratic legislatures along with Democratic governors to avert a total takeover. \n\nThere is also no guarantee that the supreme court would hand over total control to legislatures, especially since it would nullify the judiciary - and thus its own - power over elections. \n\nStop fucking dooming.","score":18,"comments":[]}]}]},{"title":"Democrats’ quietly effective strategy for defeating election deniers — Inside the strategy that carried Democratic secretary of state candidates to victory.","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[]},{"title":"What priorities are you hoping the House GOP with its majority will tackle in the next Congress?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"I ran an experiment. \n\n🤣 \n\nThere was ONE sensible response. \n\nThis, people, is why Republicans keep getting votes. Their voters actually believe this shit.","score":1,"comments":[]},{"body":"I really hope House RUpubliclowns offer melted butter for the popcorn audience. Can't run a 3-ring circus on the House floor without it. 😎","score":1,"comments":[]},{"body":"I am just hoping that they act like responsible adults; but I’m not going to hold my breath.","score":1,"comments":[]},{"body":"I hope they tackle inflation and cost of healthcare. All the things democrats tackle that republicans act as if they can do better. Let’s see it.\n\nWhat we we get is endless yapping about Hunter Biden’s computer and impeach Joe Biden nonsense and probably an anti-gay/trans bill thrown in for good measure just to show conservative voters they dislike queer people too.","score":1,"comments":[]},{"body":"It’s the exact opposite of delusions like Hunter’s laptop!","score":1,"comments":[]}]},{"title":"Voters who backed GOP governors helped keep the Senate blue — Ticket-splitting between those offices fell to its lowest rate in decades, but it played an important role in Democrats’ Senate win.","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"At this point, I can't consider a vote for a Republican or 3rd party in a vote for a federal or state office. The Republicans in congress and the state houses vote as a bloc against any measures to protect voting rights, election integrity, or the environment. For the sake of the planet and our democracy, I can't vote in good conscience for anyone but a Democrat, except for local races.","score":1,"comments":[]}]},{"title":"😂","not_safe_for_work":false,"locked":false,"body":"","score":217,"comments":[{"body":"I hate the Sooners, but I would never falsely accuse them of having Trump as a fan.","score":3,"comments":[]},{"body":"The only thing stuff like this is attacking is the person Trump's face was photoshopped over if you think about it.\n\nIt's really poor taste imo.","score":4,"comments":[]},{"body":"You obsessed or something? Man is done and dusted clearly. Focus on your own exercising and weight loss maybe instead of fucking over some random person with your trashy meme","score":3,"comments":[]},{"body":"OMG, that's so real!!","score":1,"comments":[]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"There was an attempt ....\n\n\n... to stay out of prison.","score":1,"comments":[]}]},{"title":"Opinion | There Are No Lone Wolves","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"This article may be behind a paywall. You can add 2-4 paragraphs as a quote in a comment. *Do not post the text for the entire article.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Paywall removed","score":1,"comments":[]}]},{"title":"Jeffries announces bid for House Democratic leader that would make history","not_safe_for_work":false,"locked":false,"body":"","score":603,"comments":[{"body":"I wonder why my dog is going crazy. Trying to hide his ears as if a million dog whistoes suddenly started blaring at once. Poor thing, maybe I should see a vet. Oh no wait, it's just conservatives responding to the new democratic congressional leadership.","score":113,"comments":[{"body":"Tell doggo it's okay, Republicans just say the bigoted stuff directly out loud these days. The hoods are off. It should spare the dog's eardrums an extra rattling.","score":37,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I want the Speaker and the Whip to be effective leaders. It is going to take every person they can get to get any legislation done. Republicans are already doing what they said they would do. Which is everything except handling inflation, supply chain,  and gas prices. Two years of chaos.","score":25,"comments":[{"body":"Whip is a different position if that's what you meant. Jeffries would be the minority leader, not the whip. There are majority and minority whips who are below the Speaker and party leaders.","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"He'll be fine. You don't need to be a good speaker to be a good House leader. Nancy was brilliant at it but not exactly the best at speaking. Plus she'll be there to aid him and get him up to speed.","score":20,"comments":[]},{"body":"First thing republicucks are gonna do is ask for his birth certificate","score":94,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Can I just be happy that we finally have a Gen Xer as House Democratic Leader, instead of a member of the Silent Generation or Baby Boom? \n\nLet's see some changes. Let's see some more Millennials in prominent positions, too.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He’s making history, but even better he’s qualified for the job. I’m excited for some fresh leadership in the Democrat Party.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Can’t wait to see his style. I really hope its something new, not radical, but new.","score":37,"comments":[{"body":"When your name is \"Hakeem\", pouring a glass of milk is going to seem radical to some people.","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The \"Christian Party of Law and Order\"...South Dakota Republican Charged With Rape After Losing Election to His Mom","not_safe_for_work":false,"locked":false,"body":"","score":772,"comments":[{"body":"Oh, you are telling me a Republican is accused of a sex crime? Color me suprised!","score":157,"comments":[{"body":"I'm sure qanon is on the case!","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"And he's so proud.  And was fourth with 22%. Ugly.","score":68,"comments":[]},{"body":"Republicans are now a threat to American values - these cult has failed to separate Church and State!  These Republicans are on the wrong side of history!","score":53,"comments":[{"body":"They are trying to take us back to the 1800’s that’s for sure. They’ve been saying the separation is to keep the government out of churches not the other way around. Like look lady you can’t have your cake and eat it too but ya they want everything both ways that benefit them no compromises they truly believe they’re being oppressed and fighting for “rights”","score":10,"comments":[{"body":"Republicans are now a threat to our union! In my opinion!","score":8,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Lock him up! Throw away the key. Forget he ever existed.","score":15,"comments":[]},{"body":"Most have lost their minds due to extreme violent fake news sites.","score":7,"comments":[]},{"body":"And multiple warrants outstanding from the Ogallala Sioux Tribal Police.... Exactly the kind of person who would commit a crime on tribal land and then scoot over the border where they don't have jurisdiction. #VAWA","score":9,"comments":[]},{"body":"So the bleeding gash on his forehead was apparently from an encounter *before* the rape.  Like, dude was showing his @$$ before he even got around to sexual assault.\n\nDefinitely a contender for the 2024 GOP nom.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Rep. Hakeem Jeffries announces bid to replace Nancy Pelosi as Democratic leader","not_safe_for_work":false,"locked":false,"body":"","score":461,"comments":[{"body":"Republicans probably: Hakeem? More like Ha-show us your birth certificate.","score":99,"comments":[{"body":"\"More like Ha-Kenyan Muslim, amirite?\"","score":45,"comments":[]}]},{"body":"I like him tho, he is solid","score":44,"comments":[{"body":"I’d hope so. Would be pretty weird if one of our party’s leaders was liquid","score":28,"comments":[{"body":"As a politician you’d expect him to be a gas actually, all hot air.","score":8,"comments":[]}]},{"body":"Let's hope he can channel his inner LBJ and get stuff done..","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Can’t wait for GOP to continue to be more racist","score":31,"comments":[]},{"body":"Gen X in the House. He’s great and will be aggressive about calling out GOP tomfoolery. He’s Pelosi’s chosen successor and never bet against the Queen.","score":65,"comments":[{"body":"Lets hope. Dems need to get a lot more aggressive to minimize the damage from Republican cheating and misinformation.","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"All I hear is popping sounds. Is that repub heads exploding?","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"House Democrats Will Soon Be Under New Management. Here Are Their First Big Challenges.","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[]},{"title":"GOP operative illegally funneled Russian money to Team Trump","not_safe_for_work":false,"locked":false,"body":"","score":337,"comments":[{"body":"So, yet again, Hillary was right.","score":21,"comments":[]},{"body":"The cult treason party!  These Republicans are now the enemy of American values and not to be trusted in my view!","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"- Republican operative Jesse Benton was pardoned by Donald Trump for one crime, only to get busted again soon after for a similar crime.\n\n- If you’ve never heard the name Jesse Benton, [this](https://www.washingtonpost.com/dc-md-va/2022/11/17/benton-trump-russian-vasilenko-guilty/) Washington Post report on his criminal conviction yesterday might not seem especially notable. But don’t click away just yet, because Benton’s career trajectory is what makes this story amazing.\n\n*A Republican political strategist was convicted of illegally helping a Russian businessman contribute to Donald Trump’s presidential campaign in 2016. Jesse Benton, 44, was pardoned by Trump in 2020 for a different campaign finance crime, months before he was indicted again on six counts related to facilitating an illegal foreign campaign donation. He was found guilty Thursday on all six counts.*\n\nAs a separate Washington Post report noted last year, Benton’s career trajectory is a sight to behold. It began in earnest 14 years ago, when the GOP operative worked on then-Rep. Ron Paul’s 2008 presidential campaign. Two years later, Benton took the next logical step and ran Rand Paul’s Senate campaign in Kentucky.\n\nTwo years after that, Benton went back to the other Paul, running the Texas congressman’s 2012 presidential campaign before agreeing to return to Kentucky in order run Sen. Mitch McConnell’s re-election campaign, all while preparing to run the younger Paul’s 2016 presidential campaign.\n\nIn 2013, however, a problem arose: Benton was caught up in a scandal involving an attempt to buy an endorsement. He was later indicted as part of the fiasco, but that didn’t stop a pro-Trump super PAC from hiring Benton anyway in March 2016.\n\nTwo months after getting the new gig, Benton was convicted, but he continued to do political work in 2016, including engaging in efforts to assist a Russian national who want to support Trump.\n\nIn September 2016, Benton was convicted as part of the previous bribery scheme, but he avoided a prison sentence and was ordered to serve two years of probation. He later picked up a pardon from Trump, who had an unfortunate habit of handing out pardons to Republicans accused of corruption.\n\nBut Benton was then indicted again, not for the 2013 campaign-finance violation, but instead for the 2016 campaign-finance violation: He was charged with helping funnel money to Team Trump from a Russian national. The operative was convicted yesterday.\n\nIn other words, Benton was pardoned by Trump for one crime, only to get busted again soon after for a similar crime.\n\nBenton is currently awaiting sentencing. If he’s waiting for another presidential pardon, I have a hunch he’s going to be disappointed.","score":10,"comments":[]},{"body":"Of course he did. I’m just glad the gop has found a new douche bag for the conservative turds to flock to. DeSantis is like a methadone clinic for trumpsters.","score":10,"comments":[{"body":"yet still a fascist","score":5,"comments":[]}]},{"body":"Crime we were aware of before he ran for president..yet he still became president.. committed more crime.. his impeachment was ignored by the Republican Senate at the time.. now we have mountains of proof of his further crimes along with insurrection, stolen documents etc..  and somehow this human bag of trash is free and seeking reelection.. WTF is wrong with our legal system that poor people are still in prison for smoking pot and a rich person can walk free while being a traitor to the country...I think I'll fall down with disbelief if this asshat ever pays for his crimes.","score":7,"comments":[]},{"body":"Will they give the money to charity or forfeit it somehow?","score":3,"comments":[]},{"body":"No surprise here.","score":3,"comments":[]},{"body":"shocked I am shocked","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"‘I feel gay, disabled … like a woman too!’: Infantino makes bizarre attack on critics","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"Wow a woman too! The lowest of the low.","score":1,"comments":[]}]},{"title":"Texas Republican files longshot bill to dissolve the city of Austin (very Democratic city)","not_safe_for_work":false,"locked":false,"body":"","score":206,"comments":[{"body":"So we're clear, the anti-democracy crowd hasn't disappeared after this past Election Day.","score":118,"comments":[{"body":"Yup… still lots of work to do. Democracy a real maintenance bear.","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I can only assume Republicans have vast amounts of acid.","score":24,"comments":[{"body":"It’s Texas. The republicans have guns not acid","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"i didn't read the article but...how would this work, exactly? or what would the Texas GOP think would happen? would the entire city and it's residents just disappear into thin air? even if they did 'abolish' the city of Austin or whatever, the voters would still be there and would still vote in elections. \n\n....why am i even trying to make sense of the modern GOP?","score":22,"comments":[{"body":"It would become an unincorporated town under the administration of its county. It could no longer hire its own police force, pass its own laws, collect taxes, nor take out bonds for public works.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Fucking Republicans and Texas Republicans are even worse 🤦‍♂️","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What are they gonna do, snap their fingers like Thanos and make Austin disintegrate?","score":54,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Into what? Water?","score":7,"comments":[]},{"body":"Fuck Texas","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Whoever replaces Pelosi has less to fear than McCarthy does","not_safe_for_work":false,"locked":false,"body":"","score":41,"comments":[]},{"title":"Barack Obama Shows What Fox News Destroyed In American Politics","not_safe_for_work":false,"locked":false,"body":"","score":73,"comments":[{"body":"Fox \"news\" is a weapon of mass destruction!","score":9,"comments":[{"body":"Absolutely","score":1,"comments":[]},{"body":"Yes. And the Murdochs have destabilized democracy here, in Australia, and Europe. So much evil from one little profiteering family and its sleaze rags.","score":1,"comments":[]}]}]},{"title":"Benghazi Times Infinity: What To Expect From the Republican House Majority","not_safe_for_work":false,"locked":false,"body":"","score":91,"comments":[{"body":"I suspect it won’t turn out like Benghazi though. \n\nIt ruined Hilary’s reputation. \n\nThis will just ruin their reputation further. \n\nIt’s hilarious that investigations are their priority. Not actual policies.","score":27,"comments":[{"body":"It's not hilarious at all. They'd prefer Americans to suffer while they perform theatre.","score":29,"comments":[{"body":"Aggregation of power for the sake of power. Not governing. All Republican office holders (with few exceptions) are trying to figure out how they can personally profit from catering to billionaires and corporations. They pander to zealots/crazies/white supremacists/authoritarians to scrape together enough voters, even if it means scrapping democracy.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"That's the thing we're \"expected\" to just deal and let these Nazi crazies wreak havoc on our government. Instead of demanding that  they act like adults and do the job they've been elected for, without wasting millions of our dollars on absolute nonsense! But as usual the Dems will lay down and take it. We should have an absolute fit about it! CALL YOUR REPS!!!","score":16,"comments":[]},{"body":"The Dems will just sit by quietly and do their jobs while Republicans will file a bunch of pointless things that will die immediate but will further rile up their base which is all they care about.","score":11,"comments":[]},{"body":"They’re going dredge up But Her Emails- Mmmmm buttery males. Then Benghazi. Then Pizzagate. On a continuous loop.\n\nMeanwhile the Dems will be trying to get legislation crafted and passed. It’s like living in two different countries.","score":2,"comments":[]},{"body":"Hearings daily on various people.  The revenge tour for 2 years.  Republicans will continue to not work.  \"Nay\" rubber stamp is full of ink. \n\nPlease, Georgia friends, remind your Thanksgiving friends and family to vote Senator Warnock.","score":2,"comments":[]},{"body":"The sad truth is that the gop base believes in this bs!","score":1,"comments":[]}]},{"title":"Hey Starbucks, your workers are more important than red coffee cups. No more union busting. No more delaying collective bargaining agreements. I'll continue fighting to pass the #PROAct to hold all corporations accountable for union busting, including Starbucks.","not_safe_for_work":false,"locked":false,"body":"","score":85,"comments":[{"body":"I strongly support unions. \n\nMy user name should tell you that.","score":3,"comments":[]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Boycott Starbucks! No money to Union busters.","score":1,"comments":[]},{"body":"[deleted]","score":0,"comments":[{"body":"Sounds like some great bullet points for a non-union shop.","score":1,"comments":[{"body":"[deleted]","score":1,"comments":[{"body":"Again, union buster bullet points.","score":1,"comments":[]}]}]}]}]},{"title":"Wondering where to direct your anxiety about the GA runoffs? Volunteer to write letters to Georgia voters! There’s still 107k voters left to reach. I just checked and was surprised there’s still more left. Grab 5 or 20; together we can make a difference!","not_safe_for_work":false,"locked":false,"body":"","score":48,"comments":[{"body":"Hey. VoteFwd, we could've used a letter writing campaign to CO-03 this year","score":3,"comments":[{"body":"Yeah I wonder how the results will inform their selection of key races next time. I agree, tho!","score":3,"comments":[]}]},{"body":"My 40 letters are already in the mail❤️","score":3,"comments":[{"body":"My 60 went out today!","score":5,"comments":[]}]},{"body":"Throw in a gift card or something when you get to my letter.","score":2,"comments":[]}]},{"title":"Who is Jack Smith, the special counsel named in the Trump investigations","not_safe_for_work":false,"locked":false,"body":"","score":31,"comments":[{"body":"Garland has enough to charge.  Good idea","score":9,"comments":[]},{"body":"Guys' resume reads like a rock star! Let's see what happens, shall we?","score":9,"comments":[]},{"body":"With such a generic name, the crazies on the right are going to start copious rumors with any criminal activity committed by anyone with that name.","score":8,"comments":[]},{"body":"Based on his experience, sounds like there may be some possible international crimes/criminals related to Jan 6.","score":7,"comments":[]},{"body":"If he's the same Jack Smith I went to high school with 50+ years ago, we're in trouble","score":3,"comments":[{"body":"If he’s the same Jack Smith people went to Harvard with 40 years ago, Trumps in trouble.","score":1,"comments":[]}]},{"body":"[deleted]","score":0,"comments":[{"body":"Yeah, that's the thing to take from this.\n\nKeep up those mental gymnastics, Russia will hire you someday!","score":6,"comments":[]}]}]},{"title":"Judge blocks DeSantis law on barring ‘woke’ education","not_safe_for_work":false,"locked":false,"body":"","score":1058,"comments":[{"body":"I'm so lost on how the republicans define \"woke\" I'm at the point I just assume they mean anyone who's not a straight white christian gun owner. It honesty seems most appropriate.","score":87,"comments":[{"body":"Yeah you are not confused. \n\nThat’s their definition.","score":15,"comments":[]},{"body":"That's the point. If you write laws that are vague you can enforce them to match your current goals. It's a standard playbook of authoritarians.","score":26,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I love the absolute *FACT* that the Republican Party couldn't put up a decent human as nominee if their party depended on it.\n\nReally speaks to their current state of affairs and what they feel is important. \n\nThe Republican Platform Trifecta:\n\n###Fiscally Bankrupt\n\n###Morally Bankrupt\n\n\n\n###Spirituality Bankrupt","score":126,"comments":[{"body":"Its absolutely insane that, after all the whining from conservatives about free speech on campus, they’re literally banning certain ideologies from the classroom","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The judge even quoted 1984 and referred to the ministry of truth. And the First Amendment.","score":71,"comments":[{"body":"That’s what I don’t get - how do any of these bills survive any legal challenge when they’re such obvious violations of the First Amendment?","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"See the banana republic he's turning Florida into?  Don't let that be the whole country!","score":50,"comments":[]},{"body":"Awesome! Now do Virginia.","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"She needs to be brought in under oath..","not_safe_for_work":false,"locked":false,"body":"","score":17,"comments":[{"body":"Another lying MAGAt.","score":3,"comments":[]}]},{"title":"Pelosi, dominant figure for the ages, leaves lasting imprint","not_safe_for_work":false,"locked":false,"body":"","score":68,"comments":[{"body":"She's a hero,  no doubt about it.","score":7,"comments":[]},{"body":"The worlds greatest tenant, since she lives rent free in so many’s heads","score":3,"comments":[]},{"body":"WASHINGTON (AP) — There are two searing scenes of Nancy Pelosi confronting the violent extremism that spilled into the open late in her storied political career. In one, she’s uncharacteristically shaken in a TV interview as she recounts the brutal attack on her husband.\n\nIn the other, the House speaker rips open a package of beef jerky with her teeth during the Jan. 6, 2021, Capitol insurrection, while on the phone with Mike Pence, firmly instructing the Republican vice president how to stay safe from the mob that came for them both. “Don’t let anybody know where you are,” she said.\n\nThat Pelosi, composed and in command at a time of chaos, tart but parochial-school proper at every turn, is the one whom lawmakers have obeyed, tangled with, respected and feared for two decades.\n\nShe is the most powerful woman in American politics and one of the nation’s most consequential legislative leaders — through times of war, financial turmoil, a pandemic and an assault on democracy.”","score":5,"comments":[]},{"body":"A storied career. \n\nI for one, best remember her standing up at a table in a room with Trump and his staff, military leaders and other declaring, \"All Russian roads lead to Trump\" ... that was sterling!\n\nThank you Madame Speaker for your service to the nation.","score":3,"comments":[]}]},{"title":"Lake refuses to concede in Arizona governor's race she lost","not_safe_for_work":false,"locked":false,"body":"","score":571,"comments":[{"body":"To quote another Democrat ... \"Who cares if she concedes, it does not change the data. It is over but that does not mean she won't waste the RNC and Arizona state's money  scheming up a suit to say she won.","score":255,"comments":[{"body":"I'm fine if she wastes the RNC's money, honestly.","score":146,"comments":[{"body":"Good point.","score":52,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"She can refuse until Arizona freezes over. Katie is still the governor elect and will be sworn into office while Kari is throwing tantrums on the steps of the Statehouse.","score":129,"comments":[{"body":"As an Arizonan, this worries me because I could easily see something like 1/6 happening here. We had a high number of participants in that one and I don’t think they’ve gotten smarter.","score":54,"comments":[{"body":"No surprise here. Also unsurprised that she’s been spotted at Mar-a-Lago. Kissing the boots, thinking Daddy Trump is going to magic her a “re-do election”","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It agree.  I am getting tired of the lack of decorum and the signals it sends especially to children \nand teens about how democracy is supposed to be.  Throw a tantrum until you ....","score":30,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Trump really has started a trend with this “refusal to concede” shit. When I think about all the political norms he has refused to honor it makes me so sick. Maybe it’s just me, but I have a natural , instinctual aversion to personalities like his. Can’t even remotely admit to a mistake or take responsibility for any of his wrong doings. And God forbid  Someone points out any fault of his, then you are not loyal enough. What makes ANYONE supportive of or admire this kind of person.","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Just let her kick and scream.  It only makes her look foolish.","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Well she’s no Al Gore.\n\nWho she probably hates, for a variety of nebulous, false reasons.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"‘I voted Democrat for the first time’: Guardian readers on the US midterms | US midterm elections 2022","not_safe_for_work":false,"locked":false,"body":"","score":78,"comments":[{"body":"I canvassed hundreds of houses, maybe over a thousand.  I had many conversations with people at their doors. Tons of people told me they were voting Democrat after voting republican for the bulk of their lives. Not one conversation went the other way. I was canvassing independent voters and democratic voters. Although my list gave a specific name I often spoke with another member of a household so that's how I ended up speaking to former republican voters.","score":14,"comments":[]},{"body":"If this trend continues republicans are screwed. All these people agree trump is a problem.","score":3,"comments":[{"body":"Not just trump but the whole philosophy of the republican party.","score":1,"comments":[]}]},{"body":"Not impressed with Cons who just realized their party is fucked up... Nothing to see here.. move along ..","score":6,"comments":[{"body":"I agree. It's pretty sad with all the shit the GOP has put America through since the days of Reagan that it took this long for these people to wake up.","score":7,"comments":[]},{"body":"Not even realizing, they’re just blaming it all on Trump. As if you simply take him out of the picture and that magically makes everything better. The GOP were messed up long before Trump came along, he just started saying the quiet part out loud.","score":1,"comments":[]}]}]},{"title":"Hakeem Jeffries launches bid to be Nancy Pelosi’s successor","not_safe_for_work":false,"locked":false,"body":"","score":22,"comments":[]},{"title":"Pelosi stepping down as House Democratic leader after 20 years","not_safe_for_work":false,"locked":false,"body":"","score":1108,"comments":[{"body":"As much as I loved watching her spar with the Orange Cult Leader, I am glad the next generation is getting a chance to step up.","score":205,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"Democratic Caucus Chair Hakeem Jeffries (D-N.Y.), 52, is seen by many colleagues as Pelosi's natural successor, though Majority Leader Steny Hoyer (D-Md.), 83, is keeping his options open.\"\n\nI'm hoping Hoyer follows Pelosi's example and lets the next generation take the mantle without a big fuss.","score":120,"comments":[{"body":"I heard Hoyer is stepping down now, as well.","score":55,"comments":[{"body":"Yep, just read Steny Hoyer’s letter.  Looks like older D leadership is stepping aside for younger folks. \n\n“Now is the time for a new generation of leaders, and I am proud to offer my strong endorsement to Hakeem Jeffries for Democratic Leader.”","score":56,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Hope her replacement is someone in their 40s or 50s. Both parties need younger people in leadership positions.","score":346,"comments":[{"body":"She agrees with you too.  In her announcement speech ([https://facteroid.com/timeline/5738](https://facteroid.com/timeline/5738)) she said \"For me the hour has come for a new generation to lead the Democratic caucus\".","score":69,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Can’t say i’m happy, she really was a gifted speaker and whipped the congress people in line","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"As she said she would","score":106,"comments":[]},{"body":"Anyone happy to get rid of Pelosi has zero understanding of what it takes to keep a party like the Democrats together (or is a Republican). She managed to get major legislation through even with a hair-thin majority.\n\nAnd Republicans know it behind the scenes, too: during the insurrection they were turning to her for leadership as long as the cameras were off.\n\nShe's by far the best Speaker in at least a generation, probably in the last 50 years.","score":97,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I don't blame her. Aside from her promise not to keep holding on to her position for the new term, I wouldn't want that job either if it put my family in the cross-hair like her. Congrats Speaker Pelosi. Job well done.","score":135,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Now Trump and the GOP are losing young evangelicals too","not_safe_for_work":false,"locked":false,"body":"","score":429,"comments":[{"body":"I mean that should have been a given. There's rarely been a less christ like person than Trump is leading \"Christians \" the man should be repugnant to them in no uncertain terms.\n\nSadly, that's not the case.","score":102,"comments":[{"body":"The new MAGA Jesus goes into the temple and whips the poor for not giving bigger tax cuts to the moneychangers","score":59,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Demographically, the GOP is fucked.  Their only reliable demographic is dying by 5500 people per day.  Other whites and evangelicals are in demographic freefall, and even those are not even close to reliable loyal as we see from this article.\n\nFor they have sown the wind, and they shall reap the whirlwind - Hosea 8:7","score":79,"comments":[{"body":"They have to come around on climate change, women's choice over their own bodies, and universal health care to have any hope of remaining relevant. Good luck with that, GOP.","score":26,"comments":[{"body":"alternatively (and I think more realistically), they could go soft libertarian - actually do the small government they pretend to do so it includes people's personal lives\n\nbecause the white christian nationalism combined with conspiracy theory isn't exactly a winner as we saw a couple weeks ago","score":13,"comments":[{"body":"The Republican Party hasn't been fiscally responsible since Eisenhower. I have a difficult time seeing Ron DeSantis eliminating donor interests in the current Republican-created Citizens United plutocracy of corporations and wealthy. They'd cut entitlements that help the working class and poor while siphoning the same amount or more to for profit enterprise. It's what they do as the premier corporate-facing political party in the U.S.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Yall I’m starting to suspect appealing exclusively to white, male baby boomers wasnt a good long term strategy","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Trump has always used the Bible as a prop, literally during the George Floyd riots. But he’s used Christianity too, emphasize on word ‘used’.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":" Could Republicans be out of touch with the younger generation? No that can't be it. Its that damned avocado toast!!","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Earlier indication of exodus:\n\n[Evangelical Reverend Robert Schenck: Trump \"Using Bible as a Prop\" | Amanpour and Company](https://youtu.be/kDRs1SdlSvo?t=588)","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"'Positively dystopian': Judge blocks Ron DeSantis' 'Stop WOKE' law by quoting George Orwell. DeSantis is worse than Trump. We need to safeguard our democracy. This is from a Judge!","not_safe_for_work":false,"locked":false,"body":"","score":258,"comments":[{"body":"This is who is talked about as the GOP hopeful. He’s a nut job, but he’s smarter than Trump and doesn’t have quite as much baggage. Yet.\n\nHowever this is the person that had immigrants literally kidnapped and flown to Martha’s Vineyard. You really have to question the judgement of that stunt.","score":31,"comments":[{"body":"I wouldn't apply \"smart\" to either of them. Ivy League degree alone obviously doesn't indicate ipso facto intelligence. If one appears smarter than the other I'd attribute that to Trump's greater willingness to act without calculating risk which is probably attributable to frontal lobe damage. Neither of them seem particularly bright.","score":4,"comments":[{"body":"I'm from Florida, and I've been paying attention to him for years. He's pretty smart. He knows when to start battles, and when to stay out of them. He's invented lots of culture war BS in Florida, but when it comes to unpopular issues for Republicans, like abortion, he stays out.\n\nHe invents new strongarm tactics to gain power all the time. Things Abbott and Trump wouldn't have thought of. And because he's hurting the right people, Republicans love him.","score":3,"comments":[{"body":"Imagine Trump, but smart. That's terrifying.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Evil incarnate. Do not allow.","score":13,"comments":[]},{"body":"Republicans are the Orwellian nightmare they warned everyone about. Who knew? (Anyone paying attention!)","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Another Human Hemorrhoid.\n\nThank you Floriduh!","score":9,"comments":[{"body":"every photo i’ve seen of him, he looks like he’s dealing with a bad case of hemorrhoids","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"It does seem a little strange for a government to dictate what college students can and cannot be taught.  Even high school and elementary schools, it seems like more for a school board than a governor.  But in College?  Isn't that more for the marketplace of ideas to decide?","score":7,"comments":[]},{"body":"Worse than Trump? *points to Jan 6th. Let’s discuss…","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Opinion | Nancy Pelosi, Badass","not_safe_for_work":false,"locked":false,"body":"","score":177,"comments":[{"body":"This article may be behind a paywall. You can add 2-4 paragraphs as a quote in a comment. *Do not post the text for the entire article.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"“Ms. Pelosi is an original, and we are unlikely to see another leader of her ilk any time soon. She elbowed her way to the tippy top of the congressional boys’ club, then set about distinguishing herself as the most formidable, most effective House leader since the middle of the last century. Love her or hate her, you have to acknowledge the fundamental badassery.”","score":29,"comments":[{"body":"Truth","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"For those of you who are confused about her policies-\n“Jobs &amp; Economy\nThe economy just isn’t working the way it should: the costs of living keep rising, but families’ incomes and wages aren’t keeping up.\n\nEducation\nNothing brings more revenue to the Treasury than an investment in our children’s education whether it is early childhood, K-12, higher education, post graduate, or lifetime learning.\n\nImmigration Reform\nOur nation’s immigrants are the constant reinvigoration of America. Each wave of newcomers brings their patriotism, bravery and determination to succeed to our shores – and in doing so, makes America more American.\n\nHealth Care\nIn America, health care should be a right for all, not a privilege for the wealthy few.\n\nVeterans\nLearn about news and information related to Veterans issues.\nWomen's Economic Agenda\nWhen women succeed, America succeeds. It’s a fact whose truth resonates throughout our history. And today, the success of women is more important than ever to the strength of America’s working families and the future of our economy.\n\nDemocracy, Campaign Finance Reform &amp; Voting Rights\nOur Founders pledged their lives, their liberty and their sacred honor to build a democracy: a government of the many, not of the money.\n\nGun Violence Prevention\nUpon taking office, every Member of Congress makes a solemn pledge: to protect and defend the American people.  This is the most important oath we take as elected officials – and to honor this promise, we must do everything in our power to keep our children and our communities safe from the threat of gun violence.\n\nEnergy &amp; Environment\nThe verdict of science is clear: climate change is real, and its consequences are undeniable. Rising seas, savage droughts, horrific famines, devastating floods and life-threatening air pollution will impact every nation on every continent – and communities across America are already feeling the effects.\n\nHuman &amp; Civil Rights\nIn the United States, we draw our strength from the strength of our most treasured ideals: that all human beings are created equal and are endowed with equal rights – no matter what they look like, where they come from or who they love. Our success and endurance as a nation depend on our commitment to upholding the promises of freedom and justice written into our founding documents.”","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The footage of her during the J6 insurrection showed Nancy IS 👏🏻 A 👏🏻 BOSS 👏🏻 .","score":3,"comments":[]},{"body":"Yes. Yes she is.","score":3,"comments":[]},{"body":"[removed]","score":-2,"comments":[{"body":"Yeah, she became the person republicans hate the most by helping the rich. /s","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"[removed]","score":-1,"comments":[{"body":"Citation needed.","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Texas Democrats ask feds to ‘intervene’ against Greg Abbott’s ‘invasion’ declaration","not_safe_for_work":false,"locked":false,"body":"","score":80,"comments":[{"body":"Well we just had an election that would have taken care of this type of state overreach, but ya'll didn't want that!","score":12,"comments":[{"body":"Over half of texas loves this. Brown people aren’t really people to them. They think if they kill a few with cruelty the rest will get the message.","score":3,"comments":[]}]},{"body":"A child nearly died of dehydration on the latest GOP human trafficking trip.\n\nRepublicans are not human beings. We must stop treating them like people. They are better described as tapeworms with anger issues.","score":8,"comments":[{"body":"Let's not fall into the same trap they did. Republicans are people too, cowardly, dishonest, gullible, pathetic people, but still people.","score":1,"comments":[]}]},{"body":"Abbott is trying to out fascist DePantless. At least he has hopes and dreams.","score":1,"comments":[]}]},{"title":"Political Consultant Convicted for Scheme Involving Illegal Foreign Campaign Contribution to 2016 Presidential Campaign","not_safe_for_work":false,"locked":false,"body":"","score":104,"comments":[{"body":"&gt;from Russia \n\nshockedpickachu.jpg","score":12,"comments":[]},{"body":"From Russia to Trump.","score":11,"comments":[]},{"body":"A presidential candidate and money from a Russian national. Gee, who could that be? /s if needed","score":6,"comments":[]},{"body":"News articles confirm what we already know: it’s the orange candidate.\n\nImagine the Republican hypocrisy if Hillary had taken money from Russia.","score":4,"comments":[]},{"body":"Gee, I wonder which candidate it was.","score":1,"comments":[]},{"body":"Republicans are such hypocrites.","score":1,"comments":[]}]},{"title":"Recount flips New Hampshire seat from Republican to Democrat — by one vote","not_safe_for_work":false,"locked":false,"body":"","score":1128,"comments":[{"body":"This reads like it's a state legislature seat and not a US house seat. Am I reading correctly?","score":144,"comments":[{"body":"You are correct. It's the state legislature.","score":95,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Sweet, sweet victory. Never let anyone tell you your vote doesn’t count!","score":73,"comments":[{"body":"Saving this post for evidence.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Never realized how massive NH House of Representatives was. Just shy of matching the US House of Reps member count.","score":27,"comments":[{"body":"All that means is that the US House is too small (it is) and that we need to remove the cap and increase it drastically. I'm thinking build it Galactic Senate style from Star Wars","score":41,"comments":[{"body":"Even just re-capping at 600 like the UK Parliament would be nice or I think the Indian parliament is around 1200. Really though, we should push a constitutional amendment to move to the German-style \"overhang\" system and then gerrymandering becomes almost completely ineffective for major parties.","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"This is why voting is important","score":19,"comments":[{"body":"Yes! I always urge people to vote.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Queue rigged election claims....","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Just saw this…","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"This is only symbolic, since there's an automatic recall by law. Just highlights the fact that Democrats don't pretend to have won elections.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Was hoping she was out. Who could vote for her?","score":7,"comments":[{"body":"Trumpers","score":3,"comments":[]},{"body":"Republicans","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This was no confident vote for Boebert, those that voted for will get exactly what they voted for, nothing but drama, a circus with no actual production for Colorado.","score":7,"comments":[{"body":"Her constituents would rather be entertained than helped","score":5,"comments":[]}]},{"body":"Yuck.","score":4,"comments":[]},{"body":"Ahhh, fuck!","score":4,"comments":[]},{"body":"I don't understand how you can concede a race when it hasn't officially been called yet, because the margin is too close and will result in a recount. Plenty of races have been overturned due to recounts in history.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Merde!","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Indeed","not_safe_for_work":false,"locked":false,"body":"","score":517,"comments":[{"body":"Been out of the loop for a while now what happened in Georgia aside from the run off","score":13,"comments":[{"body":"Walker went on a rant about werewolves and vampires at some campaign event this week.","score":19,"comments":[{"body":"I’m which he describes the events of the movie “Fright Night” (or freak night he isn’t sure) as showing that werewolves are superior to vampires as they can kill the latter, despite the movie not featuring any werewolves.","score":12,"comments":[{"body":"And these guys think *Biden* is mentally incompetent. Projection much?","score":11,"comments":[]},{"body":"🤣","score":5,"comments":[]}]},{"body":"I still don’t understand how a million Georgia voters looked at Walker and said “this is fine”","score":20,"comments":[{"body":"I know, right. \n\nIts amazing how many people want their representatives to waste time on useless stuff like werewolves,  vampires or the electronics of a politician's kid... instead of .. you know dealing with the problems that are actually relevant to their citizens.","score":13,"comments":[]}]},{"body":"I expect it will eventually come out. That at some point when Walker was a teenager, someone had to train him not to run the wrong way on the football field.","score":4,"comments":[]}]}]},{"body":"Walker is a threat to America","score":6,"comments":[]},{"body":"I do be scared of Vampires and Werewolves though","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Why is Ron DeSantis always so angry? Didn’t anyone tell him that he won?","not_safe_for_work":false,"locked":false,"body":"","score":450,"comments":[{"body":"I don't know if he's angry in this photo, but he has to be pretty upset with Trump right now. Trump is the primary opponent from hell. His approach is to burn his opponents to the ground, personally and politically. \n\nHe is always in attack mode, so you can't stop him by counterpunching and forcing him to defend himself. He will just keep attacking and see which of you limps across the finish line.\n\nAnd Trump won't back off when it becomes apparent that he's lost. He will just accuse his opponents of rigging the primaries and caucuses. He won't drop out until at least mid-May, no matter how far behind he is. And while he might endorse the Republican nominee, he will not bother to campaign for him, and a lot of Trump's supporters will believe that they've been cheated and stay home on election day.\n\nWhat that means is, it will be nearly impossible for a Republican to win the general election if they manage to get past Trump in the primaries. Trump does this deliberately, to clear the field of popular challengers like DeSantis and give himself an easier path to the nomination.\n\nSo if DeSantis is feeling pissed off right now, I'd say that's probably why.","score":106,"comments":[{"body":"This. Also if he's willing to motivate his base to try to kill his vice president, I can only imagine what he'll motivate his base to do to competition.","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"And for some reason half of America voted for that phsyco. 😂","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That’s just the Republican default emotional state.","score":113,"comments":[{"body":"Faux outrage learned from faux news.","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Rage is their fuel. Misdirected, incoherent rage.","score":20,"comments":[]},{"body":"They took away his kicky white boots.","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Because the base like the anger and DeSantis know how to play them. He is an intelligent version of Trump with less charisma. If he ever becomes president we are royally fucked.","score":14,"comments":[]},{"body":"He’s just an angry little man. Those lines on his face betray his inner emotions beautifully.\n\nIf he runs for president, I’d bet good money he’ll get Botox and fillers to make himself look less like the giant chode he is.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He's wearing his mask like a moron.","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Pelosi stepping down as top House Democrat after 2 decades in leadership","not_safe_for_work":false,"locked":false,"body":"","score":130,"comments":[{"body":"As much as I hate seeing her step down due to right-wing nut job violence, Jeffries could be really strong as Speaker.","score":20,"comments":[]},{"body":"The most consequential and successful Speaker since Sam Rayburn.","score":7,"comments":[]},{"body":"👑","score":5,"comments":[]},{"body":"Man we really need term limits for these people.","score":8,"comments":[{"body":"Not as much as we need pych evaluations on any mfer that runs for office. IQ under 70 can't run for office; cant pass the dementia test (annually) get someone else in immediately as a replacement, start and insurrection get arrested, tried and hung.","score":12,"comments":[{"body":"There's a lot of changes that should be made. Unfortunately they won't be made.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"They also shouldn’t be allowed to participate in the stock market while in office because it is akin to insider trading. No wonder she *still* not giving up her seat despite being over 80.","score":2,"comments":[]}]},{"body":"shes been great at her position however its simply time for someone else to take the mantle.","score":1,"comments":[]},{"body":"Yay!","score":0,"comments":[]},{"body":"[web archive](https://web.archive.org/web/20221117201214/https://www.washingtonpost.com/politics/2022/11/17/nancy-pelosi-house-speaker/)","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Wasserman has seen enough: Rep. Mary Peltola (D) wins reelection in AK-AL defeating Sarah Palin (R) and Nick Begich (R)!!!","not_safe_for_work":false,"locked":false,"body":"","score":200,"comments":[{"body":"Go back to hunting from a helicopter, Sarah.","score":14,"comments":[{"body":"the masked singer is always there as well.","score":3,"comments":[]}]},{"body":"I would have been legitimately sad if she lost. Very glad to see she’s coming back","score":5,"comments":[{"body":"Thank god for ranked choice voting. A great deterrent to keeping the crazies out of office","score":7,"comments":[]}]},{"body":"Peltola sounds really finnish, does anyone know if she has finnish ancestory or if its a coincidence?","score":1,"comments":[{"body":"Her husband Gene Peltola is part Finnish I believe.","score":3,"comments":[{"body":"Thanks for the info👍","score":2,"comments":[]}]}]}]},{"title":"Immunity? Immunity for murder? Immunity for ordering murder? What in the divine right of kings is going on Biden?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"As a sovereign governor, he is acting as the state, so under international law you can't hold him personally accountable.  Either his country would need to hold him accountable, or the US would have to take it up with Saudi Arabia.  It is a diplomatic matter rather than a criminal matter.","score":21,"comments":[{"body":"Otherwise someone could have jailed Obama for ordering the murder of Osama bin Laden, right? That is the tradeoff.","score":2,"comments":[{"body":"The idea is any action he takes on behalf of the state is the same as an act of state.  States have sovereign power, so one state cannot abridge another state's sovereignty.  Except by diplomatic means of course.","score":5,"comments":[{"body":"This sovereign power makes the most sense, but damn it sucks.  I know things we be a lot different if Ali Kamenie or Kim had done this to a journalist.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"body":"I call Bullshit...","score":3,"comments":[]},{"body":"Then other countries start holding our elected leaders accountable for the murders we commit in the name of national security. Can’t have that.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Gas prices. It is sadly what the people want, low gas prices.","score":5,"comments":[{"body":"This was my first thought when reading about it. Freaking oil.","score":3,"comments":[]}]},{"body":"It’s called international diplomacy. Biden can’t take action without putting our diplomats at risk on cooked up charges.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Being the world's oil supplier makes him immune. It's a question of blackmail.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Texas Republicans Introduce 17 Anti-LGBTQ+ Bills","not_safe_for_work":false,"locked":false,"body":"","score":74,"comments":[{"body":"They just can’t stop thinking about sex.","score":38,"comments":[{"body":"Especially gay and underage sex","score":16,"comments":[]},{"body":"Wish I had money... I'd give you a nice fat reward.","score":8,"comments":[]}]},{"body":"Closet cases with exclusionary kinks. Dig up dirt on people who do this.. please. You'll find a hypocrite every time.","score":13,"comments":[]},{"body":"“Small government”","score":13,"comments":[]},{"body":"No hate like Christian hate. And they  don't do love anymore!","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That’s more work than they did in the four years Trump was in office.","score":9,"comments":[]},{"body":"Can we just agree every American is equal to every other one? I think Evangelical American Fascists should be declared terrorists. It is crazy a former Supreme Court Nominee has not RICCOed the movement.","score":7,"comments":[]},{"body":"Their motto: they can’t be gay if they say no homo before gay sex.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Democrats make history with state-level gains — and that could be crucial for democracy","not_safe_for_work":false,"locked":false,"body":"","score":119,"comments":[{"body":"Democrats just need to flip one more seat in each chamber to win control of Arizona’s state government. This can be done in 2024!","score":5,"comments":[{"body":"And ditch Sinema for someone not beholden to oligarchs.","score":2,"comments":[]}]},{"body":"Could State Houses form committees to investigate their Congress Members?","score":4,"comments":[{"body":"They couldn't impeach them. :(","score":2,"comments":[{"body":"True but could they?\n\nThere are other means of punishment beyond impeachment.","score":1,"comments":[]}]},{"body":"Legislatures can form committees to do basically whatever they want. They usually have subpoena power, though I think this varies from state to state. However, there is no mechanism for a state legislative committee remove a member of Congress. And they can't bring up charges if that's what you mean by \"punishment.\"","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Republicans who rejected the outcome of the 2020 presidential election lost every battleground statewide race for offices that control elections. I feel very good about that.","score":4,"comments":[]},{"body":"[deleted]","score":-1,"comments":[{"body":"You obviously either did not read or did not understand the article.","score":2,"comments":[]},{"body":"Also, the Supreme Court is about to rule that state governments are allowed to hold fake elections with predetermined outcomes like Russia. Democracy is still doomed.\n\nUnless someone has some idea what to do to stop these tyrants after that? Ban the Republican party from blue state ballots, perhaps?","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"title":"There's a reason Trump rushed to announce his 2024 bid, and it's not just a legal one: he was already hemorrhaging support","not_safe_for_work":false,"locked":false,"body":"","score":115,"comments":[{"body":"And * gasp * almost hemorrhaging his own money !","score":13,"comments":[]},{"body":"Its a travesty that he has not been indicted yet.","score":10,"comments":[{"body":"I don't think he ever will. He had dirt on lot of powerful people. Trumps end will either be he gets away with it all and dies of natural causes or he actually gets indicted and very quickly \"kills himself\". \n\nI'm more of the mind that he is part of the oligarchy, and they are not held legally accountable. Not as bad as Russia but getting damn close.","score":3,"comments":[{"body":"You think he’ll be Epstiened?","score":1,"comments":[{"body":"I think those are the two outcomes here. He is more dangerous too because not only would he release dirt I'm sure is real, but he would add in total fake BS with the intent of maximum harm. Just like the Russian ran WikiLeaks.","score":1,"comments":[{"body":"Maybe. But we know he’ll never see a cell. An indictment would mean house arrest so he’d still have a lot to lose.","score":1,"comments":[]}]}]}]}]},{"body":"I don’t think he’s going to be the nominee. My money is on DeSantis.","score":1,"comments":[]}]},{"title":"Facebook is still banning Trump — at least, for now","not_safe_for_work":false,"locked":false,"body":"","score":72,"comments":[{"body":"Ignore this traitor.","score":3,"comments":[]},{"body":"Who?","score":1,"comments":[]},{"body":"He's hard to ignore when he's shoved in our faces by the media...   “It may not be good for America, but it's damn good for CBS,” ..","score":1,"comments":[]}]},{"title":"Facebook reminds employees: You can't fact check Trump now that he's running for president","not_safe_for_work":false,"locked":false,"body":"","score":83,"comments":[{"body":"These fucking people","score":50,"comments":[{"body":"But it really doesn’t matter. The people who spread the lies and believe the lies, refuse to believe the fact checkers. They’ll just say it’s biased big media tech companies who favor democrats.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"WTFing hell.. allowing the country's most notorious criminal to stand behind ceremony. Lock him up!!!","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Apologies for being out of the loop, but WHY aren't FB employees ALLOWED to fact-check cheeto head?","score":14,"comments":[{"body":"It would look like conservatives are being censored just like when they changed their algorithm to be more neutral and conservatives got all upset about it for the same reasons.","score":10,"comments":[{"body":"Didn’t they attempt to block Nazi content at one time and it ended up blocking conservative content? (pretty much one in the same.)","score":6,"comments":[{"body":"something like that..  I just remember conservatives were upset because their content was not getting served up as much as non-conservative content and in their infinite wisdom they thought that big tech was out to get them instead of the content being.. well wrong or hateful or whatever it ended up being.","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"To be fair, we are all aware that if Trump’s mouth is open, he is either stuffing it or lying through his teeth.","score":9,"comments":[]},{"body":"And he may get his account back next year.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"you mean russian propaganda machine?","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Oh the hypocrisy.","not_safe_for_work":false,"locked":false,"body":"","score":1415,"comments":[{"body":"Disturbing thing is Grassley has already filed his reelection paperwork for 2028. He'll be 95...\n\nThe Democrats dropped the ball *hard* in Iowa organizationally - Franken came the closest to unseating Grassley ever with basically no support from the national party and our state party in complete disarray. This fumbling also lost us Axne's seat.","score":139,"comments":[{"body":"Trying to be the new Strom Thurmond, staying in office until he's 100","score":23,"comments":[{"body":"If he wants to be the new Thurmond, did he already do the \"have a mixed race child with a teenage African-American housekeeper while supporting segregation and ultimately voting against civil rights acts\", or is that still on the to-do list?","score":13,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"&gt; The Democrats dropped the ball hard in Iowa organizationally\n\ndude.. speaking as one of the people in this statistic\n\niowa has fuck all to offer and never has or will.  almost every young educated 20 something leaves the state.  the education system in the 80s, 90s and early 00s was also absolutely top notch.\n\nthe state has just experienced massive brain drain, we all said \"fuck that shit\" and GTFO'ed","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Wait.... when was the chocolate chip cookie invented?\n\nSo many things just seem like they've kinda always existed in modern times but haven't. Like the high-five.","score":24,"comments":[{"body":"1938. Grassley was born in 1933","score":14,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"This subreddit seems obsessed with idiotic Republicans. Is there another Dem subreddit that addresses issues and discusses actual Democrats? This kind of thing is meaningless.","score":25,"comments":[{"body":"I like r/politicaldiscussion — way more substance.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"They both are (I voted Biden and will again) but republicans don’t have ground to criticize Biden when they voted Grassley in.","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I don't honestly care that Grassley is old. I care that Grassley sucks.\n\nAs an Iowan, he sucks. His seniority doesn't do much for my state and he actively works against the public interest.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"John Fetterman shows how Democrats can win back working-class Trump voters","not_safe_for_work":false,"locked":false,"body":"","score":122,"comments":[{"body":"Find a giant white guy with tattoos to run? And a slimy Turkish snake-oil salesman to run against him?","score":16,"comments":[{"body":"Don’t forget the Turkish guy is a Muslim and a lot of democrats don’t like that either","score":-2,"comments":[]}]},{"body":"I'm glad he won but this ignores Shapiro running 5 points ahead of Fetterman.","score":14,"comments":[{"body":"More like 10.\n\nTo paraphrase Mitch McConnell, \"Candidate quality matters.\"","score":7,"comments":[{"body":"Shhhh they had this take written before the election…","score":1,"comments":[]}]}]},{"body":"Periodic reminder that when the media talks about “working class” they mean “white working class.”","score":4,"comments":[{"body":"Yes, they mean the class that Democrats gave up over the past decade.","score":1,"comments":[]}]},{"body":"Maybe we should just give up on fascists and motivate people who care about democracy and reproductive rights?","score":2,"comments":[]}]},{"title":"To all the people upset about the Marriage Equality Bill","not_safe_for_work":false,"locked":false,"body":"","score":394,"comments":[{"body":"Unless it's a banning abortion. Then it's all good.","score":31,"comments":[{"body":"Or banning immigration. They'd be good with that, too.","score":12,"comments":[{"body":"Then they'd blame Democrats for the 20 dollar head of lettuce.","score":14,"comments":[]}]}]},{"body":"Either that or they'll cry \"states rights\" but hate it when THEIR state decides in opposition to them.","score":20,"comments":[{"body":"County rights!","score":9,"comments":[{"body":"City rights!","score":8,"comments":[{"body":"Take it one step further and holy hell, it's almost a personal decision.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Township rights?","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"body":"Only if Dems wrote the bill &amp; if it helped people. The GOP could try to pass federal bills banning morally subjective issues &amp; many on the right would be fine with it.\n\nThey just want their \"team\" to win - they no longer care about the topic.","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I just hope we won’t make the same mistake(s) we did the first time.","not_safe_for_work":false,"locked":false,"body":"","score":351,"comments":[{"body":"I think people underestimate Trump because they think he's not a good communicator. In reality, he might be the best communicator I've seen run for president.\n\nLook at how he never leaves anything to chance. The audience never has to wonder what conclusion to draw. It is always spelled out for them, and repeated over and over. And he is constantly stroking his followers' egos, telling them that most people are fooled by the \"fake news\", but that they are the ones who are smart enough to see through it.\n\nAlso, he uses trial and error to find the themes and talking points that will engage, entertain, and energize his audience. He's constantly testing new lines and new themes at his rallies. If he gets a big response, it becomes integrated into the stump speech. If not, he drops it. So by the end of the campaign, rallygoers leave excited and energized, and ready to donate money and enlist their friends in their crusade to save America.\n\nThat said, I think that he, like the great communicator Joe McCarthy before him, is starting to wear out his welcome. People put their faith in him, and he failed them. Now he's asking them to trust him again. Many will, but not enough to elect him to a second term.\n\nIn fact, his candidacy is the best thing that could have happened to Joe Biden. Biden will win in 2024 if inflation is brought under control without triggering a recession. Failing that, his only chance is either A) Donald Trump gets the nomination, or B) Trump fails, and in the process convinces his backers that the Republicans are just as corrupt they imagine the Democrats to be. If that happens, there will probably be enough Trump supporters who stay home to hand the election to Biden. Look at Sanders' 2016 campaign to see a historical example of this phenomenon.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"In the run up to 2016. I thought it was amusing that Trump was running. He was such a caricature. Then when he won the nomination, I was unsettled, but almost glad because I thought it would be a slam dunk for Clinton. After election night, I was stunned. I will never feel complacent again.","score":15,"comments":[{"body":"Same here. \n\nRidiculing Cheeto Mussolini and his minions is normal and frankly healthy: the Orange Idiot *is ridiculous* and it is important to call out evil.\n\nI too was surprised to learn how many Americans are racists and how many have an authoritarian mind-set. Many see anyone unlike themselves as un-American, an enemy to be defeated, and not an equal person they simply disagree with.","score":7,"comments":[]}]},{"body":"He can win. It's not even unlikely. Desantis is (at least) equally dangerous. GOP infighting is not going to drive a statistically significant number of voters away from whoever wins the republican nomination. \n\nGEN Z saved our asses this year, and only just. The strategy going forward is to show them we appreciate it, and that doing so was worth it. THAT IS EVERYTHING!","score":30,"comments":[{"body":"student loans and cannabis law would help","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Yeah he won. But more recently he lost.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Due to the Electoral College, Democrats will be underdogs in presidential elections for the foreseeable future. That will be the case against strong candidates, weak candidates, and everything in between. Assume ***nothing.***","score":6,"comments":[]},{"body":"To be fair, most of us weren’t paying alot of attention in 2015.  Things have changed.  None of us are just going to shrug our shoulders and say “whatever”.  \n\nIt’s going to be exhausting watching this piece of shit for 2 years so buckle up, and when 2024 comes around, I expect a bigger blue wave.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He's a master manipulator. He insulted Cruz's wife, Lindsey Graham, Rubio etc, a week later they all kissed his a**. That's talent","score":4,"comments":[]},{"body":"Then we get our asses out there and vote exactly like we voted in the midterms in 2024. \n\nLet's make him a consistent LOSER.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How about Florida next?","not_safe_for_work":false,"locked":false,"body":"","score":1408,"comments":[{"body":"Kyrsten Sinema is a “democrat”.","score":101,"comments":[{"body":"Sinema is a Dino","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"It's more like a democratic governor and 1.5 democratic senators with Sinema but I'll still take it","score":60,"comments":[{"body":"I’ll definitely take Sinema over a Republican, but she is definitely a fringe democrat at best.","score":25,"comments":[]}]},{"body":"As a Floridian, good luck. Our state party is a joke. Lets look at Wisconsin","score":36,"comments":[{"body":"I agree! There’s not one fucking politician in this whole fucking state that’s worth a shit! Honestly, DeSantis? Marco Rubio? Rick Scott? And Rino Dino Charlie Crist. Then you have the retired orange one living one county over. Whatever happens to him, I hope he loses Mar-a-Lago. That’s his pride and joy and I would love to see it taken away from him. That and his stupid big ass jet. At least the county I live in is bright blue. I don’t know how that happened but I’m glad it did! It’s always been that way, too. I can’t think of any other areas except maybe the Gainesville area or Orlando area that’s actually more democrat than Republican. I’m in Broward. Maybe I’ll run for Congress. I’ve got six years to prepare. I’ll announce my candidacy next Tuesday, lol!","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Is there an actually two and a half Democrats","score":100,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"We have 2 Democrats and a DINO.","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Just need to replace Sinema to make that happen","score":12,"comments":[]},{"body":"Florida is where America's trash moves to die. Let it go. Texas is the better pipe dream .","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Senate defeats filibuster on gay marriage bill, paving path for protecting same sex unions","not_safe_for_work":false,"locked":false,"body":"","score":402,"comments":[{"body":"That’s great. I’m all for it, I just wish we had 12 republicans who valued women’s rights. Then we could codify Roe.","score":81,"comments":[]},{"body":"This didn't just cover same sex marriage it also covers interracial marriage  as well, which I hoped was a thing of the past.","score":27,"comments":[{"body":"So true. It’s as if Thomas wishes to nullify his marriage in the stupidest possible way.","score":15,"comments":[{"body":"Now imagining him wanting to get a divorce and this finally being the way out","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This codifies it at the federal level. If Obergefell is overturned and you live and want to marry your same sex partner in a state where it’s banned, you’ll need to travel and get married in a state where it’s legal.","score":26,"comments":[{"body":"Because it'll be federally protected, the Supremacy Clause will require all states to recognize their married status.","score":27,"comments":[{"body":"Yes, but this legislation still would not require states to issue marriage licenses to same-sex couples, which the only thing requiring them to do so right now is Obergefell. \n\nFrom [Reuters](https://www.reuters.com/world/us/us-senate-hold-initial-vote-bill-protecting-same-sex-marriage-2022-11-16/): [The bill] would serve as a legal backstop against any future Supreme Court action by requiring the federal government to recognize any marriage that was legal in the state it was performed. It would *not block states from banning same-sex or interracial marriages if the Supreme Court allows* them to do so.\n\nSo, if Obergefell is overturned then (1) everyone who was married pre-overturn is still married and every state has to recognize that (because the federal government does and Supremacy Clause), but also (2) states would be free to then begin denying marriage licenses based on sex/gender (interracial marriages are still protected by Loving v. Virginia), and (3) states would have to recognize other states newly issued marriage licenses (because the federal government does so and Supremacy Clause).\n\nIn all, if this passes and Obergefell is overturned,  then states will be free to restrict marriage based on gender and sex, and if that happens then it’s very likely that non-heteronormative couples in many states would once again have to travel to another state to get married.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Unless SCOTUS goes even further and rules this bill unconstitutional for whatever reason Alito feels like.","score":11,"comments":[{"body":"If so, congress can just pass it again and again until another justice dies","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"What the fuck is the excuse for the republicans who did not vote for this? Party of freedom, my ass.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Almost Twice as Many Republicans Died From COVID Before the Midterms Than Democrats","not_safe_for_work":false,"locked":false,"body":"","score":167,"comments":[{"body":"Boy, I sure feel \"owned\"! They sure showed us. Smh.","score":51,"comments":[{"body":"Dying just to own the libs.","score":13,"comments":[]},{"body":"they can please continue owning us in this fashion. in fact i encourage them to increase the level of ownage","score":15,"comments":[]}]},{"body":"Keep up the good work antivaxers!","score":25,"comments":[]},{"body":"I'm surprised it's only twice as many.  Ok, ok, I might feel slightly owned.","score":14,"comments":[]},{"body":"Bonus: Alot of the Democrats who died were probably those frustrating democrats you always hear about in polls who voted for Obama in 2012 then Trump in 2016.","score":12,"comments":[]},{"body":"How sad","score":5,"comments":[]},{"body":"And they STILL won House majority! If they hadn't caused the death of all of those Republicans they would've taken everything in the midterms! Maybe they will keep up their anti-vax stupidity and take care of 2024 for us!","score":12,"comments":[{"body":"Two more years of young people turning 18! The youngins are swinging almost 70% democrat. Keep voting!","score":6,"comments":[]},{"body":"Gerrymandering is powerful.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"My actual instagram feed😵‍💫","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"And we’re the ones “indoctrinating children”","score":11,"comments":[]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Madison Cawthorn was the only sitting member of Congress at Trump announcement last night","not_safe_for_work":false,"locked":false,"body":"","score":993,"comments":[{"body":"Understandable he's looking for a job.","score":476,"comments":[{"body":"Right?  Hasn't anyone told that idiot that he is completely irrelevant?","score":81,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Looking for boys, preferably 1st cousins.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It gets better....\n\n&gt;Florida Rep. Matt Gaetz was set to attend, but could not make it due to a scheduling conflict. Some lawmakers, like Rep. Marjorie Taylor Greene, congratulated Trump online.\n\nSURE...\"scheduling conflicts\". It goes to show how little juice Donald has right now... for even the gross bottom feeders of the republican legislature to not show up.\n\n&gt;Also absent were three of Trump's children, Donald Trump Jr., Ivanka Trump, and Tiffany Trump. Following the announcement, Ivanka Trump, in a statement to ABC, said that she no longer plans to be involved in politics.\n\n😂 His #1 and #2 favorite children ducked out. Oh of course Eric went because he probably thought he could be the favorite child for the night. 😄 Or maybe he'd get a hug. Ivanka is only upset because her personal brand is trashed and she can't get into desperately fawned over parties anymore. Being a *persona non grata* in NYC has got to sting for a ladder-climber such as herself.","score":132,"comments":[{"body":"Spoiler Alert: Still wasn't the favorite child present","score":43,"comments":[]},{"body":"Jared was there, it’s part of his job working for MBS.","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Well he needs a job since he was not re-elected.","score":160,"comments":[{"body":"This brings me joy","score":29,"comments":[]}]},{"body":"Who? \n\n^/s","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Looks like he ate his feelings (and probably his cousin’s asshole).","score":140,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Twitter can be a fun place to get some sweet memes","not_safe_for_work":false,"locked":false,"body":"","score":257,"comments":[{"body":"Next, I’d you could just put the bastard in jail where he belongs.","score":7,"comments":[]},{"body":"How ironic that hello Brandon was intended as an insult and turned into praise for our great President.","score":3,"comments":[{"body":"I always say that. Everytime I see let’s go Brandon I always say oh he is","score":1,"comments":[]},{"body":"I love the way that got flipped back","score":1,"comments":[]}]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Republicans win U.S. House majority, setting stage for divided government","not_safe_for_work":false,"locked":false,"body":"","score":219,"comments":[{"body":"Did they say how much of a majority they have? Are they at 221 seats?","score":29,"comments":[{"body":"218-210 right now. 7 seats are still up. IMO, there's probably enough Republicans that can cross aisles for legislation to pass.","score":68,"comments":[{"body":"Yep.  It won't be anything too extraordinary though.","score":41,"comments":[{"body":"Honestly, with how the midterms turned out, I wouldn't be surprised if some of the more moderate/centrist republicans just decide to reach across the aisle more than expected.","score":39,"comments":[{"body":"Just had several in the senate cross over to vote for same sex marriage rights today. Hopeful sign maybe","score":29,"comments":[{"body":"It's easier to get a couple Republicans to cross over for bills in the House compared to the Senate.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"O boy here's what they're good at. Blocking everything and complaining about how the government is broken. Lifelong victims club is back.","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The dog caught the car again.          \n\nBy the way, voters in CO-3 still have until midnight to cure their ballots, and there were thousands in need. It's my guess Democrats put no money into this effort since they haven't used it in their text and email begging, and that's another \"There they go again\".         \n\nThe Crackpot Crazy Corp is going to rip McCarthy to shreds and make his life a clusterfuck of gigantic proportion. John Boehner's tenure is going to look like an ice cream social in comparison to the shitshow McCarthy's going to have.","score":112,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Gerrymandered *","score":19,"comments":[]},{"body":"Ah perfect for elites: the do nothing demographic while the middle class get stiffed with everything. Has it ever really been different?","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Dammit, back to this?","not_safe_for_work":false,"locked":false,"body":"","score":70,"comments":[{"body":"Yes. Men can pass the defense of marriage act but they can’t pass a bill to protect a woman’s right to bodily autonomy.","score":5,"comments":[{"body":"How does codifying of Roe make it through the Senate? The protection of gay marriage had a filibuster proof majority of support.","score":3,"comments":[{"body":"Yeah no kidding! There isn’t a single republican who cares about women.","score":5,"comments":[{"body":"Not even the Republican women","score":2,"comments":[]}]}]}]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Bus carrying 28 migrants sent by Gov. Greg Abbott from Texas arrives in Philadelphia, including girl with dehydration and fever","not_safe_for_work":false,"locked":false,"body":"","score":273,"comments":[{"body":"Ugh. I  think I'll always avoid texas like the plague it is.","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"So kidnapping, can't he be removed from office and replaced with Beto?","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He’s “hurting the right people” so the base will approve.","score":61,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Abbott doesn't see them as people, he sees them as political fodder.  He's a vile POS, karma's not done with him yet.","score":47,"comments":[]},{"body":"Mortal sin alert!","score":8,"comments":[]},{"body":"If Abbott could get it up he’d be spanking it to this article.","score":17,"comments":[]},{"body":"He’s only doing this because he’s not allowed to publicly lynch and whip them.","score":16,"comments":[]},{"body":"How do these evil people sleep at night?","score":13,"comments":[{"body":"Same way Adolf Hitler did a lot of pills.","score":11,"comments":[]}]},{"body":"Abbott is a disgusting excuse for a human being.","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Where’s the lie?","not_safe_for_work":false,"locked":false,"body":"","score":394,"comments":[{"body":"A certain YouTuber from the south often wears a shirt that says \"Some of you traded your country for a red hat\"","score":31,"comments":[{"body":"It’s too good","score":14,"comments":[]}]},{"body":"Yep, i feel same. The guy tried to destroy democracy and here we are about to go through another two years of chaos because our judicial system has done nothing about it.","score":17,"comments":[]},{"body":"It's the profiteers &amp; pathological liars of the RUpubliclone cartel. The same greedy bastards that dreamt up phony WMD of Iraq &amp; took us into war for $$$. Now, these ass wipes permeate the dark money laundry of the GOP. Trust them at your own peril. American redcaps &amp; tRUmpies are idiots.","score":13,"comments":[]},{"body":"I cannot expalin how much this resonates with me. Really puts my feelings into the right words and will be used to explain to my extended family as to why I am not attending Thanksgiving.","score":8,"comments":[]},{"body":"This sums up exactly how I feel. Exactly.","score":6,"comments":[]},{"body":"It still breaks my brain every time I think about how a carpet bagger from Manhattan has convinced the poorest people in the country to vote against their best interests.","score":5,"comments":[]},{"body":"This removes agency from the people voting for the grifter. They want to take away your agency, put minorities in their place, and uphold white supremacy. Trump just became the embodiment and showed them, wrongly, that their wants were a winning strategy. They are complicit and they are fascists. Be more angry with the Republicans in your life. They are ok with coups! This is unacceptable. Let them know it is unacceptable.","score":2,"comments":[]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Joe Biden's calmness might have just prevented catastrophe","not_safe_for_work":false,"locked":false,"body":"","score":54,"comments":[{"body":"Wow it's almost like having someone who thinks before he acts or talks is working out for us.","score":17,"comments":[{"body":"Buh buh buh old man can’t think!\n\n/s","score":4,"comments":[]}]},{"body":"FIRE AND FURRY... THE LIKES OF WHICH NO JUAN HAZ EVAR SEEN BEFORE EVER, LIKE NEVAR BEFORE","score":6,"comments":[]}]},{"title":"Patty Murray in line to be first female Senate president pro tempore","not_safe_for_work":false,"locked":false,"body":"","score":32,"comments":[{"body":"These are nice little victories :)","score":3,"comments":[]}]},{"title":"Trump running again can only hurt the Republicans","not_safe_for_work":false,"locked":false,"body":"","score":3877,"comments":[{"body":"LOL, way to drive out the blue vote in 2024.","score":553,"comments":[{"body":"expectations that everyone would vote is how we lost 2016.  I will take nothing for granted and claw for every last voter.","score":394,"comments":[{"body":"I will never miss an election for as long as I live. Especially if it’s to vote against a Republican.","score":306,"comments":[{"body":"That is what our family did in Arizona - we voted smarter:\n- We voted by mail.\n- Only voted for Democrats in our ballots.\n- Hand-carry our Ballots and drop them downtown directly to the registry. We could not trust post office with this important documents.\n- Will do it again and ge suspicious of any Republican tactics to stop us from voting!  Be aware and cautious but VOTE!","score":154,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It would be really fucking funny if he drove all the other GOP candidates out of the race and then had to drop out cause he gets arrested for treason. I know it's mostly a fantasy but a man can dream.","score":247,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I will make a branch of predictions for 2024 and I would like to hear you guys opinions. If no major event happen, like war a with China or Russia, I predict the following outcomes: 1) Trump will run for president and DeSantis will not. After 3 consecutive losses, it should be clear that most Americans do not like the MAGA message. Trump will most likely lose and make the republican party even weaker. 2) Trump will run for president and so will DeSantis. This will cause a split in the party between the MAGA group and more moderate republicans. This will make republicans even weaker no matter who wins. I think that the best thing could happen to Republicans is to Trump to choke on a Big Mac and die before 2024. I guess Lindsey Graham was right back in 2016 when he said \"If we nominate Trump, we will get destroyed.......and we will deserve it,\"","score":237,"comments":[{"body":"I am positive it will the latter. DeSantis is the GOP golden boy. He will win the primary. Trump will then run as an independent thus splitting the vote.","score":185,"comments":[{"body":"&gt; Pray he’s that stupid. Pray we’re that lucky. \n\n\\- Leonidas, King of Sparta\n\n\\- - Michael Scott, King of Paper","score":39,"comments":[]},{"body":"DeSantis is looking as good as he’s ever gonna look. If he wants to be president and there’s every indication that he does, he knows that he has to strike while the iron is hot. I don’t think there is any way DeSantis passes on 2024. Btw there are 4 potential presidential candidates from FL. And I hope they rip each other apart.","score":72,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"&gt;Trump running ~~again~~ can only hurt the Republicans\n\n\\- My naive ass in 2016.\n\nLet's not get complacent, folks.","score":144,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Opinion | America Deserves Better Than Donald Trump","not_safe_for_work":false,"locked":false,"body":"","score":351,"comments":[{"body":"This article may be behind a paywall. You can add 2-4 paragraphs as a quote in a comment. *Do not post the text for the entire article.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"“The case against Mr. Trump is straightforward. He uses demagogy to stoke racism. He lies about matters great and small. As president, he frequently placed his personal interests above the national interest. He promised to lift up ordinary Americans and instead delivered tax cuts for the wealthy that significantly increased the federal debt. He was a friend to dictators and an inconstant ally to liberal democracies. He made the country’s military position in the world demonstrably weaker by foolishly withdrawing from the Iran nuclear deal, which even a senior Israeli official now concedes was a serious self-inflicted wound. And in perhaps his greatest test as president, he treated the Covid-19 pandemic as a public relations problem, downplaying the danger and resisting basic safety measures that would have saved lives.\n\nIf he is elected, a second Trump term would lack whatever guardrails were in place during the first. Over the course of those four years, Mr. Trump grew bolder in his defiance of the other branches of government, disregard for the law and flagrant abuses of presidential power. This time, he would be running with the support of those who are not only aware of his worst abuses but have also embraced him as the wronged party. He is likely to be surrounded even more completely by sycophants. Consider, for example, whom Mr. Trump might choose as an attorney general. At the end of his term, Mr. Trump forced out his own attorney general, Bill Barr — a loyal supporter but someone who was unwilling to openly break the law — and tried to install a midlevel Justice Department official whose primary qualification was an apparent willingness to do exactly that on Mr. Trump’s behalf. A second term promises to be a revenge tour of grievances and political payback.\n\nThe Democratic Party has an obligation to do more than simply point to those possibilities. Democrats must take seriously the challenge of offering to Americans an appealing alternative. The ultimate justification for democracy and upholding the rule of law is that it is the system of government that provides the best life for the most people. Democrats argue, correctly, that voting against Mr. Trump and his allies is the principled course. They must also show voters that democracy is worth defending, and that it will improve their lives and the lives of their children. In countries where weak, ineffective opposition parties leave people without hope or good alternatives, it is easier for autocrats to fill the void.\n\nMr. Trump gravely damaged American democracy, but there are promising signs that the wounds are beginning to heal. Nearly without exception, the losing candidates in the recent midterm elections have conceded with grace — even some of those who had attacked the integrity of the election system during their campaigns. The return of Mr. Trump’s dark circus threatens that progress. He will once again tempt Americans with misinformation and outright lies, veiled threats and outright calls for violence, insults and provocations. By rejecting his bid for a political revival, Americans can put Mr. Trump in the past, and get back to the hard but necessary work of self-government.”","score":37,"comments":[]},{"body":"The NY Post ran the headline Florida Man Makes Announcement! 😂","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I offer the following slogan for the coming campaign season: 45 =/= 47.\n\n45 MUST NOT = 47","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Doesn’t matter what we do or don’t deserve. Trump has an unnatural ability to gain momentum. He has found a crowd that loves him and he knows exactly how to self market. People saying he doesn’t have a chance are in denial. Look how that went in 2016. \n\nOnce again, we have to show up and vote. The democrats need an overhaul because the voting to oppose the other is not sustainable.","score":11,"comments":[{"body":"But in 2016 people didn’t know what they were getting. Now they do.\n\nHe’ll still get votes sure. But he’s lost two popular votes, an electoral college, and now his party is underperforming, a lot of that underperformance directly relates to him.\n\nPersonally, I don’t think he can. I really don’t even think he’ll win primaries. But I’m no clairvoyant, so we’ll see in two years","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I don’t know about “deserve”, but we certainly need better.","score":8,"comments":[{"body":"Taking into account the old adage about \"government they deserve\" we've been reallly shity","score":5,"comments":[]}]},{"body":"And this is an “opinion”?  No it’s a fact.","score":15,"comments":[{"body":"I was going to say lol this is definitely not a \"hot\" take","score":5,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"First Poll released after midterms shows Democrats cleaned the slate with young voters.","not_safe_for_work":false,"locked":false,"body":"","score":208,"comments":[{"body":"TFW when they keep pushing conservative culture war shit while we're literally spawning more voters and theirs are dying of treatable diseases, cant pay for medical because no public healthcare, they give all their money to a big orange grifter and other televangelists, and others just become unable to vote because they're too old to leave the house but theyre told mail in vote=bad.","score":30,"comments":[]},{"body":"This is pretty dangerous for the GQP.  While young voters do tend to get more conservative as they get older, party affiliations are sticky.  Turning off young voters during their formative years may be a costly mistake.","score":25,"comments":[{"body":"Maybe a couple decades ago. I don’t think young voters today are gonna be conservatives as they get older. The world as a whole is liberal and we’re just now trying to catch up","score":13,"comments":[]},{"body":"Actually people don't get more conservative as they get older. \n\nhttps://www.journals.uchicago.edu/doi/abs/10.1086/706889\n\nWhat happens instead is that each generation is more liberal making the older generations look more conservative.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It's almost like young people don't like MAGA policies of codified LGBTQ hate, anti-CRT (pro white power) and no abortion for rape victims.","score":29,"comments":[{"body":"Or being scared of getting massacred in math class.","score":17,"comments":[{"body":"Getting killed in math class is probably the worst way to go.","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Look at the Hispanic vote, 11% independent.  That is a good bit up for grabs from either party.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That isn't the only positive thing. Those identifying as moderate were far more likely to swing Dem as well. Keep voting everyone!","score":9,"comments":[]},{"body":"So they , Republicans, want to piss them off even more and raise the voting age. Just how stupid are these morons. They've already pissed him off when they didn't do anything about the mass shootings and gun control and now they want to raise the age of voting. There is going to be some pissed off kids when they turn 21 if that happens","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Women Empowerment 💙","not_safe_for_work":false,"locked":false,"body":"","score":240,"comments":[{"body":"This boomer guy has long been hoping for many more women in government.","score":18,"comments":[]},{"body":"And Iowa gets Kim Reynolds. FML","score":7,"comments":[{"body":"And SD gets the other Beotch Con..\n\nEdit: fuggetabout abalama..","score":6,"comments":[]}]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"🌊","not_safe_for_work":false,"locked":false,"body":"","score":112,"comments":[{"body":"Good luck with that. *Moore v. Harper* will allow Republican state governments to decide election results regardless of what the actual votes say. By 2024, the United States will be a dictatorship with fake elections like Russia.","score":3,"comments":[]},{"body":"Instead of making this another election about Trump let's pressure the Dems in office to do something so we can run on achievements instead of partisan politics.","score":2,"comments":[]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Since Dems are the ones doing it, we should steal the MAGA campaign. MakING America Great Again, with a \"No Trumps Allowed\" (No Smoking) symbol. Also, should be blue.","score":1,"comments":[]}]},{"title":"Anyone else notice that Trump has gone full Qanon? Here is one of his posts from the other day.","not_safe_for_work":false,"locked":false,"body":"","score":81,"comments":[{"body":"After watching him last night it seems like he is on valium or something.  He seemed slow and had no energy or emotions...","score":32,"comments":[{"body":"Klonopin trump seems *alot* more presidential, but he's just as coocoo for cocopuffs as ever.\nThis time he's chanelling Dutarte with his 'death for drug dealers' bullshit..","score":16,"comments":[{"body":"Just about everything he read so carefully was bullshit like usual.","score":7,"comments":[{"body":"That speech was written by Stephen Miller, doing his best imitation of Heinrich Himmler..\n\nI thought his 'death penalty for drug dealers' lie was hilariously stolen from Dutarte..","score":7,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"He has. Q might be his main supporters.","score":23,"comments":[{"body":"I think so too, especially since he’ll be going against DeSantis. Trump will grab up the Q-anoners and loud and proud MAGAs, while DeSantis will get all the normie conservatives who like to pretend that they’re better than the MAGAs even though they basically believe the same things.","score":27,"comments":[{"body":"Let them fight","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Not sure why so many think him running has any effect on whether he's indicted, but it doesn't. There's no legal reason he can't be indicted just because he's running.","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Lol. He's forcing Republicans to split the party. If he's not indicted, we'll end up with him and Desantis running against each other, and the sides will be so stark that whichever one gets the nomination, the followers of the other won't support them. He's guaranteeing an easy Dem win in '24.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Who cares?","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Fact check: 20 false and misleading claims Trump made in his announcement speech | CNN Politics","not_safe_for_work":false,"locked":false,"body":"","score":149,"comments":[{"body":"Only 20?","score":23,"comments":[{"body":"Yeah I was wondering what the ratio was. I didn't listen to the speech so how many claims did he make?  \n\nA 50% truthfulness ratio may be a new record for him","score":5,"comments":[{"body":"I didn't waste those minutes of my life that I would have never gotten back.","score":5,"comments":[{"body":"I watched only murders in the building. I couldnt imagine wasting a night listening to his lies.","score":6,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"So done with that shit. Just assume it's ALL lies and close the tab.","score":13,"comments":[]},{"body":"What the hell does anyone expect, in  1.461 days, 208 weeks he told 30.573 lies, that Motherfucker blinks he is lying!!","score":8,"comments":[]},{"body":"I've got an idea! How about the press stops covering his BS and ignores him now?  He really needs to be marginalized somehow.  I don't want to ever hear his name again. Now, you know where I stand. \n\nCNN fact checked his entire speech and almost all of it is a different reality than normal people  live in. He only lies and is psychologically messed up.   Why does anyone give him the time of day?!  There needs to be some restrictions on what a political party can lie about to its supporters without stepping on freedom of speech. How can that happen?  We all can't run into a movie theater and yell fire, right?! Why can he? He's a criminal, would somebody please arrest him already?!","score":14,"comments":[]},{"body":"That pretty much average for a trump speech","score":5,"comments":[]},{"body":"&gt;American importers, not Chinese exporters, make the actual tariff payments – and study after study during Trump’s presidency found that Americans were bearing the cost of the tariffs.\n\nThis problem needs to be solved somehow. American companies should not be allowed to profit from Chinese slave labor while Americans are living in tents.","score":4,"comments":[]},{"body":"I worked for Zappos.com, the big shoe company in Las Vegas, before I retired in 2015. At some point tRump and his people asked Tony Hsieh, the founder and CEO, to appear on tRump's god awful Apprentice show. Tony didn't want to do it since by his nature, he was pretty reserved and didn't much enjoy speaking in public. \n\nHe finally decided to take part and by reports we heard afterwards it was a very unpleasant experience. I don't remember details but it only made my opinion of tRump even worse.I also felt bad when the details of Tony's death came out....he was a genuinely decent person and he made some errors towards the end.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Elon Musk Joins Anti-LGBTQ+ Libs Of TikTok to Mock Fired Employee","not_safe_for_work":false,"locked":false,"body":"","score":48,"comments":[{"body":"What an asshole","score":18,"comments":[]},{"body":"*stochastic terrorist Libs of TikTok (she called on supporters to harass a children's hospital and they ended up having to shut it down due to a bomb threat from one of her cult)","score":6,"comments":[]},{"body":"One reason I left Twitter when he bought it, rich asshole with a new toy.","score":8,"comments":[{"body":"Twitter has always been a mess though. Glad you left, you’ll only feel better","score":1,"comments":[{"body":"Did the same with Facebook 7 years ago.","score":3,"comments":[]}]}]},{"body":"I dislike Elon with every passing day.","score":4,"comments":[]},{"body":"Elon is the definition of Privilege that needs to be taxed out of existence.","score":3,"comments":[]},{"body":"&gt;A tragic case of adult onset Tourette’s\n\nElon Musk, projecting again.","score":3,"comments":[]},{"body":"What a piece of shit.","score":2,"comments":[]},{"body":"He’s turned into a garbage human being. I wonder if his fan club is sticking with him these days","score":1,"comments":[]}]},{"title":"Same-Sex Marriage Rights Bill Clears a Crucial Senate Hurdle","not_safe_for_work":false,"locked":false,"body":"","score":39,"comments":[{"body":"This article may be behind a paywall. You can add 2-4 paragraphs as a quote in a comment. *Do not post the text for the entire article.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Not only is this great news overall, it was nice to see one of my Republican senators support it. As well as the occasionally helpful Mitt Romney😹","score":3,"comments":[]},{"body":"Now what?","score":2,"comments":[]},{"body":"Do Griswald v Conneticut next","score":1,"comments":[]}]},{"title":"109 Republicans Who Voted Against banning non-disclosure agreements in cases of sexual assault and harassment","not_safe_for_work":false,"locked":false,"body":"","score":69,"comments":[{"body":"The 109 GQPers who will need the NDA to cover their perverted asses.  What a surprise.","score":7,"comments":[]},{"body":"The fact that Zeldin had a puncher’s chance of being my governor 🤬","score":5,"comments":[{"body":"Blame NY democrats for not mobilizing and campaigning. They got complacent assuming that NY would always vote blue","score":6,"comments":[]}]},{"body":"Here are your bible kissers - However, Republicans now will try to sabotage our economy as a weapon against democrats while they screw Americans for self orgasmic political power!","score":3,"comments":[]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Curious where did you get this screenshot? Did someone make it?","score":1,"comments":[]}]},{"title":"She's a sore loser suffering from Electile Dysfunction","not_safe_for_work":false,"locked":false,"body":"","score":62,"comments":[{"body":"Mr. Trump, I don’t feel so good…","score":3,"comments":[]},{"body":"**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"However, we need to be cautious. Republicans will try to sabotage our economy in my view as a political vengeance to put blame at Democrats!","score":1,"comments":[]},{"body":"Trump's going to make her his VP pick.","score":1,"comments":[]}]},{"title":"Former President Donald Trump announces a White House bid for 2024 | CNN Politics --- Memo to MoscowMitch - This is what happens when you ignore cancer and let it thrive. LOL","not_safe_for_work":false,"locked":false,"body":"","score":179,"comments":[{"body":"\"If we nominated Trump we will get destroyed.....and we will deserve it\"\n\nLindsey Graham 2016","score":35,"comments":[{"body":"His ass has been destroyed for a long time. Literally.","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"[removed]","score":19,"comments":[{"body":"Yes, but its interesting to watch MoscowMitch squirm and just say - \"I've got the votes..\" when the 3 idiots - Ted/Rubio/Scott are gunning for him LOL","score":15,"comments":[{"body":"Let them tear each other apart like rabid dogs fighting each other.","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Garland isn’t coming to save us. Trump can run for President from jail. \n\nThis is on us to do the right thing.","score":8,"comments":[]}]},{"body":"“You’ve wrecked the car three times.  Here, go ahead and take the keys cuz I don’t want to hear your tantrum”.\nBasically.","score":20,"comments":[]},{"body":"We can wish and hope this burns the GOP to the ground, but it won't. Stay vigilant.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He’s metastasized?","score":7,"comments":[]},{"body":"I offer the following slogan for the coming campaign season: 45 =/= 47.\n\n45 MUST NOT = 47.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Election Deniers Lost, But Will the GOP Change?","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[{"body":"No. Thanks for coming to my TED Talk.","score":5,"comments":[]},{"body":"LOL…. GOP, change….. LOL.","score":3,"comments":[]},{"body":"Why would they? Their men on the Supreme Court are about to give them the power to decide election results however they want.","score":2,"comments":[]},{"body":"Democrats have a great opportunity to show what Republicans are all about, Democrats better be vocal about it, “ what are Republicans doing for you “ better be pumping stand alone Bills for the American people and when they’re not brought to the floor or voted down ask why, bring those questions to the American people.","score":2,"comments":[]},{"body":"Not in the short term. \n\nThey have created a system where they cannot win a primary without adherence to their oligarch puppet masters (by their design). Unfortunately, the primary is all that matters for many districts because the Oligarchy has also ensured that this is true.\n\nThe GOP is seeing the downside of this with the realization that most people can actually figure out the BS. However, the amount of institutional inertia is too great to reverse over the short term.\n\nMost election deniers who ran for office never actually believed that there was a problem with the election. \n\nWhat they believed is that this was their special sauce for gaining power. It worked in the primaries and failed afterward.\n\nChanging the GOP, at least the current version, has nothing to do with the election lie, or any of the current lies they use to gain power. \n\nThey will move on to another lie, or gross exaggeration, that appeals to, in many cases manipulates, their base. \n\nThey have learned that the best lies are those that are least grounded in reality because these elicit the greatest emotional response. The fact checks reinforce this because they tap into confirmation bias. Most in the GOP only pay attention to one or two news networks who make all of this work.\n\nThis was Trump's special sauce.\n\nThe GOP cannot even articulate a policy agenda that appeals to more than 50% of the population without contradicting the alternative reality they have created. That is the problem with lies. \n\nThe GOP has mostly given up on policy. \n\nThe rank and file Republicans have been conditioned to not care about details. They just need to know who to hate.\n\nToday a study was released that since the vaccine, Republicans are dying at 2X the rate of Democrats from SARS-CoV-2. Again, lies catching up with unfortunate consequences. \n\nThose who know they have been lying are now wondering whether they should rethink, but how do you tell people you have been lying when you have used emotional manipulation to make the alternative reality part of your supporters ontology? \n\nDemocrats have their issues, but their adherence to school scientifically demonstrated facts and fact-based party initiatives will ultimately pay off. We are seeing some of this already.\n\nWe should not deviate from this. Supporting Trump lunatics in the primaries worked, but it madee feel icky. This is not who we are.\n\nStay true.\n\nThey are feeling consequences of their years of lies. The only way Democrats fail is by being drawn into this.","score":1,"comments":[]}]},{"title":"Trump’s Running, and Republicans Have Only Themselves to Blame","not_safe_for_work":false,"locked":false,"body":"","score":52,"comments":[{"body":"Hopefully Trump losses the nomination but people collect enough signatures to get him on the ballots anyways.","score":3,"comments":[]},{"body":"Hi there!\n\nIt looks as though the article you linked might be behind a paywall. Here's an [unlocked version](https://demo.thisischip.com/?q=https://www.theatlantic.com/ideas/archive/2022/11/donald-trump-presidential-candidate-republican-2024/672132/&amp;o=reddit)\n\n*I'm a bot, and this action was performed automatically. If you have any questions or suggestions, feel free to* [PM](http://www.reddit.com/message/compose?to=chip-paywallbot) *me.*","score":1,"comments":[]}]},{"title":"BREAKING: Republicans will win control of the House of Representatives","not_safe_for_work":false,"locked":false,"body":"","score":27,"comments":[{"body":"Dem here.. I cannot believe I’m at the point of wishing Pence will run for President. I have trump trauma","score":13,"comments":[]},{"body":"So it’ll be 2 years of nothing getting done","score":7,"comments":[]},{"body":"Sucks","score":3,"comments":[]},{"body":"Be ready to be held hostage, they have been very loud they are going to shutdown the govt until Biden ends social security, medicare etc. Fucking Un-American White Christian Nationalist need to be banned from voting or the country for that matter.","score":3,"comments":[]}]},{"title":"Dark Brandon! Biden Sent An Attack Ad Before Trump Even Finished His 2024 Presidential Run Speech","not_safe_for_work":false,"locked":false,"body":"","score":132,"comments":[{"body":"Biden is going to absolutely wreck Trump","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Imagine being the dude who’s job it is to listen to trump babble so you can drop the ad at the right time. “Ok hit send now…no just more ranting..” “ok now…no damnit” 😹","score":18,"comments":[]},{"body":"It's not so much an attack ad as it is just stating facts, but good on Joe for stating facts  - it's kinda refreshing now","score":13,"comments":[]},{"body":"Remember when the world celebrated Trump's loss! Trump is a big loser that's what he does.","score":8,"comments":[]},{"body":"Good for him.  He's no fool, but clearly Trump is.","score":12,"comments":[]},{"body":"Well, it's about bleeping time they started calling out the Republicans' deplorable behavior.","score":4,"comments":[]},{"body":"I also found it hilarious that he timed his statement from Bali about the Poland strike right before Trump’s start time. And ABC had me dying - as soon as he opened his mouth to start the speech, they cut the sound and went to an analyst.","score":5,"comments":[]},{"body":"Yeah I was noticed about it via a campaign email before even the BBC updated their reporting.","score":3,"comments":[]},{"body":"A pretty good one, too","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Republicans’ 2022 Lesson: Voters Who Trust Elections Are More Likely to Vote","not_safe_for_work":false,"locked":false,"body":"","score":54,"comments":[{"body":"This article may be behind a paywall. You can add 2-4 paragraphs as a quote in a comment. *Do not post the text for the entire article.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Another 2022 lesson for them; voters that didn't die of COVID are more likely to vote.","score":12,"comments":[{"body":"I still get weirdos who are joyous at the idea that I am going to die from blood clots from the vaccine.  Right wing manufactured outrage really ruined them.","score":1,"comments":[]}]},{"body":"Shhhhh… don’t tell them. 🤣","score":5,"comments":[]},{"body":"Votes won't matter very much once *Moore v. Harper* is decided next month, just in time to overturn the election results and install a permanent right-wing dictatorship.","score":3,"comments":[]}]},{"title":"Help finance an NC-based postcarding push for Warnock!","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[]},{"title":"Far-Right Republican Who Called For 'More Gallows' Wonders If GOP Had A Messaging Problem","not_safe_for_work":false,"locked":false,"body":"","score":46,"comments":[{"body":"Hmmmm.,..who woulda guessed that calling for lynching of fellow Americans wouldn't play well. Losers. Smh.","score":14,"comments":[]},{"body":"It that the message inst getting thru, yeah must be","score":4,"comments":[]},{"body":"We NeEd To RuN rEaL cOnSeRvAtIvEs","score":1,"comments":[]},{"body":"That bitch is NUTS! Bigly!","score":1,"comments":[]}]},{"title":"Almost Twice as Many Republicans Died From COVID Before the Midterms Than Democrats | The authors of a new study can’t say if this impacted the midterms, but say that it’s “plausible given just how stark the differences in vaccination rates have been, among Democrats and Republicans.”","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"&gt;^(Is it possible that anti-vax Republicans dying from COVID affected the midterms? “If Republicans are dying in increased numbers relative to their Democratic colleagues in a political climate where there are so many close electoral contests, could that have been the decider in a particular particular race?” Jason L. Schwartz, an associate professor of Health Policy at the School of Public Health at Yale and one of the authors of the study, told Motherboard. “Our study can't answer that. But it certainly seems plausible given just how stark the differences in vaccination rates have been, among Democrats and Republicans.”)  \n\nThe professor should have mentioned that in a medical testing environment, the experimenters would be ethically and morally obligated to halt the experiment, in order to deliver more than placebos to the control group.  \n\n  &amp;nbsp;\n\n&gt;^(Schwartz said that he and his colleagues wanted to look at something that hadn’t been carefully studied before. “Could we actually drill down at the level of individuals—in this case of individual death rates—and see whether or not politicization could be linked to mortality,” he said. “So far, it looks like there really is a signal here, particularly linked to the availability of vaccines.”)  \n\nMost who *chose* to reject vaccines did so based on disinformation offered by various cults, most often those cults some  mixture of antiscience, politics and religion.  The cults' disinformation was then amplified and broadcast by the Republican leaders to capitalize on cult support for personal gain.  \n\n  &amp;nbsp;\n\n&gt;^(First, our mortality data, while detailed and recent, only includes approximately 80 percent of deaths in the US. However, excess death patterns in our data are similar to those in other reliable sources,” the study said. “Second, because we did not have information on an individual’s vaccination status, analyses of the association between vaccination rates and excess deaths relied on county-level vaccination rates. Third, our study is based on data from the only states where we could obtain voter registration information - Florida and Ohio; hence, our results may not generalize to other states.”)  \n\nCredit to Schultz for trying to remain apolitical, while trying to describe how politics may have contributed to excess deaths.  Credit to him for trying to describe the strict, scientific limitations of his study.  **Massive credit** to him for taking on this investigation in the sure knowledge that he would become a target of cult and political attack alike.  \n\nThat said, and not being bound by such scientific constraints myself, snug in both my anonymity and lack of personal risk, I'm willing to apply to common sense, and state,\n\nDUH.  Republican \"leaders\" killed their own constituents for personal gain, and they are now experiencing only some of the consequences of their hideous grift, their crimes against humanity.\n\nOr, perhaps they'd like to cling to their *deep state*, anti-mandated-vaccine notions of injecting bleach, Ivermectin, thoughts and prayers, etc., as their constituents continue to die, mercilessly culling their herds of voters.  Republicans have expanded their drunken swerve into the oncoming traffic lanes of science and medicine, and as many as they're able to maim and murder, truth will out, in summing up the dead.\n\nRepublicans should be held legally accountable, not just in terms of \"do we still have the numbers to win elections,\" a morally repugnant place from which they are sure to start.","score":1,"comments":[]}]},{"title":"New Jersey Democrats moving toward putting abortion on the 2023 ballot","not_safe_for_work":false,"locked":false,"body":"","score":29,"comments":[]},{"title":"Democrats sue to allow Saturday voting in Georgia runoff amid holiday dispute","not_safe_for_work":false,"locked":false,"body":"","score":122,"comments":[{"body":"Standard GOP voter suppression tactics. All election days should be on a weekend and be a paid holiday.","score":14,"comments":[{"body":"Vote. By. Mail.\n\nThe whole reason Republicans hate vote-by-mail is it gives voters ample opportunity to study the candidates and make informed decisions.","score":4,"comments":[{"body":"Agreed. Mail in ballots are super convenient. Make voting as easy as possible with several days of early voting by mail or in person, or... dare I say.. online voting?! ... Don't vote on some dead guy's birthday though!","score":2,"comments":[{"body":"Online voting would be a bad idea because of the security risks involved. Convenient, yes, but do you really want some overseas criminal to hack your ballot and vote Republican for you?","score":1,"comments":[]}]}]},{"body":"Has that somehow shown to improve voter turnout?","score":2,"comments":[{"body":"In some places lines are very long and people can’t always miss work to vote.","score":2,"comments":[{"body":"Should be PTO","score":1,"comments":[]},{"body":"Well, and lots of people work holidays.","score":1,"comments":[]}]}]}]},{"body":"That \"holiday\"\n\n&gt;the Friday after Thanksgiving was recognized as “Robert E. Lee’s Birthday” in Georgia","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"Trump's Money Man Just Linked Him to Tax Fraud Scheme","not_safe_for_work":false,"locked":false,"body":"","score":520,"comments":[{"body":"- A major untaxed perk was “authorized by Donald Trump,” his former CFO Allen Weisselberg testifies\n\nFormer Trump Organization chief financial officer Allen Weisselberg testified Tuesday that Donald Trump personally green-lighted untaxed benefits that are the center of a Manhattan criminal trial against several of the ex-president’s eponymous companies — including a gratis residence in New York City. “The rent was authorized by Donald Trump,” Weisselberg said less than two hours into his time on the stand in State Supreme Court in Manhattan. The septuagenarian, who sported a deep gray suit and pale blue tie, spoke matter of factly.\n\nProsecutors allege that the Trump Organization participated in an illicit compensation scheme that illegally lined Weisselberg’s pockets to the tune of $1.7 million of untaxed income. Weisselberg in August pleaded guilty to a 15-count indictment related to these unlawful payouts and, according to Weisselberg’s plea agreement, he “must testify truthfully” if called to testify at trial.\n\nProsecutors indeed summoned Weisselberg to testify — hence the Trump loyalist’s much-awaited courtroom appearance this afternoon. Should Weisselberg testify honestly, his sentence under the plea deal is five months in jail, and five years probation. If Weisselberg doesn’t, then he faces far more time behind bars, judge Juan Merchan previously said. \n\nWeisselberg’s plea agreement stipulates that he won’t face sentencing until after the trial ends, “to ensure compliance” with this testimony requirement. He also has to cough up nearly $2 million in unpaid taxes. \n\nWhen Weisselberg pleaded guilty in August, he made a stunning admission. He responded “yes, your honor” when Merchan asked whether he “engaged in a scheme” with the Trump Organization “to defraud federal, New York state, and New York City tax authorities.” \n\nOne day prior to Weisselberg’s plea, Rolling Stone exclusively reported that he would cop to conspiring with several of Trump’s corporations during his allocution proceeding. CNN first reported that his plea agreement mandated him to testify against Trump’s companies at trial.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Let’s me know when they actual charge him.","score":56,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Of course, he approved it.  Narcissistic autocratic cheapskate asshole like him will never let anyone make money decisions for him without him knowing and approving it.  How can that be so hard to comprehend to people?  He may be a billionaire but he's running a small size corporation to scam people and that doesn't require a huge team to run it.","score":9,"comments":[{"body":"Yep. Trump org is like 10 people.","score":5,"comments":[]}]},{"body":"We never need to charge him, we need to make him poor. I'm talking food stamp poor!","score":6,"comments":[]},{"body":"The DOJ will NOT charge Trump until they are absolutely sure it will stick.  There are so many investigations going on, Garland will find one that he can win.  They are working on it.","score":19,"comments":[{"body":"This is the tax fraud case from the Manhattan DA, not the DOJ.","score":7,"comments":[{"body":"They don’t care either.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"And this idiot was able to announce a 2024 run lol","score":4,"comments":[]},{"body":"$2m in tax fraud and he only gets a six month sentence. \n\nWhile Kalief Browder was in prison for three years before the charge against him for allegedly stealing a backpack was dropped.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"*sigh* here we go again.","not_safe_for_work":false,"locked":false,"body":"","score":436,"comments":[{"body":"We should ignore Trump and let Republicans eat each other. We should only talk about our candidates and what they're accomplishing or plan to accomplish to help people.","score":46,"comments":[{"body":"This is what will happen. I think this is good for the dems.","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I am afraid they will cave in for Trump. You know how republicans play the game.","score":12,"comments":[{"body":"I hate what Trump is doing. He knows that the MAGA movement didn't garner enough pizazz in the midterm results, and that even people who were once fans/allies of him are upset with him, yet when he decides to run for president and if he wins the primary, the people who don't really want him anymore will have \"no choice\" but to back him, and he knows that, which means that Trump won't allow the MAGA movement to die,. He's keeping people who don't even care for him, in hostage to him if he wins the primary. I hate this.","score":10,"comments":[{"body":"This is what narcissistic pigs do!","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I am not sure I can take 2 more years of this..","score":11,"comments":[]},{"body":"Facebook sent out a memo that they can't fact check him because it's political speech and they can't intervene.","score":8,"comments":[{"body":"This is precisely why that shithole of a platform should be regulated","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Yea.. cuz he's been so fuckin quiet these last two years","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Instead of pointing out his lies, they should do the opposite, point out each time he *doesn’t* lie. The fact checkers could take most of the year off.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The Pathetic Story of the Women in the Trump Family....","not_safe_for_work":false,"locked":false,"body":"","score":1256,"comments":[{"body":"I love that when Ivanka posted this she cut Kim G out of the shot.","score":73,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The senate was her “something blue”","score":144,"comments":[{"body":"😂damn ! 💙","score":34,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"All while cropping out your brother's mistress. You can't make this stuff up.","score":43,"comments":[]},{"body":"Lol and then there’s Lara.","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I got confused reading that","score":20,"comments":[{"body":"Trump cheated on Ivana (Ivanka's mother) with Marla Maples (Tiffany's mother), then cheated on Marla with Melanie (Cyber Lord Barron's mother).","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Oh snap!!  I would love to see Trumps reaction to this one!!  Hide the ketchup...lol","score":54,"comments":[{"body":"How great is it that Don Jr’s fiancé Kimberly the gargoyle got cropped out of this photo? Lmao","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He’d be proud!","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"California Creates 17,000 Infrastructure Jobs with Support from the Biden Administration","not_safe_for_work":false,"locked":false,"body":"","score":25,"comments":[{"body":"Slap up about 10-15 billboards, let people see them everyday.","score":2,"comments":[]},{"body":"Do they pay enough to actually live there?","score":1,"comments":[]}]}]}