{"name":"HowTo","description":"Welcome to r/HowTo! Where you can learn how to do anything and everything yourself! Need advice on how to start a podcast or how to fix your car? It's all here from A-Z!","subscribers":3170086,"posts":[{"title":"Please report any self promo/spammers! Thank you! - Management","not_safe_for_work":false,"locked":true,"body":"r/HowTo does not allow any kind of self-promotion videos, sharing youtube channels, or spam. Those who continuously break these rules will earn a permanent ban from this subreddit. We are going to be cracking down on these kinds of posts.\n\nOn desktop (new Reddit) click the three little dots on a post and press report. It is similar on the mobile app too. This will go right into review. \n\nThanks y'all and happy DIY-ing! &lt;3","score":56,"comments":[{"body":"I’m trying to post a question and it’s not posting. Why can’t I post my question? 🥺","score":4,"comments":[{"body":"apparently i don't know how to use the internet either....i'm having the same issue no matter where i post","score":2,"comments":[{"body":"I pretty much always have issues. Complete train wreck 🙋🏻‍♀️","score":2,"comments":[]}]}]},{"body":"Absolutely","score":3,"comments":[]},{"body":"[removed]","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I made several how to video’s but theyre on my youtube can i share them? Or will it be seen as spam?","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I asked a question here yesterday and my post only garnered unhelpful and rude criticism of my question. I wish people weren’t such jerks. I’d take self promotion over downright meanness anyway!","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I’m making free courses on how to weave seats for almost all danish design chairs. Architects such a as Wegner","not_safe_for_work":false,"locked":false,"body":"","score":98,"comments":[{"body":"You can request a course in a specific chair, and I’ll do my best to fulfill! ☺️","score":3,"comments":[]},{"body":"I have metal frame chairs with plastic weaves. Is it possible to re-weave it? Do I have to keep using plastic weaves or can I do it with the wooden like yours?","score":1,"comments":[{"body":"Maybe if you pm me a picture, I can answer that :-) \n\nTypically metal frames are not suited for the type of weaving i do","score":1,"comments":[]}]}]},{"title":"How to clean this","not_safe_for_work":false,"locked":false,"body":"Also What are the tools, sprays  required?","score":99,"comments":[{"body":"Power washer and a stiff brush on a pole.","score":126,"comments":[{"body":"I agree, you'll need a pressure washer. Maybe some simple green, and a brush.\nThat's EIFS/Stucco. Good luck. Might have to paint it.","score":12,"comments":[]},{"body":"Plot twist: this is white stone and they will have to do the whole facade.","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Is this in Indiana? I think i know exactly where... weird.","score":18,"comments":[{"body":"You should quickly drive over and power wash it before OP gets back","score":41,"comments":[{"body":"that would be wholesomely funny and r/wediditreddit","score":15,"comments":[]},{"body":"For real though, I used to live in the neighborhood behind this restaurant. I ordered it all the time. Just confirmed that this is in fact the place.","score":10,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Just hang another sign over it. Screw it.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Vanatrol from a masonry supply store and a wire brush. Wet the stone first, apply a Vanatrol/Water Solution that is 90% water. Let sit for 1-2 minutes. Scrub with wire brush. It will appear to smear around and not come off. Apply Vanatrol water solution again and let sit again. Wash with water. Do ALL of the stone, not jus where the lettering is, to maintain a consistent color. Use caution, the Vanatrol is pretty acidic. It wont burn through your skin, but it will burn it. And it can blind you if undiluted and in your eyes. Don't do it all at once, as you don't want the acid to sit too long. Do as much as you can clean in a ten minute period at a time.","score":7,"comments":[]},{"body":"Pressure washer with some standard degreaser.","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How can I get rid of those bubbles?","not_safe_for_work":false,"locked":false,"body":"","score":453,"comments":[{"body":"You’re going to have to take it somewhere to get re-tinted, unless you’re able to do that yourself.  \n\nGiven your question, I’m guessing that you are not.","score":566,"comments":[{"body":"Don't do it yourself if you don't have experience.  You may end up removing the rear defogger from the glass and it will cost more to repair.","score":161,"comments":[{"body":"I am not sure if it has changed but even the pros used to give a disclaimer that they can't guarantee removal won't damage the defroster. I won't even try getting it off I would ruin it almost guaranteed.","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Had a friend that worked at a tint shop for a while. He said that for some makes and models, it's cheaper to include the price of replacing the window completely than trying to remove old tint and failing.","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Pin and heat gun are definitely the way to fix but replacing at a place that does a good job is way better imo","score":152,"comments":[{"body":"Ya, pop and press might be the easiest way here","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"When a tint job starts to bubble is it typical for it to fail along the defrosters like that?","score":44,"comments":[{"body":"I can’t fully answer your question but this is the exact spot my tints started to get messed up in. Not from a bad job, just age. Had my tints for 5, almost 6, years before they bubbled in this spot and lived in the desert in Southern California and other parts of SoCal for 90% of that time- no garage so endless sun beating down on my car. \n\nI’m going to guess this is a sensitive spot and probably the reason people urge to get it done professionally","score":29,"comments":[]},{"body":"Often times yes, you won't see bubbling like this on normal windows . The defroster heating element is usually painted on and can be hard to clean thoroughly. Each one of those bubbles could be the result of crap on the glass and the defroster lines. Cheap tint will bubble up like that as well.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"New tint","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What is this box for? I am trying to declutter of existing unused wires on my new(old) house.","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"That’s your fiber internet line. You should probably keep that.","score":49,"comments":[{"body":"You don’t think they should slap some peanut butter on there for insulation?","score":14,"comments":[{"body":"And maybe some [fruit salad](https://reddit.com/r/StupidFood/comments/z3wwpk/happy_thanksgiving/) in case someone gets hungry later?","score":2,"comments":[]}]},{"body":"Thanks. I’m using Comcast internet so I may keep it in case I switch.","score":2,"comments":[{"body":"Ya you don’t want to get rid of that. If you cut it, they’ll want to charge you for running new fibre of you go for it in the future.","score":4,"comments":[]}]}]},{"body":"Incoming fiber optic. Leave it be.","score":14,"comments":[]},{"body":"Fiber optic internet","score":7,"comments":[]},{"body":"It’s a fiber optic line. It works better if its really dark in the box. Mine was always slowing down midday. So I shoved a bunch of stuff in there to block the light. \n\nHere’s what works:\nA bunch of socks, \nEmpty paper towel rolls\na really old coke can with a mysterious key inside, \na very creepy doll,\na newspaper, and this is kind of tricky, the date must be the birthday of the next guy that gets called out to service the box,\nOne burnt tarot card,\nWhatever baby teeth you got lying around, \nA small red pebble that, when held, makes you feel like being on an important call but your phone is almost out of juice and there’s nowhere to plug it in. \nTwo tops to an oyster shell and one bottom. \na blockbuster dvd from season one of Charles in Charge  with the phrase “Damnatio memoriae” written in blood on it. Again whatever blood you got. \n\nThis may seem a little odd but anyone with a CompTIA Network+ certification will back me up. \n\nAnd now no more slowdowns.\n\nPlus theres a bunch of crows hanging around now. Like a lot. A lot a lot.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"actually that should be on the inside of your home","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cable internet. Needs to be kept. But totally paintable!","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How to remove this marble? Son got a marble stuck in this game piece and not sure how to get it out. Any ideas?","not_safe_for_work":false,"locked":false,"body":"","score":39,"comments":[{"body":"Put marbles in all the game pieces.","score":68,"comments":[]},{"body":"Melt a glue stick on to the marble. Then use a heat gun to slowly heat up the game piece so that it becomes flexible enough not to pull the glue off","score":61,"comments":[]},{"body":"Trade in son for new toy! JK\n\nHot water and soap. OR wd40 and a hard tap should do it","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Tap it on the edge of a table, with the marble hanging off the edge","score":25,"comments":[{"body":"This.  Maybe heat the plastic with hot water first","score":18,"comments":[]},{"body":"Second this.  If it doesn’t work, hold by the point marble down and hit it sharply with something.","score":3,"comments":[]}]},{"body":"Why all the answers are about ruining either the plastic or the marble?\n\nUse a two way adhesive tape (they are usually stronger then one way ones. Just one side would be enaugh.","score":15,"comments":[{"body":"This sub kinda feels like it has AskReddit levels of karma shit posting sometimes","score":11,"comments":[]}]},{"body":"Super glue and pull","score":14,"comments":[]},{"body":"Drill hole in game piece, poke from behind","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Help! I blew a breaker working in the garage and need it on asap to finish my time sensitive work. I have no idea how to read this.","not_safe_for_work":false,"locked":false,"body":"Hey I blew the breaker working in my garage spray painting w/ a compressor and I need to finish my coats because I'm worried I'll screw up my project however my husband also works from home and is an important meeting for the next 3 hours that I cant interrupt by flipping the breakers and accidentally taking out his power.  I tried the one I thought was the garage and it wasn't.  \n\nHow do I know which ones are garage ? I can't make heads or tails of this.","score":48,"comments":[{"body":"Do you have any GFCI outlets in the garage that may have tripped","score":77,"comments":[]},{"body":"Probably a GFCI. Everything looks fine on that box. If it didn’t fully trip you need to shut off that circuit and not use until you can replace breaker. \n\nI’m going to guess this is a GFCI problem or whatever was plugged in is broken.","score":73,"comments":[{"body":"You were right thank you !!","score":42,"comments":[{"body":"Nice!","score":14,"comments":[]}]}]},{"body":"Looks like the breaker is fine for the garage, did whatever you were using have an internal fuse or breaker on it? Does your garage have a separate panel?","score":16,"comments":[]},{"body":"Solved thank you !  It was the GFCI thing on the power bar.","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"For your personal reference and since no one else has pointed it out yet (to my knowledge, sorry if I missed a comment) your breakers don't work like fuses; they don't get blown out every time the circuit is overloaded. Instead, it will simply \"break\" connection with the circuit causing the switch to flip to the \"off\" position. Since it was a GFCI problem, a breaker tripped down the line that prevented the entire circuit from overloading, which is why you didn't find any flipped switches on your box. I hope you find this information useful.","score":4,"comments":[]},{"body":"Also the one on the left that says garage din and outside still works.  I assume it's the garage one on the right ?","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Have a separate panel in the garage?","score":2,"comments":[]},{"body":"Has to be a inline GFI plug. I have had that issue in mine. Good luck.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The Tiles guy has wrongly preempted the size of an electrical switch box. What is the best way to fix the glitch considering the tiles are all affixed….","not_safe_for_work":false,"locked":false,"body":"","score":330,"comments":[{"body":"Extra wide cover plates exist","score":464,"comments":[{"body":"and you can always add a facade trim/tile to the switch plate too.. use a pair of wedges in opposite directions to center and mount with construction adhesive after trimming excess.","score":87,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Get a bigger box to fit the hole","score":110,"comments":[{"body":"they based it off of something.. get the box they used..","score":43,"comments":[{"body":"Looks like they used the switch plate","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Big switch plate","score":32,"comments":[]},{"body":"Easy. Have the tile guy fix his mistake.","score":144,"comments":[{"body":"OP is probably the tile guy","score":72,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Remove the grout from the tile with the wrong sized cut and break the tile. Clean off any tile adhesive with a chisel, adhere tile with correct sized hole, then grout.","score":111,"comments":[{"body":"this is the only right way.","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Tile guy opened the hole way to big and plumber tried to fill it in to save it, anyway I can fix this?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"This is quite easy fix. Home Depot/Floor and Decor (if you are in US/Canada/Mexico) sells your tile (buy one sheet). Also you can buy a small quantity of thunder and grout. \n\nTake the grout out, even with a flat screwdriver. The rest is easier if you just watch a short YouTube video","score":6,"comments":[{"body":"What kinda of video would I look for, how to lay tile? Do I have to cut the surround tile to lay in a new patch?","score":1,"comments":[{"body":"Tile guy should know how.","score":2,"comments":[{"body":"It’s been almost impossible to get people to work on anything. I keep getting told that they’re to busy to that they have too much to do. I can only rely on myself now. If anyone knows any tile people in the La area that can do it properly I would be over the moon.","score":0,"comments":[]}]}]}]},{"body":"Yes. Have tile guy fix it and have them grout caulk that crack on the left. They will probably just re grout that area. Looks like plumber used thin set and not grout.","score":1,"comments":[]},{"body":"You definitely can, it’s just pretty stone pieces and the right type/color of sand in the mortar mix. The hard part is hand picking the stones that match and test-cure a mix to see how the color turns out before you roll up your sleeves. Patience will deliver the rest.","score":1,"comments":[]}]},{"title":"how to reattach/fix this so gate functions normally again.","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"If that's an automated gate, leave it well alone and get a professional gate engineer/technician to take a look. These things can cause serious injury, or worse, when they go wrong.","score":1,"comments":[]}]},{"title":"Friend puked on my fleece jacket. Already tried washing it. How do I remove these stains?","not_safe_for_work":false,"locked":false,"body":"","score":165,"comments":[{"body":"No joke. Shampoo. Like the kind you use in the shower on your head. I didn’t believe my dad when he said it gets almost every stain out on clothes (even blood and oil/grease) until i tried it one day. Doesnt have to be a fancy shampoo or anything. Just the dollar stuff works fine and use just only a small squirt, like dime sized or else youll have bubbles and suds all over the place! Use cold water. Hot water will only set the stain. And plus as a bonus, my clothes came out WAY softer and smelling amazing too after they came out of the dryer.","score":169,"comments":[{"body":"Would this also work on a carpet? I spilled coffee on our rental carpet and it is not coming out with carpet cleaner. I added some nutmeg to the coffee so I'm not sure if that's the problem but would love to get my security deposit back lol","score":16,"comments":[{"body":"Try laundry detergent","score":17,"comments":[{"body":"Okay… so what youre saying is…. For clothes don’t use laundry detergent use shampoo… for carpet use the laundry detergent….  So to actually get my hair really clean I should be using the carpet cleaner then right?     \n\n/s","score":54,"comments":[{"body":"Chris go to your room!","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"I’ve had to wash loads of clothes with it before and the smell was nice. Plus no more dander in my whitey titeys","score":7,"comments":[]},{"body":"Cheaper shampoos will likely work better for this purpose since they will have more aggressive degreasing agents.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"There are special carpet shampoos made with enzymes to clean up pet puke.\n\nThey are not very expensive and are great at taking stains made also by food and other stuff so its a good investment","score":23,"comments":[]},{"body":"It's possible that the acidity in the vomit bleached the color out.","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Dude good luck man. If you haven't tried one of those nasty extra strength stain removers do one of those. If you're particularly attached to the garment you could have it dry cleaned. Me personally I'd be like Kyle I'm not mad, I had a great night in fact. But you will be buying me a new jacket.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How do I remove this stain of ink? (A rubber for scale)","not_safe_for_work":false,"locked":false,"body":"Quick before my mom finds out","score":8,"comments":[{"body":"Alcool","score":2,"comments":[]},{"body":"Soft scrub, soft white damp cloth and elbow grease.","score":1,"comments":[]},{"body":"What’s it on?","score":1,"comments":[]},{"body":"Eucalyptus oil or rubbing alcohol","score":1,"comments":[]},{"body":"It’s either water-based or alcohol-based so try one of those","score":1,"comments":[]},{"body":"I'm gonna assume this is fabric of some kind. It's it's paper you're gonna have a real hard time lifting it out without damaging the paper. \n\nIf it's very fresh probably just water, if the stain is setting already you may still have some luck with rubbing alcohol. Bleaching it out becomes more viable the longer you wait.","score":1,"comments":[]},{"body":"WD-40, toluene, hair spray, acetone… Dawn®️&amp; water….  Mr. Clean Magic Eraser….","score":1,"comments":[]},{"body":"Strangest condom I ever saw","score":1,"comments":[]},{"body":"Magic erraser","score":1,"comments":[]},{"body":"Always be sure to check the dates on your rubbers.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How to delete messages on Facebook messenger in conversation log with a deactivated account","not_safe_for_work":false,"locked":false,"body":"The usual method of holding down and unsend doesn’t work","score":1,"comments":[{"body":"Once it hits the server, it's there forever, for any agency/person to see.","score":1,"comments":[]}]},{"title":"How to fix my whippersnipper/trimmer with the line tangled inside it?","not_safe_for_work":false,"locked":false,"body":"It's an auto-line feeder. It stopped auto feeding so I took out the line to have a look at it, put it back together, turned it on and this happened. I must have done something wrong somewhere, but now I can't get the line out. Even pulling hard, it doesn't come. Any ideas?\n\n[Image.](https://preview.redd.it/il0sfy97p12a1.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=86df3c69be26b6cd4205564d8c65acb8097f7083)","score":1,"comments":[{"body":"pliers, pull harder","score":2,"comments":[{"body":"You know, I honestly wasn't expecting this to work. It required a lot of turning and jiggling the line at the same time, but I eventually got there.","score":1,"comments":[]}]}]},{"title":"How to make plutonium fuel rods for nuclear reactors","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"Nice try Kim Jung","score":1,"comments":[]}]},{"title":"How to open door that’s locked itself with these handles (only access to side 1.)?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"My cat is locked inside, any help is extremely appreciated!","score":2,"comments":[]},{"body":"use a key....or make a pick with a bent wire/nail","score":1,"comments":[{"body":"Don’t have a key and have tried picking the lock but doesn’t seem to do anything","score":1,"comments":[{"body":"it takes a relative strong amount of force to move the bolt","score":1,"comments":[{"body":"I’ve tried real hard but no luck","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"body":"Pick the lock, shouldn't be too difficult","score":1,"comments":[{"body":"Have tried, harder than it looks","score":1,"comments":[{"body":"Have you tried removing the front plate? Or at least unscrewing and turning it to expose the lock part","score":1,"comments":[{"body":"If I remove the plate all that’s behind it is the door and two holes, one for the key and one fore the door handle spindle","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"body":"unscrew the plates and go from there","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"How to remove black water stains ?","not_safe_for_work":false,"locked":false,"body":"Hello! I got a leak from the washing machine and it damaged the wood on the otherside of the door. Any ideas how to make the marks less visible ?\n I tried with hydrogen peroxide but it didn't do much.\nThanks!","score":5,"comments":[{"body":"Check out furniture refinishing videos on Youtube featuring oxalic acid","score":2,"comments":[{"body":"Thanks I'll have a look 😌!","score":1,"comments":[]}]}]},{"title":"How to fix this part of my windows? The one on the right has a gap but the one on the left doesn't. Not even sure what it's called.","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"Tip the window in, then you can get to the bottom of that piece and slide it back up","score":2,"comments":[{"body":"Is it possible that's how bugs are getting into my house or is there another way?","score":1,"comments":[{"body":"Generally not, but you can feel for a draft there to see if it open to the outside. What kind of bugs? If they fly check vents, chimney dampers and openings higher up, if crawling, check gaps under doors","score":3,"comments":[]}]}]},{"body":"My double pane bathroom windows have a gap like that on the slider side. There's a plastic capping piece that slides into the hole.","score":1,"comments":[]},{"body":"It’s window stops from lifting the window and coming out usually a piece of aluminum","score":1,"comments":[]}]},{"title":"Anyway to fill this with something? Or get rid of marks?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"Walnuts","score":3,"comments":[{"body":"I think this only works for real wood. Could be wrong though, couldn’t hurt to try","score":2,"comments":[]}]},{"body":"Gouges in laminate are gonna be there.\n\nYou might have luck with a touch up stain marker, but that's going across a lot of grain, and that's a tinted film finish more than stain, so the touch up markers probably aren't the best choice. You might find ones that'll do it. \n\nI'd look for a multi pack of all the sharpie marker colors and pull the relevant greys and browns out. Find a scrap chunk of wood that's a similar color to the exposed wood, and experiment with color until you're pretty close. Then color in the scratches with the markers. \n\nBurnish the edges of the scratches down with a big marble to press in any sharp edges, and then use a wipe on water based polyurethane for 2-3 light coats to seal it.","score":3,"comments":[]},{"body":"Most hardware stores and even Walmarts sell furniture touch up markers that will make it less eye catching","score":2,"comments":[]},{"body":"Engineered wood? If you have sample piece take to store to match. Wood putty to fill deeper gouges. You can get away with darker to match grain. Variety pack of wood stain pens for scratch. Test on hidden area. Start Light to dark. Darker will make stand out more. Best of luck.","score":1,"comments":[]},{"body":"Experiment with (don’t laugh) a crayon. Buy a 64 box and find the nearest match, maybe using multiple colors where the fake grain is darker. If you want to be *really* brave, try heating them up so they’re super soft and melty. You’ll need to scrape excess of after. Obv a fix you’ll need to retouch. \n\nAnd for future reference, any home improvement store sells those felt pads for the bottom of furniture legs. $6.99 will prevent this headache in the future.","score":1,"comments":[]},{"body":"Melt some paraffin into the gouges, then buff. Add some appropriately colored Crayola®️ crayon…\n\nOn the shallow scratches, try some colored furniture oil, Crayola®️touch up for tint.","score":1,"comments":[]}]},{"title":"How to fix these table legs?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"probably held in with dowels; wiggle the legs off, scrape off old glue, apply new glue, clamp back together with ratcheting straps","score":4,"comments":[]},{"body":"Take it apart and put it back together with Elmer's glue, and hold together with C-clamps until dry.","score":2,"comments":[]}]},{"title":"How to replace the seat?","not_safe_for_work":false,"locked":false,"body":"I bout a couple of these chair about 6 months ago. Sears in both just sank. I guess, I'm too heavy for normal furniture. What can be done to fix / replace the seats?","score":0,"comments":[{"body":"\"Seats\", not \"Sears\". Brand: Lifetime.","score":1,"comments":[{"body":"E mail them and send pictures. I bought a Lifetime folding chair a few years back and it broke after like a month of use. I wrote them back explaining how I was under the weight limit etc... And they replaced it and that chair they replaced it with has taken years of abuse and it still gets daily use.","score":2,"comments":[]}]}]},{"title":"How do I create a new pleat in my wool coat and smooth out an old one. (On a budget, no machines)","not_safe_for_work":false,"locked":false,"body":"Got this jacket and want it to just hang open a little more but these creases are in the way how can I make this work","score":0,"comments":[]},{"title":"Get the wrinkles out of this rug?Ive tried ice cubes, water, books, flipping it. Nothing works","not_safe_for_work":false,"locked":false,"body":"","score":495,"comments":[{"body":"See how the rug is wrinkled where weight is on it by the coffee table and by the ottoman? Move the furniture, take the rug up. Put down pieces of 1/4 inch plywood or hardboard the size of your coffee table and ottoman, then put the rug back on top. Make sure your rug is smoothed out then put the furniture back on where its weight is on the plywood (that's under the area rug). Should solve the wrinkling problem. I've used this idea before with rug on carpet and it worked well for me. All depends on the kind of padding underneath the carpet.\n\nBest of luck.","score":445,"comments":[{"body":"Hijacking relevant top comment--\n\nOP--\n\nThe carpet is wrinkling from what this person is saying.  A flat sheet of paper will wrinkle on your carpet if you put pressure on the middle of it and force it into the carpet padding.  \n\n\nTape a stack of coasters together and put them underneath the rug and on top of the carpet, where the feet of the furniture are.  You need a spacer underneath the rug so it doesn't wrinkle.  \n\nThe rug isn't wrinkled, you are wrinkling the rug.","score":197,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"The rug needs a firm surface below it so the furniture does not sink into the carpet/foam below it. Maybe a plastic sheet as used for rolling chairs on carpet.","score":90,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Carpet on carpet.","score":219,"comments":[{"body":"More rugs","score":17,"comments":[]},{"body":"He's already got a carpet on a carpet, and that apparently didn't work","score":54,"comments":[{"body":"The legs are sinking into the carpet and exaggerating the pull on the rug","score":19,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Could be caused by weight of furniture, but amplified by the carpet and padding below as the carpet is stretching in some parts and warping elsewhere as a result.","score":77,"comments":[{"body":"This is problem.   Weight of furniture on one side holds rug, then rug pulls and distorts on other side as you walk on it","score":27,"comments":[]}]},{"body":"It looks like it is on another rug. I tried that and finally gave up. I tried pads and adhesive for rug on rug. Nothing worked.","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Is it possible to paint or mod my white LEDs (christmas lights) to make them amber colored?","not_safe_for_work":false,"locked":false,"body":"As I said above... I want my leds to have a warmer hue. Thanks.","score":0,"comments":[{"body":"Technology connections has a couple videos on this: \n\n[https://www.youtube.com/watch?v=PBFPJ3\\_6ZWs](https://www.youtube.com/watch?v=PBFPJ3_6ZWs)\n\n[https://www.youtube.com/watch?v=cQgcTkXacAc](https://www.youtube.com/watch?v=cQgcTkXacAc)","score":1,"comments":[]},{"body":"Dip in translucent nail polish or similiar?","score":0,"comments":[{"body":"That's good advice! Thanks :)","score":1,"comments":[]}]}]},{"title":"Washer tries to spin but fails. Please help.","not_safe_for_work":false,"locked":false,"body":"","score":96,"comments":[{"body":"Not sure there’s anything you can do yourself, but it looks like some kind of clutch is not engaging. It’s probably supposed to be clutching the inner ring AND the drum when it starts its spin cycle. That’s why the middle part is going so fast. Then, the electronics probably sense something’s wrong by the (lack of) amps the motor is pulling, and so it stops and tries again.","score":24,"comments":[]},{"body":"You could start with the \"drain shift actuator\" if that's what it's called.","score":12,"comments":[{"body":"Yep.  Changed one out after an hour of research and a couple of hours of hunting the replacement down semi locally.  Worked great for a couple weeks.  Then something else went wrong and I went to Home Depot and left 800 lighter because fuck trying to fix washers.","score":10,"comments":[]}]},{"body":"Had this happen with mine not long ago. Had to replace the gearbox and the washer basket hub. The gearbox sticks into the washer and has splines that line up in the hub. They had eroded and no longer sat firmly inside one another so it wouldn’t spin the drum. It sounded like an airplane roaring. Was a pretty simple job that didn’t take me very long once I figured out what was going on. Cost me about $200 bucks and has been going strong for two years since then.","score":6,"comments":[]},{"body":"Bad agitator coupler maybe. Super easy fix, cheap part. Google how to replace on your washer.","score":5,"comments":[]},{"body":"I’ve had this happen. Unfortunately the teeth on the actuator that were supposed to drive it were worn down. Pain in the ass repair.","score":3,"comments":[]},{"body":"I've done a lot of digging. Found out how to error code it. Ended up with an F2 E1 error code which the internet tells me could be a) not draining, b) lock switch malfunction, c) stuck button. I cleaned out the drain system, checked the lock system. So the stuck button code means that the control board is faulty. I've also read a few posts that said worn down clutch teeth could cause the same code. I think it's basically time for a new washer.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Of the subject, but that’s a beautiful washer tub.","score":2,"comments":[]},{"body":"Are you getting gas to the carburetor?","score":0,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Before buying any part. A lot of mewer washers just trip relays sometimes. Mine does frequently. unplug it for 30 minutes; plug back in and drain all the water out. try again. Then start buying parts lol","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Help! Bowl is stuck!","not_safe_for_work":false,"locked":false,"body":"I made a double boiler to melt chocolate, but the bowl is stuck bc it was too small! How can I remove it?","score":61,"comments":[{"body":"Put ice and water in the interior bowl. Heat the exterior pan.","score":94,"comments":[{"body":"This. Because physics.","score":34,"comments":[{"body":"Sizzle BRRR","score":8,"comments":[]},{"body":"Thermal Dynamics are awesome","score":3,"comments":[]}]},{"body":"Then twist it to pull out.","score":2,"comments":[{"body":"Then bop it!","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I’m stuck step-bowl","score":15,"comments":[]},{"body":"Where are my Buckeyes then I’ll tell you!","score":10,"comments":[]},{"body":"Fill the bowl with ice water. It will make it easier to separate them.","score":6,"comments":[]},{"body":"Heat differential is your friend as others have said but there's a lip on the inside bowl. Clean it and put it upside down on the floor. Stand on the lip and pull the other part off. Might get lucky.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Hair dye on carpet??","not_safe_for_work":false,"locked":false,"body":"How do I get hair dye out the carpet??🥹 it’s artic fox  Transylvania for reference","score":1,"comments":[{"body":"You can’t remove the dye…just shave it","score":1,"comments":[{"body":"😲","score":1,"comments":[]}]}]},{"title":"Help! Can’t get this off my wife’s car.","not_safe_for_work":false,"locked":false,"body":"I’ve tried everything to get these well water stains off my wife’s car. Is there anything anyone can suggest? These stains have been on the car for over 2-3 months now. Any advice would be greatly appreciated!","score":50,"comments":[{"body":"Clay bar, wax, polish.","score":73,"comments":[{"body":"Yup second this","score":14,"comments":[]},{"body":"Any recommendations on clay bar or polish and wax? I’m kinda novice to all this.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Pay a detailer. It’s way easier. 🤣","score":64,"comments":[]},{"body":"Don’t park next to sprinklers and if you do, wash car within a week.\nBut to take off polish, or chemical guys sells a waterspot remover.","score":12,"comments":[]},{"body":"Ya clay bar. It’s gonna suck but it will be worth it. Give it a good wax after.","score":17,"comments":[{"body":"The wife or the car 🤔","score":50,"comments":[{"body":"This made both my wife and I lol, so thank you","score":25,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Dont.\n\nJust buy a large doghouse and sleep there from now on.","score":16,"comments":[{"body":"LOL. It’s gonna be a cold winter.","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Infrared heat lamp in Restroom","not_safe_for_work":false,"locked":false,"body":"All, I want to replace this ceiling lamp with an infrared heat lamp. When browsing through options, i only found lamps that would require me to cut into the ceiling dry wall or make modifications on the ceiling. Does anyone know of any other options where the lamp is in a similar setup/fixture so I can just swap this? Thank you and happy Thanksgiving!","score":1,"comments":[{"body":"Not really. The housing for an infrared light is heat resistant. Try a small plug in space heater. Or a sand alone lamp with a heat lamp bulb.","score":2,"comments":[]},{"body":"If you have the wall space near an electrical outlet you might be able to install an [infrared panel heater](https://www.google.com/search?q=infrared+panel+heater).","score":1,"comments":[]}]},{"title":"Cleaning burnt-on cranberries in pot","not_safe_for_work":false,"locked":false,"body":"Happy Thanksgiving. Not my mistake. A neglected pot of cranberries [led to thick solid burnt-on char in this stainless-lined copper saucepan](https://imgur.com/a/WioiSpA).\n\nI’ve already tried thick baking soda and vinegar, long soak, heating that solution, holy water.  Ideas?\n\n**EDIT:** After half a day, oven cleaner and especially a pick-axe, [here’s where it’s at](https://imgur.com/a/wXjWaJd).  I’m out of Barkeeper’s Friend, but will try that next against the residual with some kind of drill-attached Scotch or similar abrasive pad.","score":0,"comments":[{"body":"You need alkaline cleaner to remove carbon. Oven cleaner, lye, etc","score":2,"comments":[{"body":"Thx ok. I would have to be careful to keep it off the outside of the pot, which is copper, but that’s doable.","score":1,"comments":[{"body":"You could also put a smaller container filled with ammonia in the pot and cover it, the fumes will soften the carbon, but will take a couple days.","score":2,"comments":[]}]}]},{"body":"Simmer and add vinegar","score":1,"comments":[]},{"body":"A potato cut in half and dipped in salt.","score":1,"comments":[]},{"body":"Other than donating it to a goodwill, I know that youtube is full of home cleaning remedies that don't rely on harsh chemicals","score":0,"comments":[]}]},{"title":"Christmas lights","not_safe_for_work":false,"locked":false,"body":"Okay let’s hear everybody’s crafty way to hang lights on high gutters (32 feet). I tried the light hanging pole only to discover that I have gutter guards so those clips won’t work. I really don’t want to have to buy a $400 32 foot ladder….","score":1,"comments":[{"body":"Don't buy a 32 ft ladder, and don't climb there. So many people get injured for Christmas lights. Get a professional or reduce your plans. \nBe safe first.","score":3,"comments":[]},{"body":"Hire professionals","score":2,"comments":[{"body":"Thanks I totally didn’t think about that","score":1,"comments":[]}]},{"body":"I installed command outdoor light clips to my gutters and use a long pole with a bent hanger on the end. I originally thought magnetic hooks would work but gutters aren’t magnetic so I ended up gluing them to the gutters but after a season they came off. The command hooks have lasted two full seasons now. It’s a bit of a pain to hook the wires in but easy to take down. Your going to need a ladder or reach out windows the first time but no need for the ladder after that.","score":1,"comments":[]}]},{"title":"Can I remove this print from sheer polyester?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"The fabric is 100% polyester and very thin, and the print is stamped on and not part of the fabric. Feels like the paint texture you have on t shirts that becomes cracked over time. I can remove the bits that are already cracked by scratching, but I’m worried about damaging the fabric by scrubbing or using chemicals","score":1,"comments":[{"body":"take it to the drycleaner, they may work with polyester","score":1,"comments":[]}]}]},{"title":"Garbage disposal odour","not_safe_for_work":false,"locked":false,"body":"Not your straight-up odour-ridding question here.  My garbage disposal is, apparently, an outdated model which I have not (yet?) been able to find ANY documentation for online.  The disposal in question has been giving off an extremely foul, earthy stench at varying times/for varying reasons, so I'm trying to clean it out if at all possible.  It's from Emerson Electric, so it's one of their Insinkerator types, Model 405700-5.  On their website, nothing they have listed (even for their discontinued models) even comes close to that model number.  I'm trying to figure out how to safely remove it from everything else so that I can finally and fully clean it out as I don't think it's EVER been cleaned out.\n\nIt could be something for a professional plumber (I won't even call myself an armchair plumber), but the management companies here (the recently departed and the newly current one) are dragging their heels on this, I feel, so I figured I'd try my hand at it.\n\nAppreciate any and all (useful) help!","score":1,"comments":[{"body":"Does it work?","score":1,"comments":[]},{"body":"Best bet is to run bleach water through it.","score":1,"comments":[]},{"body":"Run some ice cubes thru it to break up the goo","score":1,"comments":[]},{"body":"If it works best solution is to run ice cubes followed by whole lemons. \n\nDisposals shouldn’t store ground up food but they grind waste up and it goes down the drain. Smell can come from food getting stuck in the blades but shouldn’t require dismantling to remove.","score":1,"comments":[]},{"body":"You shouldn't need to remove the disposal to clean it.  In addition to running stuff through the disposal, you should clean the inside of the drain that leads to the disposal.  Pull the rubber splash guard out of the drain and clean it.  Then use an old toothbrush or a slightly larger brush to clean the area below the splash guard.  I usually spray a household cleaner into the drain while brushing, but soapy water should also work.","score":1,"comments":[]}]},{"title":"Hide this annoying cable?","not_safe_for_work":false,"locked":false,"body":"","score":628,"comments":[{"body":"Cable raceway or run an additional receptacle up and behind the TV","score":357,"comments":[{"body":"There’s also a kit that you can buy to run the wire down behind the wall and out next to the outlet I forget what it’s called\n\nEdit: Forgot to mention this device comes with fire rated extension cord","score":45,"comments":[{"body":"Wall fish","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Raceway if you don't have the tools to pull power from the pre-existing outlet mainly if there is fire blocking","score":55,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"install a receptacle behind TV","score":142,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Add an outlet at TV height\n\nhttps://youtu.be/pe6H9sZMkhA","score":15,"comments":[]},{"body":"I have some flat white plastic conduit for mine I thought would be obnoxious but I never really notice it. Would recommend.      \n      \nI think it's called TV cord cover on amazon","score":91,"comments":[{"body":"Yup it’s paintable too won’t notice it after a week","score":34,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Cable conduits. There are also kits you can by that allow you to run the cable behind the wall and come out right next to the plug. Then just put a table in front and it's wireless!","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I would run a wire straight up from the low outlet and put an outlet behind the TV.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How to fix this before it breaks","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Heat shrink tube.","score":7,"comments":[]},{"body":"Buy a 5 pack of new ones from Amazon for about $10","score":3,"comments":[]},{"body":"Electrical tape.\n\nHowever it won’t hold up for long, you’ll want to be investing in a new USB cord soon.","score":2,"comments":[]},{"body":"[Sugru](https://sugru.com/).","score":1,"comments":[{"body":"That stuff is amazing","score":1,"comments":[]}]},{"body":"Frank's hot sauce- I put that shit on everything!","score":1,"comments":[]},{"body":"Wrap the broken joint with an insulation tape.","score":1,"comments":[]},{"body":"Electrical tape","score":1,"comments":[]},{"body":"You don’t , better get a new one, unless if you don’t mind the risk of starting a house fire","score":1,"comments":[]},{"body":"\"Braid\" a scoubidou around it, mine works fine after 4 years still","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I moved apartments and didn't use it for a month. Water still tastes bad after running vinegar through it.","not_safe_for_work":false,"locked":false,"body":"So I recently purchased the small filter (white thing on the right) so I connected it and set it up.\n\nWater tasted bad (I'm bad at describing it but I wanna say... Plastic taste? I'm not sure...) So I filled the cold water tank (couldn't reach the hot one but idc about it) with food vinegar (5% transparent-yellow one) and, dispensed some of it to let it \"in\" the lines and let it sit for an hour...\nThen washed it away and set up everything back.\n\nWater still tastes like plastic most of the times I'm trying it.\n\nIn the previous apartment I had three filters and even when they had a 16 months of work, water still tasted good.\n\nPlease help, I can't waste mone rn on technicians or a new one. What can I do about it?","score":1,"comments":[{"body":"That's because vinegar is not a disinfectant. You need to actually clean it with something that will kill whatever is growing in there.","score":3,"comments":[{"body":"Like what?\n\nI mean it looks clean, I cleaned the tank with disinfectend wipers.. what CAN I do?","score":1,"comments":[]}]},{"body":"There are a few options, but if it's bacterial, then a dilute solution of bleach is your best bet. You will need to rinse it thouroughly afterwards. Before that, you should know whether it's a charcoal based filter or not, this will change how you have to clean it. If it is in fact volatile compounds from the plastic leaching out, then it may either be a materials or installation defect. One way to try and de-gass the plastic would be to put very hot (almost boiling) water through it for a bit to heat the plastic up and try to get it to release those chemicals all at once. You may have to so this several times to completely eliminate the flavor. As I write, I realize that perhaps it is your filters themselves that are bad. Can you run it without the filter? Is it better that way? I know some filters have expiration dates, I'm not familiar with this type of system though. Sorry for being so snarky, hope this helps.","score":2,"comments":[{"body":"Thanks for the elaborated comment!\n\nAs per the filter, it is a new one so I don't believe it's close to the expiry date. I also don't believe it's a new filter after taste because I ran gallons of water through it in attempt to clean it. I suppose that rules out the option of the filter being the culprit?\n\nI also don't think I can run anything through it but water from the apartment lines because it goes directly into the wall... \n\nI once tasted the water only out of the filter, and it didn't have a bad taste, but I'm not sure if it's a consistent thing.\n\nSo I suspect this is something between the tank and the cup? \n\nOr maybe I should check if it's in the filter a couple more times to make sure?\n\nI also think that when the water is new in the tank (like after every attempt of cleaning it) it tasted less bad.\n\nMaybe I can do something about it to rule it out too?","score":1,"comments":[]}]},{"body":"Yeah, that's the dishwasher mate. Try again with the brown-bubbler-wakey-doo, yeah?","score":1,"comments":[{"body":"What?","score":1,"comments":[]}]},{"body":"Baking soda mixed in water a few times will pull that plastic taste out. I put a 1/4 in a liter of warm water and let it sit over night in whatever bottle/bladder tastes bad. Twice usually does.","score":1,"comments":[{"body":"How much baking soda per warm water should I put in it overnight?","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Hmm, do you know when the last time your tank was cleaned? (When you say tank I assume you mean the water heater?)","score":1,"comments":[{"body":"Not heater, just the cold water tank inside.\n\nWell, I cleaned it a few days ago trying to fix the taste...","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"title":"How to find contacts on Twitter/ig?","not_safe_for_work":false,"locked":false,"body":"You have the option to sync your contacts but they don’t actually show up, or I don’t know how to. Anyone else have the same issue?","score":0,"comments":[]},{"title":"Light fixtures","not_safe_for_work":false,"locked":false,"body":"Where is the cheapest place (website)to buy decent light fixtures? I have about 10 to install and am hoping to find deals on Friday.","score":4,"comments":[{"body":"I imagine Home Depot is the cheapest place to buy light fixtures.","score":2,"comments":[]}]},{"title":"Repairing/reattach wall paneling?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Unfortunately that is finished. The quick and dirty is to make it stick and fix the next ones to fall is get some Liquid Nails or an equivalent and just dab a few dots as they did and stick it on. Use a few strips of masking tape to hold it up there. To fix that wall properly will depend on your desired outcome.","score":1,"comments":[]},{"body":"Lightly sand to get some grit back on the back of the panel… clean the wall… liquid nails and attach.","score":1,"comments":[]},{"body":"If the material is vinyl, put it up with a troweled on adhesive, but you may want to strip it all, clean everything off, and make a fresh start.\n\nThat sticky stuff was pressure sensitive adhesive. It all has to go away in order for you to succeed.","score":1,"comments":[]},{"body":"Putting it back on is not the root issue, the issue is the warping and buckling.. which may because by the humidity in the space.. if this material is cellulose/wood fiber.. its just poor material choice for the environmental conditions of the space  it was installed in.\n\nyou can try to change the environmental factors and reinstall the items hoping for the best or you can choose an alternative material. these might just be a collection of flooring remnants that the contractor had laying around.\n\nReal paneling comes in long/large tongue and groove (T&amp;G)sheets to be applied vertically so if humidity/heat/thermal expansion is a factor they tighten and loosen as the environment permits. applying it at length vertically allows for the T&amp;G tighten and separate with no visible cues.","score":1,"comments":[]}]},{"title":"Accidentally broke my lock.... How do I fix it? Thanks!","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Buy a new and better quality lock.","score":5,"comments":[]}]},{"title":"How to remove old toilet roll holder?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"On tile? Could just be silicone. You need a picture from below.  I mean did you even look for a small screw in the facia?  It also almost looks like the round end might thread on, certainly easiest way to assemble it, behind that round face might be screws.","score":2,"comments":[{"body":"Took a few more pictures from below. I also think that the round end threads on, I'll try to unscrew it later. Seems like I'll have to use some pliers to unscrew it, it doesn't unscrew by hand.\n\nhttps://ibb.co/d4rHsS0\nhttps://ibb.co/3BXjcwg","score":1,"comments":[{"body":"I thought you were taking about the bottom one. \n\nYou either need vice grips/ channel locks.  Or a putty knife if it's just silicone.\n\nThe problem might be screws and plastic anchors in the tile.  You will have to pull out anchors with needle nose and fill holes with colored silicone","score":1,"comments":[]}]}]},{"body":"Probably a set screw on the bottom of it. More than likely a bracket with some type of screws going through the tile.","score":1,"comments":[]},{"body":"I think you screw off the knobs and the screws might be behind the knobs? Check and see","score":1,"comments":[]}]},{"title":"How to fix my dryer? I found this black debris","not_safe_for_work":false,"locked":false,"body":"My dryer stopped working this evening. After opening it up, I checked the connectivity of the fuse and the thermostat, and they are working good. The heating element are also showing good electrical connection. The only thing that is broken is the high level thermostat.\n\nI intend to replace the part, but I have questions on the debris I found under the heating element. It is black, it is brittle, it is not fabric, it is quite hard. It is not hot, and there are no burn smell.\n\nCan you advise me what to do? Replacing the thermostat is easy but I don’t want to run into further trouble.\n\nThank you!","score":2,"comments":[{"body":"heating element is worn down you might need to change it","score":3,"comments":[{"body":"I opened up the heating element and it turned out that debris came from the plating of the heating element. The coils are still good, and testing showed that it is still well connected.\n\nShould I replace it now or I could hold off for a few days?","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I think is a fire hazard, heat could radiate to ignitable parts, but not sure, play it safe","score":3,"comments":[{"body":"The wire to the element looks burnt, any ideas on how to replace it?","score":1,"comments":[{"body":"look for wiring diagrams and look for replacement parts, if not sure hire a pro since it’s a shock and fire hazard","score":1,"comments":[]}]}]},{"body":"Heating elements are small wire coils. They won't have chances like that. Hard to tell from the picture but it looks like the drive belt failed. If the chunks are rubber that's where to look. Dryers are very simple if it's not a circuit board issue. Google/youtube how to take it apart and get a part breakdown. Find out what's wrong from there.","score":1,"comments":[{"body":"It is not rubbery, it turns out that it is the heating element. It is not the coil, as the coil is good; but it is the plating sides of the  heating element.","score":1,"comments":[]}]},{"body":"Replace the regular thermostat too if the hi-limit is bad. The hi-limit won’t go bad with a functioning thermostat. If the inner cladding (heat shield) of the heating element has deteriorated then I would replace the element too.","score":1,"comments":[{"body":"The thing is just I replaced the element just last month. It is strange that it has deteriorated in just one month.","score":2,"comments":[{"body":"are you sure you got the right one?   Or manufacturer made a bad batch.  I'd try a different supplier.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"title":"Deep Clean hardwood floor - bona doesn’t work","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"Our floors were so bad that we were considering replacing them but we had a floor cleaning come out and look at them; They said it was wax build-up, they stripped them and they look like new!  I don't know what product they used but they didn't charge very much so you might give a floor cleaning company a call.","score":2,"comments":[{"body":"Those exist? Nice","score":1,"comments":[]}]},{"body":"When I lived in New Orleans I think we used Murphy’s oil soap.","score":1,"comments":[]},{"body":"what are you trying to clean?\n\nSmell/odor?\n\nTexture?\n\nColor?","score":1,"comments":[{"body":"Hard to tell from the picture but dirt, grime, cat fur, anything lodged in floor","score":1,"comments":[{"body":"are you trying to clean the gaps between the planks?that can only be done with a toothbrush, set of tiny hook picks and a vacuum.\n\ntexture, color or fading is a refinishing task\n\nsmell/odor is white vinegar (may affect texture/color/pattern)","score":1,"comments":[{"body":"If you zoom in the picture, you can see a faded white splotch.  Sounds like a refinishing task then - this requires a professional? Thank you","score":1,"comments":[{"body":"If it's wax.. try a hairdryer first.\n\nIf it's polyurethane that's cloudy than it's... Chemical","score":1,"comments":[]}]}]}]}]}]},{"title":"How do I clean the grime from this very old, very sentimental, glass?","not_safe_for_work":false,"locked":false,"body":"","score":443,"comments":[{"body":"Try warm soapy water and vinegar.use a sponge to scrub it and rinse it off with warm water as well.","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Looks like the glass is actually etched. Scratched. No repairs would be worth the effort involved unless it's sentimental. You could (theoretically) grind, buff, and polish the inside if you're wanting to save it.\n\nEdit: spelling","score":56,"comments":[{"body":"I agree. This seems more like etched glass rather than stain or soil. No real economical way to refinish this easy at home, unless you know what you’re doing and have the tools, but in that case this question wouldn’t exist.","score":15,"comments":[]},{"body":"Yes, this.  You might Google \"polishing glassware\" rather than cleaning.","score":6,"comments":[]}]},{"body":"I'd start with a white vinegar soak to break up any water deposits and the like so you can better scope any etching, pitting, or other physical damage.","score":11,"comments":[]},{"body":"I've been told a mixture of 1 part dish soap to 1 part vinegar (no water) works wonders.","score":23,"comments":[{"body":"a base and an acid? Hows that work?","score":8,"comments":[{"body":"It foams up all nice and fun for a few seconds and therefore makes the stay-at-home pintrest crowd think it works. \n\nMy favorite crackpot cleaning solution is baking soda and vinegar, nothing cleans like... uhh... carbon dioxide? \n\nThen there is the vinegar only people. Gotta love a mild acid with zero surfactants, to ~~promote rust~~ clean my surfaces... well... except anything metal, wood, stone, grout, mirrors, appliances, greasy, or contaminated with bacteria.","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Try asking r/cleaningtips","score":5,"comments":[]},{"body":"Oxyclean &amp; boiling water","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Welp, this happened. Oak table. How to get it off without ruining it?","not_safe_for_work":false,"locked":false,"body":"","score":235,"comments":[{"body":"I'd start with a damp rag and a bit of work. The paper will soften and fall off when it's a little wet.\n\nMight need a little wax/polish after","score":229,"comments":[{"body":"Solved!\n\nThis is the one I went with. Warm, damp washcloth. I used a mild wood cleaner for follow up, fortunately the glue wasn't too unreasonable.","score":90,"comments":[]}]},{"body":"You can get most things off if you rub it long enough.","score":30,"comments":[{"body":"Skeet skeet skeet","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"paper towel with hot water. should soak in and loosen the cardboard","score":7,"comments":[]},{"body":"Damp it in a warm cloth for a few minutes and rub it with your fingers. Should come off easily","score":5,"comments":[]},{"body":"olive oil.","score":11,"comments":[{"body":"I love you too.","score":10,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Side note I'm pretty surely it's glue from the box, not moisture","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I want to replace the dated hardware on this sewing cabinet, but the old hardware left dents in the wood. Is there a way to fix this without refinishing? Would light sanding with high grit sandpaper cause damage?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"You really can't sand out a dent.  Plus, if you sand at all, you're gonna need to refinish.  Find hardware with plates that will cover the dents.","score":2,"comments":[]},{"body":"I’d would be better to run a steam iron over it through a towel before trying to sad. Steam heat can pop the debts out a bit and perhaps lessen or eliminate the sanding","score":1,"comments":[]}]},{"title":"Remove this mantle from a stone fireplace","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"Hammer","score":19,"comments":[{"body":"I thought you were trolling me… but you were right! It is down and was really easy… thanks!!!","score":14,"comments":[{"body":"Damn glad it worked bc I was just being a twat.","score":39,"comments":[{"body":"Haha, well it was solid advice anyways. Confirmed by some YouTube videos.","score":10,"comments":[{"body":"Nice!","score":4,"comments":[{"body":"You twat!","score":2,"comments":[]}]}]},{"body":"This exchange made my day lol","score":5,"comments":[]}]}]}]},{"body":"Mantle will have to go back up when/ if you ever want to sell the house.\nIt will get flagged for code violation\"","score":2,"comments":[{"body":"What is the reason for a mantle being code?","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Why is it a code violation?","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"How can I remove/clean this?","not_safe_for_work":false,"locked":false,"body":"This is a glass stovetop. It seems the stain is underneath. How did it get there and how can I clean it?","score":1,"comments":[{"body":"Use a blade from a box cutter perpendicular to the stop top, that’s how my mom taught me","score":2,"comments":[]},{"body":"Glass cook top cleaner let it sit then with a window razor scraper about 45 degree should come off.","score":2,"comments":[]},{"body":"I have this too. I'm not sure it can be cleaned - I think this is evidence of the film on the underside wearing away. Following though, because if there's a fix, is love to know too!","score":1,"comments":[]},{"body":"Baking soda and water to form a paste.  Works every time.","score":1,"comments":[]},{"body":"My oven came with a polish. Looks like sour cream with Dorito dust in it search glass cooktop cleaner","score":1,"comments":[]},{"body":"Some people like hopes and dreams, but I like Pink Stuff.","score":1,"comments":[]}]},{"title":"How to clean my walls without toxic products ?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"power washer","score":17,"comments":[]},{"body":"pppppower washer","score":5,"comments":[{"body":"Happy cakeday","score":1,"comments":[]}]},{"body":"Power washer or sand blaster","score":2,"comments":[]},{"body":"Bleach. Use bleach. Can't get more natural. Totally degrades into salt and water","score":2,"comments":[]},{"body":"Vinegar might do something. Have you googled it? There are lots of home remedies on the web and YouTube.","score":1,"comments":[]},{"body":"30 second cleaner. It’s non toxic and works great depending on what you’re trying to clean off","score":1,"comments":[]},{"body":"Simple fabric washing soap. Apply washing soap on the dark spots and leave it over night or just to dry. Dab extra soap in thick spots. Brush and wash it with water. Repeat after 2 or 3 days if it is stained for longer period.\nCheck for non dye soap. Few blue soaps leave blue color on the walls.. There are white color soaps are available.","score":1,"comments":[]},{"body":"Soda. Dissolve in warm water.","score":1,"comments":[]},{"body":"Dry ice cleaning","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"how to adjust cabinet doors with this kind 9f hinge?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"Which way do you need to adjust? Not sure if there’s up and down but I see two screws for in and out. So left to right when the door is shut. Actual attachment is in that hole. The two more prominent flat faced ones will move the hinge.","score":1,"comments":[]}]},{"title":"Cover this burn a guest left on our hot tub lid.","not_safe_for_work":false,"locked":false,"body":"When you lift the cover on our woodfired hot tub it hits the flue, which if it’s been lit for a while burns the cover. It’s a major design floor but the company has been no help.\n\nWas thinking of putting an aluminium plate stuck with some sort of adhesive to prevent it happening again.","score":2,"comments":[{"body":"You might need a lot of aluminium for it might transfer the heat, it also might get very hot.\n\nMake the hole for the pipe larger and make a “cage” for the pipe to keep hands off.","score":1,"comments":[]},{"body":"Was it alfeady covered in brown duct tape? Is that what that is? Might wanna see how much it is to replace the lid.","score":1,"comments":[]}]},{"title":"HVAC help.","not_safe_for_work":false,"locked":false,"body":"how many Modine gas heaters can you run off of a single exhaust?","score":1,"comments":[{"body":"Local code specific.","score":1,"comments":[]}]},{"title":"How to fill the gap between stone and wood? (2 photos)","not_safe_for_work":false,"locked":false,"body":"Would like to somehow fill this jagged gap. Bonus if material used to fill is fire retardant as the wood stove is on stone.","score":149,"comments":[{"body":"Seeing as how you have gaps between your wood floor planks, my gut response is; don't do anything.","score":368,"comments":[{"body":"This - it will never look seamless!","score":63,"comments":[]}]},{"body":"The traditional way is to use natural-fiber rope. You just tap it into the gap. It’ll age darker with time and dirt, but is an easy way to fill gaps permanently with a flexible material that allows the wood to expand and contract.\n\nThere are more modern, more expensive, gap fillers but they are not worth the extra effort and expensive.","score":162,"comments":[{"body":"Is this like old school backer rod?","score":22,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Why do you want to fill that gap?","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It looks great just how it is. That’s how it should look.","score":27,"comments":[]},{"body":"I don't see anyone who has given the best answer I've ever heard which is rope.","score":17,"comments":[{"body":"Rope stained to match","score":8,"comments":[]}]},{"body":"Just sweep dust into it every time you sweep your floor.  A transition would be too busy right there.","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Need to use something that has flex to it as the wood will breath and expand and contract depending on weather - would look at a similar colored silicon.","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Remote camera to monitor boiler","not_safe_for_work":false,"locked":false,"body":"My dad wants to find a way that he can monitor the boiler remotely when he is out of town.  What he needs is to find a way to look at that led on the far right where I am pointing to see if it is lit up or not. Off is good, lit is bad.  \n\n\nI am looking for a cheap camera that will have a resolution to see if that light is on or not.  If it shows there is a problem, he will call someone to go take a look.    \n\n\nIs there a better way, or a cheap/easy camera that will work?  \n\nThanks for your time.","score":13,"comments":[{"body":"Hvac tech here. Depending on how many zones he has ( how many thermostats) he could do smart thermostats and they notifi you if your set temp isn't being reached. But could get expensive if there are alot of zones. Another option is tekmar has a wifi control. I  unfamiliar with it so I don't kown the details but those could be some options.","score":3,"comments":[{"body":"Interesting \n\n\nHe has a thermostat warning but his concern is the boiler itself.  I guess he had an issue recently where it made a huge amount of noise and there was an issue (easy to fix apparently) where he had to bleed something down and it worked just fine.   \n\nI will look into the wifi control.  Thank you!","score":2,"comments":[]}]},{"body":"There are very cheap security cameras on Amazon, with night vision, maybe 40 bucks. They connect to your wifi and you can check them on your phone from wherever you are. Used a camera like that as a baby phone for years.","score":2,"comments":[{"body":"Thank you!","score":1,"comments":[{"body":"&gt;Thank you!\n\nYou're welcome!","score":1,"comments":[]}]}]},{"body":"Something like this would work fine. [Link](https://www.amazon.com/Wireless-Security-Reolink-Monitor-Two-Way/dp/B07X81M2D2/ref=mp_s_a_1_7?crid=GMLQ7OH4C902&amp;keywords=reolink+wifi+camera&amp;qid=1669199165&amp;sprefix=reolink+wifi%2Caps%2C148&amp;sr=8-7)","score":2,"comments":[{"body":"Thank you!","score":1,"comments":[]}]},{"body":"I point an Amazon blink camera at my boiler when I’m out of town. And I put the boiler on a smart switch.\n\nI have best thermostats but the blink camera is peace of mind.","score":1,"comments":[]},{"body":"He could even look are a more involved buy automated system. Something like a raspberry pi zero w and a light sensor, plus a couple of LEDs. \n\nStick the light sensor to the led on the unit, then use the 2 other LEDs, say one red and one green, to indicate if the now hidden on is lit or not. \nThen have a rule setup to send an email when it goes to the wrong state. \n\nYou’ll need to look up and find some kind of project for the code and setup but is better than random visual monitoring. \n\nMaybe get some form of IoT temp sensor and strap it to a pipe that’s relevant and let it send alerts too. \n\nThere might even be better ready built solutions.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How to seal this gap in my attic/roof to keep birds out?","not_safe_for_work":false,"locked":false,"body":"Noticed a bird going from the outside corner of my house underneath the roof into the attic. Went up there and found this small hole/gap. What would be best way to seal it myself? The outside area is largely inaccessible due to the way the roof is (it’s a mansard roof). \n\nWas thinking a metal mesh covering and then spraying foam over it. Thoughts?","score":3,"comments":[{"body":"You should add a picture of the outside too. While keeping animals out is important, water intrusion and shedding is pretty important as well to prevent interior damage.","score":2,"comments":[]},{"body":"Hardware cloth nailed or stapled in place covered with foam from the inside:\n\n[https://www.homedepot.com/p/GREAT-STUFF-16-oz-Pestblock-Insulating-Spray-Foam-Sealant-with-Quick-Stop-Straw-99053993/207077796](https://www.homedepot.com/p/GREAT-STUFF-16-oz-Pestblock-Insulating-Spray-Foam-Sealant-with-Quick-Stop-Straw-99053993/207077796)\n\nYou should still take a look outside to see if any flashing, siding, trim, soffit, etc is missing or damaged.","score":2,"comments":[{"body":"\\+ the green pest expanding foam so the critters don't come back.","score":1,"comments":[]}]},{"body":"I'd do a patch where you trace the hole and place the shaped wood/drywall in it and tape and putty over that. That's what comes to mind anyway. You can Google how to videos.","score":1,"comments":[]},{"body":"Flex seal?  Or that stuff you spray &amp; it expands?","score":0,"comments":[{"body":"Birds will peck through expanding foam.","score":1,"comments":[]}]}]},{"title":"How do I fix this water leak?","not_safe_for_work":false,"locked":false,"body":"Every time it rains the rain just comes crashing through this portion of the roof..are the gutters leaking? Anyone know what is causing this issue and how I can fix it? Any guidance would be much appreciated!","score":10,"comments":[{"body":"step one, make sure the gutters are clean and clear.  blocked gutters overflow and can cause this","score":12,"comments":[]},{"body":"Drip edge?","score":3,"comments":[]},{"body":"Call a pro","score":2,"comments":[]},{"body":"What’s it look like from above? Also looks like your fascia may have water damage that’s been happening for a while.","score":2,"comments":[]},{"body":"Obviously on the bottom it’s leaking through all those little holes. How about a picture of the top?","score":1,"comments":[]},{"body":"Do you have internal guttering? There's probably an issue with that. The water backs up and spills through wherever it can.\n\nTry disassembling the gutter from below first. If that doesn't work, look for roof access from the inside.","score":1,"comments":[]},{"body":"Clean your gutters","score":1,"comments":[]},{"body":"Flex Seal ?","score":1,"comments":[{"body":"That may make it back up into the house though.","score":1,"comments":[]}]},{"body":"I have a similar problem, I think with mine it is a small peice of flashing that should go between the gutter and roof edge.","score":1,"comments":[]}]},{"title":"Load Bearing Wall?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I have people ask me this from time to time. I tell them the best way is to open up the wall so you can see everything. Then hire a structural engineer to provide stamped plans for either a flush beam or exposed. Don’t take chances with the roof over your head.","score":8,"comments":[]},{"body":"The right way is to find a structural engineer who will answer the question.  Post on your local community's subreddit for recommendations.\n\nThe DIY way is to use a stud finder on the ceiling.  If the joists holding up the ceiling and the floor above are parallel to the wall, on both sides of the wall, it is not load bearing.  If they are perpendicular to the wall then the wall is holding them up.","score":10,"comments":[{"body":"If the joists are perpendicular, the wall **might** be holding them up.   It might also just be a decorative wall that happens to be in that orientation.","score":6,"comments":[{"body":"True.  You cannot tell without opening things up.  But from the size of the rooms in the picture, I'm betting in that case the wall is load bearing.  Regardless, and engineer is the way to go.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"I was told If the floor joists above run parallel it’s not a load bearing wall.","score":3,"comments":[]},{"body":"How would I go about determining if this wall is load bearing?","score":2,"comments":[{"body":"This is one of those questions where if you have to ask you should probably hire a professional, or find an engineering school and take the structures classes.","score":6,"comments":[{"body":"Fair enough!","score":2,"comments":[]}]},{"body":"First off, no one except a structural engineer can make that determination. But if you want to know for your own reference, you need to go up into the attic space and see if there are any structural members resting on that particular wall. Structural members can be used to support ceiling joists, rafters, or roof ridges/beams. If any of these things are mounted directly into the top of that wall then it is load bearing. You cannot tell simply from a picture from the outside.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Open home floor plans are overrated.  Noise travels so much further.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Stop the audio from coming out of projector.","not_safe_for_work":false,"locked":false,"body":"I just installed a surround sound system for our projector. The problem I'm having is the audio is still on on the projector and is a little lagged compared to the surround system causing an annoying echo. How do I get the audio to stop coming out of the projector.","score":11,"comments":[{"body":"Change the audio output of the computer it’s connected to.","score":14,"comments":[]},{"body":"What kind of projector is it, make and model?  Is there by any chance both an HDMI in and out on the soundbar?  What make and model of soundbar is it?","score":3,"comments":[{"body":"So the projector it a lucent industries lx1000. Can't find really anything on it, I'm assuming it is some knock off projector but it was free lol. The sound bar is Vizio v-series 5.1 model: v51x-j6 \n\nAnd the sound bar only has one HDMI (ARC)","score":1,"comments":[]}]},{"body":"I just tool the projector apart and clipped the speaker wires. Works great now lol, Thanks all for the help.","score":6,"comments":[]},{"body":"This would surely be an option on the menu system of the projector.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Unplug the red and white cables, they are audio cables. The HDMI is already carrying audio.","score":5,"comments":[{"body":"Those audio cables are plugged in to the output to (I assume) the surround sound system.  The issue is the audio is still coming from the projector's internal speakers.","score":5,"comments":[]},{"body":"That's what I had to use to get audio to the sound bar. I tried the hdmi and It didn't work","score":1,"comments":[]}]},{"body":"HDMI","score":1,"comments":[]},{"body":"Audio routing will likely be a menu option. Keep in mind some ports are ‘smart’ and some are ‘dumb’","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Damaged flooring","not_safe_for_work":false,"locked":false,"body":"Curious how I fix this type of flooring. I have a single panel that keeps coming up and it snags on things. I have extra panels but don’t want to dig myself into too big of a hole.","score":22,"comments":[{"body":"Got an area rug?","score":4,"comments":[]},{"body":"Is it the click lock style?  If so take a scrap piece, put a small rag under it and whack that corner back down using a rubber mallet to get it to pop back in. \n\nSo it's this order bottom to top: snagging board, rag, scrap piece and then whack that with a rubber mallet and hope it pops back in.","score":2,"comments":[]},{"body":"If you just don't want the top visible layer to peal back like tearing a milk carton:\n\nEpoxy, 2 sheets of wax paper and a book with something heavy to hold it down 10-20lbs/kg\n\nthe first layer of wax paper will bond to the repair.. but if you use too much epoxy it will bleed everywhere(tiny dab will do ya\\[toothpick/cottonswab\\]), after it cures you'll need a fine wire brush that will not scratch the flooring, but will take the wax paper off. if you use too much epoxy you will have to sand it down 1000grit+ and it may effect the flooring pattern.\n\n\\&gt;the right way is to replace the piece in the effected area with a spare from the remnants left over from the initial install.","score":1,"comments":[]}]},{"title":"How to turn on my bathroom’s ceiling fan without standing on something to reach it?","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"Cut a notch in a PVC pipe.","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"**[Water meter key](https://www.amazon.com/Eapele-Water-Enforced-T-Handle-Multi-Functional/dp/B08Q3Q5RHL)**","score":13,"comments":[]},{"body":"Replace it with a humidity sensing switch.\n\n[https://www.homedepot.com/p/Leviton-Decora-In-Wall-Humidity-Sensor-Fan-Control-3-A-Single-Pole-White-R02-IPHS5-0LW/204734988](https://www.homedepot.com/p/Leviton-Decora-In-Wall-Humidity-Sensor-Fan-Control-3-A-Single-Pole-White-R02-IPHS5-0LW/204734988)\n\nOr, a humidity AND occupancy sensor switch.\n\nhttps://www.homedepot.com/p/Square-D-X-Series-15-Amp-500-Watt-Single-Pole-Occupancy-Humidity-Sensor-Light-and-Fan-Control-Back-Wires-Matte-White-SQR73105WH/320130659","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Something like a stick with a claw type shape, like...\n\n[https://www.toolstation.com/stop-cock-key/p62757](https://www.toolstation.com/stop-cock-key/p62757)\n\nBut probably best if you made it out of wood so it fits exactly and is lighter.","score":3,"comments":[{"body":"Look at 52 seconds what he's made to turn the crank...\n\n[https://youtu.be/apsH8eBfjVA?t=52](https://youtu.be/apsH8eBfjVA?t=52)\n\nYou want a longer one of those.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Use a paper/trash picker stick...","score":3,"comments":[{"body":"We call that a pinchy-grabby at my house","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Why is the switch on the ceiling ? It’s like bathroom light switches outside the bathroom I just don’t get it.","score":3,"comments":[]},{"body":"replace that timer switch with a smart switch.","score":3,"comments":[]},{"body":"Use the force Luke.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Anyway to fix this rotating chopping board? It starts moving when I use it, so it becomes difficult to use.","not_safe_for_work":false,"locked":false,"body":"","score":66,"comments":[{"body":"Get a wash rag or small towel wet and put it underneath","score":428,"comments":[{"body":"This is how they do it in restaurant kitchens","score":118,"comments":[{"body":"Yep. I used to work as a cook in a hospital kitchen (don’t laugh lol) and that’s what we did","score":48,"comments":[{"body":"Why would anyone laugh at that? I ran a hospital kitchen for years, patient services and nourishment is a very important thing. I know hospital food isn’t the best but it’s definitely needed.","score":55,"comments":[{"body":"I agree. Our food was actually pretty good but most people don’t think of hospital food as being good.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I usually put a tea towel under it, so it can't move.","score":38,"comments":[]},{"body":"Just put a dampened cloth under the cutting board","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I use a piece of one of those rubbery mesh drawer liners underneath, and it works fantastic. Better than the wet towel, I think.","score":40,"comments":[{"body":"Same, plus those rubbery things make great jar openers if the lid is tight.","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Flip it over.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"how to DYI uneven concrete slab foundation floor beneath carpet, at concrete joint?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"Self leveling cement or filler.    Home Depot guy will help with right stuff usually","score":3,"comments":[{"body":"\\+best practice  \n\n\nthe self leveling epoxy is a form of grout that will also water seal the floor, on old concrete you shouldn't have to worry about escaping gasses.. and if you do the whole floor it will be water tight.","score":1,"comments":[]}]},{"body":"[deleted]","score":1,"comments":[{"body":"That's just a temporary fix though, only lasts until the ranch packets expiration date.","score":1,"comments":[]}]},{"body":"How to level your floors:  [https://www.youtube.com/watch?v=cGHlkW2lJpY](https://www.youtube.com/watch?v=cGHlkW2lJpY)","score":1,"comments":[]}]},{"title":"How do I pull it down to open up the shade?","not_safe_for_work":false,"locked":false,"body":"This is probably really dumb but I moved to a new country and don’t know how to pull down the shades here. The second picture shows the shade when it’s down. I think the wind retracted it upwards.","score":82,"comments":[{"body":"https://youtu.be/7BAUPLI-0k8 this may help","score":15,"comments":[]},{"body":"The joint at the bottom of the green box is just a hinge/slide.  Look in the middle of the blinds (middle of the window), there’s a hook. Grab it and pull forward.  The whole roll will rotate down, the flat support in the green box will rotate 90 degrees.\n\nOnce the shade is deployed (rotated down) you can slide the whole thing up and down the rods to make it cover more of the window.","score":12,"comments":[{"body":"Awe you beat me to it lol well said. Friend has this same issue and we just made a hook pole to make it easier to pull down and out","score":1,"comments":[{"body":"\\+pull slowly.. with even force so the ratchets have time to click.","score":1,"comments":[]}]}]},{"body":"I think those type you need to twist the rod to deploy. There should be a crank that attaches to the bottom to make twisting easier.","score":25,"comments":[{"body":"No, those rods are not meant to rotate, and if you try to force it you'll get it jammed up and you won't be able to deploy the shade.\n\nThe rods are tracks for the support to slide up and down on once it's rotated into the deployed position.","score":2,"comments":[]}]},{"body":"The loop in the middle. Pull there. There's usually a rod with a hook nearby for this.","score":4,"comments":[]},{"body":"Classic Aussie blind. You gotta pull that from the middle. They need quite a tug as they are pretty old and clunky. The rails on the side are just guides.","score":2,"comments":[]},{"body":"There is supposed to be a string in the middle to just pull straight down, get up there and grab it in the middle to pull down","score":-1,"comments":[]},{"body":"Twist it like a car jack","score":-1,"comments":[]}]},{"title":"Anyone knows how to get rid of this?","not_safe_for_work":false,"locked":false,"body":"I just sprayed my shoes with a leather protector. When I woke up in the morning it already has these white marks on it. Can someone help me how to clean this?","score":2,"comments":[{"body":"Unzip, pull foot out.","score":9,"comments":[{"body":"... and throw away.","score":3,"comments":[]},{"body":"Or the hard way - a reciprocating saw","score":1,"comments":[]},{"body":"Was going to say the exact same thing.","score":1,"comments":[]}]},{"body":"Shoe polish","score":2,"comments":[]},{"body":"Polish…?","score":2,"comments":[]},{"body":"Shoe polish since thats faux leather (Pleather) leather conditioner wont work for it. But honestly kohls is having a really good deal on boots rn. Saw a really nice pair for $25","score":1,"comments":[]},{"body":"Unzip the side zipper, remove boot, discard.","score":1,"comments":[]},{"body":"Take off boot.  Throw boot away.  Problem solved.","score":1,"comments":[]},{"body":"Automotive interior cleaner/dye/paint","score":1,"comments":[]}]},{"title":"Sending musical instruments across the US?","not_safe_for_work":false,"locked":false,"body":"I live in Australia but I need some instruments sent to their maker in the US. My MIL has offered to take them to the states when she goes over in December, but she will need to send them from within the country as she'll be many states over. Once the work is done then the maker can post them back to her and she can bring them back to Australia in her luggage. \n\nWhat I'm wondering is what services and such to use, how to package the instruments safely, how to take out insurance for postage when I won't be the one signing for it etc (eg should I just give my MIL money to cover the postage and insurance, and then get her to organise it?)\n\nI'm quite nervous about this whole process as I'm worried about things getting lost or damaged. If anyone can walk me through this process I'd be very grateful.","score":0,"comments":[{"body":"I work in shipping. Specifically, shipping music gear. I use Fedex to ship. Plenty of people also use UPS (not USPS).  I’d be more concerned about the luggage handlers on your MIL’s flight than the shipping company you choose. I’ve heard more stories about gear getting trashed by airline companies than Fedex or UPS. \n\nMake sure the boxes aren’t bigger than they need to be. Everyone uses “dimensional weight” instead of “actual weight” so if your box is 5lbs, but it’s   29”x29”x29” you’re gonna get charged a ton for shipping. Your MIL can add insurance based on the value your gear when she ships your packages. Cost will be based on the value you provide. If you don’t pack your gear properly they may not cover it if something happens. Make sure your boxes are double walled or pretty darn sturdy. Don’t go cheap. I’d imagine they’ll re-use the boxes to ship your gear back to you so you need them to be quality. Make sure you pack the box so your packing material will absorb any impacts or pressure from being stacked. I also do the “shake test” when I box stuff. You don’t want your gear moving around. Sometimes I will roll some cardboard into tubes or cubes to add some reinforcement if I’m sending something especially fragile. \n\nHope this helps.\n\nEdit: I’d also take pics of your gear before your MIL flies just in case the airline causes damage.","score":2,"comments":[{"body":"Thanks! Luckily there won't be any issues with luggage handling because my MIL will be taking the instruments as hand luggage. Do you know roughly how much insurance costs as a percentage of value? Is there a calculator on a website somewhere?","score":2,"comments":[{"body":"There might be a calculator on the website, but I’m not sure. I don’t add insurance on packages unless the customer asks for it or my boss tells me to add it on. I’d guess that I’ve shipped well over 2500 boxes this year. I’ve only had one instrument damaged. If memory serves, insurance doesn’t cost that much extra and it’s worth it for all the trouble you’re going through.","score":1,"comments":[]}]}]},{"body":"Instrument made of? Tin? Wood? Urethane? Resin?\n\na good old fashioned plywood crate case with latches, handle and layers of felt on the inside.. tinned corners and edges are fancy but not needed for a one way trip.   \n\n\nSymphony crates are awesome if you can find them..  I used a bunch a while back when they got back from touring the world... for shipping off used turbine parts. worked great. They are quite large and are on skids but you can imagine from this example of what i trying to explain.","score":1,"comments":[]}]},{"title":"How can I fix this? It’s missing the other one (I don’t know how it’s called)","not_safe_for_work":false,"locked":false,"body":"It’s from some lights. It came like this. They were pretty cheap so it’s not worth paying extra money to fix it.","score":18,"comments":[{"body":"If you want to:\nFold a piece of aluminum foil to slide in there that will contact both batteries metal cap centers.  Just checked Reynolds Wrap shiny side is conductive! 😂","score":55,"comments":[{"body":"IT WORKED THANK YOU ❤️❤️❤️","score":26,"comments":[{"body":"Yaaaaaaaaaayyy","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"You can easily fix this by putting tin foil in the spot where the metal piece should be. Make sure to cram enough that it makes contact with the terminals on the batteries.","score":12,"comments":[{"body":"IT WORKED ❤️❤️","score":5,"comments":[{"body":"Lol you can use that same trick to use AAA's if you don't have AA's. Glad to help!","score":3,"comments":[]}]}]},{"body":"Get the spring from a ball point pen","score":10,"comments":[]},{"body":"Tin foil should work","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Take the spring out of a clicky pen","score":2,"comments":[]},{"body":"You don't. It needs both sides to have metal to complete the circuit.","score":-4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Balancing a washing machine","not_safe_for_work":false,"locked":false,"body":"I have a two year old, top loading washing machine, not on a pedestal. In the last month it has started shaking and thumping badly on most loads. I’ve already made sure to load it evenly and not overfill it. \n\nHow do I adjust its balance?  It has feet, but I can’t get to them, and I’m not strong enough to lay it over","score":1,"comments":[{"body":"Possibly replace the suspension rods.","score":3,"comments":[{"body":"\\+worn guides wheels allow slop too, especially in sandy areas.","score":1,"comments":[]}]},{"body":"You need another person to help you. My husband and I just did this recently. My husband just tilted the washer to one side onto 2 feet while I adjusted the other 2, and then tilted the other way to do the other feet. Ours is not on a pedestal. It used to shake and thump too. I lowered all feet to the lowest position. Then used a level on top of the washer and made slight adjustments until it was level.","score":1,"comments":[]}]},{"title":"We live in a rental and I woke up to our dog chewing the stairs. What’s the most economical solution?","not_safe_for_work":false,"locked":false,"body":"","score":1221,"comments":[{"body":"What is under those stairs? One of my dogs was scratching on the floor and we later found out we had mice.","score":390,"comments":[{"body":"Finally someone mentions this! That would have been my first thought: what is on, in, or under that carpet?!","score":171,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It's cheap and easy to remove all of that. New padding and carpet for that amount of stairs is cheap. Choose a similar pattern or at least plain neutral one and call it a day. Teach the dog. Or be prepared to do it again.","score":922,"comments":[{"body":"All this, plus have the dog watch your repairs so he can do the work next time.","score":296,"comments":[{"body":"As the old adage goes, lay carpet for a dog and he will scratch it up the next day. Teach him to lay carpet and his knees will hurt for the rest of his life.","score":55,"comments":[]}]},{"body":"Came here to say this. This is cheap and easy. Just be sure to secure it well or you’re going to have some accidents slipping on the loose carpet.","score":171,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I like the way you talk","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"As a dog owner, your dog might be going through a hard-chew phase. All mine did from the ages of 1 to 2. Carpet steps are delicious to these teenage weirdos.\n\nThey magically stop at 3.","score":113,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"New dog? haha jk he just needs some training and stimulation. Thats your most economical solution because otherwise he may just keep doing it.","score":418,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Be honest with your landlord and offer to fix it or  pay up to fix it. If it’s one of those mass management companies, they’ll try to turn a profit on this too.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How to remove this logo","not_safe_for_work":false,"locked":false,"body":"How can I remove this logo from this jacket?","score":1,"comments":[{"body":"Not possible without irreparable damage to the fabric.\n\nI’d suggest you do the opposite of remove it, and cover it with a patch you prefer.","score":13,"comments":[{"body":"Thank you, thinking of embroidering over it.","score":3,"comments":[]}]},{"body":"Isopropyl alcohol. Let it sit and temove","score":1,"comments":[]},{"body":"I think your flower embroidery is the way to go but I’ve heard acetone will break it down for removal.","score":1,"comments":[]}]},{"title":"How to expand your vocabulary","not_safe_for_work":false,"locked":false,"body":"I no longer feel like I understand a lot of words. I used to do well in high school English class with vocabulary but now I feel like my word rolodex (big word lol) is pretty short. Does time just erode our capacity to understand English? I need some advise. Thanks","score":2,"comments":[{"body":"Reading books is a great way to expand your vocabulary. Even comic books or manga!","score":4,"comments":[{"body":"Read. That’s it. It’s that easy. Read on an iPad so you can look up words when you need to, but really just read.","score":1,"comments":[]}]},{"body":"Like with anything, if you don’t use it, you lose it. 😁 I’m guessing you aren’t around others who use the more ‘advanced’ vocabulary regularly. All the advice to try apps and such are great to learn words, but they need to be used! Good luck!!!","score":2,"comments":[]},{"body":"Subscribe to dictionary dot com's word if the day\n\nBonus points if you also do Spanish","score":1,"comments":[]},{"body":"/r/VocabWordOfTheDay is fun. I know most of the words but still like the subreddit. I would encourage you to read as much as possible. look up any word your come across that you don't know.","score":1,"comments":[]},{"body":"I read. I look up new words. I try to use those words in my writing. I also play word games, but some of those are spoilt by using a ridiculously large dictionary.","score":1,"comments":[]},{"body":"Honestly, I don't read a ton, however I listen to boatloads of podcasts. Also, when I hear a term I haven't learned before, I look it up.","score":1,"comments":[]},{"body":"Read books that are a little bit difficult for you. Comic books and \"Young Adult\" books are dumbed down to make them more accessible. Aim a little higher, and when you come across a word you can't define (which isn't the same as one you've never seen before - often they just slide by) look it up. But don't stop there. Make a point of using that word you just learned in a sentence while it's fresh in your mind. If people look at you funny when you do that, the embarrassment reinforces the memory.","score":1,"comments":[]},{"body":"Read the dictionary, Now please understand that I mean *READ* the dictionary - cover to cover. Now, imagine that you understand the definition of every word and understand the connection of every word to every other word. The knowledge that is unlocked is absolutely tremendous.","score":0,"comments":[]}]},{"title":"How can I get this pantry lid to close up all the way at the top?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"Your hinges may need adjusting. What kind they are, will determine how they need adjusting... you did make sure there isn't anything poking out too far on the inside, right? 😉","score":2,"comments":[{"body":"They are ball bearing hinges. Generic looking https://imgur.com/a/LLgShzu","score":1,"comments":[{"body":"Buy some new ones, the size of that door and the closing action has probably warped the hingeplates after 1000s of closing smacks","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Install a magnetic cupboard catch like this one.\n\nhttps://www.homedepot.com/p/Everbilt-11-lbs-Magnetic-Catch-with-Counter-Plate-White-1-pack-9235941/303045720?source=shoppingads&amp;locale=en-US&amp;&amp;mtc=SHOPPING-BF-CDP-GGL-D25H-025_004_BUILDER_HARD-NA-Multi-NA-SMART-NA-NA-NA-NA-NBR-NA-PRO-NA-BuildersHardware_Smart_Q3_Control&amp;cm_mmc=SHOPPING-BF-CDP-GGL-D25H-025_004_BUILDER_HARD-NA-Multi-NA-SMART-NA-NA-NA-NA-NBR-NA-PRO-NA-BuildersHardware_Smart_Q3_Control-71700000081230576-58700006913855557-92700064312898254&amp;gbraid=0AAAAADq61UfPNFfiunlp9Vi30Oq-nIuc6&amp;gbraid=0AAAAADq61UfPNFfiunlp9Vi30Oq-nIuc6&amp;gclid=EAIaIQobChMIu9j9v6PD-wIVqylMCh2fqgRGEAQYASABEgInG_D_BwE&amp;gclsrc=aw.ds","score":2,"comments":[{"body":"I tried some super thin ones before but this might work better. Thanks!","score":1,"comments":[]}]},{"body":"Does it have adjustable hinges with a tensioner screw on each hinge?","score":1,"comments":[{"body":"https://imgur.com/a/LLgShzu  I don't think so.","score":1,"comments":[]}]},{"body":"Check the hinges or a small velcro dot in the top corner","score":1,"comments":[]},{"body":"Assess the hinges/ask Reddit to assess the hinges.","score":1,"comments":[{"body":"working on it!","score":1,"comments":[]}]}]},{"title":"Alternative way to increase water pressure in central heating system","not_safe_for_work":false,"locked":false,"body":"Hi all,\n\nThe pressure in my water system unfortunately on the low end as I live on the fourth floor. Consequently, the central heating boiler can't be pressurised over 1.4 barg while 2.0 is the required amount. I'm looking for an alternative way to do this. I've heard about suggestion using a bicycle pump, is there anyway with a clear guide on doing so or who knows another way?\n\nThis is just an intermittent one time solution as I'm in the process of getting a hydrophore but getting cold in the meantime. \n\nThanks!","score":5,"comments":[{"body":"Getting air into the system will not improve efficiency.","score":5,"comments":[{"body":"Probably should've stated this, but the idea would be to submerge the pump into a bucket of water and as such increase the pressure using water","score":1,"comments":[]}]},{"body":"1.4Barg should be enough to reach the 4th floor. Your problem may lie elsewhere.","score":1,"comments":[{"body":"Could well be, for my heating system it is however requested to have a water pressure &gt;1.5 barg to ensure that the pump works properly. So I'm close but could be improved.","score":1,"comments":[]}]}]},{"title":"Heat home during outage","not_safe_for_work":false,"locked":false,"body":"How do you guys do it?\n\nWhere we live power outages are frequent (about 1 per week or more) even though we live in the city. I.e there is a scheduled outage thursday 8am to 4pm. They are supposedly improving the system.\n\nIts winter now and I am wondering if there are options to heat the home during extended outages.\n\nCurrent heating is baseboard heaters throughout the house.\n\nNo natural gas hookup available.\n\nI have a wood fireplace but its very sketchy (home wss sold with fireplace as is), you can see insulation bat hanging inside of it.\n\nI thought of installing a propane or pellet fireplace insert with a exit through the current chimey with a blower fsn module to send heat basement and upstairs....but for the cost approx 10k..I might just rent a hotel room for a couple days....\n\nJust wondering if there were other altenatives that I missed?\n\nTheres also the big buddy heater approach but I would need to have a draft for it to be safe...and at -20c I doubt it would work. Also safety concerns\n\nThanks a lot!!","score":5,"comments":[{"body":"Small generator and an electric space heater on an extension cord is probably your easiest solution. Long term, I’d get that chimney fixed.","score":3,"comments":[{"body":"That makes sense. I thought about the generator to heat the whole house but with all the baseboard heaters that would ne be possible....I think I have 15kw of it lol\n\nBut I could def run space heaters and power the fridge freezer for a while.\n\nGreat idea thanks","score":2,"comments":[]},{"body":"Other problem with that fireplace is its placement/location. It doesnt match our layout which makes bestbuse of that room. We basically sit with our back to it. We would need to move the couch out to use it. Very weird placement lol. I guess back in the days the room with fireplace had the fireplace as main focal point.\n\nI might eventually seal it up and have a standalone stove in a better location.","score":1,"comments":[]}]},{"body":"You've touched on gas heaters, so have other commenters here. Here's a cheap, easy and quick upgrade: Try and create a 3-4 inch dead air gap between your windows and the inside of your home using plastic sheeting/film. You can also use bubble wrap for free if you have enough. This alone makes a pretty huge difference and stops cold from coming in and heat from escaping.","score":3,"comments":[{"body":"Oh I see. You mean to seal (i.e shrink wrap) my windows. Thats a great idea...I have old aluminum windows...will work on that as well thnks","score":1,"comments":[{"body":"I've seen 2 kinds of film. One that you put directly over the glass, and one that you put a few inches away from the glass. Like this stuff here https://www.homedepot.com/p/Frost-King-E-O-Indoor-Window-Insulation-Kit-4-per-Pack-V73-4QPD2/301643819","score":1,"comments":[]}]}]},{"body":"Have you looked at kerosene heaters? Very safe but I'd get a CO detector regardless. Also, if you rent a hotel make sure to leave water trickling in all faucets to prevent freeze ups.","score":2,"comments":[{"body":"Ill look them up. Didnt know they existed!\n\nFor the pipes I thought of turning water of and run the pipes empty.","score":1,"comments":[]}]},{"body":"I used to live in an area where power was always going out. During the winter I would hang out in the kitchen as it was the smallest room. I would close off the room with a heavy blanket, open the cupboard doors under the sink and let taps drip. Then I'd light a ton of candles. It was still nippy but not as bad as the rest of the house. I don't miss those days.","score":2,"comments":[]},{"body":"Google “tea light heater”.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Cold air enters the house from these gaps which are between car door and frame. How can I close the gap here and keep the door still functional?","not_safe_for_work":false,"locked":false,"body":"","score":20,"comments":[{"body":"Get your owner to buy a soft foam strip and run it around the perimeter of the swinging door","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I would go with a brush seal","score":14,"comments":[]},{"body":"I haven't had the courage to let my cat drive my house around town yet..","score":9,"comments":[]},{"body":"Not sure how to solve your issue, just came here to look at photos of a cat","score":8,"comments":[]},{"body":"I would be concerned that adding anything between the door and the frame could make it difficult for your cat to open the door. I would hang a thick blanket over the cat door to cut down the draft and it shouldn't impact your cat getting in and out.","score":7,"comments":[]},{"body":"Dafuq kind of brand name is SkiPoo???","score":5,"comments":[]},{"body":"You can fit your car through there??","score":3,"comments":[]},{"body":"That’s an interesting looking car door.","score":10,"comments":[{"body":"I was looking for the micro car but none found.","score":3,"comments":[]}]},{"body":"Some thin foam weatherstripping should do the trick. But he already knew that, he just wanted to make sure you could figure it out on your own.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Help!! I bought slacks last night for a last minute interview today and they don't fit around the waist.","not_safe_for_work":false,"locked":false,"body":"I bought slacks last night, they fit because I was bloated I guess but today they're too loose just around the waist. They don't have belt loops and I'm struggling to safety pin them because they're stretchy. What can I do?? My interview is in 3 hours 🥲 Also, I'm wearing a long sweater over them so only the front waist of the pants will be visible.","score":6,"comments":[{"body":"Wear them over another pair of pants. Or a pair of shorts.","score":13,"comments":[{"body":"I just put on a thick pair of leggings underneath and it worked! Thank you! ❤️","score":20,"comments":[]}]},{"body":"out of the box idea if all else fails and if your gut behaviours are reliable: cause yourself to bloat again","score":5,"comments":[]},{"body":"Can you exchange them for a smaller size?","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Go to a store real quick and get a pair of suspenders. Most suspenders just use clips so they work on any pants, plus they’d be hidden by your sweater","score":2,"comments":[]},{"body":"You can wear a belt without belt loops! If you have one that can go around your waist tight enough, no one will notice, I think waist belts are very in rn","score":1,"comments":[{"body":"That was one of the first things I tried but to have it tight enough to fit my waist it would slide up over my pants while I walk or sit down.","score":3,"comments":[]},{"body":"The pants slip out from under the belt.","score":3,"comments":[]}]},{"body":"Staple them to your boxers, duh 🤦🏼‍♂️","score":0,"comments":[{"body":"If only I was a man lol","score":1,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How to fix the left tile? It seems like the glue underneath has bulged, but I can’t get this tile out without braking it. Finding a replacement tile is not possible.","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"get a large putty knife under there and try and scrape out what you can, use a hammer to tap in and wiggle around","score":3,"comments":[]},{"body":"It's not coming out in one piece. You can sometimes get a full tile but it's easier if the first one is out and the first one isn't coming out in one piece.  I'm surprised whoever installed is called it good. It's been like this forever, yes?","score":2,"comments":[{"body":"no, it appeared a couple weeks ago after our neighbours flooded us","score":1,"comments":[{"body":"Ooooooooh flood that sucks.   Well maybe someone else has an easy fix. Have you talked to your building manager or anything if you rent maybe he has those tiles and storage somewhere the easiest thing to do would be just smash it out scrape the floor up maybe the plywood underneath separated if it was a bad flood?  You never gonna know how bad it is underneath that thing until the tiled comes up but I know that like the tile or the grout didn't get waterlogged and pop","score":1,"comments":[]}]}]},{"body":"Water damage. Insurance as the bulging wood will be weak.    Causing a soft spot in the floor. \nRemove cabinet and trim over tile.   \n\nHope not glue.  Thinset is like cement.  Cement doesn’t attach well to water damaged wood.   Cement can be chipped off as in chisel cracking tile in process.   If it is mastic.  Then worse as any water on the floor will cause it to pop up on any part.   But you can save the tile.  \n\nSee Insurance or a claim against neighbor’s insurance","score":1,"comments":[{"body":"Tile is really weak on specific planes.  So a pro would remove the cabinet above if hand removal isn’t possible.  Tools will just cause it to crack.  Thinset is kinda of permanent","score":1,"comments":[]}]},{"body":"Try some citrus strip on the tile to get off the old glue","score":1,"comments":[]}]},{"title":"How do I get this sticker off of my book","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"Hair dryer, low heat, fan over it for a few minutes and peel slowly while the glue is still warm.","score":13,"comments":[{"body":"This. Slower the better.","score":4,"comments":[]}]},{"body":"If you haven't tried soaking it...don't it's a book","score":7,"comments":[]},{"body":"Damp cloth, pick a corner a little bit then instead of pulling up on the sticker, pull it parallel to the books surface.","score":2,"comments":[]},{"body":"Did they seriously ship that to you without even wrapping it?  That's how you get a 1-star review.","score":2,"comments":[]},{"body":"Soak a papper towel in rubbing alcohol and press it into the sticker wait untill the sticker is wet enough to pull off.  Might work worked for me in the past","score":4,"comments":[]},{"body":"Undu sticker remover works great even on paper","score":1,"comments":[]},{"body":"Olive oil.","score":1,"comments":[]}]},{"title":"How to seal the air between double doors?","not_safe_for_work":false,"locked":false,"body":"What is the best way to seal this gap? When it’s windy and cold there is a noticeable draft coming through.","score":3,"comments":[{"body":"You could apply foam strip to the door frame and between the doors","score":5,"comments":[{"body":"Yes! You can also try weather stripping under the doors","score":2,"comments":[]}]}]},{"title":"Restore this pan?","not_safe_for_work":false,"locked":false,"body":"Left it to boil dry while cooking rice recently and...yup. its stainless steel, any advice on getting it back appreciated 🙏","score":2,"comments":[{"body":"i inherited my mother’s 75 year old set of stainless steel pans that had seen better days. i put them all out on newspaper and sprayed them with oven cleaner, back and front. it took 2 or 3 times doing this and scrubbing but they look good as new and i’ve been using them now over 10 years.","score":5,"comments":[]},{"body":"I always use hot water, a gentle scrubber and Bartender's Friend with good results.","score":2,"comments":[{"body":"Just a note, that's \"Barkeeper's Friend\"--easier to find when you're searching on the right keyword.","score":3,"comments":[{"body":"Oops, thank you.","score":1,"comments":[]}]}]},{"body":"Oven cleaner or boil a dishwashing tablet in it.","score":1,"comments":[]},{"body":"Oxiclean / sodium percarbonate, add about 2cm water, heat close to boiling &amp; turn off - it will foam up. Allow to stand 10mins. Use a stiff brush and scour the base. Warm back up, turn off and leave. Scour with a brush and generally will have lifted most of the burnt material off. Rinse, scour with brush. Generally sorted with minimal effort.","score":1,"comments":[]},{"body":"Boil it with vinegar do it few times then rough side of the sponge or steel wool","score":0,"comments":[]},{"body":"Fine wire brush attachment, a drill, and a few packs of steel wool. Stick a pad of the wool on the wire brush drill. Rev at high speed and apply steady, firm pressure. Change pads as needed. Avoid allowing steel wire brush to contact pan as it will ruin the polish.","score":1,"comments":[]},{"body":"White vinegar - scouring pad.","score":-1,"comments":[]},{"body":"Two big squares of red  scotchbrite.   Cordless drill with a sanding disc backer or a wooden disc on an arbor chucked in it.    Staple or tape the scotchbrite to make a big puffy buffing wheel and go to town on the pot with a bit of water in the bottom.  If it is badly pitted, start with brown scotchbrite.","score":0,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How do I remove this grease/motor oil stain from a white shirt?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"Tried using FOLEX pictured above, but no luck","score":1,"comments":[]}]},{"title":"How do I remove/cover the writing on this leather lanyard permanently, it’s ok if it gets damaged as long it’s usable and still looks mostly ok","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Get a cord of some sort, maybe leather, that fits inside the inlay of the letters, then use fabric glue and the cord to fill in the holes. Maybe cut a section of cord and shred it to fill in any gaps too. It might not bend quite as well but should still work.","score":2,"comments":[{"body":"Thanks you!","score":1,"comments":[]}]},{"body":"You'll have to fill it in and sand it down/re-stain it. Look up leather repair kits.","score":2,"comments":[{"body":"Thank you!","score":2,"comments":[]}]}]},{"title":"How do I fix this door knob?","not_safe_for_work":false,"locked":false,"body":"As you can see on the picture screwing it back on does not hold as one of the holes has broken open. Is there any type of glue I can use? Or do I just fit a new door hinge all together?\n[The holes](https://i.imgur.com/I75t0w6.jpg)\n[The doorknob](https://i.imgur.com/I1Kbhe0.jpg)\n[The knob](https://i.imgur.com/CKAbLQi.jpg)","score":2,"comments":[]},{"title":"Wondering how this was done","not_safe_for_work":false,"locked":false,"body":"This is probably a dumb one and maybe doesn't belong on this subreddit but its the only place I could really think of so here goes nothing lol\n\nRecently saw this music video and I was wondering how to achieve that sort of \"style\" (not sure if that's the right word) when making an animation. I'm talking about like the effects and how certain things are lit.\n\nI'm also like a beginner and have only messed around in Blender a little bit so I know that the level of animation in the vid is unachievable atm, but at least maybe get the same vibe/feel.\n\nAgain I'm not sure if this is the right subreddit so if there's somewhere else to ask questions related to this stuff please let me know and I'll take this post down lol\n\nThe video in question: [https://www.youtube.com/watch?v=qIe8jxfmMZ0](https://www.youtube.com/watch?v=qIe8jxfmMZ0)","score":1,"comments":[{"body":"Looks like a combination of 3D animation (either Maya, 3DS Max, Blender) and 2D animation in something like Adobe After Effects.","score":1,"comments":[]}]},{"title":"Door knob and spindle fell off on opposite sides of closed closet","not_safe_for_work":false,"locked":false,"body":"The door knob to my closet fell off and unfortunately the spindle fell off on the other side- the door is closed so I have no way of opening it. Is there anyway for me to open the door","score":1,"comments":[{"body":"Large flat head screwdriver in the spindle hole, or literally anything made of metal that is the same size as the spindle hole (door key for instance)","score":5,"comments":[{"body":"Lmao I’m mad I didn’t think of that but it worked! I used an envelope opener!!! Thankssss","score":2,"comments":[{"body":"No worries. Glad you got it opened!","score":2,"comments":[]}]}]}]},{"title":"How do I fix the broil element in my whirlpool oven?","not_safe_for_work":false,"locked":false,"body":"I was pulling food out of the oven the other day and the parchment paper rubbed on the broil element, causing the element to shut off and the paper to catch on fire(really small)\n\nNow whenever I try to use the oven, the broil element stays cold and only the bottom part heats up. \n\nThe landlord can’t make it in time to fix it before thanksgiving on Thursday, does anyone have any suggestions on how and if I can fix it? Really sucks having your oven go out right before Thanksgiving. I’m hoping it’s something I can quickly reset. \n\nThanks you!!","score":1,"comments":[{"body":"You may have cracked the element bumping into it with something heavy (casserole dish??).  I just replaced a stove heating element last year for the neighbor.  Think I spent $25 for the replacement part on amazon.","score":2,"comments":[]},{"body":"Elements can be bought at electrical parts shops. Switch off the oven before you take it out and see if you can match it in store. The element has a lifespan and once it's broken, it isn't fixable, but it is replaceable. Same with the internal light bulbs.","score":1,"comments":[]}]},{"title":"How best to fix this drain pipe that snapped off","not_safe_for_work":false,"locked":false,"body":"This is a drain pipe from a glass dishwasher that was tied into the drain and vent of a three compartment sink. What's the best way to approach repair?\n\nSorry if its rotated weird. Ams not good at the reddit posting and imgur stuff.\n\nCheers and thanks!","score":1,"comments":[{"body":"you're going to have to cut out both those tees and re-glue new ones in, same for the tee that attached to that main column....good news is that PVC/ABS is relatively easy to work with, just a lot of dry fitting\n\nand probably add another pipe support bracket to keep it from happening again","score":3,"comments":[]}]},{"title":"Rodentia installed a Bluetooth plug w wire delete flush with the plug. how to unfuck?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[]},{"title":"how to make this snow globe clear again. It's only 4 years old but it's piss yellow now.","not_safe_for_work":false,"locked":false,"body":"","score":30,"comments":[{"body":"UV light","score":15,"comments":[{"body":"Yeah, I agree. If it’s algae you can hit it with uv or total darkness for a week or two - I mean, blackout dark - zero light… nothing. Your eyes could never adjust because there is no light. As dark as my bosses heart dark. \n\nIf it’s not algae/bacteria/something of that nature, this will do nothing.","score":45,"comments":[{"body":"“As dark as my bosses heart” 😂😂😂 \n \nNice one haha","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"If you remove the globe from the base it will have a stopper in the bottom usually covered in silicon or resin, if you can remove it, empty it wash and refill. Then hot glue everything to seal/stick back together.","score":10,"comments":[]},{"body":"lmfao.\n\nit's plastic isn't it tell me it's plastic","score":7,"comments":[{"body":"It's glass. At least it feels like it. And we never put it anywhere with sunlight. I","score":7,"comments":[{"body":"Beat me too it. That's really peculiar, I can only guess that the water inside has something to do with it then","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"does it taste normal?","score":17,"comments":[]},{"body":"Its the glycerine oxidizing, not algae. Afaik theres no real way to fix it withought replavcing the glycerin mixture outright which is hard to do without trapping air in it, which is also not really good either if you dont want it oxidizing in the first place","score":4,"comments":[]},{"body":"I know a piss yellow shade anytime and this isn't it. It would be a much more vibrant yellow hue.\n\nThis is a decade cigarette murk.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Fix my thermostat","not_safe_for_work":false,"locked":false,"body":"My heat always stops kicking on around 3 notches from where the thermostat is set. I can’t figure out how I would sync it up to the setting. I don’t mind setting it a little higher but it’s just mildly irritating","score":0,"comments":[{"body":"Take off the cover.  There is a \"heat anticipator\" setting.  For water and steam heat it will be set to 1.2, for forced air it will be much lower.  See where yours is set.  Perhaps it's kicking on early because it's anticipating how long it will take to meet desired temperature.","score":1,"comments":[{"body":"Solved! This worked! Thank you!","score":1,"comments":[{"body":"Excellent!  That would have driven me insane too lol.","score":1,"comments":[]}]}]},{"body":"If you don't want to upgrade it to a new one, you can remove it, disassemble it, and get the dust off the mercury switches inside. Reassembly if the opposite of the removal. Note which wire goes where when removing.","score":1,"comments":[]},{"body":"It is critical the Mercury stats be level. Place a level across the posts","score":1,"comments":[]},{"body":"Under the cover, there is a bimetallic strip coiled up with the mercury bulb on one end. there is a screw through The other end of the coil that you can loosen to adjust the coil then re-tighten the screw.","score":1,"comments":[]}]},{"title":"I just got out of a 2 year relationship. It ended well but how do I move on and try again?","not_safe_for_work":false,"locked":false,"body":"Title says mostly. I just broke up with my partner of 2 years last night. It was devastating to admit I wasn't happy and neither were they. It was more or less mutual and I'd say out of all the possibilities, this was likely the best outcome for us both. I just don't know how to do it again. It's scary and I'm bad at it but I want to be happy and healthy again. \nAny advice?","score":0,"comments":[{"body":"Time heals all wounds. Focus on yourself.","score":4,"comments":[]},{"body":"Just move on and try again) Don't be afraid and everything will be fine.","score":2,"comments":[]},{"body":"You start by learning to make yourself happy. Everything else will fall in place after that.","score":2,"comments":[]},{"body":"the best way to get over someone, is to get under someone :)","score":1,"comments":[]}]},{"title":"How do I adjust my apartment's heater? Or lessen the heat output in the apartment?","not_safe_for_work":false,"locked":false,"body":"Hi all! I just moved to NYC two years ago from Asia, and I'm still pretty stumped as to how heaters work. We don't get winters where I'm from, so I'm still learning about living through the seasons here.  \n\n\nI currently live in a 1950's apartment building that has this kind of heater: [https://photos.app.goo.gl/UEjCc432xkGWsSWE6](https://photos.app.goo.gl/UEjCc432xkGWsSWE6)  \n\n\nNow, not that I'm complaining, but it gets incredibly toasty especially at night. I've kept one window open---the window is right above that heater. But it's still pretty warm. My neighbor said that you can adjust the temperature, but I'm not convinced. I opened the panel at the bottom there, and the knob isn't where it's supposed to be anymore lol : [https://photos.app.goo.gl/GW6HYZ24rrVDCM1c8](https://photos.app.goo.gl/GW6HYZ24rrVDCM1c8). I'm able to turn it by hand though (with gloves, because it's extremely hot).  \n\n\nI looked at the heater in the hallway, which is similar to what we have inside the apartments, and the knob looks like this : [https://photos.app.goo.gl/5NSB3UpV4FdYzGb46](https://photos.app.goo.gl/5NSB3UpV4FdYzGb46)  \n\n\nI'm convinced the knob doesn't really control the temperature, and figured it **has** to be either all the way open or all the way closed. Can I use a mylar blanket to cover it?   \n\n\nThank you all for your suggestions and input!","score":2,"comments":[{"body":"There are blankets that can cover the heater and keep it more insulated, but I’ve had the best success just turning the knob all the way and turning it off. I’m not sure how similar our heating systems are, but in my old and current apartment I had to turn off the valve and the trapped heat from the other apartments kept my apartment toasty (still almost too warm). If that doesn’t work, once it cools a bit more hopefully it will level off! Or ask your super you help you out. Good luck!","score":1,"comments":[{"body":"Thank you! It was warm today, so the building management turned off the heat. But I did rig a curtain rod over it so I can hang a blanket over it while also keeping the sides free where I hang my tiny buckets of water for humidity lol.","score":2,"comments":[]}]},{"body":"Looks to be heated with steam or water. If that's the case the knob most likely controls the amount of water flowing through the radiator.","score":1,"comments":[]},{"body":"the knobs *should* control the control the amount of hot water moving through the radiator and thus control the amount of heat, when they're functioning...but they're far from precise\n\ntry and turn it off, and or contact the landlord","score":1,"comments":[{"body":"Thanks! I tried turning it off, and then turning it on slightly. Off = works. Slightly on = fires of hell lol, so it doesn't matter whether I turn it all the way or not.  \n\n\nAs it happens, the building turned the heat off altogether because today was warm enough lol","score":1,"comments":[]}]}]},{"title":"How do I center the sink? Or should I just put up with it until I do a total makeover?","not_safe_for_work":false,"locked":false,"body":"","score":721,"comments":[{"body":"Wait for the remodel. In the interim, hang a hand towel ring to the left to visually balance the space.","score":979,"comments":[{"body":"Damn a hand towel rack &amp; small trash bin would legit level things out mentally for me Lol smart guy baconfromthegrave!","score":336,"comments":[{"body":"The cat already balances it, just leave him there.","score":92,"comments":[]}]},{"body":"Can I also hang a hand towel ring to cover up a sledgehammer accident?","score":35,"comments":[{"body":"Sledge away at the geometrically opposite site.","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Just put another cat on the right side to balance it out","score":346,"comments":[{"body":"Contractors hate this one simple trick","score":106,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It’s more than likely bolted to the wall, so you would have to remove the entire sink, move the bolts, then reinstall the sink. Doable but probably not worth the hassle if you’re planning on a remodel in the near future. Other than the bolts, it would just involve loosening the P-trap, scooting the sink over, then tightening the P-trap back down.","score":57,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Your cat seems to like it that way....\n\nI would recommend to keep it like that until you do a makeover, depending on the piping it could be a shit load of work, possibly resulting in the necessity to do a total makeover...","score":122,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The bowl is attached to the wall by resting on a bracket. The pedestal is probably caulked to the bowl, and possibly the floor. So, they're not held together in a permanent way to ease installation. The bowl may actually slide left to right a bit if the pedestal is loosened from the floor and both can be re-centered.\n\nIf not, you should be able to remove the water lines and drain fairly easily, and then simply lift the bowl up and off the bracket. Just be careful to ensure that if there is caulk holding the bowl and pedestal together, that you're prepared to catch the pedestal if it's sticks and suddenly loosens during movement.\n \nOnce the pedestal and bowl are removed, you can begin shifting the bracket on the wall over to the wall's center. Make sure you have adequate blocking on the wall if studs aren't aligned for the bracket (likely the reason the sink's bracket was off center in the first place). Once the bracket is re-centered, the pedestal and bowl can be reattached, followed by the the water lines and drain. \n\n[Here is a helpful link](https://www.jacksonville.com/story/news/2015/03/19/heres-how-install-bathroom-pedestal-sink/15655277007/)\n\nGood luck!","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"sorry if it’s a rlly stupid question but how to put this belt buckle with one ring (or something) on a normal belt?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"buckles like this are used with belts that have snaps. You can take any belt you like to a shoe repair shop and they can mount it for you, or you can add snaps to a buckle with a few tools available at most craft shops.","score":9,"comments":[{"body":"thank you! :)","score":2,"comments":[{"body":"no worries. Western shops will have the kinds of belt that is already set up. You could stitch it on as well, but then you could not change the belt/buckle combo easily.","score":1,"comments":[]}]}]},{"body":"Don’t you thread the belt through the loop and then that nodule looking thing gets pushed into one of the belts holes?\n\nOn second thought, maybe that doesn’t make sense, haha. I’m not sure, sorry OP.","score":2,"comments":[{"body":"It definitely looks like a plate style belt buckle but the pin or nodule looks worn down","score":1,"comments":[]}]},{"body":"Take it,and a belt, to a shoe repair (cobbler) shop","score":1,"comments":[]},{"body":"Bro, can i give you my addresss. Just send it to me, coz damnnn","score":1,"comments":[{"body":"ikr!! it’s a very exciting find :)","score":1,"comments":[]}]}]},{"title":"How to make a baton from things you can buy in a hardware store.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Is this one of those videos where you make things just to infuriate people?","score":1,"comments":[]}]},{"title":"Is there a sealant I can use on this connection without taking it apart?","not_safe_for_work":false,"locked":false,"body":"We have had someone come out to \"fix\" this leak 3 times now. It is now leaking very very little but still leaking. Can I just throw some type of sealant on and be done with it?\n\nIt is an home heating oil line. The leak is coming from the bottom of the connection. It's a flared copper tube under the brass fitting.","score":1,"comments":[{"body":"You have to take it apart to seal it. Unscrew the bolt, wrap the thread of the connector/tap piece in ptfe plumbers tape, tighten it back up, job done. \n\nYou might want to turn the water off first, unless of course you like flooded houses and cold showers.\n\nI re-read your post and realised you said it’s an oil line. I’ve never heard of this application. I didn’t think hot oil was used in central heating systems. You’re sure this is the case?","score":5,"comments":[{"body":"WRONG!  Flared or compression fittings should never need tape or dope. The seal is the copper flare getting smashed into the brass valve by the cone nut. Make sure the flare is correct, clean with no burs and tightened properly. Make sure the copper tube is not subject to movement or vibration and you should be good.  How much pressure is in that line? Is it just gravity fed from the tank?","score":6,"comments":[{"body":"Oh yeah, I didn’t realise it was flared. Are those the fittings where you put the brass olive ring on the pipe before tightening?","score":1,"comments":[]}]},{"body":"Not hot oil. It is the line that leads from the tank to the furnace. Just the delivery system.","score":2,"comments":[{"body":"So it’s a gas pipe?","score":2,"comments":[]}]}]},{"body":"I’m all for DIY but if you’re not sure you should call in a professional instead of having an oil spill. Also, that braided line looks like a water line and should probably be replaced with something suited for oil. Oil will dissolve many plastics over time.","score":2,"comments":[]}]},{"title":"How to cure airplane clogged right ear that has been clogged for almost 24 hours since my flight has landed? Any tips? (With the common cold as well).","not_safe_for_work":false,"locked":false,"body":"Hi all,\n\nIt has been almost 24 hours since my flight has landed, and my right ear is still clogged. I also have the common cold, and I feel quite congested. Does anyone have any insight as to how I can get my right ear to unclog?\n\nThanks in advance!","score":8,"comments":[{"body":"Happened to me, needed antibiotics and prednisone to fix it.  Was told once blocked the natural bacteria in the ear canals grows fast and causes further swelling.  After 2-3 days it went back to normal.","score":5,"comments":[]},{"body":"Plug both nostrils, and blow your nose.  I know, that goes against everything you've been told.  My Ear, Nose, and Throat doctor taught me this trick.  He said, \"don't believe what you've been told... it is safe to do.\"  Or, try yawning with a wide-open mouth.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Have you tried any decongestants to date? Also, if you are like me and wear headphones for an entire flight, have you tried using a earwax drain? Just in case you are a little compacted.","score":3,"comments":[]},{"body":"Go to a doctor, this sub is for changing light bulbs not medical advice. For real, this is not a good way of getting medical advice","score":5,"comments":[{"body":"Yeah, seconded. Also make sure your \"common cold\" isn't something worse. Don't assume it's fine just cuz you want it to be. (Not saying OP is doing that, just that some people do.)","score":3,"comments":[]}]},{"body":"Sneeze","score":1,"comments":[]},{"body":"I've done this with a sore jaw from clenching my teeth and had my ears clear up (not realizing that it was clogged) I placed a fingertip over where my jawbone hits next to my ear and press lightly at first while applying firm pressure I open as fully as possible my jaw and close, move to the next spot, rinse and repeat.... I can fit my fingertip onto 4 distinct spots between there and where my earlobe is. It may sound crunchy and after a few times then feel like something opened up just a tad bit from where it was. Slowly and stop if there's real pain, give it a rest, maybe switch to the other side of your face (sometimes, I have no choice so both get done)  and I noticed when finished, my ears have cleared up though I don't realize it had been needed when I got started.  I guess you can slowly get used to a minimal amount of hearing loss and forget about it pretty quickly once it returns, lol\n\nIt might work to get yours unclogged too. There's different tutorials for TMJ if you'd like to check it out before deciding to try","score":1,"comments":[]},{"body":"Guaifenesin thins mucus and can help plugged sinuses drain. It’s the main ingredient in a lot of cough syrups and is available over the counter.","score":1,"comments":[]},{"body":"Of it stays clogged, you can get an ear infection. Take a Benedryl and get a nose spray with psuedophederin from the pharmacy.    Get a bowl of hot water, steaming, put a few drops of eucalyptus in it, a towel over your head, and bend down and breathe the steam.   If your ears don’t immediately clear, call a doctor, you will probably need a broad antibiotic. Maybe amoxicillin or similar.","score":1,"comments":[]},{"body":"It's just swelling,  take nothing,  do nothing and it will get better on it's own, or maybe something to reduce swelling (paracetamol???) Might help","score":-2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How to turn the heating on? I’ve been trying to save energy but now i’m sick. My landlord has some weird landlord set up and say they don’t know how to turn it on.","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"Your thermostat is in frost protection mode, turn it off. It’ll usually not allow the temp to go below 6celsius. Once you have that off you can control the temp.","score":9,"comments":[{"body":"Solved. I’m such a ditz! Thank you","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It is also good to keep the frost protection mode during summer as the temp might dip below 20, but you don’t need the hearing to come on.","score":5,"comments":[]}]},{"body":"Yours is slightly different try the pair button and make sure the thermostat regulator in your left hand is paired to the gas heater","score":2,"comments":[]},{"body":"Thermostat says \"off mode\".  What happens when you press the silver button on the lower right directly beneath \"off mode\".\n\nIs there a model number on the back?  Perhaps under the battery cover? (You may need to remove batteries to find it). With that information, a Google search would be simple and your best option.","score":2,"comments":[{"body":"Thank you. I did try to Google but the instructions didn’t work. Another Reddit or advised me to take frost protection off and that worked!","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Tell the landlord you need heat for the dwelling to be considered habitable.  Ask him to immediately figure out how to turn it on.  If he can’t figure it out, offer to call a HVAC contractor to replace the thermostat, or, you will be calling a lawyer to deal with the problem, ultimately at the landlord’s expense.","score":2,"comments":[]},{"body":"Ok I crash coursed mine yesterday let’s see if anything helps\n\nThere should be a box near the heater that has two slide buttons on off at the top and automatic- manual on the bottom\n\nMake sure that’s on and on manual\n\nDo you have hot water?","score":2,"comments":[]},{"body":"YouTube has video for your boiler make and model and you can google the manuals","score":1,"comments":[]},{"body":"I think you tell your landlord you're not paying rent on an apartment that doesn't have heat, and I bet it'll magically start working for him.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How do I stop Reddit Mobile from asking me this EVERY time I look at a post and leave it….I’m about to delete the app.","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Switch to Boost","score":2,"comments":[]},{"body":"https://f-droid.org/en/packages/ml.docilealligator.infinityforreddit/","score":1,"comments":[]},{"body":"Try baconreader if you're on Android","score":1,"comments":[]},{"body":"Reddit is fun works better anyway","score":1,"comments":[]}]},{"title":"How can I build something like this?","not_safe_for_work":false,"locked":false,"body":"Found this bed frame at a furniture store and it was falling apart on their floor, flimsy construction. I love this design but I have a queen bed and box spring, i feel like i could build this better🤔 i have no idea where to start. Pls help","score":0,"comments":[{"body":"Draw it first. Make the measurements sensible. Make list of materials. Prepare the parts. Assemble.","score":3,"comments":[]},{"body":"Buy two book cases, different sizes to make it easier. \n\nThen draw the bed platform.\n\nMake a list of materials.\n\nWatch videos on YouTube for how to build a platform bed.","score":1,"comments":[]},{"body":"IKEA bed, ikea book shelf. Easy way would just browse the ikea collection and kit bash it","score":1,"comments":[]}]},{"title":"Crazy amount of condensation after installing a thermal blind, what can I do to resolve this?","not_safe_for_work":false,"locked":false,"body":"","score":63,"comments":[{"body":"Dehumidifier. And look into why there’s no air movement.","score":39,"comments":[]},{"body":"Get a *humidistat.* Not a dehumidifier. Not yet at least.\n\nThis should not be happening. At all. So you have to find the source. A dehumidifier is a band-aid and not a solution.\n\nIf your house is too humid, then solve that by finding where the water is coming from and fix it. For example a leak in the wall would do this. Running your shower without a fan. Or a humidifier that is running too much. Or a disconnected dryer vent. Or hanging up laundry inside to dry. Or the windows could be screwed. There are plenty of possible reasons.\n\nThe water is not coming from the air. It is coming from somewhere else, evaporating into the air, then condensing on the window. The air is transmitting some other ongoing source. Place humidistats (available at a dollar store) around your house and narrow down the source. Identify it even if you can't or don't want to solve it.\n\nYou might need a dehumidifier. But that is the very last thing, not the first.","score":64,"comments":[{"body":"This is the first I've heard of this. When I google it I get loads of items suggesting that it's attached to the furnace and ADDS humidity when you need it. Can you give us a link or example of one that I can buy? I can't find it at my dollar store.  Specifically I don't understand how it shows you where the humidity is coming from.","score":3,"comments":[{"body":"It is the % listing of relative humidity on a thermometer. If you own a thermometer that also lists a % then you've got one. In fact they are useless without a thermometer because it is *relative* humidity to temperature. (60% humidity but with 10 degrees difference is very different.) Also called a hydrometer (though not where I live). Aka a [humidity sensor](https://www.amazon.com/s?k=humidity+sensor&amp;i=lawngarden&amp;sprefix=humi%2Clawngarden%2C121&amp;ref=nb_sb_ss_ts-doa-p_2_4).\n\nOne device cannot can show where humidity is coming from. But multiple can and by moving them around. If different rooms are more humid with no explanation, then there is still a logical reason. For example the corner of the bedroom is extra humid. There's no water source there. So it has to be a leak. Or if you run the dryer and it suddenly jumps to 80% humidity, then it isn't venting correctly. Or if something like the humidity in a bathroom after a shower doesn't clear quickly and hangs around for hours. These are all problems that can be discovered by measuring different humidities at the same temperature.\n\nIt's about figuring how your day-to-day activities are affecting the humidity. Then changing the easy ones first and finding then fixing anything that is broken.","score":2,"comments":[]}]}]},{"body":"Part of the problem is that the blinds (or curtains if someone is using them), are blocking off air circulation from the surface of the glass. The lower outside air temp cools the glass, and the blind prohibits air movement across the glass that would warm up the inner surface. If you need a thermal blind, something is wrong or just inadequate with the window itself, or how its installed. Air leaks, even minor ones, getting trapped behind a blind would cool the window and the trapped air pocket quite quickly. \n\nUnfortunately leaving the blinds open during the coldest parts of the day will help with condensation, but defeat the purpose of having blinds in the first place. Humans, pets, plants, showers and sinks, all pump moisture iinto the air.","score":7,"comments":[]},{"body":"Is the condensation inside or outside?","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"dehumidifier will sort this out, we recently got one and they are great!","score":2,"comments":[]},{"body":"You may buy a transparent foil at the home&amp;garden marked which is attached to the frame and works like a third glass pane. This would resolve the heavy condensation.\nYour real problem however is high air humidity. You will also get mold in the upper room corners. Do ventilate your apartment well three times a day. The condensation on the windows removes humidity from the air -- better use no foil and clean the window when condensed.","score":4,"comments":[{"body":"High humidity isn’t necessarily the problem here. If OP has any thermal barrier on the *inside* of the window and does at the same time not seal the air from the room from getting to the window then it’s just physics. Even normal air temp will cause this. This is essentially applying thermal insulation on the inside of the building which is not ideal and has to be accompanied with a foil that doesn’t ket the insude ait to travel through insulation to the cold part of construction. \n\nIn short - never put any thermal insulative material on the inside without at the same time cutting off passage of inside air through that insulation to the cold spot.","score":3,"comments":[]}]},{"body":"Wipe with a towel every morning to prevent mold.\n\nIf you use a dehumidifier, you may lower the humidity too much and get a dry throat and/or nosebleeds.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How to stop this toilet from running? , sounds like dripping water constantly and it half flushes intermittently","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"OP needs to replace the internals to his/her toilet!\n\nIt’s an easy job, &amp; can legit be learned by spending 5-10 minutes on YouTube.\n\nIf you want to try an easy half azzz fix just replace the plunger that blocks your water off at the bottom &amp; hope it’s a leaky seal.\n\nDoesn’t sound that way though","score":2,"comments":[]},{"body":"I'm no expert but is that blue hose damaged? it looks like it's damaged towards the far side and I see droplets clinging to it near there and the area around.\n\nEDIT: thanks for that whoever downvoted, if I'm wrong you could just, like, correct me","score":2,"comments":[{"body":"Hmm I don’t think it’s the hose , though it does look cracked here! I didn’t downvote you idk why someone would lol. I think it might be the seal on the base of the main white part. I’m not expert either , just renting but hate being a bother and like trying to fix myself if it’s not gonna cost a lot XD","score":2,"comments":[{"body":"I had a similar problem recently. The seal at the bottom could be leaking, as you mentioned. For me, it was the float that triggers the water supply, which wasn't fully returning to position and therefore allowing a trickle of water through. Those flush units are fairly low-cost and easy enough to replace with basic tools. Easier than trying to fix specific components.","score":2,"comments":[]}]}]},{"body":"giggle the toilet handle","score":0,"comments":[]}]}]}