{"name":"idiotsincars","description":"When idiots get behind the wheel of a vehicle, shit gets funny.","subscribers":4008336,"posts":[{"title":"Thank you for helping /r/IdiotsInCars crash past the 4 million mark.","not_safe_for_work":false,"locked":false,"body":"","score":2791,"comments":[{"body":"And, again, buy a dash cam!","score":68,"comments":[{"body":"Front and rear.    They're dirt cheap and they will pay for themselves.   \n\nAside from several entertaining videos I've gotten out of dash cams over the years, I was legit saved from a lying-ass lady that rammed into my parked car and tried to say I backed into her.  \n\nDash cams are set-it-and-forget-it.  Buy them.   Install them. It's easy.","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I wonder how many dashcam sales this subreddit is responsible for.","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Four million subscribers,  but only 15,000 of them have an IQ above 40","score":19,"comments":[{"body":"“There was absolutely nothing OP could do in this situation THEY’RE ALSO AN IDIOT!!!!!”\n\n- *Those redditors*","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"thank you for keeping me entertained :)","score":14,"comments":[{"body":"and horrified.","score":15,"comments":[]}]},{"body":"This sub has legit made me a much better driver. Constantly calculating risk/reward of situations, car positioning on the road, etc etc. \n\nA couple weeks ago a childhood friend of mine passed away in the passenger seat of a car. Guy driving lost the backend of his mustang and slid into the other lane- passenger side was T-boned by a Dodge Ram with a family inside. Luckily the family was okay.\n\nPeople don’t seem to realize we are driving around 2 ton steel missiles, and I’ll admit I didn’t think that way until I started following this sub. Stay safe, arrive alive. Thanks","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Please stay vigilant of attempts by hateful ideologies to infiltrate this sub, push their garbage and recruit people. The larger the sub gets, the more attractive it becomes for malicious actors to groom (correct usage of the term btw.) the userbase for a takeover.\n\nI have seen this play out way too many times in officially non-political subreddits where hate went unopposed by the mods and as a result the \"normal\" people disgusted by its proliferation just left.\n\nOver time the only people left will be the ones agreeing with their hate and this will tarnish the sub's public reputation as it becomes known for being another haven for their hate-movement. Eventually TOS get broken so egregiously that site-admins shut down the sub and they move to the next victim.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Maybe my favorite sub, definitely the one I stop on nearly 100% of the time","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Idiot crashes rented Lamborghini after going 320km/h (200mph) on the highway","not_safe_for_work":false,"locked":false,"body":"","score":3493,"comments":[{"body":"\"oh the damage is not too bad... oh shit its on fire\"","score":1534,"comments":[{"body":"Just need a little extra buffing, it'll be fine","score":278,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Carbon fiber but without the fibers","score":80,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"He just bought a Lamborghini.","score":744,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I’m no claims adjuster, but that looks to me like a total loss.","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The rain wasn’t any bit a deterrent huh ? Okay..","score":307,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I work in insurance claims. This is what happens to every rented Lamborghini.","score":65,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Both the driver and the passenger are ok.\n\nI passed the guy with a van like 30 minutes before this happened, I guess I set him off lol\n\n[news article in italian](https://www.fanpage.it/napoli/incidente-sulla16-napoli-bari-distrutta-una-lamborghini-huracan-da-200mila-euro/)","score":296,"comments":[{"body":"Can you translate what they are saying? I want to see what goes through the mind of a complete nincompoop.","score":63,"comments":[{"body":"Quick summary: 46 yo man and woman hit the guardrail on a highway near Naples (Avellino) with their 200K Lamborghini Huracan (a rental, apparently, according to other similar articles). They were able to get out of the car just before it went up in flames. Cause of the accident unknown (I mean, what could it be, they were speeding in the rain), but nobody got hurt (except for the beautiful car, RIP). Passengers were visited on site and there was no need to take them to a hospital. Police and firefighter closed the highway for a few hours to stop the fire and prevent further accidents.\nSo from this, no idea what went through the mind of this complete nincompoop.","score":105,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"School bus stop sign means keep going?!?","not_safe_for_work":false,"locked":false,"body":"","score":10331,"comments":[{"body":"They literally had to move my daughters bus stop because people kept running the stop sign (on a 2 lane road).  Seems like nearly every morning 2-3 cars would just drive through without paying any attention. They had to move the stop because the kids had to cross the street, and it was just too dangerous to keep it there with so many people running it.","score":106,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Bro that's 2 blocks away from my house and I thought I was gonna be featured on Reddit.","score":1688,"comments":[{"body":"im gonna start searching the area now.","score":503,"comments":[{"body":"Bring cake and coffee.","score":306,"comments":[{"body":"Instructions unclear, brought delicious coffee cake.","score":120,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Some of you need to check the driver's manual in your state, because a lot of states (including New York) do require cars to stop for school buses on BOTH sides of a multi-lane street, unless a physical divider (like a median) is present.\n\nhttps://www.flhsmv.gov/wp-content/uploads/BusSafety.jpg","score":2633,"comments":[{"body":"When in doubt, check if a stop sign with bright strobe lights is pointed towards you.","score":990,"comments":[{"body":"I think most people forget that the whole point of stopping for school buses is because kids can dart across the street…\n\n![gif](giphy|xUA7aLrdFvkS3BeaEE)","score":583,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Both Indiana and Florida require stopping if there's no physical barrier, as you state. Source: passed the test in both states and that question was on both. Also, the number of people getting dinged in our state after a woman was in a hurry and went around a bus and killed 3 kids in the process - enforcement of these rules is super tight in Indiana now.","score":121,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Where I'm from, passing a school in either direction when the signs are active is one of the worst traffic fines you can get. It's not even a ticket you can just pay, they MAKE you come to court and plead guilty, then you can pay.","score":1228,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Finally have a worthy video from my travels.","not_safe_for_work":false,"locked":false,"body":"2 idiots here. White car in front turning with nosignal and then white car passing front 2 cars, me, and the other car behind me.","score":4918,"comments":[{"body":"That was almost a hell of an accident.","score":891,"comments":[{"body":"This road is notorious for having fatal accidents bc of its hills and sharp curves. 2 ppl died on this very road about a month ago. Speed limit was 55 and ppl complained so county lowered it to 45.","score":439,"comments":[{"body":"I drive highways like this all the time in rural Missouri where I live.  Winding roads, sharp drop offs, no shoulders and idiots like this who think they have to be somewhere 5 minutes faster than everyone else.","score":199,"comments":[{"body":"Same. I drive all day long for my job and it’s ridiculous how many ppl honestly cannot drive. My company doesnt provide the dash cam. I bought it myself bc since Im in a company its like ppl think they can just pull out in front of me. Its a big issue with company vehicles. Its like ppl think if they pull out in front of you and you hit them, youre at fault bc youre in a company vehicle.","score":102,"comments":[{"body":"That dash cam was a really good idea.  They can really save your bacon!","score":43,"comments":[]},{"body":"I use to get personally insulted that someone would carelessly pull in front of my motorcycle, Thinking they did it because they couldn't be hurt so they didn't care, but then I started driving some big trucks and people did it all the same. \"Genius has its limits, but stupidity (literally) knows no bounds\"","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Also passing on double line\n\nEdit: I’d also like to mention that that driveway leads to nothing. Its a driveway thats been built to start breaking ground on the construction of a new home so for them to use it as a turnaround seems very dangerous bc they will have to back into the road (behind them on the road is a hill and curve meaning drivers heading their way will not see them until its too late).","score":252,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Came *THIS* close to a causing a wreck.","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It's that season where people will be traveling on unfamiliar roads, visiting family. Give them space, share the road, everyone gets home safe.","score":135,"comments":[{"body":"A few years back I drove to Eagle Nest NM to visit my dad who was staying there in his camper. To get there you drive an approximately 20 mile long winding road through an increasingly steep &amp; twisty river valley cut through the Rockies until you a hit a narrow pass that opens up into a huge vale. On my way in there were 7 vehicles that had driven off the road, and couple that took some spectacular spills into deep ditches near the wide but shallow river. We were there for 5 days and every day we left the vale for some scenic drives, and every day saw vehicles off the road in ditches. Whoever runs the tow truck companies out there must make a damned good living.","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I'm sorry what","not_safe_for_work":false,"locked":false,"body":"","score":4751,"comments":[{"body":"First time in roads as British (Australian, Indian, ...)","score":172,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"From my point of view as an Aussie - that blokes the only one on the correct side of the road.","score":1157,"comments":[{"body":"that driver clearly thought they were in Australia given all the gum trees at that intersection   \n\nthere’s so many eucalypts that I think it was OP on the wrong side of the road","score":285,"comments":[{"body":"Gum trees are an invasive species in California.","score":81,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Maybe they were confused why you stopped to wait for a truck that was still very far away and didn't feel like wasting their time over it. Had you just kept driving like a normal person, they would have been well out of the way by the time the other car got anywhere near where you were.\n\nThe other car is probably used to city driving where you basically have to start your vehicle moving before the traffic you're trying to merge with or get past has moved out of the way or you'll never get anywhere, and I'm guessing OP is not used to seeing that sort of thing at all.","score":1479,"comments":[{"body":"This exactly! WTF did OP stop??","score":61,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Most likely. Or generally not wanting to wait and cross the path. Happens. Not the most elegant solution, but far from worst.","score":396,"comments":[{"body":"&gt;Not the most elegant solution, but far from worst.\n\nWhen cars become autonomous and can communicate with each other the undercut will be thing. I'd say if you can be 100% certain (full unobstructed view) it's safe to do there would be no harm, but since you can't even trust half the pop to use turn signals I'd say we're a long way off any sort of maneuvers like that.","score":39,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Good every video that has ever been posted here needs the first 20 seconds cropped out","score":47,"comments":[]},{"body":"I dont understand","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Idiot doesn't know how to drive on bike lane. Guess they don't cover that in the driving test in Michigan!","not_safe_for_work":false,"locked":false,"body":"","score":953,"comments":[{"body":"Filming while driving, declaring there is one lane to his left when there are multiple, and driving in the bike lane. Not sure what they were trying to prove other than they are a whole different breed of stupid.","score":649,"comments":[{"body":"My guess is they thought they were cool or funny for online cred.","score":86,"comments":[{"body":"I'm going to go with this option, trolling, because I don't want to live in the alternative, a world where there are drivers this stupid.","score":34,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"\"there's only one lane there\"\nThat looks like two lanes to me...","score":207,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Wtf is he talking about?? Even if there was just one lane, you don’t drive and take up the entire bike lane ☠️ you just use it to cross into the shopping center","score":45,"comments":[]},{"body":"at *least* two tickets, my guy","score":141,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I believe the best thing you can do in this situation is keep driving without changing your lane and when you reach the entry you make your turn.","score":139,"comments":[{"body":"Yes, that is exactly what you do. What blows people's minds is the concept that you may have to brake to wait for a clearing.","score":71,"comments":[]},{"body":"This isn't the best thing... This is the correct thing the only thing you should be doing.....................................","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Guys like him are probably why there were mercifully no bikes in view","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What could go wrong if you drive thru the road construction cones.","not_safe_for_work":false,"locked":false,"body":"","score":1446,"comments":[{"body":"Wait until the driver gets the bill to repair what they damaged.","score":215,"comments":[{"body":"Thats many thousands of dollars of concrete, too.","score":80,"comments":[{"body":"Oh yeah, they’re looking at over $10k","score":49,"comments":[{"body":"Our company spent over $15,000 on the concrete alone for a recent garage slab pour.","score":36,"comments":[]}]}]},{"body":"Wait til the driver has to get out and face the construction workers who just finished that... Lol...","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"As a guy that works for a concrete paving company that does this type of work all the time you are not wrong.  Have had this happen on many occasions unfortunately.  Depending on what they had to remove or fix, driver will likely get hit with the cost of removing it, as well as the replacement cost (labor, equipment, and materials).  Hope they had good insurance!","score":27,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"'Boy, this concrete sure is soft'","score":108,"comments":[{"body":"We have plenty of concrete evidence to suggest the concrete is not concrete enough","score":39,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Hey it looks like your car is totaled, you're definitely missing that thing you're in a rush for, and you're gonna have to handle your insurance now. Oh and there will be a bill for the damaged concrete. \n\nExpensive mistake, dumbass.","score":71,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"People who drive past safety cones are the stupidest mother fuckers on the planet.","score":86,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Damn pedestrians walking in my bike lane","not_safe_for_work":false,"locked":false,"body":"","score":204,"comments":[{"body":"That girl did not give a single fuck lol","score":27,"comments":[]},{"body":"[removed]","score":24,"comments":[{"body":"Getting into a fight with someone with a helmet is not an amazing idea","score":2,"comments":[]}]},{"body":"I honestly would have gave his shoulder a nudge lol.","score":17,"comments":[{"body":"Back into traffic you go","score":2,"comments":[]}]},{"body":"What an asshole.","score":15,"comments":[]},{"body":"Grab his side mirror and don't let go, it'll throw his balance off and he'll eat dirt.","score":14,"comments":[]},{"body":"Just for clarity, that *motorcycle* is on the sidewalk/pedestrian path, right?","score":10,"comments":[]},{"body":"NYC Van Wyck Local?","score":3,"comments":[]},{"body":"Good title, OP.  You fooled me for a second.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"More efficient than an alarm clock? Driver loses control and crashes into the side of my coworker's house in the early morning of 11/22/2022.","not_safe_for_work":false,"locked":false,"body":"","score":390,"comments":[{"body":"Just ramming you for your 3:00am wake up call, enjoy your day sir.","score":82,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Finally a house not made out of cardboard","score":52,"comments":[{"body":"Camera didn't even move, house sturdy as fuck.","score":17,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Have had quite a few people ask about the aftermath of this whole incident so here's a quick update:\n\n* Driver's condition is unclear. He was hanging out of the back window when the paramedics arrived and it took a full hour to extract him. Awaiting updates about sobriety at the time of the event.\n* Here are links to some pictures taken after the crash: [https://imgur.com/a/786VMTU](https://imgur.com/a/786VMTU)\n\nStay safe out there.","score":46,"comments":[{"body":"Seeing these pics makes me want to congratulate the builder.\n\nThat house is sturdy as hell. Most (Even brick/concrete, as this one is on the ground level) would just have a hole through it.","score":31,"comments":[]},{"body":"Yeah that's some blood in the bed and by my best guess a truck made before safety. That dude better thank his lucky stars he's not a bucket of jelly after that. Scary shit man","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I once woke up because someone crashed into parked cars right beneath my (open) window. The first seconds I was really terrified because I had no idea what was happening while hearing the crash sound.","score":7,"comments":[]},{"body":"Pickup truck at 3am? Probably drunk","score":2,"comments":[]},{"body":"Have you heard the good news?","score":4,"comments":[]},{"body":"They be flyin'....literally.","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How long does he drive like this?","not_safe_for_work":false,"locked":false,"body":"","score":452,"comments":[{"body":"“Yeah it’s making a bit of a scratching noise but it drove fine.”","score":70,"comments":[{"body":"When it does that, I just toss in some airpods...problem solved.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Brazening it out with the elbow nonchalantly protruding from the window as well; what a man!","score":5,"comments":[]}]},{"body":"Until he gets where he's going, or until he gets caught. Whichever happens first.","score":45,"comments":[{"body":"Or until the wife's boyfriend asks for the car back.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"He certainly doesn't find the daily grind too much for him.","score":24,"comments":[]},{"body":"I guess that's what my grandfather meant when he told me to drive my car until its wheels fall off.","score":19,"comments":[]},{"body":"Added bonus for using a donut tire on the front left also. Yellow sticker gives it away.","score":16,"comments":[]},{"body":"As long as it takes to reach the scene of his next accident","score":8,"comments":[]},{"body":"Tell me it's Russia without telling me it's Russia.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This is what you look like from behind with no lights on, now imagine what you (don't) look like in the mirrors","not_safe_for_work":false,"locked":false,"body":"","score":242,"comments":[{"body":"I hope you flashed them until they put their lights on.\n\nI had someone driving behind me in even worse weather than that last week with their full beams on.","score":17,"comments":[{"body":"Yeah man I'm flashing them in this pic here, I overtook them and flashed my rear fogs and they got the message and turned their lights on, usually they don't, makes a change!","score":17,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I feel like the advent of automatic lights has made this issue even worse.  In Florida you are required to turn your lights on in the rain, no matter how light it is.  Driving in the rain without your lights on is a primary offense.  The light sensor for automatic lights will not turn them on in those lighting conditions.  Thankfully newer cars are adding an additional sensor for the rain and wipers, so if your wipers are on your lights are on.  My 2019 car does not do this, so I have kept to operating my lights manually.","score":11,"comments":[{"body":"Do you not have day lights in the US? Here in France it's mandatory now, so every new car sold has day lights, which will be bright enough even in the rain.","score":3,"comments":[{"body":"Day lights don't turn on the market lights.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Is that a Toyota Celica?","score":3,"comments":[{"body":"GT-S baby","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Winshields are on, so must your lights","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Preach","score":2,"comments":[]},{"body":"Twat","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I Was Hit on My Bicycle Yesterday, Failure to Yield","not_safe_for_work":false,"locked":false,"body":"","score":55569,"comments":[{"body":"“Whoops my bad, didn’t see ya”.  Something like that?","score":10277,"comments":[{"body":"“Must have been in my blind spot. I was on top of you before I ever saw you”","score":8921,"comments":[{"body":"Everywhere is a blind spot if you don’t bother looking.","score":7978,"comments":[{"body":"Or stopping on the line that says Stop.","score":2379,"comments":[{"body":"Make sure your attorney shows that to his/her insurance company's attorney.","score":789,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They straight up rolled through the stop for sure.","score":917,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"They quite literally weren’t even looking in your direction?! Like “why would I need to look into the flow of traffic before turning in??”","score":11448,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"She was so reckless if you slow down the video, she didn’t even look in that direction at all","score":3505,"comments":[{"body":"She also didn't stop at the clearly marked \"STOP\" line","score":1655,"comments":[{"body":"It also appears that she tried to move forward again and rolled up onto his wheel before she saw his hand frantically waving.","score":124,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Pedestrian, check out the car at the zebra crossing!","not_safe_for_work":true,"locked":false,"body":"Just few days ago (sorry if it was already posted)","score":11316,"comments":[{"body":"That little jump is the only reason that pedestrian is still walking","score":1835,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Doesn't even get out to check on her.","score":4466,"comments":[{"body":"Well it is raining!","score":2004,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"And it more than 1 idiot in this video, literally none of the cars stopped for a crossing. smh","score":121,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It looks like they accelerated into the pedestrian.","score":2558,"comments":[{"body":"I wondered if it was another of those idiots who can't figure out which pedal makes the car stop and which makes it go.","score":841,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That bright green shirt must be pretty hard to see in the rain.","score":2232,"comments":[{"body":"Green means go, right?","score":640,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It's a zebra crossing but you have to run like a cheetah.","score":682,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That was a great jump. Likely saved them some broken legs.","score":118,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"My first post, thanks Q3 idiot! I presume he was in a real hurry to pee. PS - this is a narrow, potholed, two-way canyon road. (Los Angeles)","not_safe_for_work":false,"locked":false,"body":"","score":5977,"comments":[{"body":"In a hurry but has time to stop and give a dirty look as he passes.","score":2072,"comments":[{"body":"Exactly. I was like, welllll.... maybe there's an emergency going on. No. No emergency. Just a fucking dickhead.","score":1058,"comments":[{"body":"You have to put the appropriate amount of mental energy and bandwidth into maximizing safety for others on the road, but anything left can be spent just peacefully communing with yourself. I think some people are just such gigantic assholes that even they can't stand to be alone with themselves in a confined space longer than necessary.","score":279,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Coke driving","score":28,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I’m pretty sure that I drove that road in GTA5!","score":1168,"comments":[{"body":"I’m pretty sure that I drove JUST LIKE THIS on that road in GTA5!","score":444,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Fully expected him to head on that car at the end..","score":506,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This guy is somehow doing the most driving i have ever seen.","score":130,"comments":[]},{"body":"This guy got confused. The neighborhood made him think he was still playing GTA.","score":626,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I guess he didn't have to pee that bad. Too bad he didn't drive off the side.","score":141,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The BMW flashes it's brights to alert the lesser cars of it's dominance","not_safe_for_work":false,"locked":false,"body":"","score":463,"comments":[{"body":"I see this all the time and have figured out these people pull the indicator stock while turning on their indicator/turn signal which flashes their brights.","score":97,"comments":[{"body":"BMW turn signals are absolute garbage. They're semi-digital. The stock doesn't stay in position until you turn, it just goes back to the middle. Half the time you end up needing to manually turn it off by half pressing it in the opposite direction, like a motorcycle. The whole thing is also super squishy and just bad to handle.","score":24,"comments":[{"body":"I don’t know for sure if this is the stalk’s fault or my own, but I have a tendency to flash my lights instead of the turn signals in the 2014 Mini Countryman","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"what are you talking about. the bmw turn signals are great. I have a 2016 x6. you can tap for lane change and if you hard push it stays blinking until a full turn is complete. it is incredibly easy to use. just many do not lol","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Ugh the hunchback of notre dame musical is so good","score":11,"comments":[{"body":"Yeah I like mowing my grass now because I can sing along with Quasi and Frolo and no one can hear me.","score":5,"comments":[]}]},{"body":"At least it uses its indicators.  \n\n\nIt's evolving.","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Of course it's Florida","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not used to using the turn signal and accidentally flashed. Probably","score":5,"comments":[]},{"body":"Don’t you know if you drive a BMW and flash your high beams you can make a left on a red light 😂","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Gave Space In Front Of Me For The Side Road, Mr BMW Was Unhappy &amp; Couldn't Wait. (Very Mild Considering Other Posts!)","not_safe_for_work":false,"locked":false,"body":"","score":264,"comments":[{"body":"Beemers are allowed to drive on sidewalks, and even run over kids.","score":40,"comments":[{"body":"I thought running over kids while using autodrive was a Tesla exclusive.","score":11,"comments":[{"body":"Dan O'Dowd would agree.  If Elon buys out Cruise, he could spread his erratic self-driving software.","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"He's currently untaxed, lads. And was untaxed when this video was taken. Anyone fancy reporting him?\n\nEdit: OP you can do it here. You need the street where you saw the car. https://contact.dvla.gov.uk/report-untaxed-vehicle?locale=en","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nah, he is an idiot","score":21,"comments":[]},{"body":"Driving on the sidewalk is mild. That’s what we’ve come to?","score":29,"comments":[{"body":"Yes","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"BMW got insecure because Chad Benz was around","score":7,"comments":[]},{"body":"Report him on the Nextbase website.\nhttps://nextbase.co.uk/national-dash-cam-safety-portal/#:~:text=Yes%2C%20as%20part%20of%20the,you%20must%20provide%20a%20statement.","score":3,"comments":[]},{"body":"One can only hope he messed up his tires, rims, and the bottom of his car.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"dude couldn't wait 3 seconds, would have hit me in my driver's door had I not heard him speed up, security footage of incident in comments","not_safe_for_work":false,"locked":false,"body":"","score":318,"comments":[{"body":"Comment section is way more entertaining than the video.","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"r/FaxOfAFax","score":39,"comments":[{"body":"I just tried that sub and had to leave quick. I have an overwhelming urge to downvote any video of a video and sticking around would not have been fair to the posters.","score":18,"comments":[]}]},{"body":"Next time try to post the video a little bit smaller. Then I will know definitely not to watch it.","score":75,"comments":[]},{"body":"Was ya blinker on ?\n\nEdit - I see someone else asked, and was met with some hostility.  Lol.  It's a valid question, if blinker wasn't on you're partially at fault here.\n\nEdit 2 -  what security footage is showing u \"clearly using a turn signal?\"   Am I missing another video or something ?","score":104,"comments":[{"body":"Double yellow line means no passing","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This post sucks.","score":90,"comments":[{"body":"A video of a video, and a pissy OP.","score":52,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I’m confused now so you didnt post the video so it could be horizontal buuut like a year ago you posted a video fine \n\n[here](https://www.reddit.com/r/IdiotsInCars/comments/r9pj6e/idiot_in_a_blue_honda/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)","score":8,"comments":[]},{"body":"No potatoes were harmed in the making of this production.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Well done Captain Planet","not_safe_for_work":false,"locked":false,"body":"","score":1651,"comments":[{"body":"So how much fuel did they actually save?","score":325,"comments":[{"body":"Well they stopped all those cars from ever using fuel again.","score":363,"comments":[{"body":"So the truck driver did his part to help save the planet.  3D chess! 🧠","score":97,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Job well done then.","score":21,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Not much, most \"hypermiling\" tricks like this aren't very useful. What does save you on gas are things like *not accelerating toward a red light*","score":96,"comments":[{"body":"Why not? You just gotta accelerate enough and it'll be green for you. Maybe not for anyone else,but that's just details","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"So... he saved fuel *and* managed to permanently remove 48 gas guzzlers from the road? Environmental hero!\n\n/s","score":158,"comments":[{"body":"He almost removed the carbon footprint of 20-30 people.","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Why this is actually moronic as fuck - when using the engine brake on a slope, the vehicle engine cycles without using essentially any fuel.","score":137,"comments":[{"body":"Turning off the engine to save fuel going downhill is one of the most stupid and dangerous things you can ever do. As you won't have any power to use the hydraulic brakes and power steering, loosing control of a car going downhill on neutral is very easy.\n\nMy uncle used to live on a hill and accidents like this happened so often the city had to put a campaign against this practice.","score":96,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Idiot semi driver makes car go off the road in order to avoid head on collision","not_safe_for_work":false,"locked":false,"body":"","score":86,"comments":[{"body":"Wholly Shit, thank goodness the driver had a place to ditch! What was that Lorrie driver thinking?? Hope they fined him for that ridiculous maneuver.","score":6,"comments":[{"body":"Yeah, imagine there was just a barrier on his right.","score":3,"comments":[]}]},{"body":"A lot of drivers from my country can't resist crossing a solid line, doing it before a turn without visibility is not that uncommon unfortunately. \n\nAlso this is just a guess but unless there are a lot of turns people usually go 8-9km over the speed limit in villages along main roads so that idiot shouldn't even have a reason to overtake there.","score":1,"comments":[]}]},{"title":"Not sure if this qualifies, you decide.","not_safe_for_work":false,"locked":false,"body":"","score":66,"comments":[{"body":"They didn’t have the right-of-way and forced you to come to a complete stop, so I’d say that counts.","score":32,"comments":[{"body":"Op yield to the turning car, so all is good on that front. They are idiots for doing a u turn on the sidewalk.","score":5,"comments":[{"body":"That too, but OP shouldn’t have had to yield as they had the right-of-way. I’m not saying OP should’ve went into road rage mode and not let them turn but they shouldn’t have had to legally.\n\nEDIT: also that turn by the Xterra was probably illegal to begin with.","score":8,"comments":[]}]}]},{"body":"Not sure about the location. But U-turns in business districts are illegal in my area, unless specifically allowed. So, yes, I would consider it an idiot.","score":6,"comments":[]},{"body":"On one hand they probably didn't see me turning, on the other, why stop during the turn and not just use the driveway to turn around?","score":9,"comments":[]},{"body":"Thank God I have a driver's Ed course at my school.....","score":3,"comments":[]},{"body":"No better way to do that?","score":2,"comments":[]},{"body":"Not enough evidence to rule it out","score":2,"comments":[]},{"body":"Pretty sure it's totally illegal to use a center turn lane to make a U-turn. I can't find any sources that explicitly prohibit it, but in california, it's only legal to make U-turns at stoplights. \n\n\"No driver shall make a U-turn at an intersection controlled by official traffic signals except as provided in Section 21451\"","score":1,"comments":[{"body":"that only refers to \"intersection controlled by official traffic signals\". u-turns are legal in many places other than \"intersection with traffic light\"  \n\n\nhttps://www.dmv.ca.gov/portal/handbook/california-driver-handbook/turns/","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Massive car accident caused by street racing (unknown if anyone was injured or died)","not_safe_for_work":true,"locked":false,"body":"","score":2529,"comments":[{"body":"I did my best to sleuth this one. Not sure if this is the right article/crash\n\nhttps://www.krem.com/article/news/local/spokane-county/person-pulled-from-spokane-valley-high-speed-crash/293-404b2117-9b28-464c-aa68-e0096fa00611\n\nEdit: it is the right one.","score":555,"comments":[{"body":"That actually might be it, the color of the camera car matches and the buildings look similar.  They are very lucky to be alive.","score":279,"comments":[{"body":"100% these idiots, Here is a full video: https://www.youtube.com/watch?v=6PVmQfWX7yA","score":207,"comments":[{"body":"What's fascinating is that he still uploads and is asking for donations.","score":202,"comments":[{"body":"The guy who uploaded the video said this:\n\n&gt;not my crash. My car, but I wasn't in it. My friend was driving my car and he is remorseful\n\nHis friend, Chase, who crashed the BMW said this:\n\n&gt;I was the BMW, I ended up shattering a pelvis, every rib, multiple other broken bones, smash the kidney and lost 7 pints of blood, I was in a wheelchair for a few months and had to learn how to walk again, But thankfully I was the only one injured.  \n&gt;  \n&gt;No other people were injured thankfully, The driver of the Subaru made it out with just a few scratches.\n\nAnd also this:\n\n&gt;Definitely the dumbest thing I’ve ever been a part of.  \n&gt;  \n&gt;I’m thankful that physically I was the only one injured. Two years later I’m still recovering from this and there isn’t a day that goes by that I don’t think about my lapse in judgement from that day.  \n&gt;  \n&gt;I cannot apologize enough to everyone that was affected by this. Watching this video still brings tears to my eyes and inside makes me feel grief that cannot be expressed.","score":354,"comments":[{"body":"somewhat believable. the time the video was uploaded and the time the article was written matches up. the drivers of the vehicles would clearly be in the hospital and wouldn't have access to their vehicles for a while... unless it wasnt theirs to begin with. also the cammer is in the yt comments known as \"chase\" describing what they went through.","score":103,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"7 pints of blood.... so he got a transfusion and lost more?","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Of course, they crash into other cars and ruin someone else's day","score":123,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[BMW vs Subaru](https://youtu.be/6PVmQfWX7yA)\n\nI remember seeing this video a while back","score":70,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I thought that footage was sped up.. until the accident occurred","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Don't mind me, I'm a bike","not_safe_for_work":false,"locked":false,"body":"","score":8318,"comments":[{"body":"I cycle on this cycle lane a lot. Have had a car drive into it in broad daylight while I was stood in the middle of it waiting for my traffic light to change. \n\nThe road layout could be much better here. But people should also be aware that “blue road” means cycle lane.","score":726,"comments":[{"body":"The massive pictures of bicycles would also have given it away I thought","score":334,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That bell told him","score":1075,"comments":[{"body":" Brits' aggression is sophisticated.","score":210,"comments":[{"body":"In this video, he rings the bell of despair","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Lmao that guy is probably thinking, “what’s up with all these cyclists in the middle of the fucking road.!” 🤣","score":95,"comments":[]},{"body":"The bell kills me 😂","score":334,"comments":[{"body":"Little Ben","score":52,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Isn’t this what the Brit’s call a twat?","score":145,"comments":[{"body":"Wank stain too.","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"No strap or cords. wood was sliding around and sticking out at least a foot","not_safe_for_work":false,"locked":false,"body":"","score":35,"comments":[{"body":"weird ass amount of wood, I wonder how much you could find on the way back to your nearest lowes","score":12,"comments":[{"body":"funny enough he literally just pulled out of home depot and this was the light near that plaza","score":3,"comments":[]}]},{"body":"\"I don't see any problem here.\"\n\n*chugs a beer while driving*","score":6,"comments":[]},{"body":"Those boards are crooked as hell too","score":6,"comments":[{"body":"Yeah no kidding. I wouldn’t give a you a squirt of piss for those boards.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Bonus dumbass points for having the tailgate down.","score":5,"comments":[]},{"body":"\"His wood was sticking out atleast a foot officer\"","score":3,"comments":[]},{"body":"The new Final Destination looks cheap","score":3,"comments":[]},{"body":"Florida, the fuck it state.","score":5,"comments":[]},{"body":"Slaps boards and says “these aren’t going anywhere”","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Can opener","not_safe_for_work":false,"locked":false,"body":"","score":101,"comments":[{"body":"Hope they opted for that extra insurance from Enterprise.","score":6,"comments":[{"body":"Does not cover roof damage ):","score":6,"comments":[]},{"body":"I was just gonna say this 😂","score":1,"comments":[]}]},{"body":"Don't use your phone when driving.","score":12,"comments":[{"body":"Yeah the idiot in this video is the one recording","score":8,"comments":[{"body":"Came here to say this lol","score":1,"comments":[]}]}]},{"body":"2-fer. No need to say more.","score":3,"comments":[]},{"body":"Enterprise Rent-an-Idiot","score":1,"comments":[]},{"body":"Ikea sells trucks now? Those are some big Allen keys on the floor","score":1,"comments":[]},{"body":"Chicago?","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Parking spots = free-for-all lanes now. Got the death glare for this","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[{"body":"Now that’s a major idiot","score":12,"comments":[]},{"body":"Wow and they made you stop for them what an idiot. “Free for all lanes” 🤣 seriously","score":6,"comments":[]},{"body":"Had a lady do this to me tonight in the Walmart parking lot while I was on my escooter. She rolled her window down to say something and wasn’t stopping so I yelled “you better have fucking insurance” and kept going ready to hop on her hood if I needed too. She stopped abruptly after I yelled","score":1,"comments":[]},{"body":"This stuff is my biggest pet peeve.","score":1,"comments":[]}]},{"title":"Maybe driver was originally from the UK and forgot what side of the road to turn/drive on?","not_safe_for_work":false,"locked":false,"body":"","score":28,"comments":[{"body":"Back in 2019 a 19 year old motorbiker was killed by an American women in the UK who mistakenly drove her car on the right hand side of the road. She hit him head on and then fled the country.\n\nhttps://en.m.wikipedia.org/wiki/Death_of_Harry_Dunn","score":10,"comments":[{"body":"That’s horrible. She’s being sentenced soon. \n\nThanks for sharing!","score":2,"comments":[{"body":"&gt;That’s horrible. She’s being sentenced soon. \n&gt;\n&gt;Thanks for sharing!\n\nI'm not sure how much coverage it's got it USA but it was very big news in UK for a long time. Mostly because she was given diplomatic immunity for a long time and fled any criminal proceedings.","score":2,"comments":[]}]}]},{"body":"Ive done that in India 😊\nThe other driver (like you here) gave me a condo look 😁","score":3,"comments":[]},{"body":"I would bet they were complaining about you going the wrong way on what they thought was a one way street","score":3,"comments":[]}]},{"title":"That's not going anywhere, nothing says secure like painters tape","not_safe_for_work":false,"locked":false,"body":"","score":20,"comments":[{"body":"At least it will come off easily without peeling the cars paint away 🤣","score":10,"comments":[]},{"body":"Not the best solution, but could be someone who was doing their best.","score":5,"comments":[{"body":"Indeed it may be there best, but if thats there best, perhaps they should go to a body shop rather than driving around. If that comes off on the highway and hits a car, doing there best isn't going to mean much. If you cant properly secure it, take it off until it can be secured.","score":-5,"comments":[]}]},{"body":"Seriously?  Everyone knows that duct tape is called for here.","score":3,"comments":[]},{"body":"Maybe they’re just leaving it on there, waiting for the painters caulking they used as glue to dry?","score":2,"comments":[]},{"body":"It looks like they struggled with putting it on too","score":1,"comments":[]},{"body":"If it’s been on there for more than a week, there’s no way it’s coming off.","score":1,"comments":[]},{"body":"Odds are that the tape is just meant to hold things in place til the glue sets fully. Not sure if mirrors bodies require glue though.","score":1,"comments":[]}]},{"title":"Drunk couple leave scene of accident after crashing car into house","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"Ring is such a lifesaver.  Even a shitty detective should be able to figure it out","score":2,"comments":[]},{"body":"What’s the point of leaving the scene if the car has a license plate ?","score":2,"comments":[{"body":"This video didn’t catch it. In my city you’d get away no worries. Police are too busy to investigate unless they have a clear plate on video with clear shot of the drivers face.","score":3,"comments":[{"body":"People really overestimate how willing the cops are to investigate.","score":4,"comments":[]},{"body":"Nice to know. Makes sense why I seen people leave their car behind after they crash","score":2,"comments":[{"body":"If they cops don't catch you while you're still drunk, they can't prove shit. A ticket for leaving the scene is better than a DUI","score":1,"comments":[]}]}]}]}]},{"title":"Merge after lane ends","not_safe_for_work":false,"locked":false,"body":"","score":13840,"comments":[{"body":"I thought you meant that one, but you meant THAT one....","score":3251,"comments":[{"body":"The even idioter one","score":1178,"comments":[{"body":"There's always a bigger fish","score":354,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This is how I feel every time I go through a yellow light. \n\n\"Oh jeez, I cut that one kind of close.\" *checks rearview mirror* \"Oh the three cars behind me went through too.\"","score":90,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I think we all were thinking. \"Big deal.  Another bad driver. Happens all the time. Oh nevermind.\"","score":212,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Damn the first one was bad enough","score":1452,"comments":[{"body":"The second one was an even bigger idiot if you realize that the sides of the road are mostly very soft grassland in the Netherlands, where this happened. Even just driving off the road with one wheel often results in major accidents / flipping the car.","score":413,"comments":[{"body":"Looks like the N301 in the Flevopolder. They have widened the road there from one lane to two because so many people were injured during takeovers.","score":89,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Mini Cooper did an illegal over take, out of track boundaries.. he’s gonna have to give that position back.","score":214,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"See the problem is they turned their hazards on after pulling that move. Everyone knows you just toss your hazards on, it means you're free to drive like GTA.","score":423,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Video calling and driving","not_safe_for_work":false,"locked":false,"body":"","score":55,"comments":[{"body":"Just feel really sad for that dad with the kid. Nowhere to go, no proper sidewalk. At the mercy of idiot drivers just trying to get their kid safely to/from school.","score":6,"comments":[]},{"body":"Not really sure what the rules are here. Does the other driver have a stop sign? In my country you normally give way to traffic from the right in intersection without signs.","score":1,"comments":[{"body":"No, there was no stop sign. It's a small road in a residential area. Normally, The one who is merging should wait till it is safe to turn though there is no official rule for this.","score":2,"comments":[]},{"body":"In my country that is only true at a four way intersection but at a three way like this the perpendicular car must yield… I too am curious about OPs local rules","score":1,"comments":[]}]},{"body":"The video is from India. We have a right-side driving seat here therefore my view was getting blocked by the auto-rickshaw.","score":1,"comments":[]}]},{"title":"4-way stops are hard these days I guess.","not_safe_for_work":false,"locked":false,"body":"Nothing major happening here, just a cluster of not caring","score":24,"comments":[{"body":"Looks like a 3-way stop but yeah… those 2 cars really didn’t want to wait their turn.","score":8,"comments":[{"body":"As well as the car in front of OP just sitting there throwing everything off","score":9,"comments":[{"body":"I can't blame him too much for that. He did exactly as the sign required: stopped completely and waited for traffic to clear before proceeding. It's not his fault that the powers-that-be wanted an all-way stop, but were too cheap to actually spend the [$10 per sign](https://www.roadtrafficsigns.com/stop-sign/all-way-sign/sku-x-r1-4) to let people know.","score":2,"comments":[]}]}]},{"body":"Didnt they teach you that the stop signs with the white boarders were optional?  I got hit by a young girl and she had been told that by her \"friends\" right after she got het license...","score":3,"comments":[{"body":"I've heard parking lot signs are optional, due to their on private property that's not maintained by the local municipalities.\n\n\nOn another note, drive in any Best buy parking lot this time of year can be a shit show(on ice in my area) lol","score":3,"comments":[]}]},{"body":"I know this lot. It's full of reckless maniacs at all times. Fully stocked. Idiots and assholes, the 'lot' of them.","score":1,"comments":[]},{"body":"IS THAT A BEST BUY?!?!?!!!!","score":1,"comments":[]},{"body":"Stupidest kind of things... 4-way stop... jeez, this is a fcking stupid sign using...","score":-3,"comments":[]}]},{"title":"If hadn’t filmed, no one believed in her story","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"\\*driver of the car watches her swirl down the drain\\*  \n\n\nSooo, I'm off the hook then?  \n\n\n\\*slowly drives away\\*","score":5,"comments":[]}]},{"title":"No, they can't see out the windshield. Yes, they were driving between two 35 ton loaders on a busy intersection.","not_safe_for_work":false,"locked":false,"body":"","score":2362,"comments":[{"body":"Ah, it will fall off eventually.","score":317,"comments":[{"body":"Once we get this baby up to 88 mph, you’re going to see some serious shit.","score":183,"comments":[{"body":"I believe they would call that a localized snowstorm","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Hell, it will *melt* off eventually.   No reason to clear it if nature will just take care of it in several months","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Probably a blind driver, doesn't realize they can't see. /s","score":211,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Looks like the driver had his little slit of the windshield cleared off.\n\nDefinitely an idiot.","score":113,"comments":[{"body":"Playing “tank commander”","score":68,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I feel like underneath that mountain of snow two windshield wipers are furiously whipping back and forth beneath intermittent spurts of largely useless wiper fluid.","score":75,"comments":[]},{"body":"I don't see the issue. This is clearly the snow transport which gets loaded by the two loaders and moves the snow to poorer regions without any.","score":85,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Every fucking year.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Idiot vs Police","not_safe_for_work":false,"locked":false,"body":"","score":2927,"comments":[{"body":"Totally had the guy until the truck driver said I'm outta here.","score":688,"comments":[{"body":"/r/NotMyJob","score":299,"comments":[]},{"body":"Huge assist. That dude deserves a cut of the take. Awesome bait and switch.","score":32,"comments":[]},{"body":"[removed]","score":13,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"The only reason the truck stopped was because the police van was in the way.","score":843,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Box truck with the clutch fakeout.\n\nI thought he was trying to help but turns out my man just had places to be.","score":436,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Busted…….later","score":88,"comments":[]},{"body":"Lol that’s the classic “escape during the busted countdown “","score":69,"comments":[]},{"body":"Nothing says \"car chase\" like Benny Hill!","score":24,"comments":[]},{"body":"Truck driver is smart! Get out of there and don’t risk your life or property.","score":47,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Turn signal? What's that? Blindspot? Never heard of 'em. I do what I want","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"Is that Strangers by Bring me the Horizon?","score":2,"comments":[{"body":"It might have been, I was a bit preoccupied","score":1,"comments":[]}]}]},{"title":"Almost witnessed a head on collision","not_safe_for_work":false,"locked":false,"body":"","score":810,"comments":[{"body":"Wtf was that idiot doing?","score":183,"comments":[{"body":"His truck saw another truck and wanted to kiss?","score":126,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Dropped his meth pipe","score":30,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Ah I fucked up! I’ll just super slowly, nonchalantly manoeuvre back into my lane..oops, I’m still in the wrong lane.  Let me just finish my beer and try this again.","score":123,"comments":[]},{"body":"Is that person drunk, high, sleeping or just checking their messages?","score":129,"comments":[{"body":"Yes","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"&gt; or \n\nand","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I did this once. After a 24 hour fishing trip, driving back home at night with my friend passed out. Middle of nowhere on a small 2 lane rural highway. I fell asleep and woke up to a semitruck’s air horn blasting. I was right in front of him and was able to swerve back. Never told my friend how we almost died.","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Don't Text and drive","score":61,"comments":[]},{"body":"Bet they fell asleep","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Driver is still inside btw.","not_safe_for_work":false,"locked":false,"body":"","score":4445,"comments":[{"body":"Latvia?","score":116,"comments":[{"body":"Yessir","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This is advanced parking and will become commonplace in the future.","score":147,"comments":[{"body":"just put some planks over the hole and a second car can park there... much more efficient use of space","score":56,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You can't park there sir","score":359,"comments":[{"body":"ahhhh fak off","score":95,"comments":[]},{"body":"Do I block the road? No\n\nIs there any no-parking indication? No\n\nSo yes, I can park there if I want!","score":80,"comments":[{"body":"Yes you can, but the exit fees are pretty stiff....","score":39,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"please deposit another Audi to continue....","score":32,"comments":[]},{"body":"Must have slid on the snow, surely wouldn't have been aiming for the ditch.","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Caught this one on my commute today. They sat like this for a few minutes while cars drove around them","not_safe_for_work":false,"locked":false,"body":"","score":74,"comments":[{"body":"After fucking up, it's better to be careful while correcting. At least this guy is trying to fix his fuck-up instead of doubling down. Stupid mistake, smart correction.\n\nAssholes who do this on purpose and then just blast through are way worse.","score":6,"comments":[]},{"body":"Smart for them to sit until the intersection is clear and they figure out what to do.  Haste makes wasteful crashes.","score":6,"comments":[]},{"body":"Correct me if I’m wrong, one idiot in the middle of the intersection and the other on the wrong side of the road? 2 for 1?","score":4,"comments":[{"body":"There is a median that separates the left turning lane from the main light. The guy in the middle of the road missed the median and tried turning from the other side of the straight lane from the looks of it","score":6,"comments":[{"body":"Ok gotcha, I see the point of the median now that you explained it","score":2,"comments":[]}]}]},{"body":"Boston left with a death wish","score":2,"comments":[]},{"body":"Prius...","score":2,"comments":[]}]},{"title":"How to drive on a wet road in the eternal city of Rome","not_safe_for_work":false,"locked":false,"body":"","score":38,"comments":[{"body":"If I'm not mistaken, drivers in Rome, drive on the right hand side of the road. Which explains why you're so careful when you're moving your phone in your hand so the steering wheel doesn't show in the video.. Idiot.","score":6,"comments":[]},{"body":"That's the Fontana degl'Imbecili!","score":2,"comments":[{"body":"lol very true","score":-1,"comments":[]}]},{"body":"First I thought it was one of those squirting videos.","score":1,"comments":[{"body":"We’ve found a gusher!","score":-1,"comments":[]}]},{"body":"/r/youcantparkthere","score":1,"comments":[]}]},{"title":"Can't even sit in your own car these days. Still no word as to why the other driver gunned it.","not_safe_for_work":false,"locked":false,"body":"","score":644,"comments":[{"body":"The ol' gassie brakey switcheroo","score":97,"comments":[]},{"body":"“I’d wear my seatbelt even in park cause I don’t trust the fools that drive around these parts”","score":55,"comments":[]},{"body":"Accidentally pressing the accelerator instead of the brake.  Happens a lot.","score":124,"comments":[{"body":"Less pedals = more problems\n\nSomehow","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"If you can't differentiate the accelerator and brake then perhaps someone shouldn't have a licence","score":22,"comments":[]},{"body":"r/FUCKYOUINPARTICULAR","score":58,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Next time turn on your force field.","score":13,"comments":[]},{"body":"*Shit your pants? No worries, Swiss Uniform Rental is here!*","score":13,"comments":[{"body":"Man, viral advertising is getting weird.","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I'm so sorry watched this 5 times and can't stop laughing. You have made my day","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Subarus can do anything...","not_safe_for_work":false,"locked":false,"body":"","score":63,"comments":[{"body":"**Is the load secured?**\n\nI see straps, I THINK, so I’d say the load is probably secured. Properly? Unknown, to be fair. It’s kinda far away. \n\n**Is the load reasonable?**\n\nYeah looks it. That looks like an empty bin, well within GVWR. \n\n**Roof?**\n\nLooks like roof racks, typically rated for ABOUT 150lbs. Obviously there are some nuances, some differences, etc. Those containers weight about 120LB dry….\n\n**Height?**\n\nDoesn’t look “overheight”, and if they know their height, that’s all that matters. \n\n\n\n\n\nAll things considered, the only stupidity here (ASSUMING it’s tied down properly) is that….the Baja has a bed……","score":11,"comments":[{"body":"I'd bet it wouldn't fit width-wise in a Baja's bed.","score":2,"comments":[{"body":"That’s correct. Same with the Ford Explorer Sport Trac from around that time. They’re just a tiny bit too narrow and too short to do much with. I’m pretty sure those water containers are 48x40 like a standard shipping skid, and it’s probably the 48 that screws things up here. \n\nPlus it looks like the suspension would sag too much if the weight was all on the rear axle, putting the load on-centre here is actually reasonable if that is the case.","score":2,"comments":[]}]}]},{"body":"Strength of a bus. Because backwards Subaru is UR A BUS.","score":7,"comments":[]},{"body":"We have those totes all over my workplace. They aren't light, but they also aren't crazy heavy when empty.\n\nAs long as it's strapped down and they keep the speeds reasonable, I don't see a problem.","score":2,"comments":[]},{"body":"This has to be somewhere in the Northwest if it’s a Subaru doing something idiotic.","score":2,"comments":[{"body":"Nailed it! Chewelah, WA.","score":0,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Someone air-dropet on this car","score":1,"comments":[]},{"body":"I would have been more impressed if it was filled with water.","score":1,"comments":[]},{"body":"I took me a minute to actually see that on the car, it looks photoshopped on, its that poorly tied down.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Minor bike accidents","not_safe_for_work":false,"locked":false,"body":"","score":22,"comments":[{"body":"I just enjoy watching the bikes go by with the whole family jammed on.","score":5,"comments":[{"body":"Very common from where I live","score":2,"comments":[]},{"body":"Almost like that's the only vehicle they can afford, and not putting everyone on it would cause an even bigger financial problem","score":2,"comments":[{"body":"Just an unfortunate way to get your entire family killed.","score":1,"comments":[]}]}]},{"body":"It's like watching 3 year olds playing and running around. You know they are uncoordinated enough, they are going to collide and fall down.","score":1,"comments":[]}]},{"title":"Remember folks: clean the snow off your roof before you kill others.","not_safe_for_work":false,"locked":false,"body":"","score":1587,"comments":[{"body":"but if you keep the snow, you could hide the body in it.","score":118,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Did they just pull that van out of a deep freeze? There is not a speck of snow anywhere else in that picture.","score":163,"comments":[{"body":"I find this so unsettling because at first I read your comment and thought “maybe the parking lot was shovelled really well” but then I looked at the grass and trees in the background and not even a tiny little bit of snow to be seen. How far did they drive like this?","score":62,"comments":[{"body":"Upstate NY. They drove from Buffalo/Lake Erie area that got 66+ inches last weekend. It's the reason the football game got moved to Detroit. They drove - at least - 60 miles on the I-90 with that on top of the roof.","score":85,"comments":[{"body":"How much would that weigh? Probably a couple 100kg? Wonder what the weight and aerodynamics does for your fuel too.","score":18,"comments":[]},{"body":"I'm of the mind that brake checking other drivers is 100% unacceptable--except in this case. Give this fool a good pump and watch it cover his own dumbass windshield. They'll get out and clean that shit up after that.","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"They drove ~1 hour from Buffalo to Rochester with that on their roof.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"He just needs to go through a drive thru.. that will trim that snow right off for him. 🤓 (kidding)... don't come for me.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'm not denying this is a problem, but isn't it just a high-top conversion, [like this?](https://imgur.com/MhXuYk4)","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Understood, i should clean off my roof, BEFORE I  kill others.\n\nI've been killing in the wrong order","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Semi driver takes turn too fast and spills giant toothpicks (lumber) everywhere.","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"I wooden of done that If I were him.  \n\n\nPerhaps he was board.","score":4,"comments":[{"body":"I see what you did there.","score":3,"comments":[]}]},{"body":"That had to be a pain to clear.","score":2,"comments":[{"body":"I'm sure it was a real thorn in the side.","score":2,"comments":[{"body":"I see what you did there.","score":1,"comments":[]}]}]}]},{"title":"Exit Only? Big Truck Thinks Not","not_safe_for_work":false,"locked":false,"body":"","score":3136,"comments":[{"body":"That exit only sign can’t stop him because he can’t read","score":81,"comments":[]},{"body":"He’s in a truck. That cowboy makes his own laws!","score":569,"comments":[{"body":"As he pulls into his gated apartment complex. A true cowboys home","score":218,"comments":[{"body":"Ah yes, the rare urban cowboy","score":58,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Flashes their lights too like \"you have to stop. I'm coming in. I'm in charge here\"","score":596,"comments":[{"body":"yeah, i was thinking \"oh how courteous of him to flash me, as if i don't see this massive ass truck charging at me\".","score":398,"comments":[{"body":"That's how I feel when a car waves me to cross the road when I'm already ¾ of the way across\n\n\"How nice of you to let me finish crossing the road and not plowing me over, such an act of courtesy\"","score":97,"comments":[{"body":"I usually give a wave of acknowledgment if a pedestrian is crossing in front of me, just a \"hey I see you and I'm not going to run you over\" kind of wave, not a \"I allow thee to cross\" wave.","score":43,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"me have truck, truck go now, truck truck truck","score":155,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What a pavement princess","score":73,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Is this safe?","not_safe_for_work":false,"locked":false,"body":"They drove at least 15 miles, at speeds of 40-50 mph down a windy and mountainous road….","score":90,"comments":[{"body":"I was two cars behind a guy that had a dog like this. Dog fell out, guy in front of me barely avoided him, and I was able to stop and block the lane. The dog was hurt from the fall, and the guy in front and I had both gotten out of the car to see how he was. He clearly broke something, and the guy in front took him to a vet - found out later he had broken a leg and several ribs, but he survived. I had given the guy my number so he could let me know.\n\nTruck driver just kept on going. As far as I know, the guy in front of me kept the dog.","score":34,"comments":[]},{"body":"Um, NO.","score":49,"comments":[]},{"body":"Fucking idiots….\n\n\n“The dog loves it…”\n“He’s done it for years…”\n“He jumps right up there…”\n\nMy dog is ‘smart’ too but she still doesn’t understand danger! Hell, she’ll eat most anything without any consideration of whether or not it can kill her! \n\nBe smarter than a dog and keep them safe!","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not even remotely","score":12,"comments":[]},{"body":"No.","score":29,"comments":[]},{"body":"# NO","score":10,"comments":[]},{"body":"Keeps veterinarians in business.","score":8,"comments":[]},{"body":"Not even a little bit.","score":3,"comments":[]},{"body":"Absolutely not","score":9,"comments":[]},{"body":"I see this and it get's me so angry.  So dangerous for the dog.  It's one thing riding in the bed around the farm but on the public roadways, no way.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Tight U-turn","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[]},{"title":"I turn now, good luck everybody else pt. 20460","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"Where's the turn? I only seen a cut off merge...","score":6,"comments":[]},{"body":"You're supposed to anticipate their needs!! OP is the idiot!/s","score":3,"comments":[]},{"body":"I'm confused because OP moves to the left anyway. Was the roadway a single lane or did we just witness a merge swap?","score":1,"comments":[]}]},{"title":"Road Rash?!","not_safe_for_work":true,"locked":false,"body":"","score":737,"comments":[{"body":"Tan removal!","score":125,"comments":[{"body":"“*Tanning salons love this one trick.*”","score":15,"comments":[]}]},{"body":"Man donated some skin\n\nr/meatcrayon","score":195,"comments":[{"body":"His arm definitely changed a whole color","score":47,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"And then he holds her with his back against oncoming traffic. That's a nice gesture after potentially maiming her.","score":130,"comments":[]},{"body":"Dress for the slide","score":40,"comments":[]},{"body":"Fuck all of these idiots.","score":141,"comments":[{"body":"Yep. Every one of em.","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I saw that blood/flesh streak","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Meat crayon.","score":27,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Raining, double yellow, and around a blind corner with an oncoming car..","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"I couldn't hardly see because your wipers need to be faster! 😬","score":7,"comments":[{"body":"Yeah, that’s on me. My auto wiper sensitivity is low since I have rain-x applied on my windshield.","score":-5,"comments":[]}]},{"body":" Error 405: can’t see because of rain on the windshield.","score":4,"comments":[]},{"body":"I love people who are late to their own funeral. Just wish the universe would make them pay more often","score":2,"comments":[]},{"body":"Passing on a double line is ok in Ontario Canada","score":1,"comments":[{"body":"Funny enough, this is BC 😂","score":-1,"comments":[]}]},{"body":"Blind curve == didn’t see no damn oncoming car","score":0,"comments":[]},{"body":"Must’ve really needed to poop…","score":0,"comments":[]}]},{"title":"Was I the idiot? Sorry I don’t have a rear dash cam, but I was hit in rear quarter panel on driver side while moving into the left lane after signaling","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"Insurance wise, I'm sure you're fine. That lane split just happened so that means the guy had to be riding your ass so they could get one car ahead.","score":15,"comments":[{"body":"He was tailgating me prior to the collision, but I’m not sure that will make its way into the police report. I may have been going relatively slow as I am not familiar with the area.","score":3,"comments":[{"body":"&gt;I may have been going relatively slow \n\nNo you weren't. Your Dashcam doesn't show GPS speed. Don't admit to anything. Let insurance handle it. Given only information that is necessary and no more.","score":14,"comments":[]},{"body":"I'd just contact your insurance and let them handle it. Looks like Massachusetts.","score":5,"comments":[]}]}]},{"body":"Just show the video to your insurance and police.  Don’t say too much about it","score":4,"comments":[]},{"body":"If it’s on the driver side that means he was in the lane that you merged into.  He was driving aggressively but you still need to look before making a lane change.","score":0,"comments":[]},{"body":"[removed]","score":1,"comments":[]},{"body":"Depends, and without seeing what happened it’s impossible to say. Did the vehicle behind you speed up as soon as the lanes split into two and you didn’t check your blind spot?","score":-6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Today I was the idiot. First time ever having an accident, I spun out on ice and ended up sideways and thankfully missed 2 oncoming cars, but I was 2 feet deep in snow. Got a tow from my cousin, my car is fine and didn't get a ticket. So, could worse.","not_safe_for_work":false,"locked":false,"body":"","score":228,"comments":[{"body":"I very much doubt your car is fine. Get the alignment checked.","score":55,"comments":[]},{"body":"Winter driving can be humbling.  Glad you are okay, and even better that you were close to family and got pulled out! \n\nCheap lesson. Now you know a little more about what to watch out for in bad weather.  \n\nEasy on the pedals, and easy on the wheel.  \n\nDon't worry, spring will be here in a few months.","score":9,"comments":[]},{"body":"Fortunate you weren’t injured 👏🏻 Maybe needs an alignment?","score":17,"comments":[]},{"body":"You're not an idiot. Shit happens. At least you're ok. I would take it as a learning experience.","score":6,"comments":[]},{"body":"Naah, not an idiot. Winter driving is and will always be kinda on-the-job training. Some off-road incidents are almost inevitable part of it. And you forget a lot in summer so you restart the training every autumn. Just try not to kill anyone","score":29,"comments":[]},{"body":"my california ass has no idea how to drive in snow and ice, does that make me an idiot","score":9,"comments":[{"body":"Here's my advice from my personal experience. When there's snow, heavy slush or black ice, don't speed and don't tailgate.  Especially so if you have all-season tires.\n\nIf you try to turn but your car starts slipping uncontrollably, abandon the turn and focus on staying on the road going mostly straight. Putting the brake pedal all the way to the floor, or overcorrecting in either direction will only make a bad situation worse. Apply firm but controlled braking.\n\nYou'll only truly get a feeling for how to do it by fucking up slightly... which is why my first point is to go slow in the snow.","score":10,"comments":[]},{"body":"Yeah my butthole will be puckering the day I have to drive in snow being from the deep south.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"It happens to the best of us","score":10,"comments":[]},{"body":"Glad you weren't hurt!\n\nYou're not an idiot. Shit happens to us all.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Special kind og odiots","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"Not sure who the ogiot is, but I'm not certain who even has the right of way here since there seems to be a lack of signage.","score":10,"comments":[{"body":"I am guessing this is somewhere in Europe, where the right before left rule applies if there is no signage. So the guy on the bicycle was the idiot.","score":3,"comments":[{"body":"It's in [Norway](https://goo.gl/maps/aEtW2miwSNKgnpZX8).\n\nThere's no signage, but I don't think it's universally right before left - some places you would need to weave/merge when there are multiple vehicles waiting (probably still starting with the person on the right). That said, the car didn't seem to think he had right of way, so it's probably the cyclist in the wrong.","score":1,"comments":[]}]},{"body":"Since there's no signage, obviously it would be the person who is going straight that has the right of way, no? \n\nIn what situation can you just turn in front of someone without a stop sign at a three way intersection and not be in the wrong?","score":0,"comments":[{"body":"Did you read the other replies, they seem to have different rules in some European countries than what I would expect in America.","score":1,"comments":[]}]}]},{"body":"Even in \"friendly\" countries like Norway, the VW drivers are the same.","score":0,"comments":[]}]},{"title":"Well excuse me","not_safe_for_work":false,"locked":false,"body":"2am on the I10 far right lane, I guess I was in their way…","score":350,"comments":[{"body":"It’s always good to see people on bikes not chasing someone down for this; just giving them the peoples finger and going on about their day. Glad he wasn’t half a foot closer to the bike or it would have been a bad situation","score":76,"comments":[{"body":"Not worth the chance asshat has a GUN. Already willing to put me at risk","score":51,"comments":[{"body":"Agreed! I’ve seen too many bikers chase someone down for something so stupid and it always ends up badly!","score":15,"comments":[{"body":"Plus my luck I’d be the one arrested for “road rage”","score":24,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Ikr maturity.","score":5,"comments":[]}]},{"body":"After midnight I assume everyone on the road is drunk.  I don't take the bike out that late unless I absolutely have to.","score":42,"comments":[{"body":"Got to go to work..  but you are correct","score":23,"comments":[{"body":"Man, if you have to go to work at 2am, it’s time to get a car. Risk is high enough on a motorcycle, but add the element of tired and drunk drivers and it’s only a matter of time.","score":14,"comments":[]}]}]},{"body":"Yeah I had that happen same situation all lanes open still does it I had the same reaction.","score":7,"comments":[]},{"body":"Gotta go with the thumbs down, hit ‘‘em with that disappointed dad emotional damage","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"mattress was in road. had flashers on. idiot hit me at 65mph. 3 car pileup.","not_safe_for_work":false,"locked":false,"body":"","score":83,"comments":[{"body":"Gonna need some info about the mattress part?","score":27,"comments":[{"body":"I'm guessing he slowed down because he saw a mattress in the road.\n\nWhat I'm NOT clear on is if it was his own mattress, or one he wanted to stop and pick up (\"hey! a free mattress!\") or if it was just a road hazard he was trying to avoid.","score":13,"comments":[{"body":"There was a mattress laying on the freeway. I was the van  with flashers on. In hospital now. Wad trying to avoid mattrrss..\nNotMy matteres","score":38,"comments":[{"body":"Hope you're ok","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Provide us with an update on your injuries when you can. Hope its not as bad as it looks...","score":4,"comments":[{"body":"Just had a CT scan done for my neck and brain. Probably concussion. They are looking for a brain bleed now. The van did not have airbags or locking seatbelts. \n\nI can type fine, but can't talk pretty much at all. Which worries the doctors.","score":27,"comments":[{"body":"The speech problem is very worrisome, but at least no fractures or breaks... thanks for the update and hope it goes smoothly with recovery.","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"You'd have to be crazy not to try and collect the awesome free motorway mattrass.","score":4,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That sucks! I am assuming the van is yours. Insurance will probably total the van because to them it has less value than it actually is worth. That is a classic ride.  I hope everyone is okay!","score":7,"comments":[{"body":"Probably. I don't know if I can afford the repairs out of pocket. It would kill me to total her though. I love her so much. \n\nI'm in the hospital.","score":14,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Almost got T-boned on my morning commute","not_safe_for_work":false,"locked":false,"body":"","score":219,"comments":[{"body":"You shat yer pants and pulled over? I don't blame you, that fucker was not going to stop.","score":28,"comments":[]},{"body":"I got a big truck that means I can plow right out into the intersection even when I can't see shit","score":27,"comments":[]},{"body":"I believe you were about to be the boner, and not the boned.","score":68,"comments":[{"body":"Definitely a near-boner.","score":1,"comments":[]}]},{"body":"Oh my god I thought it was gonna be the car sitting there, I didn't even see that truck. Looked like he was about to turn wide too, glad you made it out ok!","score":17,"comments":[{"body":"You can tell he's a habitual idiot, by the fact that he was turning into the furthest lane.","score":10,"comments":[]}]},{"body":"Typical truck driver.  It's their road, they just let you drive on it from time to time.","score":5,"comments":[]},{"body":"Mmmmmm steak","score":3,"comments":[]},{"body":"They were going into the far left lane as well - lol what a moron","score":1,"comments":[]},{"body":"Truck Nuts talk all about how sitting up high gives them a commanding view of the road and they feel safer?","score":1,"comments":[]}]},{"title":"“Red lights and turn lanes are more what you’d call ‘guidelines’ than actual rules.\"","not_safe_for_work":false,"locked":false,"body":"","score":147,"comments":[{"body":"The extended right on red.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Ahe-aye, Captain  Barbossa","score":4,"comments":[]},{"body":"It appears the OP stopped a bit too far into the crosswalk.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Tourists. Jesus.\n\nSource: me. I've done that once or twice, going \"oh fuck oh fuck oh fuck sorry! Soorryyyy!!\" In places I've never driven before.","score":4,"comments":[{"body":"Why can't you just drive legally and turn around? Being a tourist is no excuse","score":6,"comments":[{"body":"Didn't say it was an excuse either","score":1,"comments":[]},{"body":"He didn't say it was an excuse.  LoL.  He just said he could identify with that level of stupidity.","score":1,"comments":[]}]},{"body":"That's literally what GPS navigation is for though. The dude could have made the left turn he was in, made a U-turn and then gone straight onto the freeway. 😄","score":6,"comments":[]}]},{"body":"Mild","score":3,"comments":[]},{"body":"So are stop lines, apparently.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Imma just back up in an active intersection and make a U-Turn on a red","not_safe_for_work":false,"locked":false,"body":"","score":454,"comments":[{"body":"Putting on your hazards these days means “look I’m going to do something stupid and you better yield to me”","score":83,"comments":[{"body":"Can’t forget they literally let you park anywhere you want as long as they’re on","score":20,"comments":[]},{"body":"Hazards lights only propose is to provide full legal immunity to the protagonist behind the wheel. When we plebs see the hazards we must know that this superior being must be allowed to make whatever maneuvers please them. /s if you need it.","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"It’s ok, they have their hazard lights on! Can’t you see? /s","score":17,"comments":[]},{"body":"The tiktok @Les morons de la route loosely translates to \"Morons of the road/highway\"...\n\nThis appears to be in Blainville, Quebec, near Montréal.","score":12,"comments":[]},{"body":"Y s'en câlisse ?","score":6,"comments":[]},{"body":"Hazard lights = Mario kart star","score":4,"comments":[]},{"body":"Wow, just wow.","score":5,"comments":[]},{"body":"aaah of course it’s in fucking Quebec lol","score":2,"comments":[]},{"body":"La porte de la voiture? C’est grande.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Tesla vs Tesla.","not_safe_for_work":false,"locked":false,"body":"","score":410,"comments":[{"body":"Did you use DivX to code the video? Are you from 1998?","score":333,"comments":[{"body":"Yes I’m a time traveller who brings you cutting edge technology from 1999.","score":197,"comments":[{"body":"I knew it, what's this week's loto numbers?","score":39,"comments":[{"body":"I can’t tell you that. I can only move forward in time which is how I managed to bring you amazing cutting edge technology from the past. I can also give you the winning lotto numbers from 1999.","score":100,"comments":[{"body":"I smell a scam","score":40,"comments":[{"body":"Well, stop sniffing it then.","score":42,"comments":[]},{"body":"No, it's true. We invented a time machine. It propells you up to 10 hours in the future. \n\nYou just lay down on it, close your eyes, and *BAM!* time has passed. \n\nHas some weird side effects though... sometimes it makes you hallucinate, and it seems to slowly make you age, too.","score":17,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Looks like the Predator filmed it.","score":102,"comments":[]},{"body":"Video looks like a bad acid trip because the CCD on my BlackVue camera is fried. I’m buying a new camera.","score":142,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Big surprise, Vancouver, BC","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I don’t think I’m the idiot on this one, but correct me if I’m wrong","not_safe_for_work":false,"locked":false,"body":"45 mph road, car decides to turn into their driveway and I narrowly avoided impact","score":143,"comments":[{"body":"Not at all, separate yourself from whatever guilt has made you ask such an absurd thing.","score":84,"comments":[{"body":"Ahaha, see I didn’t think I was! I will separate all guilt from the situation 🫡","score":28,"comments":[]}]},{"body":"You're good my guy, you were literally just trying to drive your motor vehicle.","score":33,"comments":[{"body":"Attempting to operate their horseless carriage, if you will.","score":4,"comments":[]}]},{"body":"NTI","score":23,"comments":[]},{"body":"Uhh, NO.  No, you are most assuredly NOT the idiot.","score":17,"comments":[]},{"body":"NTI, he should've waited until traffic (you) cleared.","score":15,"comments":[]},{"body":"How dare you follow the rules of the road! Shame on you.","score":11,"comments":[]},{"body":"Uh no he fuckin turned right in front of you like his blinker was a force field","score":10,"comments":[]},{"body":"Hit the brakes quick, avoided a crash and insurance companies. Good driving.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"driving with a loose bumper","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[]},{"title":"Idiot NYC cab driver! Very dead tires.","not_safe_for_work":false,"locked":false,"body":"","score":125,"comments":[{"body":"The cab companies not the drivers are responsible for maintainence. Very few drivers own their medallions","score":17,"comments":[{"body":"Still up to the drivers to make sure their cars are in good working order and bring any issues up with the company. \n\nThis is 100% a safety issue and the car shouldn't have left the garage.","score":3,"comments":[{"body":"It looks like a retread was put on the tire and it's coming off. OP should have notified the driver instead of filming. It probably happened during I ng the shift. NYC cabs are the most regulated livery vehicles in the world. They know what they're doing.","score":1,"comments":[{"body":"Regardless of why they were driving around like that, I agree that the filmer should have went up to them.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"And that's what we call a rimjob\n\nOr maybe not, but your ass is going to hurt either way.","score":4,"comments":[{"body":"&gt; And that's what we call a rimjob\n\n[rimshot](https://i.gifer.com/1U9e.mp4)","score":1,"comments":[]}]},{"body":"Cash Cab has fallen in some hard times.","score":5,"comments":[]},{"body":"Just another day in NYC","score":3,"comments":[]},{"body":"Spanish is my first language, and I think that was Spanish, but I cannot confirm.","score":2,"comments":[]},{"body":"Shit! Those tires are good for another 5,000 miles /s","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"PSA: Turn Your Lights On At Night","not_safe_for_work":false,"locked":false,"body":"Every time I drive a night I don’t go but a mile and see someone without their lights on. \n\nIf you own an older vehicle that doesn’t have an “auto” light function, please turn your lights on before someone gets killed.","score":83,"comments":[{"body":"I once encountered a semi truck barreling down the interstate without any lights on, driving out of a city into a rural area where there were no street lights.  Scared the crap out of me and I made sure to follow it at a safe distance as I didn’t want it coming up behind me.","score":5,"comments":[]},{"body":"I always keep my lights off, because less drag and also I like saving electricity. /s","score":6,"comments":[]},{"body":"The worst one are the one with DRL and thinks their headlight is on, but their taillight isn't.","score":3,"comments":[]},{"body":"PSA always have your lights on when driving, even in the day, it’s always safer.","score":3,"comments":[{"body":"I don't understand why people don't do this. It's clearly so much safer. If your cat is running it should have white lights on in front and red lights in rear. So much safer for other cars, bikes, and pedestrians when any car that could move has lights on. It should be the law.","score":2,"comments":[]}]},{"body":"It’s not cause of the no auto lights. It’s cause they don’t have lights haha","score":9,"comments":[]},{"body":"Nightmare fuel","score":3,"comments":[]},{"body":"With or without auto lights, this Accord looks old enough that it should have an analog cluster rather than a screen with an always-on backlight. The driver should catch on that their lights are off when they first look at the dash and can't read anything. Of course, that assumes that they look at the gauges.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I remember the first time I drove at night without my dad the second I was about to move my car on a dark road a bike without lights flew by my car. If I had started the car a second earlier It would have hit me.","score":2,"comments":[]},{"body":"Hell, I turn mine on during the day. As a previous biking commuter, it helps.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Box truck hit my neighbor’s tree and took off","not_safe_for_work":false,"locked":false,"body":"","score":198,"comments":[{"body":"You neighbor should leave it there and hang Christmas ornaments from it.","score":33,"comments":[]},{"body":"I hope they purchased the insurance protection.","score":8,"comments":[{"body":"Usually still excludes Overhead damage","score":6,"comments":[]}]},{"body":"Does the tree have insurance","score":6,"comments":[{"body":"/r/treelaw","score":3,"comments":[]}]},{"body":"r/11foot8\n\nAlso, I bet a local box truck rental place would like to see this.","score":16,"comments":[]},{"body":"If he decides to report it, it shouldn’t be hard to id the perps vehicle","score":4,"comments":[{"body":"He got the truck’s license plate, but I’m surprised he still left. I briefly saw the damage to the truck and it looked like it was gonna collapse","score":3,"comments":[]}]},{"body":"Now *this* is jousting!","score":3,"comments":[]},{"body":"Truck left part of box behind.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How does one manage to do this","not_safe_for_work":false,"locked":false,"body":"","score":541,"comments":[{"body":"His shoulder is out for sure","score":71,"comments":[]},{"body":"I think they want to get hit. Kind of like when the cowboys and bulls go at it.","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Takes skill to control the oversteer so you just whack the guy, not take him completely out.\n\nOr were you thinking something different?","score":27,"comments":[{"body":"2/10.  Didn't even get him over the trees.","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Now put a circle of 100 or more people around it.","score":16,"comments":[{"body":"I'm amazed that even with only a handful of people around this time, some guy still manages to get hit.","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Guys I get it, there’s always gonna be a fool doing donuts in an empty parking lot, but why oh why is there always an idiot on foot risking his/her life in the hands of an amateur driver?! I wouldn’t even trust Lewis Hamilton to do this shit with me standing there but there’s always a fool running for his life getting trampled by an inexperienced driver 😂","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not so hard, I do it all the time.\n\nIn Gta V","score":11,"comments":[]},{"body":"Mustang and BMW drivers are 2 sides of the same coin.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If you mean getting hit by a car, that is easy. If you mean hitting a moving target with a car, that takes practice.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Lights on for safety","not_safe_for_work":false,"locked":false,"body":"Keeping’ in classy in Houston…","score":1,"comments":[{"body":"It's a couple pallets that look like they are securely strapped down. What's the issue? Looks janky but if the straps are good it's no worse than say three bikes, or a kayak. Not a such weight as a roof tip tent.","score":1,"comments":[]}]},{"title":"Caused major grass fires along a major interstate highway","not_safe_for_work":false,"locked":false,"body":"","score":27123,"comments":[{"body":"100% this person is either fleeing from an accident/police/crime scene, or very not sober.","score":6451,"comments":[{"body":"It's south Louisiana so probably all of the above","score":2137,"comments":[{"body":"When you rear end a cop car after robbing a liquor store while drunk","score":677,"comments":[{"body":"And don't want to be caught because you're driving your father-in-law's truck and your license was taken away last week.","score":297,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"*why is everything lopsided*","score":437,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Update- he was running from the police","score":4215,"comments":[{"body":"Shocked! Shocked! I tell you.","score":1417,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"He's going so damned fast like that wtf. You'd think he'd be like\"ok we'll just get this thing there\" but nope he is straight flying.","score":2815,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When this makes it over to r/justrolledintotheshop C/S it's pulling a little to the right","score":821,"comments":[{"body":"I need an oil change and don’t touch anything else.","score":255,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Black car cutoff tractor trailer trying to exit, driver responds by trying to run that car off the road.","not_safe_for_work":false,"locked":false,"body":"","score":128,"comments":[{"body":"I don't know where you are, but construction zones near me don't allow 83 mph.","score":19,"comments":[{"body":"If you squint your eyes the sign pretty much says 83","score":5,"comments":[]},{"body":"Told the wife to take it easy in the pedal, my 4Runner guzzles up the gas easily! 😅😂","score":-5,"comments":[{"body":"I ask my girlfriend to keep it around 70 in my car and two seconds later she’s passing everyone going 85 😂","score":5,"comments":[]},{"body":"Why is this downvoted lol he’s not wrong","score":2,"comments":[{"body":"Cuz you’re in r/idiotsincars","score":4,"comments":[]},{"body":"Cause I’m “blaming” my wife","score":6,"comments":[]}]}]}]},{"body":"Play stupid games, win stupid prizes. When you are in a 3 ton car arguing with a 40 ton truck, you lose. Even if you're in the right you lose. Always drive with that in mind.","score":7,"comments":[]},{"body":"Report it to the Company and the authorities.","score":-2,"comments":[{"body":"lol, the police don't give a fuck, and the company sure as hell don't give a fuck if they didn't hit anyone.","score":1,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"School Pick up Line - Cops were called and said they are aware but cant do anything about it. So many people coming the other way moved out of his way and drove in the dirt to let him go.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"OP thinks they’re Batman out here lol. \nLet the person pass it’s not like theyre entitled to wait in a line that has nothing to do with them","score":28,"comments":[]},{"body":"The line is waiting for school to be out and to get in the lot on the right to pick them up.  The truck was simply wanting to go on his merry way with no relation to the school.  I had this exact situation for some years near a garage I had rented.   Finally the cops and the school admin convinced the parents to either park in a nearby lot and walk to pick up their kids or if they insisted on driving all the way into the lot to pull fully off the road to the right so that there was room for traffic to pass both ways beside the line just as is happening here.","score":31,"comments":[{"body":"I think it's insane how many kids get driven to and from school by their parents.","score":4,"comments":[]}]},{"body":"These bullshit school pickup lines.  Impeding traffic but people act like the ones that just need to get by are wrong.","score":52,"comments":[{"body":"Always funny when it sprinkles outside and the line triple in length","score":10,"comments":[]}]},{"body":"You got the the person in the truck but is it just me or does it look like you're driving in the middle of road because you have people in the incoming traffic having to pull over to the right side to get around you.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Why are you driving in the middle?","score":6,"comments":[{"body":"He’s an asshole","score":7,"comments":[]}]},{"body":"You obviously have no clue what it's like living near a school. Why do people in pickup lines think there entitled to block traffic? I'm pretty sure impeding traffic is also a law. Maybe everyone gets a ticket?","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Or just tell ya kid to walk a block and pick them up there lmao","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"More idiots running the red light at Chili’s","not_safe_for_work":false,"locked":false,"body":"","score":68,"comments":[{"body":"Just left and they can already feel the diarrhea coming.","score":3,"comments":[{"body":"I came here to say this. 🤣","score":1,"comments":[]}]},{"body":"Take a pill","score":4,"comments":[]},{"body":"If the dashcam car hadn’t been trying to time the green light and actually slowed down coming up to a red then they wouldn’t have felt the “cut off” from the two turning vehicles who clearly were finishing their turn on late yellow or even red. Doesn’t make your driving any better","score":2,"comments":[{"body":"That second car wasn’t even in the intersection when its light turned red.","score":2,"comments":[]}]},{"body":"Maybe they were in the wrong but failing to yield to an unclear intersection is also dangerous.","score":1,"comments":[]},{"body":"It’s always Chili’s","score":1,"comments":[]}]},{"title":"Was just casually driving around on Saturday morning at 9am and saw this.","not_safe_for_work":false,"locked":false,"body":"","score":332,"comments":[{"body":"Can't wait for their tires to blow out doin that.","score":19,"comments":[]},{"body":"What’s the problem? The VIP line was used by a VIP member whose life is more important than every other user of the road.","score":18,"comments":[]},{"body":"is that a prius","score":16,"comments":[{"body":"Hell of a machine","score":8,"comments":[]},{"body":"You be surprised what a Prius can do in “Power mode” lol. (Sarcasm)","score":3,"comments":[]}]},{"body":"That's one way to get around a rolling road block anchored by a left lane camper.","score":8,"comments":[]},{"body":"Last Podcast on the Left!","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I didn't think a Prius could go that fast.","score":14,"comments":[{"body":"Took him 25 minutes to get to that speed...fucked if he's gonna lose it now...","score":16,"comments":[]}]},{"body":"Hail Yourself!","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Don't Drink and Drive","not_safe_for_work":false,"locked":false,"body":"","score":68,"comments":[{"body":"can't believe they stopped for  stop signs, even tho its past the line. some people don't even do it when they're sober","score":19,"comments":[{"body":"I'm surprised they even saw the stop sign.  Notice that they had no headlights on.","score":10,"comments":[]},{"body":"I imagine they're the type of person who say \"I actually drive pretty well when I'm drunk.\"","score":11,"comments":[{"body":"\"I feel like I focus better under the influence\"","score":2,"comments":[]}]}]},{"body":"You called the cops on them, right?","score":12,"comments":[{"body":"Yep.  I'm generally live and let live,  but this was bad.","score":14,"comments":[{"body":"Thank you for doing that. Probably saved a couple of lives.","score":6,"comments":[]}]}]},{"body":"Drunk + Driving + Dark = Fun Fun Fun and a new episode of Untold Stories of the ER","score":1,"comments":[]}]},{"title":"he’ll get out there eventually, right?","not_safe_for_work":false,"locked":false,"body":"","score":35,"comments":[{"body":"[deleted]","score":6,"comments":[{"body":"No, I think dude cheaped out and got the 2 x 4.  I think we would be seeing the front wheel spin out in that wet cement.  To me, it’s even more stupid because it’s just an admission that you will never actually use the truck for truck stuff and that it’s just a giant car.","score":1,"comments":[{"body":"It does have a pretty big trunk though","score":3,"comments":[{"body":"I thought his gets much use","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"I like it, next time pay attention","score":2,"comments":[]},{"body":"I am thinking about a new version of cement mixer!","score":2,"comments":[]},{"body":"It went from ‘unlikely’, to ‘never gonna happen’","score":2,"comments":[]},{"body":"Turn right to go left…. \n                     Lightening McQueen","score":1,"comments":[]},{"body":"From bad to worse.  A good time to have a long 2x10 board in the bed.","score":1,"comments":[]},{"body":"I love the part where the rear wheel goes in with the front wheel.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Truck nails ladder on highway","not_safe_for_work":false,"locked":false,"body":"","score":33,"comments":[{"body":"Hey free ladder!\n\nEven run over still probably safer than the ones work provides","score":3,"comments":[]},{"body":"I remember a story about a guy in a sports car who tried to go around a ladder that lying across the highway.  He went off the road, rolled his car, and died.","score":2,"comments":[{"body":"Yeah, no idiot in this video. Unless you count the person who dropped the ladder.","score":2,"comments":[]}]},{"body":"Feels like Edmonton","score":1,"comments":[{"body":"Saskatoon","score":1,"comments":[{"body":"Oh, much better!","score":1,"comments":[]}]}]},{"body":"Gonna cause a wreck","score":1,"comments":[{"body":"Nah, someone in an Elantra will come by and vaporize it and tear open their oil pan in the process and then have to replace it that weekend in the freezing cold. But they'll do it right and it won't leak and they'll go on to drive that car like nothing happened.","score":3,"comments":[{"body":"Oddly specific","score":1,"comments":[]}]}]},{"body":"Ah the ubiquitous ladder on the highway.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Got annoyed with her sun shade, so she threw it out the window.","not_safe_for_work":false,"locked":false,"body":"","score":188,"comments":[{"body":"Looks like the type you suction cup on the window. Probably forgot it was on the rear side window, and when they opened the window it popped off and got sucked out.","score":21,"comments":[{"body":"I would’ve hoped so, but it looked like she was messing with it before this and just got annoyed based on what I could see. Hopefully that isn’t the case though!","score":3,"comments":[]}]},{"body":"It's a Fiat. Probably fell off mid adjustment.","score":5,"comments":[]},{"body":"I feel this one. They never make them wide enough now. Sun will always be in the gap between the visor and the a pillar.","score":13,"comments":[{"body":"Frustrating. Be sure to dispose of it responsibly though!","score":1,"comments":[]}]},{"body":"r/trashy","score":-2,"comments":[]},{"body":"😂😂😂","score":0,"comments":[]}]},{"title":"left turns have right of way in this person's reality","not_safe_for_work":false,"locked":false,"body":"","score":75,"comments":[{"body":"Welcome to LA \n\nEverybody has their own reality.","score":9,"comments":[]},{"body":"You’re just not that important.","score":1,"comments":[]},{"body":"Just most Arcadia drivers in a nutshell","score":1,"comments":[]},{"body":"Oh hey, a Pittsburgh Left outside of Pittsburgh!","score":1,"comments":[]}]},{"title":"Lady blocking left turn lane at the intersection. She received lots of well deserved honks","not_safe_for_work":false,"locked":false,"body":"","score":46,"comments":[{"body":"Is this is riverside?","score":4,"comments":[{"body":"I was about to ask the saaaame thing","score":1,"comments":[]},{"body":"Yep, right next to the Petco at Tyler","score":1,"comments":[]}]},{"body":"\"Must block the box because I would hate to wait for 1 more signal cycle\".","score":4,"comments":[]},{"body":"inb4You'retheidiotforusingyourphonewhileyouweredrivingitdoesn'tmatterifyouwerestopped.","score":-4,"comments":[]}]},{"title":"Looks a bit intentional to me...what you think?","not_safe_for_work":false,"locked":false,"body":"About 4 miles prior to this incident I merged onto the interstate in front of this car. I had to increase speed pretty rapidly (about 12 mph over 3 seconds) to get about 5 car lengths in front of them. They ride behind my for a few miles, then pull up next to me, then back off, then this.\n\nHad an Angel looking out tonight. Thank God for a low center of gravity and high situational awareness. I was pretty shook but I think Autopilot gave me the first warning by moving the car over initially.","score":33,"comments":[{"body":"That could all just be really inatentive driving.  When not paying attention, on a mostly open road, many drivers tend to base their speed on the one other car on the road, because it's the only speed cue the driver is getting, with making an active attempt to moniter the speedometer.\n\nThe end effect is that drivers slow down to match the speed, as they approach a car, and tend to tailgate or hang out in a blind spot.  Combine that with drifting out of the lane, and you probably have someone intoxicated or falling asleep.","score":8,"comments":[]},{"body":"Is that a mach e?","score":3,"comments":[{"body":"I'm in a Tesla, they are in some Hyundai I think. Definitely not a Mach E though.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"God? And why not just download the video?","score":8,"comments":[{"body":"Because you have to disassemble the entire car to get to the USB drive. Sort of sarcasm, but not really.","score":0,"comments":[{"body":"The USB drive is in the glovebox or center console","score":8,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Why did you start swerving? I'm confused as to what the issue is","score":2,"comments":[{"body":"It looks to me like they got it, but reading the comments it looks like the other driver was pissed, going to do something and then OPs autopilot kicked in","score":1,"comments":[{"body":"Why he gotta be pissed or intentional? Hyundai is just looking at his phone or micro-sleeping","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"12mph over 3 seconds? Rapid acceleration? When that Tesla will do 0-60 in less than 3?","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"Idiot on car","not_safe_for_work":false,"locked":false,"body":"","score":56,"comments":[{"body":"Why'd you assume they were mexican? Care to explain?","score":1,"comments":[{"body":"She’s got a Mexican flag draped around her neck, and this was the morning after Mexican Independence Day in Chicago","score":2,"comments":[]}]}]},{"title":"The guy was there the entire time we walked away, welcome to NOLA","not_safe_for_work":false,"locked":false,"body":"","score":171,"comments":[{"body":"Why didn't anybody just go knock on his window and remind him he's stopped in the middle of the road? I mean, did anybody even try?","score":16,"comments":[{"body":"Fuck no, in New Orleans you get shot for that","score":16,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Also for better context, we were on a walk and saw him already stopped. He had his hazards on and was talking to someone in the car. By the way there was an open parking spot right next to him. After being there for a while he finally let the person out and continued on his way. The amount of time I had seen him stop (not including the time I didn’t see him and for that traffic to a-crew) was around 5 minutes","score":18,"comments":[]},{"body":"What's a \"NOLA\"?","score":10,"comments":[{"body":"New Orleans, Louisiana (which is abbreviated as LA)","score":11,"comments":[{"body":"I thought Los Angeles was abbreviated as \"LA\"?","score":4,"comments":[{"body":"It is, two things can have the same abbreviation.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"La. ?","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"what carbrian does to a motherfucker","score":2,"comments":[]},{"body":"Is this by Loyola / Tulane?","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"Guy does 360 in front of school bus","not_safe_for_work":false,"locked":false,"body":"","score":1380,"comments":[{"body":"This is one of those crazy Arab drifting videos. Surprised a few people aren't hanging out the window as they spin around.","score":266,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"4 way flashers are on so they are being as safe as they can.","score":68,"comments":[{"body":"Safety first. Even if he crashes, the kids will learn a lesson either way.","score":9,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Imagine the kids inside enjoying and greeting him.","score":80,"comments":[{"body":"The kids have had a story to tell for a whole week! Even the ones on the other side will have something to say ..","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"It's fine, he had his flashers on\n\n/s in case it's unclear","score":21,"comments":[]},{"body":"That was honestly some very very good driving I hope he got a job in Hollywood right after","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"WTF, that’s crazy","score":12,"comments":[]},{"body":"Damn I thought this was on purpose for like 2 and a half seconds! Obviously scary, but also kinda tight","score":73,"comments":[{"body":"It was on purpose. Search YouTube for arab drifting and hold onto your cajones.","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Parenting 101","not_safe_for_work":false,"locked":false,"body":"","score":2184,"comments":[{"body":"When the trash in the car is worth more than your child. 🤦🏻","score":290,"comments":[{"body":"Kids ARE expensive, and one mans trash IS another mans treasure...","score":61,"comments":[{"body":"I could sell a child for a lot more than I could sell that garbage","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That’s a real shame when folks be throwin away a perfectly good white boy like that.","score":9,"comments":[]}]},{"body":"If someone is about to rear-end you , the kid is supposed to push the car away with their feet.","score":208,"comments":[{"body":"It builds character.","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"why does borat come to mind","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"…..surely it’s a doll or something? Hopefully?? 😭","score":77,"comments":[{"body":"That’s what I thought at first. A practical joke","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Glad the photographer was tailgating","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Found two in the wild","not_safe_for_work":false,"locked":false,"body":"","score":96,"comments":[{"body":"Perfectly normal behaviour","score":5,"comments":[]},{"body":"Rushing to queue.","score":5,"comments":[]},{"body":"That’s being kind in Houston.","score":5,"comments":[{"body":"I came here to comment that is every day in Houston.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Gore area violation is greater violation than speeding or running a red light here in AZ.  More points on your drivers license.","score":3,"comments":[]},{"body":"What’s stopping them from moving to the right lane half a mile ago?","score":3,"comments":[]},{"body":"Jersey I tell ya","score":2,"comments":[]},{"body":"I work a few miles from this exit. It sucks. Not because its poorly designed, but because its the busiest exit north of Trenton on I-295 but idiots go really slow on the ramp, so traffic backs up and other idiots try to be clever and do this.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This happens all the time. Always someone who's having a competition they didn't tell us about so they can cheat and win lol.","score":2,"comments":[]},{"body":"Where 1 idiot goes, a second idiot is bound to follow.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Did I overreact?","not_safe_for_work":false,"locked":false,"body":"","score":62,"comments":[{"body":"Swerving into another person's lane is one of the dumbest things you can ever do.","score":37,"comments":[]},{"body":"Shit always baffles me, see this with cars too. Acting like they need semi sized turning radius smh..","score":55,"comments":[]},{"body":"Not in my opinion","score":12,"comments":[]},{"body":"you didn't overreact. If you kept your speed, you probaly would've hit them it seems like. I don't know why the hell they needed all that space out of their line to do a simple turn but that's dumb as hell, good catch on that.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"nah, it looked like they were gonna turn right or go straight, but they were actually pretending they're driving a lorry.","score":23,"comments":[]},{"body":"The truck identifies as an 18 wheeler so it must take wide turns.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nah, I think that was an appropriate response.","score":5,"comments":[]},{"body":"Better to be safe than idiots decided to go straight or right turn.  5th st exit in sf . Idiots always swing right to make a left turn.","score":4,"comments":[]},{"body":"No because why the duck you need to turn right to turn left mf ain’t in a semi with a trailer in the back or some shit","score":4,"comments":[]},{"body":"It's ridiculous where almost 75% of the population thinks the road is a Formula 1 track ONLY for THEM. I'm pretty sure I never met an instructor telling them this is the way to take a corner? If anyone did, please make sure they get fired.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Hmmm","not_safe_for_work":false,"locked":false,"body":"","score":1545,"comments":[{"body":"Here we see the asphalt in its natural habitat displaying a rare defensive move","score":382,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What the hell did she hit?","score":245,"comments":[{"body":"Looks like a square manhole cover.","score":208,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"So is the idiot the one standing at the front of the car or is it all the ones honking because that is really going to help get the car off the manhole cover...","score":203,"comments":[{"body":"Logic: \"honk, she may lift it up out of my way\"","score":67,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Time for an oil change","score":71,"comments":[]},{"body":"Anybody else notice the shadow monster sneaking up on her?","score":178,"comments":[{"body":"Naw, that looks more like tumbleweeve","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"How","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Those required maintenance alerts are getting kind of aggressive!","score":34,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Outside a Florida WalMart","not_safe_for_work":false,"locked":false,"body":"","score":51,"comments":[{"body":"Well it is Black Friday MONTH.","score":11,"comments":[]},{"body":"Really gotta hope your buddy didn't skip arm day if you're going to try this.\n\nPs  Don't try this.","score":4,"comments":[]},{"body":"That's a Walmartian pick up truck","score":2,"comments":[{"body":"Nah that’s the F-250 with the Blue Lives Matter skull","score":1,"comments":[{"body":"Uh that's the wife's ride","score":2,"comments":[]}]}]},{"body":"meanwhile- person taking picture - their car has at least 1 tire with low air pressure","score":2,"comments":[{"body":"Yeah it was a rental van.","score":2,"comments":[]}]},{"body":"Something tells me that WALMART in FLORIDA would be a very strange place.","score":4,"comments":[]},{"body":"So they put the TV on its side (shouldn’t do that), didn’t strap it down, and it’s a nissan. Really nailed the trifecta. The dumber overarching part of all of this is that you can have these things delivered in like 2 days for free if you order it online.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Most confident guy in the universe for sure","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"pizza made during delivery?","not_safe_for_work":false,"locked":false,"body":"","score":4294,"comments":[{"body":"Probably had some coals that hadn't died down completely, smoldering under the rest. Requires a real idiot to not empty the thing before transportation, though.","score":929,"comments":[{"body":"This was my thought too.\n\nWouldn't take very much to reignite when you're hitting it with 80mph winds lol","score":245,"comments":[{"body":"He was roleplaying as a train","score":93,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This is a Giorgio Ricci pizza oven being delivered new from the factory. They pre-heat it for you during the drive so you can make a pizza immediately upon delivery. They even bring ingredients if you ask. I've heard it's customary to share said pizza with with the delivery driver.  Source: I'm full of shit.","score":332,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Your pizza is delivered fresh out of the oven.","score":361,"comments":[{"body":"Freshly flying out the oven!","score":111,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Probably to do with how pizza ovens take hours to fully cool and they wanted to transport it right away. But that doesn't explain why they seemingly left stuff burning in there","score":134,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Beavis is in the house","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Chill out, Bevis.","score":342,"comments":[{"body":"Heh heh fire! Heh heh","score":76,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Yield!? Never!","not_safe_for_work":false,"locked":false,"body":"","score":36976,"comments":[{"body":"If this is where I think it is in Manhattan , this happens at least twice a day","score":2289,"comments":[{"body":"Once when this guy heads to work, and once when he returns from work?","score":1716,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That woman took that really well. Pointed at the crossing sign, then went on her way.","score":7729,"comments":[{"body":"Makes me think this wasn’t her first time getting hit by a car. Sad.","score":3855,"comments":[{"body":"She's just used to NYC drivers.","score":2303,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I was hit by two cars on a single day a couple years ago. Fucking November man. One driver simply floored it, the other got out to check if I was alright and apologized. Got a couple bruises but nothing serious.","score":158,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My own idiot in car moment. I was 17 and turning right and the sun made was in my eyes (not an excuse, just reality), and I hit this chill skater dude. It was “soft” as far as getting hit with a car can be, but guy came all the way up onto my hood. Dude just slides off and walks around and is like “bro you gotta be more careful, man” as I was apologizing profusely, then walks off.\n\nSo lucky dude was so chill and I’ve been so extra careful ever since!","score":125,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Her purse took some impact otherwise I think she would/ should have been more upset.","score":2097,"comments":[{"body":"She saw it coming and jumped to soften the impact. Good reflexes.","score":1083,"comments":[{"body":"They teach this at NYC public schools","score":527,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What could go wrong driving on the wrong side of the road during heavy mist!","not_safe_for_work":false,"locked":false,"body":"","score":351,"comments":[{"body":"Nothing went wrong  :(","score":95,"comments":[{"body":"Apparently it ok to do, good to know","score":21,"comments":[]}]},{"body":"Cam car isn’t too bright either, hanging out in the potential blast zone if that Toyota gets hit head on","score":53,"comments":[{"body":"\"Let's film it from *exactly* where the shrapnel will be\"","score":17,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"It's that really heavy mist tho?","score":30,"comments":[{"body":"Yeah not heavy at all. When you cant see the hood of your own car then it's heavy fog.","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Why are you going so slow with your hazards on? Visibility is fine. And if you're sk concerned about safety conditions on the road, why dick around on your phone?","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"what could go wrong if you drive slowly in the overtaking lane and using my phone on the highway during heavy mist","score":129,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Heavy mist?","score":9,"comments":[]},{"body":"Heavy mist? Kek.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Using shirts in doors to secure the load","not_safe_for_work":false,"locked":false,"body":"","score":80,"comments":[{"body":"They’re trying not to scratch the paint with the shirts. Who’s the actual idiot here?","score":29,"comments":[{"body":"Bingo. Roof rack grips the panel edges of the vehicle, on top of the roof and a removable clamping portion that fits on the underside of the roof just behind the top of the door. These should have a rubber backing but the owner is taking extra precautions.\n\nIt's also possible they don't want ice building up on the lock or clamping portion. But my bet is on preventing paint damage.","score":10,"comments":[]}]},{"body":"Looks like they forgot to knot it so it wouldn't pull out.","score":1,"comments":[]},{"body":"You CAN see the actual roof clips on the car. Four shirts can't hold a roof rack up that straight and high off the car. It seems to be to protect the car or something. Kind of dumb the way they did but not an example of not securing the load.","score":1,"comments":[]},{"body":"r/redneckengineering","score":-2,"comments":[]}]},{"title":"Idiot turned right from left lane","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I feel like if you caught this on camera, you could have caught this on video..","score":4,"comments":[]},{"body":"I have never seen such a good job used to black out all possible identifying factors in a picture here","score":2,"comments":[{"body":"I’m pretty sure that we can narrow it down by the statute listed on the bottom of the NO PARKING sign on the right hand side.","score":3,"comments":[]}]},{"body":"Better than turning left from the right lane, which I have already personally seen twice this month","score":1,"comments":[]},{"body":"How else would you make this turn?","score":1,"comments":[]},{"body":"If only we knew what those lines painted in the “right lane” were for…","score":1,"comments":[]},{"body":"Oh no someone correcting a mistake they made in travel direction on a completely empty road where their correction impacts no one…. noooooOoooooOooooooOooooooo","score":1,"comments":[]}]},{"title":"Nothing wrong here","not_safe_for_work":false,"locked":false,"body":"Normal trafic in Gothenburg Sweden","score":51,"comments":[{"body":"Mobile guillotine.","score":4,"comments":[]},{"body":"He's just trying to keep folks from tailgating him. It'll be fiiine  /s","score":1,"comments":[]},{"body":"Watch them right turns. How to get a free top removal for any vehicle next to this straight truck. lol","score":1,"comments":[]},{"body":"A movie is about to break out","score":1,"comments":[]},{"body":"dw it's just for downforce","score":1,"comments":[]},{"body":"Euro Kitt lives in there. Its a reverse ejecto ramp","score":1,"comments":[]},{"body":"It's great for fas mileage","score":1,"comments":[]},{"body":"Somebody's going to poke their eye out","score":1,"comments":[]},{"body":"A lead-in scene for UK TV casualty or final destination!","score":1,"comments":[]}]},{"title":"Making a Car Stack","not_safe_for_work":false,"locked":false,"body":"","score":4363,"comments":[{"body":"At least it wasn't someone's dream car... oh wait.","score":1270,"comments":[{"body":"2 dream cars","score":227,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Can confirm: Driving an SW20 MR2 is basically like driving a ramp for other cars.","score":390,"comments":[{"body":"RIP MR2 😭","score":125,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Typical BMW driver, parking on top of the red car like that... 🙄","score":519,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Poor MR2 didn't deserve that.","score":79,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The pain in his voice.","score":332,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Naturally it was a commodore.","score":177,"comments":[{"body":"The Dodge Charger of Australia.","score":110,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Stupid Commodore driver 🙄","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Long Island baby","not_safe_for_work":false,"locked":false,"body":"","score":28,"comments":[{"body":"Is that someone parked in a left turn lane?","score":2,"comments":[{"body":"No, they’re trying to leave out of the entrance to the shopping center.","score":5,"comments":[{"body":"Ah! I got it now. Thanks!","score":2,"comments":[{"body":"Np!","score":1,"comments":[]}]}]}]},{"body":"I guess if the truck gets hit owners fault than he might learn.","score":1,"comments":[]},{"body":"I bet they camp in the left lane of the expressway at 56 mph during the morning rush.","score":1,"comments":[]},{"body":"Maybe too many Long Island iced teas","score":1,"comments":[]},{"body":"my neighbor is from long island... he told me he wasnt allergic to poison ivy because he didnt know what it was...","score":1,"comments":[]},{"body":"Monster truck drivers are helpless.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How to lose your car door","not_safe_for_work":false,"locked":false,"body":"","score":1929,"comments":[{"body":"Why is someone recording another person leaving their car?","score":301,"comments":[{"body":"Great question","score":58,"comments":[{"body":"Texting each other, just saying goodbye.","score":53,"comments":[]}]},{"body":"You see the Eiffel tower in the frame. They are tourists wanting to take some video / pictures of it. \n\nThe guy was lucky he wasn't taken out himself.","score":31,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"He’s in the passenger seat, that ain’t his door","score":212,"comments":[{"body":"Might be RHD","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Had a guy swing his door open in a parking lot. After offering to trade insurance, which he declined and I have a steel bumper, I asked for video from the place but he came in saying I fixed his door that always gets jammed. Lol","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I always film people getting out of my car .... ?","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"And people say phones aren't a distraction.","score":71,"comments":[]},{"body":"![gif](giphy|pLawT3Jf5LHeU)","score":34,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"It's fine, we will guess if you're breaking on the 401 express","not_safe_for_work":false,"locked":false,"body":"","score":3861,"comments":[{"body":"401? Guy should have seen his opportunity and hopped on the 407.","score":138,"comments":[{"body":"Funny story I have a Berta plate and turns out I can drive on the 407 without paying 🤔","score":35,"comments":[{"body":"Like Baskin Robbins, the 407 billing department always finds out.","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Braking, it’s spelled braking","score":370,"comments":[{"body":"Somebody will break their car when they run into them.","score":143,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Shit… I literally didn’t understand what they meant because of the misspelling. I feel like a moron, but I thought he was trying to say “breaking down”","score":27,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"They will be breaking something, if they don't clear the snow off, so others can tell if they're braking.","score":24,"comments":[]},{"body":"[deleted]","score":256,"comments":[{"body":"This reads like some kinda haiku from another universe","score":56,"comments":[]},{"body":"Why are\n\nyour sentences spaced\n\nout like that. How'd\n\nyou even do\n\nthat","score":197,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Waste management company is usually slow, but this driver can't wait.","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[]},{"title":"Jeep Bonk!","not_safe_for_work":false,"locked":false,"body":"Totally avoidable. Last night I-25 Denver near Santa Fe I believe. I think my clock didn’t get set back for DST, so it’s an hour ahead.","score":40,"comments":[{"body":"To avoid falling asleep, skip to 25 seconds in for the, \"bonk\"...","score":13,"comments":[{"body":"I fell asleep, what did I miss?","score":3,"comments":[]}]},{"body":"Totally avoidable if they were actually paying attention.","score":4,"comments":[]},{"body":"My God was that hard to see","score":1,"comments":[]}]},{"title":"Spidey sense kicks in","not_safe_for_work":false,"locked":false,"body":"","score":2850,"comments":[{"body":"Kid probably has enough adrenaline to run up the side of a building","score":268,"comments":[]},{"body":"Love the cat-like reflexes. Lord knows I couldn't pull that off.","score":201,"comments":[{"body":"Yeah I woulda sat there and watched that car come right for me","score":86,"comments":[]},{"body":"A pen rolled off my desk the other day and I tried to catch it, missed, and threw my back out instead.","score":28,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Dude is so thankful for those karate lessons as a kid","score":293,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"r/fuckyouinparticular","score":54,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Reason #54 to learn to sit with feet on the chair seat","score":40,"comments":[]},{"body":"This should have ten thousand upvotes. This man saved his own life in milliseconds.","score":76,"comments":[]},{"body":"Dude was so lucky he was sitting like that. Had his legs been down he would have never been able to make that jump.","score":14,"comments":[]},{"body":"So the car was literally stopped then gets rear ended then it accelerated. \n\n1) Driver thought they were stepping on the brake. When they were on the accelerator \n2) Driver thought “I just got rear ended! Time to make some money”.","score":75,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Two CA idiots in LV merge from right-turn only/bike lane(red then gray car)","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"Worst drivers always have California plates","score":5,"comments":[]},{"body":"Cool","score":1,"comments":[]},{"body":"How dare those Californians inconvenience you!!! Nasty dems!","score":-3,"comments":[{"body":"So what part of California are u from?","score":1,"comments":[]}]}]},{"title":"First clip you can see light is out and there's a knocked over temporary stop sign to my right. Second clip we came back through and white sedan doesn't brake for the out light, nearly causes a wreck, and receives instant karma by ripping up his undercarriage with the sign and sandbag.","not_safe_for_work":false,"locked":false,"body":"","score":60,"comments":[{"body":"Takes a special kind of idiot to drive through an intersection with broken signals without stopping. I hope their oil pan was punctured and their engine seized a few miles down the road.","score":16,"comments":[]},{"body":"Upvote for Rust In Peace.","score":3,"comments":[]},{"body":"Upvote for Megadeth driving music","score":3,"comments":[]},{"body":"If only there was a police department nearby...","score":3,"comments":[]},{"body":"upvoting for rust in peace","score":2,"comments":[]},{"body":"Eh heh heh heh heh.","score":1,"comments":[]}]}]}