{"name":"inceltear","description":"IncelTear is a subreddit for posting screenshots of hateful, misogynist, racist, violent, and often bizarre content created by hateful “incels\" (involuntary celibates). We do not condone blanket hatred of virgins or the romantically unsuccessful. Blackpilled incels blame women, their genes, attractive men, and society at large for their inability to get dates or sex. Occasional meta discussion is also welcome. This is not a sub about k!lling incels","subscribers":114346,"posts":[{"title":"Weekly Advice Thread (November 28, 2022)","not_safe_for_work":false,"locked":false,"body":"There's  no strict limit over what types of advice can be sought; it can pertain  to general anxiety over virginity, specific romantic situations, or  concern that you're drifting toward misogynistic/\"blackpill\" lines of thought. Please go to [r/SuicideWatch](https://www.reddit.com/r/SuicideWatch/)  for matters pertaining to suicidal ideation, as we simply can't  guarantee that the people here will have sufficient resources to tackle  such issues.\n\nAs for rules  pertaining to the advice givers: all of the sub-wide rules are still in  place, but these posts will also place emphasis on avoiding what is  often deemed \"normie platitudes.\" Essentially, it's something of a  nebulous categorization that will ultimately come down to mod  discretion, but it should be easy to understand. Simply put, aim for  specific and personalized advice. Don't say \"take a shower\" unless  someone literally says that they don't shower. Ask \"what kind of  exercise do you do?\" instead of just saying \"Go to the gym, bro!\"\n\nFurthermore,  top-level responses should only be from people seeking advice. Don't  just post what you think romantically unsuccessful people, in general,  should do. Again, we're going for specific and personalized advice.\n\nThese  threads are not a substitute for professional help. Other's insights  may be helpful, but keep in mind that they are not a licensed therapist  and do not actually know you. Posts containing obvious trolling or  harmful advice will be removed. Use your own discretion for everything  else.\n\nPlease message the moderators with any questions or concerns.","score":0,"comments":[]},{"title":"-sigh-","not_safe_for_work":false,"locked":false,"body":"Hello everyone. It came to attention recently that our own mod was/is grooming young girls. He has been removed and banned from this sub permanently. As a victim of grooming myself I will not let this stand. If you or someone you suspect is being groomed call CPS in your area and tell a trusted adult. Please do not fall for the flattery or talks these predators do.","score":714,"comments":[{"body":"What the actual fuck. Dooling, if you’re lurking here. Fuck you man. You hypocritical sack of shit.","score":334,"comments":[{"body":"The fact that they were spot on, but they were also ignored is crazy. But Dooling, I’m smoking your pack, stupid ass bitch","score":49,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This is seriously shocking. \nI'm glad he's gone and I hope there aren't any more victims.\nI hope people are safe.\n\n\nI'm glad that this announcement was made in public. Respect for that. Though I hope that the mods of this sub get  more of a vetting, considering the nature of IT.\n\n\nQuestion: What are the mods planning on doing from now on? It's clear that this went on for far too long, despite numerous complaints against said mod. Any plans on how to handle cases like this in the future?","score":172,"comments":[{"body":"Currently I am the only mod. There are other accounts but they aren't active any more and I'm unable to remove them. I want to bring more veteran mods into this subreddit but seeing at the toxicity that we cover can make any loose any sense of happiness. This wasn't brought to my attention until recently which makes me angry because I'm assuming this was brought up to the other accounts that just aren't used any more. I'll definitely have to get more involved here to make sure nothing like this happens again.","score":119,"comments":[{"body":"Try reaching out to r/modSupport if the other mods are  inactive. They may consider removing them but you will need to recruit more mods","score":38,"comments":[{"body":"I'm trying too but now I'm very nervous. I was never a mod before and definitely not for a sub of this size.","score":35,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I hope you'll find some re-inforcements soon! Thank you for the effort you're putting into it, and acting on the accusation quick and good, considering the circumstances. You are much appreciated.","score":29,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"😕\n\nWhat I think about people who groom kids probably can't be posted here.","score":51,"comments":[{"body":"I can't say either but know that I understand your disgust.","score":38,"comments":[]}]},{"body":"About time you got rid of him, he is seriously creepy.","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How incels see the world","not_safe_for_work":false,"locked":false,"body":"","score":498,"comments":[{"body":"By definition a cuckhold needs a partner and a third.\n\nImpressive, they manage to be inaccurate in an already inaccurate meme 🤦🏻‍♀️\n\nEdit : also.\n\nNo MGTOW? The two women unlinked are WGTOW?\nThe gay dude isn't linked to another dude? And what about the feminist dude? And why the transsexual one is there alone?\n\nSorry kid, it's a no for me. Do it again and this time put some effort in it","score":141,"comments":[{"body":"They’re also assuming that none of those groups existed before the sexual revolution. It appears that a lot of their ideas are just good examples of the Dunning Kruger effect.","score":63,"comments":[{"body":"Are you telling me that Achilles and Patroclus weren't just roommates?\n\nOh no,my childhood! MY CHILDHOOD!","score":31,"comments":[{"body":"Apparently a lot of the ancient world didn’t happen. That’s why it’s specifically mentioned in the Bible, because it wasn’t happening.","score":18,"comments":[]}]},{"body":"They're*also* also assuming that trans women transition cuz we can't get any, forgetting the (to them, inconceivable) fact that many of us positively SLAYED when presenting male.  We don't transition because we \"can't get any,\" we transition because no amount of sex will actually quiet the genderfeels.\n\nA lesson I feel they all sorely need to learn.","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Incels have been overusing the word \"cuck\" for so long now that they've basically beaten the actual meaning out of the word.\n\nTo them it now just means \"person or thing I do not like\". Incels love to misuse language.","score":20,"comments":[]}]},{"body":"They are also saying in the one on the right they don't get females","score":23,"comments":[]},{"body":"Maybe the \"sexual revolution\" they speak of (more like the rise of male sexual entitlement in the internet age) has left a big portion of men unfit for a relationship entirely?\n\nSuicidal, homicidal, incel, and homosexual (wtf?) all SHOULDN'T be dating a woman. Add a few stick figures who have porn addictions and ED before age 20, are deadbeat fathers by 25, anddd yeah the graph kinda makes sense to me?\n\nNotice how even in this incel-made meme, it's assumed that all of the women are still fine and normal before and after, only the men turned into murderers and incels? Lmao","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Well I'm sure the homosexual man is grateful that women are leaving him alone so he has a chance to find his man","score":40,"comments":[{"body":"No you see, men turn homosexual because no women wants to date them. I'm not even sure how they come up with stuff like that, it's like incels reason like everything men ever do is to get laid, assuming other men are as pathetic as themselves.","score":17,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Dude, you created an account three days ago... Step away from the cult!","not_safe_for_work":false,"locked":false,"body":"","score":327,"comments":[{"body":"Safe bet that isn’t their first account on there.\n\nHelp them? What they need is professional mental health treatment, not sex.","score":97,"comments":[{"body":"I guarantee that if they actually got sex, they'd wake up the next morning and feel equally miserable. Possibly more so, because of the crippling realization that all their problems still exist and it wasn't the lack of sex. \n\nI genuinely hope these people find their way to therapy to learn healthy behaviours. For that to happen, though, they'd need to realize the problem first.","score":14,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"As a woman, I'm not here to help at all. I'm here to learn as much as I can about those who wish me harm. I'm here to learn to identify and avoid any and all incels like the plague they are.","score":43,"comments":[{"body":"&gt;As a woman, I'm not here to help at all.\n\nWhy do they misunderstand this?","score":17,"comments":[]}]},{"body":"These guys bring up \"muh genes\" a lot as if they really do want to \"breed\", they're the type to smash and dash, they want to fuck but they wouldn't ever want to be fathers","score":110,"comments":[{"body":"Probably the type of fathers and trad husbands expecting the women to take care of the house, children and have a fulltime job while they sit around all day doing nothing because doing anything for your partner/family is cucked.","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"We know, as women, that we would never, ever, ever want to be with a man who buys into incel ideology, extremist misogyny, and self-pity. By encouraging you to leave incel circles, drop extremist rhetoric, and go experience life without obsessing over women and sex, we are literally giving you the best possible help we could give to an internet stranger in your position. You're not going to land anyone in IT, especially as someone who identifies with the very rhetoric that we are watchdogging. \n\nBUT there is hope for you if you change your outlook and leave the online communities that keep you angry and hateful toward women. \n\nHope that helps. :)","score":24,"comments":[]},{"body":"Bruh im sorry but i dont feel like i wanna help yo sorry ass","score":21,"comments":[]},{"body":"Yeah no what they need is therapy not women","score":15,"comments":[]},{"body":"I tried to offer a pity date but they keep saying \"i'm not gay! I'm not gay!\"\n\n\nDude,you can't be sure until you try U____U","score":74,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Incel doesn't understand sex","not_safe_for_work":false,"locked":false,"body":"","score":59,"comments":[{"body":"I mean... I totally understand his feelings about this. If you aren't the most agreeable person and have a hard time making authentic, meaningful connections, it does seem mind boggling. And I also remember feeling like I could never, because I was deeply defective in a way I couldn't even understand myself.\n\nI would feel bad mocking him on grounds of this statement (though \"FemoidsGTFO\" suggests that he has a lot more vile stuff going on).","score":43,"comments":[{"body":"Exactly.  His statement is fine.  What he, like so many others, doesn’t understand that the type of personality that uses such terms is very unlikely to attract a woman or form the type of relationship he is discussing.  “hedonistic, degenerate please” doesn’t speak well for him either.","score":13,"comments":[]},{"body":"I married later in life, think 40s. Gay men which also means that I have less of a pool to choose from. Or to be chosen from. That having been said, relationships are just hard. Love is work. It worries me that so many younger folks seem to think that it should just happen with a snap of a finger. It has never ever worked like that, except for forcible situations, which is obviously why there's so much rape fantasy going on in this community, but even that ends badly. The woman you rape is somebody's sister, or mother, or friend, and they will come after you. Ditto if you do it to a guy. Very few people exist in a vacuum. More often than not what you do to one, others will take offense. This is also basic human nature.\n\nI won't lie. There was a time where I figured I might be unpartnered for the rest of my life. Not necessarily without physical companionship, but not with a partner. And that was okay. I don't need somebody else to validate me. I don't need somebody else to tell me my worth. I know it. I've known it for years. I'm a good cook. I'm a musician with many instruments tucked into my hat. I'm a good conversationalist and a good listener, and usually can give some good advice if it's wanted. And there's more, but I did all of that without anybody else in my life. And I firmly maintain that there are a lot of people who come on here feeling hopeless who have just as much skill, talent and agreeability, but they won't let themselves see it.","score":13,"comments":[]}]},{"body":"To be honest, as a woman struggling to find a relationship I often feel the same way. I think it's not uncommon.","score":20,"comments":[]},{"body":"This is really sad :( I used to fantasize about finding true love and I had given up by the time I found it. Passionate love sex is better than I ever imagined. Most days whoever wakes up first just stares at the other person and thinks about how beautiful they look while sleeping, and then we end up having sex. I wish everyone finds what I have found, but I know it’s pretty rare, sadly. I think there is someone out there for everyone but dating is HARD even when you have options- some people are *good* but they’re not right for you and you just can’t put your finger on why. It’s exhausting to try to find the right one. Oddly I only found him once I had given up.","score":15,"comments":[]},{"body":"I blame shitty movies and books for inventing the love at first sight/magical teenage sweethearts/etc myths. It's always portrayed as magical, life changing, destiny, blah blah blah...but to form a true emotional connection is hard work. \n\nHow can you love someone you dont even know? You can't...that's just infatuation with a picture you have of somebody in your own mind. \n\nTrue love and attachment is a long process and needs constant maintenance like any important relationship in your life. It's not impossible...just not effortless and magical. \n\nA hard and bitter lesson I learned: first you need to reflect on your own personality and love yourself, before you can make room in your life and heart for another person. Sex and love don't fix you...you need to fix yourself to be able to form a real connection and not just a co-dependency.","score":10,"comments":[]},{"body":"Honestly? I... kinda feel this one","score":5,"comments":[]},{"body":"Of course the incel doesn't understand love, because he is totally incapable of feeling love.","score":5,"comments":[]},{"body":"It’s a recurring them with incels that they don’t even have any friends, never mind relationships. Which strongly suggests that they have difficulty forming any kind of connection with people. Possibly linked to them spending so much time online during their childhoods, so they’re basically recluses.","score":3,"comments":[]},{"body":"pay an escort and find out, you can also search for tutorials on youtube, i don't know dude\n\nseriously now, it doesn't have to make sense, it just happens, there's no walkthrough on gamefaqs or guide on youtube\n\ni don't know how to explain it beyond that, for me it just happens","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Confused “nice guy” tries hitting on the wrong person (not me)","not_safe_for_work":false,"locked":false,"body":"","score":37,"comments":[{"body":"THIS WAS AMAZING. Not to mention, I've never once actually heard a woman request a nice guy. Kind? Yeah. But we all know what a nice guy is and none of us want it.","score":17,"comments":[{"body":"The thing that they don’t understand is that “nice” isn’t a title that they give to themselves. It’s something that is earned, like “kind”. Then there’s the fact that their behaviour consistently proves that they’re not nice at all. Just an act, until they don’t get what they want.","score":10,"comments":[]}]},{"body":"\"You bitches ask for a nice guy...\"\n\nJust no self-awareness there at all.","score":14,"comments":[{"body":"Pretty much the norm for the ones who describe themselves as “nice guys”. They can’t help themselves. It’s like a compulsion to prove that they’re actually anything but nice.","score":9,"comments":[]}]}]},{"title":"Incel steps up to defend inceldom. Starts focusing on how incels can't be pedophiles.","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"Dear dude who's DMing u/lavendarandorange,   \n\n\nYou can't unring that bell.  Your community has claimed the term \"incel\" for their own and then took it to the depths of hell and back again.  \n\n\nThose of us in IT use it in that vein.  That is, re: those people in the dot is type communities.  \n\n\nIt has, as the saying goes, passed into the common vernacular as meaning the extreme radical sorts of incels nowadays.  Thanks to your heroes such as \"locked door.\"  If all of you innocent dateless/virgin types want it back?  Stop belonging to and supporting the types of incel groups you do.    \n\n\nStart speaking out against those who misspeak on your parts.   Start calling them out on the pedophilia and woman-hating.","score":15,"comments":[]},{"body":"Wow! Hiding behind 16 year olds to defend pedophiles? Stay classy, Skippy.","score":11,"comments":[]},{"body":"Never surprises me how people can defend such disgusting and disturbing behavior. \n\nI get a few in my DM's too - from the same culprits. I haven't responded and you'd think they'd learn that they are wasting their time by now.","score":7,"comments":[]},{"body":"If you step in shit, you smell like shit. If you do not speak up against rape apologists, paedophiles and people advocating for enslavement, violence and murder towards women, you will be judged by their behaviour. \n\nNot all virgins are incels. You don't need to embrace their toxic crap just because you don't have sex. Also incels below 18yo should be non-existent to begin with...the average around here for first sexual experiences is 18yo and not 12. \n\nI don't know why 16yo would panic and hate their life because sex hasn't happened...that's totally bonkers. Life isn't over by 17 and there's plenty of people not starting to have sex before being adults.","score":8,"comments":[]},{"body":"There's no need to cover the name, same avatar and same opener.\n\nHe probably messaged at least half of the sub at this point 😂","score":6,"comments":[{"body":"Right? I never understood the cover ups. The only rule is not to share identifiable information, but it's not his real name or social security number or anything lol","score":5,"comments":[{"body":"It could be that if there used to subs like r/nice guys or  r/creepy pms both subs that would even ban you for non censorship (I have no issue with either sub and am in both I just know that being it them kinda ingrains censorship","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I'm sure this is the guy who sent me a message also. A few messages of questioning his logic, he disappeared lol\n\nHe said \"a lot of women think male virgins are strange\". Asked him how many women irl he asked. The answer? 2.","score":5,"comments":[]},{"body":"My favorite analogy for this is, if your in a room with 6 incels, 4 are rape all the bad things about inceldom rape muder pedophila all that crap they promote, but there’s one in there “who isn’t so bad bc there not like that” even tho one of those incels isn’t bad im still leaving that room\n\nI have no issues with lonely people or virgins, I have issues with incels and there agenda\n\nIt’s simple if you don’t wanna be associated with the atrocities of that incel forum, call yourself celibate or a virgin, I have no issue with a well meaning non harmful virgin who just hadn’t gotten there yet, hell I know a lot of chill virgins, but you know what I don’t know a lot of, chill incels","score":4,"comments":[]},{"body":"If he doesn't, he's not incel. Incels don't even know the definition of incel.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"\"Why don't women like us? I've only considered kidnapping a child\"","not_safe_for_work":false,"locked":false,"body":"","score":108,"comments":[{"body":"Yet another post from these asshats confirming that despite what they say about wanting a loving relationship and being desired - they really just want to get their dick wet at the expense of someone else.","score":49,"comments":[]},{"body":"FBI, are you seeing this shit???","score":44,"comments":[{"body":"why is this piece of shit not in jail and psychiatric treatment???\nthis is the fucking freedom of speech people defend: you are free to encourage rape, kidnapping and pedophilia online while idealizing what you would do to the victim in the most disgusting way. ItS jUsT wORdS bRUH","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Remember when they keep claiming to be innocent virgin men, and we are bullying them?","score":25,"comments":[]},{"body":"Inb4 that loli stabs him to death","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"they are nonces that need to rot in jail","score":13,"comments":[]},{"body":"Sure, Incel is just following his biology. \n\nAnd when her angry relatives do things that would probably get me banned for mentioning them, to you when they get her back, aren't *they* just following their biology.","score":11,"comments":[]},{"body":"That's the first time I've seen one of them use \"In Terraria.\"","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Wtf, someone call the cops.","score":10,"comments":[]},{"body":"I hope these asshats are on a list","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I honestly don't know what to say to this...","not_safe_for_work":false,"locked":false,"body":"","score":112,"comments":[{"body":"They could choose anywhere on the planet for their little fantasy land, and they choose somewhere bordering the Baltic Sea. Not sure that their army will be up to defending them, when it only exists in Call of Duty.","score":49,"comments":[{"body":"It's a tiny, displaced piece of Russia, cut off from mother Russia when the Baltic states (Latvia, Lithuania and Estonia) separated from Russia after the failed coup in late 1991. I think they think Russia would be a welcoming place for them.","score":26,"comments":[{"body":"Presumably because Russia is as bigoted as they are. Of course, incels couldn’t organise a piss up in a brewery, never mind a country.","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Super creative with the generic eagle type flag. Wonder who they're copying 🤔","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Awww, how adorable, they are LARPing. And now they have a flag to hang outside their super secret treehouse next to the \"No girls allowed\" sign  \n\n\nSeriously, my dudes have apparently never grown older than 8. Mentally","score":46,"comments":[{"body":"Little Rascals did it first right? The incels can start their he-man woman haters club! Now we know the blueprint they're following!","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Okay, even if they managed to do this…. What’s the plan after? They hate women and I doubt many would willingly go to that country, they hate Immigrants, so they have no migrants, They hate working, so no workforce/exports, currency is either Nft’s  or something less stable than euro, plus a bunch of problematic neighbors, who’ll have no issue declaring war on people who’s veterans are probably COD:MW3 players! THE REPUBLIC OF TEXAS probably lasts longer than their country ever would.","score":11,"comments":[]},{"body":"Just go ahead and annex parts of Russia, Poland and Lithuania. What could possibly go wrong?","score":5,"comments":[]},{"body":"Today in stupid ideas: What happens if you declare war on NATO and Russia at the same time?","score":9,"comments":[]},{"body":"If that's what they call a pride flag, then I can't blame them for being demoralized all the time.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"They aren't even trying anymore...","not_safe_for_work":false,"locked":false,"body":"","score":283,"comments":[{"body":"It feels like the Elliot Rodger they worship and the Elliot Rodger who actually existed are two different people.","score":38,"comments":[{"body":"Wait, you mean Incels created someone in their collective mind that was based on fantasy and not reality? I'm shocked. Shocked! Well, not that shocked","score":21,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"hey incels, when you're using the guy's name, you don't have to try to low key reference him by capitalizing the E and R. idiots.","score":22,"comments":[]},{"body":"I've got news for you, incels: pretending to be an idiot just makes you an idiot. All you're accomplishing with your \"trolling\" is further cementing the opinion that you're desperate for attention and not very bright.","score":5,"comments":[]},{"body":"All edge and no point. Jotted down for use. Thanks.","score":12,"comments":[{"body":"Just like a pizza cutter","score":10,"comments":[]}]},{"body":"Who is Elliot Rodger?","score":3,"comments":[{"body":"Some incel that went on a rampage and killed people because he couldn't get laid. He left a 100 page manifesto detailing how much of a pathetic failure he is despite having wealthy parents. Somehow, incels admire him and it's baffling to understand why.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Pizza cutter","score":3,"comments":[]},{"body":"Imagine being such a low-life, that you have to troll people with door guys pictures just for a crumb of attention...","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"That's enough Internet for one evening","not_safe_for_work":false,"locked":false,"body":"","score":994,"comments":[{"body":"At least one of their own called them out","score":514,"comments":[{"body":"It must suck ass to know you're too much of an incel for incels.","score":218,"comments":[]},{"body":"I really wanna see their faces when they realise we have a name for \"kick a pregnant woman in the belly\" \n\nIt's called GBH - Manslaughter\n\n(In my country ABH or GBH is always first, followed by type of ABH/GBH, like GBH - Murder)","score":60,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"[removed]","score":282,"comments":[{"body":"It's not like they need them anyway, right?","score":126,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Wonder how they would feel about National \"kick an incel in the junk\" day.","score":193,"comments":[{"body":"They'd celebrate it, they'd all be on the forums later boasting how a Stacey teir foid roshambo'd them in public.","score":116,"comments":[{"body":"After I hit post I immediately thought they'd just take it as someone touching their dick.","score":61,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Hi, im a little drunk right now, but kicking pregnant women is never ok, never. You know I grew up with a narcissistic mother and sister who used to gang up on me and abuse me, but never did I ever think it was ok to hit a woman, especially one who is pregnant. \n\nIm 28 and I dont understand wtf is wrong with these kids, kick pregnant women is not ok and fucked up beyond anything.","score":112,"comments":[{"body":"Kicking _people_ is not okay. Similarly, these guys shouldn't be upset that it's not socially acceptable to hit a woman (or hit her back), they should want it to be socially unacceptable for anyone to hit anyone. \n\n\nBut yes, it's especially uncool to do something likely to cause a miscarriage. It's revolting.","score":78,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"New member spells it out perfectly for them. .is: INFILTRATOR! REEEEEEEEEEE!!!!!","not_safe_for_work":false,"locked":false,"body":"","score":66,"comments":[{"body":"This is why they are so extremist and radicalized, anybody who offers even a moderate viewpoint gets othered and screeeeeeeeamed down.\n\nThey're not worth trying to help at this point.","score":41,"comments":[{"body":"I'm 96% to giving up on ever helping any of them. Thing is, someone has to choose to go to their site, see the kinds of posts people make, think \"well this is a fine group of young men,\" and participate in the cesspool. I'm sure some people can change but... means we have to wade through sewage to help the rare fool who dived in without thinking.","score":3,"comments":[]}]},{"body":"That last guy sums up a lot of their mindset. When it does affect them, then they don’t care. Which is why they’re so dismissive of the negative impact that rape has on women.","score":6,"comments":[]},{"body":"Societies create laws, legal systems and punishments expressly for those few with so few morals that the only thing that keeps them from harming others is the threat of punishment. The vast majority of people don't actually need that codified for them.","score":19,"comments":[{"body":"Exactly. I don't need a law telling me not to murder innocent people. It's not about the fear of getting caught, it's basic human fucking empathy.","score":4,"comments":[]},{"body":"Truth. I have murdered all the people I ever wanted to murder, and stolen all the things I wanted to steal.  At this point, the totals are: 0 murders, 0 thefts.","score":9,"comments":[{"body":"I mean, I occasionally get the desire to just stuff something in my pocket and keep going.  It's the same little voice that suggests jumping from high places. \n\nI ignore it, because that little voice is insane.","score":7,"comments":[]}]}]},{"body":"This guy claims that the woman is her husband's PROPERTY and still ends up getting attacked for being too moderate. I don't know what to say at this point...","score":2,"comments":[]},{"body":"Jesus fucking Christ","score":2,"comments":[]}]},{"title":"His technique could do with some work. Including not being an entitled stalker. No surprise that she didn’t respond.","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"It's almost like he has multiple personalities.","score":8,"comments":[{"body":"None of them good.\n\nI guess it always goes to show that the “nice guy” is just an act. The second that they don’t get what they want, then they show their true colours. It’s pretty much a cliche at this point.","score":4,"comments":[]},{"body":"And switches between them on a dime. \"Im in love with you... Show me ur tits whore!\"","score":2,"comments":[]}]},{"body":"Defective garbage","score":4,"comments":[]}]},{"title":"I think they're upset...","not_safe_for_work":false,"locked":false,"body":"","score":50,"comments":[{"body":"I hope they're on a list somewhere (in Roblox)","score":11,"comments":[{"body":"It is a shame what Roblox has turned into.","score":6,"comments":[]}]},{"body":"He is talking like he is in a fight in the 3rd grade","score":9,"comments":[]},{"body":"Funny how they criticise women for being too emotional, then behave like this. Little man needs big therapy.\n\nThe fact that he doesn’t even have friends is nothing to do with his looks. It’s his personality and attitude. Maybe he should consider that women aren’t interested in him for the same reasons.","score":17,"comments":[]},{"body":"I hate the heartless part that’s deep inside me and try to keep it in check.  I really don’t like to see people suffer.  Yet these guys try my patience. Yah, go ahead and suffer if it hurts so bad to see normies.  Normies aren’t an act or a pill.  They’re normal; that’s all.  Normal people, living a normal life, doing normal things.  And yes, the only reason you’re not enjoying the simple pleasure of being in a relationship is because you’re a dick.  \r  \n\n\nWe’ve all been single.  We’ve all been lonely, and we’ve all been hurt.  The big difference is how we delt with it.","score":7,"comments":[]},{"body":"How dare those normies live their lives.","score":3,"comments":[]},{"body":"Hmm, why the big anger? What secret are you hiding? Tell us about your past.","score":3,"comments":[{"body":"That's what I always wonder- what happened to you that made you decide this was the best way to live your life?","score":3,"comments":[{"body":"I know an incel in person.\n\nIt is a gradual process, but when it gains momentum it does not stop on its own. Like a billiard ball on a plane with a very slight inclination.","score":2,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"So a guy did bad things, he couldn't get laid, and now I'm supposed to feel bad for him?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Just to be clear...German prisons or generally prisons in most of Europe don't feature open cells with bars like shown in the background of this shot. \n\nPrison should be there for reform and I'm absolutely for prisoners having access to at least some walls for privacy and normal clothes and a small tv. It's usually not luxurious but you mostly get at least a normal bed, a chair and table and maybe a small shelf or cabinet for a bit of storage. Depending on the type of prison and if it houses youths or adults, there are job programs to earn a bit of money or doing jobs around the prison that can be used to buy extras like cigarettes, sweets, energy drinks, etc in the prison store. \n\nIf you house people like animals in kennels, they will behave like animals. Ofc there will always be cases that are too far gone, but with the right therapy and assistance you can reform and build a new life and find a partner. I think most people would rather build a normal life with a family than being a drug dealer if there are other options available.","score":1,"comments":[]},{"body":"&gt;\"hurt people\"\n\nWhat's with the quotes? Don't do the crime if you can't do the time.","score":1,"comments":[]}]},{"title":"Well this is even a new level for them.","not_safe_for_work":false,"locked":false,"body":"","score":28,"comments":[{"body":"much more than incels, yes","score":12,"comments":[]},{"body":"Okay. What movie is this from? That character looks familiar.","score":5,"comments":[{"body":"She is actually from a music video. Melanie Martinez - Class Fight, K12 album.","score":6,"comments":[]}]},{"body":"What the hell?","score":5,"comments":[]}]},{"title":"TW: A woman went undercover in a Incel-forum","not_safe_for_work":false,"locked":false,"body":"","score":27,"comments":[{"body":"It's nice that incel forums are getting more attention from the media and other subreddits. It's always concerning how appealing rhetoric that shows up in sites like .is on a daily basis flies under the radar of so many people.","score":10,"comments":[]},{"body":"While it’s good that they’re trying to increase awareness of how toxic those forums are, but it’s probably also going to help attract more of them to the forums.","score":6,"comments":[]},{"body":"I want to read it, but I don't want to pay for the subscription 😐","score":2,"comments":[{"body":"It's medium you don't have to pay to read it","score":3,"comments":[{"body":"It didn't let me is what I'm saying. It showed the first 3 sentences and wouldn't let me continue without upgrading. Please don't call me a liar when you didn't see it.","score":-2,"comments":[{"body":"I didn't call you a liar and if you want I can send you screenshots of the article because that hasn't happened to me I was able to read it","score":1,"comments":[{"body":"I'm going to take a pass on your assistance.","score":-1,"comments":[{"body":"Okay","score":0,"comments":[]}]}]}]}]}]}]},{"title":"Racist in Montreal intimidate indian and french women","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"How scary!  😰 I hope she is able to leave that neighborhood","score":2,"comments":[]}]},{"title":"Ever notice how incels who supposedly went to therapy say that it didn’t work?","not_safe_for_work":false,"locked":false,"body":"I think I know why: you have to admit that there are parts of you that can be improved and fixed for therapy to work. They keep calling themselves subhumans and total pieces of garbage, things that can never be improved. Of course they’d turn down advice that actually would change that because they believe it can’t be changed.\n\nThat and instant gratification. It seems like incels can’t actually wait for stuff. It has to happen right now, and it can’t be a long-term thing. Disregarding that therapy usually is meant to be a long-term thing with steady improvement over time.","score":3,"comments":[{"body":"It's because of how they define \"works\" and how they think \"works\" should...well...work.  \n\n\nIf they can't get a chick the very nano-second after walking out of their first therapy session then, to them, it didn't \"work.\"  \n\n\n\"Works\" to them, means instant sex/girlfriend.","score":6,"comments":[]},{"body":"When I was a youth therapist I’d have a lot of people say “nothing ever works for me” and it would always be an interesting conversation to ask what “working” would look like\n\nSometimes people had no idea. Some people had something but as soon as they said it they realised it was unrealistic (“I want to feel happy and never feel upset ever again”). And often people expected therapy to be a fix, rather than giving a person the tools they need to fix their lives themselves","score":4,"comments":[]},{"body":"There's also the part that often gets skipped over when it comes to the effectiveness of therapy: finding a therapist you can connect with. The unfortunate thing is that sometimes you get a therapist and they just aren't \"right\" for you. Forces you to shop around which can be discouraging. \n\nObviously its worth the effort but since incels already think that everything should just be handed to them, few are likely to make that effort.","score":3,"comments":[]},{"body":"Therapy is work. They'll never put in effort for anything. That's what's wrong with them.","score":2,"comments":[]},{"body":"Therapy can only go so far. It's not a by all end all, it's a tool to help make life manageable. They want their lives to feel difficult.","score":1,"comments":[]},{"body":"Therapy is an opportunity to have someone with expertise help you develop the tools to help manage your mental state.\n\nIt's entirely on the person to then make use of those tools and continue to use them in the real world outside of the therapy session. I think that the issue for incels is that therapy \"working\" means that they walk out of the therapist's office and have an immediate girlfriend. They're not willing to accept that \"working\" is that over a period of time utilising the skill set that they have learned in therapy will lead to them feeling more content with themselves and more comfortable in their own skin without the need to validate their existence through the lens of a romantic relationship. Which *might* lead to them having the ability to form a successful romantic relationship, but this should be a bonus, not the goal.","score":1,"comments":[]},{"body":"THey may believe that Therapy hands them results within the first 5 sessions. Or/and they may believe that if it doesn't work with one therapist, it won't work with another, ever.\n\n\nI believe what Incels don't understand is that Therapy can totally fail if they don't have a good rapport with the therapist, i.e. can't open up, don't feel supported, do not feel like they can trust the therapist etc. and that they should absolutely stop therapy with THAT therapist and look for another. It's very common to shop around for a good therapist if the current one doesn't work for any reason\n\n\nAnd yeah, there is the expectation that therapy will get them laid. They don't understand, or do not WANT to understand that therapy is meant to help them to accept themselves, improve themselves and live happier, better lives (where they might eventually get laid, as opposed to never if they continue without therapy.) You know, because some of them are convinced that they are victims of the evil feminists who want them dead.","score":1,"comments":[]}]},{"title":"And those are immoral too, just like you.","not_safe_for_work":false,"locked":false,"body":"","score":16,"comments":[{"body":"5th one was crazy","score":5,"comments":[]},{"body":"Seems like the “fuck your feelings” crowd is in their feelings.\n\nEdit: also wtf that last one came out of nowhere","score":1,"comments":[]}]},{"title":"✨Incel Biology✨","not_safe_for_work":false,"locked":false,"body":"","score":272,"comments":[{"body":"This was painful to read.","score":101,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That also belongs in r/badwomensanatomy 🤪","score":91,"comments":[]},{"body":"As someone who has given birth, let me tell you those muscles are not “way delicate” 🥴🤣","score":66,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Gotta find a way to keep the sand out, ladies!","score":58,"comments":[{"body":"gotta have that cork handy!","score":29,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I think I had a brain aneurysm reading this","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I’m still stuck on the part where he said “female friend” they have friends? Let alone women friends???","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I don't know why I read this stuff before going to sleep, it always riles me up with the absolute insanity and contradiction of all these absolute idiots","score":12,"comments":[]},{"body":"They think their penis “tears pussy muscles” 🤣🤣🤣","score":12,"comments":[]},{"body":"\"But wouldn't loose pussies be best evolutionary wise? Well...yes, if your goal is to give birth to child's 24/7 and **lives in a place without much debris\"**\n\nI am absolutely crying over here. I cannot wait to find out what name incels come up for a vagina that is filled with debris.\n\n:Edit:\n\nEveryone who didn't, go back and re-read. Its fucking magical =D","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Yeah no, it won't. ANd there is no such thing as \"incel genes\"","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"🎶Billy Gene is not my Gene.🎶","score":9,"comments":[]},{"body":"All these guys have to do is to go outside a little frequently. They'll see soooo many men shorter than 6ft having sex and making babies. \n\nNo you're not going to be extinct because who defines being \"born with incel genes\"?\n\nThere are many many short men who said \"I will not let something as petty as my height determine my self esteem, confidence and my life\", then went ahead meeting women and having sex with them. They make babies and spread those \"subhuman\" genes lmao.\n\nOh no! then maybe his son might wind up having the same height then crying on .IS about being born with \"subhuman genetics\" again. Ignoring the logic about how his dad got laid...Dear lord 🤦‍♂️🤦‍♂️🤦‍♂️.","score":10,"comments":[]},{"body":"BTW, the second dude is the reason why I'll teach my nephew how to use a knife.","score":8,"comments":[]},{"body":"They ignore the fact that there are plenty of short and/or unattractive men out there getting laid. Their post is just their victim complex. It’s pathetic how they’re always whining about being the victims of an unjust society, when many of them barely leave their bedrooms.","score":9,"comments":[]},{"body":"Seriously, where do they think they came from?  And they can’t blame some recent change in society.  Only old farts like me remember the patriarchy of the early 20th century that they idolize.","score":3,"comments":[]},{"body":"“Incel genes will be wiped out soon”\n\n😁😁😁","score":2,"comments":[]}]},{"title":"incels rule the universe","not_safe_for_work":false,"locked":false,"body":"","score":20,"comments":[{"body":"The thing is, there's a good streak of truth running through the crazy here.   \n\n\nGod (at least my God) is a proponent of free will.  So he's not restricting anyone from anything.  However, the \"go concentrate on creating a life that's worth living\" part of this is right on the money.\n\nThe problem is, Nice Guys and incels create the framework of that life (and only the framework) without actually living it and believing in it.\n\nThen they get all mad and frustrated: \"but....but...but, I did all the things!!!  I got all the stuff!!!  Just like everyone told me to, now where are the chicks?\"\n\nIf you \"did all the things\" and \"got all the stuff\" with the express and sole purpose of trading it all in for a chick, you did it wrong.\n\nSince you guys (dear lurkers) **INSIST** upon dealing with this in an \"insert action=get achievement unlocked\" way...let me put it like this.\n\nDoing all the things and getting all the stuff is not supposed to result in getting the chick.  There's another step before that.   This is a multiple step achievement.  You're missing a step.  The step you're missing is that doing all the things is supposed to, ***IN AND OF ITSELF***, create pride, contentment, happiness, belief in oneself, etc. and so on.\n\nOnce you've started living that life and believing in it, without the expectation that it will buy you anything, THAT is when you've unlocked that part of the achievement and not before.\n\nIf you try to use \"getting all the things\" as a coin to insert to the relationship vending machine it will not work.  It will never work.  \n\nWhen a person is ALREADY a happy, whole, and fulfilled human being, they attract like people.  As long as you seek another to complete you, you will fail.  No normal adult human wants to try to fill a black hole of need from another human.  Like attracts like.","score":6,"comments":[]},{"body":"Whatever helps you sleep at night boy","score":5,"comments":[]},{"body":"I'm sure he was called a lot of bad things by the other incels. They hate everyone except other black pilled incels.","score":3,"comments":[]},{"body":"Interesting. This rhetoric is similar in nature to semen retention and nofap communities. Now I wonder if the self-loathing that incels feed on make them perfect targets for fringe groups who target men with low self esteem. If so, it would be another reason to keep an eye on them.","score":3,"comments":[]},{"body":"Religious nutcase and incel not a good combo","score":3,"comments":[]},{"body":"God isn't doing shit. It's you. Listen, I pretty much count as the \"virgin trad wife\" they dream about. I know other women like me. They do not want men who obsessed over sex. It doesn't matter if your a virgin if you would give it up to the first vaguely human female thing that would say yes to you. It doesn't matter if you let your lust be your personality. They want a good man who abstains from sex like they do. Who does not share his body with someone unless he is in love with them and means to spend his life with them. They want a man who values his virginity and respects his body in the name of God like they do. And that's like the basic thing to do. They will hold you to the same standards they hold for themselves and incels don't meet those standards.","score":1,"comments":[]}]},{"title":"One of the most disturbing ones I've seen :/","not_safe_for_work":true,"locked":false,"body":"","score":1005,"comments":[{"body":"Luckily, he's never going to be near a human being but I feel bad for his inflatable doll.\n\nReally bad","score":730,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"I AM A FUCKING MONSTER!\"\n\nAt least he's honest...?","score":503,"comments":[{"body":"Yup, such monstrous standards, Such monstrous Fantasies","score":75,"comments":[{"body":"And probably monstrous body odor","score":84,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"And they wonder why women find them creepy.","score":282,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Skippy, it's time to either double or half your dosage. Switch away from Mountain Dew to something decaf. That wicked edge is starting to scare the children.","score":156,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"ok so there’s a LOT here but for some reason i can’t get past fuckin. “shitalian”???? and are we back to people thinking italians are somehow less white again?????","score":108,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Hey shitlord, you forgot to say (in Minecraft). That's how you disgusting clowns believe you can protect yourself right? You're not an animal. You're not a monster. You're a little ant scurrying across the floor hoping society doesn't step on you.","score":267,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Are the people on that website fr","score":82,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Sounds like the kind of potential abuser who *should* be alone.","score":76,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This (now 3-year-old) video about incels from Beau of the Fifth Column offers what I would argue is the most balanced perspective on the subject","not_safe_for_work":false,"locked":false,"body":"...and it can be found [here.](https://www.youtube.com/watch?v=lLZfKs5N8jQ) \n\nIf you're not interested in hearing him talk about Dick Marcinko and SEAL Team 6, you can skip forward to the 6:08 mark.","score":1,"comments":[{"body":"i don’t know if i agree with some of what he says.  Being ugly, or having disabilities is 100% going to be a challenge but there are women that also deal with those exact situations.  \n\nI know of a local mentally and physically handicapped man, not attractive in a standard sense and yea he would struggle to date an average woman.  \n\nHe is married, him and his wife are both well known and respected.  They both have basically become local celebrities in the sense that they are so well known and liked. I don’t know a person that doesn’t know them or like them or has a single bad thing to say. Partly because everyone knows they have struggled with life and are still amazing human beings.  \n\nHe started a community organization to help others will disabilities to find their own personal value, through work, community volunteering, they organize social events for people like themselves to get out and socialize. and they help people find support they need.   highly respected man, i always stop and talk to him when i see him.  he asks about my family my husband and my life in general and when you speak you feel that he actually cares about you as a person. his wife is equally a beautiful human being. \n\nSo yes he faced challenges and struggle but not impossible. because at the end of the day he was/is a terrific human being. and built a reputation as such.","score":3,"comments":[{"body":"I know of cases like this as well. But I believe that these are examples of survivorship and visibility bias. The person in your example is visible because he is a pillar of the community and displays leadership as well organizational skills - all attractive traits. But not every disabled person possesses those redeeming traits. \n\nIt is similar with the stereotypical example of the homely fat guy who does well with women because he is funny, extroverted and pretty much a social butterfly. Yes, people like that exist and of course they are very attractive. But not every fat guy possesses this degree of extraversion.","score":1,"comments":[{"body":"yes, but women and men both struggle with these issues.  Mental and physical disability can be a set back and a struggle but finding people you can relate to, bond with will make dating and love a possibility still. up hill battle for sure.\n\nare their extreme cases, 100%.  but many people with social, mental and physical disabilities still manage to find people and have relationships all the time.\n\ni used him as an example because it’s someone i know.  he definitely is an exceptional person by any standard.  however he has faxed challenges and still managed the mental fortitude and social awareness to still be a great person.  he technically had no reason to be with what he was given from birth.","score":2,"comments":[]}]},{"body":"I don't discount what you're saying but I'm inclined to agree with SaintJust when he says that your friend is a statistical outlier. Even Beau in the video states that it would take a strong woman to get past certain undesirable physical features that are too pronounced to ignore and that those who are unlucky enough to have them should prepare themselves for never getting that picket fence (to use his own words) regardless of how much effort they put into improving themselves.\n\nOf course, he also points out later in the video that the vilest rhetoric typical of what we would expect from incels comes from the third category: those who are reasonably attractive and otherwise mentally balanced save for their extreme lack of confidence, whereas those from the first two categories (physically ugly, genuinely mentally ill) are more likely to have greater mental fortitude.","score":1,"comments":[]}]},{"body":"I wouldn't normally say this but I'm honestly surprised that this got downvoted as much as it did given that Beau of the Fifth Column is a generally respected progressive YouTuber.","score":1,"comments":[]}]},{"title":"Incels don't seem to realize that legalizing rape means they can also be raped by other men with no penalty.","not_safe_for_work":false,"locked":false,"body":"","score":312,"comments":[{"body":"[removed]","score":108,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If your first \"natural response\" to seeing a woman's hair is to *rape her*, then *you're* the garbage.","score":193,"comments":[{"body":"It just doesn't make evolutionary sense, If males raped women because of hair eventually women would have evolved bald","score":74,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"If \"foids\" were cumdumspers wouldn't that make your lack of ability to hook up with one even more pathetic?","score":92,"comments":[{"body":"I'm pretty sure they realize this, and that it drives their rage all the more.","score":32,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"They should be shipped off to Afghanistan where they belong","score":20,"comments":[]},{"body":" Funny that they call women toilets yet they’re so desperate to fuck them. You…you wanna fuck a toilet?","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I've said it before and I'll say it again. \n\nWith these types of immoral men freely walking around in society, every woman needs to learn self defense and be armed. \n\nYou could walk past a man who thinks this way in the store and have no idea. You could work with a man who believes these things and have no idea. \nYou don't want to find out when its too late.\n\nIf this post doesn't convince you guys, I don't know what will. Nobody is in charge of our own safety but us. The police can't protect us, our families can try -- but at the end of the day, we are responsible for our own safety. \n\nI urge you all to learn self defense techniques, research gun ownership, and concealed carry laws in your state. The smartest thing you can do is learn to be prepared in case of an attack. \n\nStay safe everyone.","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Knowing Incels, they'd probably WANT to get raped","score":12,"comments":[{"body":"By huge Chad's dick. \n\nI mean, few days ago they said women have such a privilege in life because, among other things, we can get Chad's dick easily. \n\nMight as well say they desire Chad's dick and are salty AF cause Chad's are not interested in fucking them. Cause that's the truth lol.","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Yeah I was right, this sub is full of incels.","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"How is that spiteful? Who’s feelings* is he hurting?","score":11,"comments":[]},{"body":"Yepp. Let's see if they follow the path of previous incel-sub and spiral into hate and threats.","score":11,"comments":[{"body":"This won't happen.\n\nThe recurrent users of the sub are basically incels who are smart enough to avoid getting banned while still behaving like incels. Their misogyny is often too subtle to be interpreted as something violating Reddit's policies (but a little obvious).\n\nAny time an incel strays too far by saying certain buzzwords or directly spewing misogyny, the r/virgin mods do disciplinary action to that user to prevent Reddit from taking down the whole sub. The mods have explained it a few times and of course a few incels do complain about it.","score":8,"comments":[{"body":"Well, perhaps that can be a good thing? Gives us the chance to talk to them under civilised forms.","score":7,"comments":[{"body":"Yeah you could try. Good luck, it's a little tiring because uhm...these are extremely angry and negative people let me tell you that.","score":5,"comments":[{"body":"Oh, I know. Still, could be fun to try.","score":1,"comments":[]}]}]}]}]},{"body":"I'm confused.\n\nSo, out of spite but against who?\n\nAnd is sex itself a sin or just with a SW? And is a sin for both? Her? Him? And I presume the worker isn't virgin so his first statement is still legit? \n\nAnd if is a sin why he posted that he's down for everything, even scat, on okcupid sub?\n\nI'm confused","score":5,"comments":[{"body":"Spite against the girlfriend he will eventually have. This is so self-defeating it's hilarious -- he already hates the woman of his dreams.","score":2,"comments":[{"body":"Bold of you to assume he’ll even get a girlfriend with that attitude","score":3,"comments":[]}]}]},{"body":"that guy isn't going to make it through the screening process.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Please clap...","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"He joined their forum 5 days ago, has spent nearly 3 days of that online, and made 500 posts. Now he’s whining that he’s not getting enough attention. Wonder why no women are interested, when even incels find him too whiny.","score":9,"comments":[{"body":"&gt;when even incels find him too whiny.\n\nNow, if only incels at large could apply this to their \"reasoning (and I use that term lightly)\" and learn from stuff like this.","score":3,"comments":[{"body":"They never seem to learn. Anything that conflicts with their twisted worldview is automatically rejected.","score":2,"comments":[]}]}]},{"body":"This is the same delusion writ small.  No matter how awesome you think you are, you can't make people interact with you or take you seriously.  It's on you to be interesting enough to warrant a reply.","score":3,"comments":[]}]},{"title":"These people are making so many spaces unsafe for us women already and they still have the gall to complain about “support” and “attention”. In the comments he asked for tips to “Meet new people and get a girlfriend “ to cure his depression 😃","not_safe_for_work":false,"locked":false,"body":"","score":619,"comments":[{"body":"i just wanted to ask, are you okay, maam?","score":93,"comments":[{"body":"Yeah I am .. I am not in depressed phase atm","score":65,"comments":[{"body":"im glad to hear that!","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Avoid depression subs here and *especially* avoid suicide watch, they are crab buckets from experience I'm afraid. People egg on others and support isn't frequent from my experience.","score":77,"comments":[{"body":"Unfortunately that’s right \n\nTechnically online subs are useless anyways for “Suicide prevention “ because what suicidal people need is support and immediate help. I wish there was a lot more mental help available","score":32,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I noticed that when some guys say they “reached out for help”, what they mean is “I tried to force a relationship on a girl”.\n\nFellas: GO. TO. THERAPY.","score":135,"comments":[{"body":"This .. \n\nI mean it’s always . A relatively well adjusted guy meaning from well to do family , has a job or a way to support himself , is in good health and somewhat on social standing with no serious trauma. \n\nAnd then they spurt out “ I am depressed because girls won’t date me and I hate how easily this one particular minority of the woman population has it soooo easy” \n\nAnd that’s also valid because depression can affect anybody after all BUT accept when people try to correct your beliefs or suggest you a kind of help.","score":52,"comments":[{"body":"Also gotta remember that they only see and acknowledge the women that ARE hot and get tons of attention. The plain and ugly ones are invisible, not-women to them, so of course these men see that \"all women\" have it easy. Us regular women don't really get that attention (which also comes from men like this and honestly, I don't think it helps the hot women either at all). \n\nI guess it all stems from a certain kind of dehumanization.","score":33,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"That isn’t support at all but people trying to get close to you because of ulterior motives. \n\nBut yeah, it’s so easy being a girl when you have a lot of people being fake around you and smiling in your face for the wrong reasons. While they wait for you to fall victim and then victim blame you.\n\nEdit: my post isn’t going against you OP. I’m just clearing that out the way since it sounds like it lol","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The problem is that incels believe that members of the opposite sex aggressively trying to date you *is* help getting out of depression.","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"If a woman rejects a man, is it always because the man is low value in the eyes of a woman?","not_safe_for_work":false,"locked":false,"body":"I am debating someone on this question and I want different perspectives on the answer.\n\nEdit: I believe the answer to the question is no.\n\nEdit 2: I believe women dont reject bc of low value","score":1,"comments":[{"body":"No.  \n\n\nIt's usually merely because there was no connection.  A man can be \"high value\" in a billion ways, and a woman still won't find him her type.    \n\n\nIt almost never has to do with his \"value.\"","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The entire \"high value\" concept relies on the idea that all women want the same thing and that there is an objective \"best\" a man can be regardless of context or circumstance.\n\nBoth are false.\n\nWomen each want different things, we're insividual people, not a hivemind or just a trophy to be won.","score":11,"comments":[]},{"body":"Value in people is subjective. Some people are all about looks, some people value hobbies, others income, fertility, career, ambitions and a million other things. Every single person has different attractions and deal breakers. Trying to sort people into high value and low value categories is useless because those categories are not that same for everybody. I have personally never thought oh this person is low value, if I wasn't connecting with a person I would think we are not a good match not that they lacked value.","score":7,"comments":[]},{"body":"No. It's not because of \"low value.\" Seriously, that idea is just sad.  Simply put, she doesn't find him attractive. Both physical and character wise. Physical preferences can be overriden by a winning personality, but if both don't click, it's a rejection. \n\n\nSome might say that the woman should just give him time to get to know him better, but if it's a cold approach, opinions are usually formed within the first minute. In those cases, physical features are a strong factor (personal preferences,) but even then, the manner of approach is a strong second. If the secondary (the manner of approach) is bad, the women might not even want to know them. That's when the dreaded \"vibe\" comes in. Incels don't believe that the \"vibe\" exists. They think we're cold calculating robots who assign value to men approaching us.\n\n\nIf the approach is good, it's not impossible to get to know each other, and then it's possible to override the perceived lack in the physical department. That's also something incels don't believe in, because it disproves the blackpill.\n\n\nIt's also something that doesn't work too well in online dating unfortunately, since IMHO close interaction is necessary to be true to character. Messaging in dating apps is lacking severely in that department.","score":4,"comments":[]},{"body":"What does value and status even mean? \n\nPeople are individuals and we value very different things. I married a man who was neither rich, nor had a career, nor had tons of women before me, nor was 7' tall, nor is he ripped/super handsome or any of those things. I met him at a time, where it was hard for either of us to scrape 30€ together for a train ticket to meet. \n\nBut he made me laugh, we shared the same hobbies and interests and got to know each other for half a year before jumping into something. And to me he is the best man, handsome and funny. \n\nSo did he meet my expectations and my idea of values? Absolutely. Would that be a deal breaker for another woman? Probably. 🤷‍♀️","score":3,"comments":[]},{"body":"Value? No. What is that even supposed to mean? That’s not how relationships work. It’s compatibility.","score":3,"comments":[]},{"body":"Different women can have different reasons.   The woman could even think the man is a pretty cool dude, but just not right for her.","score":2,"comments":[]},{"body":"I guess that depends on how you're choosing to define value.\n\nI'd say that most rejections happen because the woman doesn't feel an attraction to that person. The reason that there is no attraction there is going to vary from woman to woman because, weirdly enough, they're all individuals with their own unique set of preferences. The woman who rejects you may not value what you have to offer, but that is not the same as saying that you are a \"low value man\" or that the guy that they would be attracted to is a \"high value man\".\n\nThose terms are pretty unhelpful. If you find yourself being rejected a lot, it might be time to look inward and see if there's something about your approach which isn't working.","score":2,"comments":[]},{"body":"It's a straw man argument.\n\nI enjoy me some mashed potatoes. I don't prefer scalloped potatoes. If someone offers me the choice between scalloped or mashed, I'm going to take mashed every time. I simply prefer mashed potatoes.\n\nThe logical extreme that the person debating you would make is that it's because scalloped potatoes are always \"low value\" to me. Which, I mean, I guess? Sure? Except sometimes I do enjoy a scalloped potato. They're different, they have an inherent creaminess to them that's yummy.\n\nThey're trying to use a bad faith argument. No matter what you'll argue as to why you're rejecting a man, it's proving their point. I'm not in the mood to date anyone right now. Oh, well you don't value what they can bring into your life. I'm coming off a bad breakup. Oh, they're too low value to show you how good being with a guy can be. I don't prefer blonde hair. Oh, blondes are low value. I prefer someone who makes me laugh. Oh, I'm not funny enough. Etc. etc.\n\nThey're trying to get you to indulge their self-important pity-party wankest. All people value different things, but when someone wants to argue this point, they'll just circlejerk themselves back into concluding that *they* specifically are low value, or the rest of their self-victimizing brethern.","score":2,"comments":[]},{"body":"no one is low value, i hate that term.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Presumed incel tells me I consented to rape","not_safe_for_work":false,"locked":false,"body":"","score":20,"comments":[{"body":"What a horrible piece of shit. I’m really sorry op that you get such messages from these sick fucks invalidating what you experienced and telling you deserve it. That’s absolutely disgusting","score":12,"comments":[]},{"body":"dude hasn’t heard of coercion","score":8,"comments":[]},{"body":"\"You can't just take it back.\"\n\n\nOf course you can. Consent can be withdrawn at any point, before, even mid intercourse. You're not \"legally\" bound to your consent and just have to endure it because reasons. That guy is ridiculous.\n\n\nI'm sorry that happened to you. I hope you'll find warmth, peace and a protective embrace. Don't listen to these garbage people.","score":3,"comments":[]},{"body":"this guy is nuttier then a squirrel's den","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I always wonder...imagine one of these incels got a girlfriend (pft) and she, god forbid, is the victim of rape, would they blame her too?\n\nOP, I'm sorry you received such a horrible message from this vile person. His sick comments don't invalidate the fact that you were coerced.","score":5,"comments":[]},{"body":"Yeah, these people are insane. My girlfriend was assaulted in high school by coercion and it's just as valid as any other form of assault.","score":8,"comments":[]},{"body":"One day, incels will understand it. Put em in jail, when Big Bobby with the extra large penis has his way with them, then they'll know. Not saying I'm advocating, but it seems very \"Goosh Goosh\" and if you don't know what that is, Google it, Tokyo Tribe 2.","score":3,"comments":[]},{"body":"Send him the tea video","score":1,"comments":[]}]},{"title":"\"Is that the best you can do?\"","not_safe_for_work":false,"locked":false,"body":"","score":140,"comments":[{"body":"Ok. And you still haven't found a woman who appreciates this? Maybe those heads are smarter than you give them credit for.","score":29,"comments":[]},{"body":"That fungus monster from the commercials is what lives in incel toenails.","score":19,"comments":[{"body":"Anybody order antifungal medication? These guys need it.","score":9,"comments":[{"body":"absolutely loving your flair","score":4,"comments":[]}]}]},{"body":"So fuck some incels toenail then. Idk what this has to do with us","score":17,"comments":[]},{"body":"if y'all so valuable and precious then why can't y'all get laid?","score":14,"comments":[]},{"body":"All the Incels in the world put together don't add up to a squirrel fart.","score":7,"comments":[]},{"body":"He is projecting. He knows he is worthless.","score":7,"comments":[]},{"body":"Why’s he telling us? Let him make an OnlyFans and offer it up for the enjoyment of clients he claims only attractive women can get.","score":5,"comments":[]},{"body":"Because????  \n\n\nI mean, this makes no sense at all.  They don't appear to understand what constitutes \"worth\" do they?","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Old, but was found in a FB group.","not_safe_for_work":false,"locked":false,"body":"Found this on This is what incels actually believe group and I am bothered.","score":16,"comments":[{"body":"You are equals, no one is telling you that you can’t attend school with non-incels, no one is doing incel-face on tv, no incels are getting gunned down taking a jog in a non-incel neighborhood. these fuckers wouldn’t know oppression if it literally punched them in the face.","score":11,"comments":[]},{"body":"Hot take: We've isolated ourselves because the hot girls on porn hub won't fuck us. We are superior to femoids and they hate that. Why am I so ugly, this must mean they are too stupid so I just rape them and kill all of them.\n\nWhy does no one like us? 😱😩😭😭","score":2,"comments":[]},{"body":"MLK was short, not white, didn't have a good jawline, he still got married and is a legendary man. None of these traits doomed him like Incels.is claim they do.","score":1,"comments":[]},{"body":"This is giving John Lennon, in trying to be anti hate.. they perpetuate hate!!","score":1,"comments":[]},{"body":"Sorry I should have put a NSFW and a TW on this. I forgot to do any of those. I was just grossed out that these incel folk are so disillusioned by their own culture they actually feel like they're their own race or something.","score":1,"comments":[]},{"body":"These people grind my gears to no end. Like, how are generations upon generations of my people's suffering, persecution, enslavement, and murder comparable to you not having sex?","score":1,"comments":[]},{"body":"Oof, I know they don't feel like they need to censor that but I feel like we don't need to drop it in reddit feeds unexpectedly","score":0,"comments":[{"body":"I stumbled across this and was all like \"this is on an official subreddit? wow\".","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Is this more incel or religious nutcase?","not_safe_for_work":false,"locked":false,"body":"","score":67,"comments":[{"body":"Both.  It is both and both is not good.","score":29,"comments":[]},{"body":"There’s a lot of overlap between both groups of wackos.\n\nHonestly, THEY are what we need to protect ourselves from.","score":21,"comments":[]},{"body":"‘Patriarchy is meant to protect women and children’ - from what exactly? Oh that’s right - men. It’s men controlling women and children to ‘protect’ them from other men.","score":30,"comments":[{"body":"The biggest problem is, who protects them from the \"protectors\" if the latter turn out to be not so benevolent?","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Porque no los dos?","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Elliot Hulse really went deep in that hole...","score":6,"comments":[]},{"body":"I guess they skipped that part in the New Testament where we hear there is no male or female in the lord. Cherry picking can be so much fun.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"There is no god, only Zul.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Right wing","score":3,"comments":[]},{"body":"It's religious nut job nonsense.\n\nIt has the potential to come from an incel or be latched onto by incels, but until the post says \"and this is why I can't get laid/I'm a virgin/no one will date me\" then it isn't actually incel shit.\n\nThat isn't to say that this isn't problematic, it's just not *this* kind of problematic.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Am I An Incel","not_safe_for_work":false,"locked":false,"body":"I am a guy. 22 years old. I have only had 2 girlfriends and never really had a serious relationship. In spite of this, ever since middle school I recall girls looking twice at me, asking me out, complimenting me, so on so forth. In highschool a very pretty young woman who wanted to be a supermodel told me she liked me and wanted to be my girlfriend.  I have had lots of chances to date and have girlfriends but I have never pursued them for...reasons I don't really know. I have been diagnosed with Borderline Peraonality Disorder amonger other things. I am not really socially awkward but I don't go out of my way to pursue women or speak to them. It has been a very long time since I have had a crush on a girl. I am pretty asexual and I try to leave women alone to avoid looking like a creep. Girls always liked me first or asked me out first. I have asked out a girl about 2 times in my entire life but I have been asked out 20+ times. I don't hate women. I view them just as I'd view another person. I don't mind being single..I need to get my shit straight anyways. Sometims I feel lonely but it is what it is. .","score":9,"comments":[{"body":"no. why would you think you were?\n\nin the most literal sense, there's nothing \"involuntary\" about your relationship life.","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not really since typical incels hate women and make being an incel their only personality trait. If I HAD to assing you incel terms you'd probably be blue pilled volcel. \n\nI think at this point being an incel required you to hate women and not see them as people rather than actually not having sex. It's also very hard for incels to actually work on themselves since they spend most of their time in their little echo chambers. \n\nI guess the real question is whether you agree with the views incels have or not. Judging by your post I'd guess the answer is no. Common incel ideas include:\n\n- it's womens fault you don't have sex\n- women owe you sex\n- all women are whores who fuck everyone except you\n- women only fuck chads and tyrones \n- women should be ashamed for having sex \n- women should be virgins until they get married, BUT they should still have sex with you","score":15,"comments":[]},{"body":"Being an incel is a choice. The \"involuntary\" part is an illusion. If you're able to understand that women are actually humans and not objects for sexual gratification and/or breeding then your worldview is incompatible with inceldom.","score":39,"comments":[{"body":"exactly, being an *incel* is voluntary and is just a disgusting mindset to have. having bad luck dating and/or being a virgin is just a normal thing about life.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What would you call the unlucky minority of men and women who, despite years of trying, live their whole lives without ever finding a partner nor having any form of romantic/physical contact with the gender of their preference? \nBeing an incel as defined on this sub might be a choice. Still, I think it’s important to remember there’s far to many men and women who, while not adhering to the hateful worldview of the blackpill incels, live a life of involuntary celibacy","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Incels actively go out of their way to make women's lives miserable. So in my life, you are nowhere near an involuntary cellibate. I struggle with this too, it is not a bad thing to not like other women, I am always approached first but I don't want to bee seen as creepy and I'm just not needing a relationship. I do not view you as an Incel at all, you just have you're own personal choices, likewise with everyone.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"incel is an ideology of hate, being picky or disinterested isn’t incel.   even struggling to date if you are actively interested isn’t incel.  that is just struggling to date.","score":8,"comments":[]},{"body":"You're good my man. Being disinterested in women that approach you, or not pursuing other women seems like more of a choice, and there is nothing wrong with that. Just stay away from the black pill guys. They are not your friends. Keep doing your thing.","score":7,"comments":[]},{"body":"It's sounds like you just don't like sex. Or at least sex with another person. There is nothing wrong with liking to take care of your own sexual needs over having a partner. As long as you also feel this way about men, it just sounds like your asexual. You can have deep relationships or friendships without sex involved if that sounds like something more you want. \n\nI'm bi but I have always been more attracted to women then men. My husband was the first man that I've ever felt anything for. For most other guys I've been disinterest in. So it'd really just about doing you and doing what feels the most right. Don't force yourself into a box of what society thinks you should be. As long as your healthy mentally that's all that really matters","score":6,"comments":[]},{"body":"You just sound like a normal 22 year old? I’m not even sure where you’re seeing “incel”","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"So disgusting","not_safe_for_work":false,"locked":false,"body":"","score":205,"comments":[{"body":"Does he think that the female prisoners would just let him do that?\n\nHe'd get brutalized so hard.","score":147,"comments":[{"body":"Not to mention the warden... don't think he'd survive that one","score":63,"comments":[{"body":"Most wardens in women's prisons are just as sadistic as this waste of oxygen.","score":33,"comments":[]}]},{"body":"For every warden like this there is the archnemesis meth head who won’t stop until his balls and his body are in different rooms\n\nI’m team meth","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Ah yes, another episode of \"The things I would like to do to women if I weren't an insecure, weak, pathetic loser\".","score":111,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"These imbeciles watch way too much fiction entertainment.","score":69,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"50 fucking years old, actually pathetic.","score":25,"comments":[]},{"body":"Holy fuck this has to be one of the most disgusting thing i have ever read on this sub plz for the saftey of every woman lock up these psychos","score":29,"comments":[]},{"body":"Those women won’t let him do any of those sickening things instead they’re club together to kill him because some of them may have done murder ect he will never know","score":28,"comments":[{"body":"Another life sentence doesn’t mean shit when you’re already serving a life sentence.","score":33,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"It's not your looks, it's when you do bs like this","not_safe_for_work":false,"locked":false,"body":"","score":74,"comments":[{"body":"Then the guys DMing me from this site have the audacity to ask why I'm hostile towards them.\n\nI like asking them why they don't call each other out on this shit. \"Boohoo I would get banned and they're my only friends\".\n\nLike, \n\n1) the reason they're your only friends is *you consider people like that okay to be friends with, that is fucking messed up, it isn't a joke, that is gross*\n\n2) why the fuck should anybody come rushing to save you from inceldom when you choose to log in and applaud shit like this? Stay there then. Nobody is going to dive into a river of shit to drag you out when you could stand up and walk out on your own.","score":35,"comments":[{"body":"Of course they only have one friend","score":9,"comments":[]}]},{"body":"He killed her because she rejected him, that being said these incels need to stop idolising these killers because women don’t like men like that, they will get scared of you hence why they don’t choose you incels.\n\nI’ve been rejected many times in life I didn’t kill them I took it and moved on it’s apart of life not every female will love you back so move on and don’t cry like a babe just accept it and move on that’s what made me stronger mentally","score":23,"comments":[]},{"body":"“SUPPORT GROUP PLZ NO BULLY”","score":17,"comments":[]},{"body":"So when do we start discussing chemical castration for these creatures?","score":16,"comments":[{"body":"i was thinking surgical but that’s probably cheaper","score":6,"comments":[{"body":"A big enough knife could work aswell.","score":6,"comments":[]}]}]},{"body":"Geez these creatures sure have mommy issues.","score":18,"comments":[{"body":"Don't most serial killers have mommy issues? That is a big coincidence...","score":5,"comments":[]}]},{"body":"I really hope these men get everything they deserve in life.","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Calling women trash because they are dating not white people","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[{"body":"But i see incel after incel in various forums and subreddits saying that they're \"white women only\"\n\nhe probably thought that just because he's (probably) white women would come flocking to him\n\nand when it didn't happened it was easier to blame \"ethnics\" rather than himself","score":4,"comments":[]},{"body":"...Because they're actually appealing to white women? 🤨 \n\nBut really incels, like your dead idiot terrorist idol, even if it was just you and \"your\" women as the last people on Earth, the species would die because \"your\" women would *still* be uninterested in you and it has jack shit to do with your skin color and everything to do with your behavior. \n\nBut if anything, if you're seeing all these \"ethnic men\" dating white women then it further proves that men of color, including/especially Asians, *aren't* screwed by their skin color like incels claim they are just as white guys aren't \"superior\" for the same reason.","score":1,"comments":[]}]},{"title":"Redditor on “why women stay friends with guys they “friendzoned””","not_safe_for_work":false,"locked":false,"body":"","score":45,"comments":[{"body":"The friendzone isn't punishment bc it means I finally have a friend :D","score":15,"comments":[]},{"body":"Skippy, are you that unaware of the concept of friendship? Or is this so many sour grapes?","score":13,"comments":[]},{"body":"Ah, don’t forget the bigger pic - men get friendzoned because when women unequivocally reject, sometimes women get unequivocally killed.","score":12,"comments":[]},{"body":"These guys don’t deserve friends.","score":10,"comments":[]},{"body":"I hate the fact that I'm really not attracted to someone unless I'm friends with them 😕.  It has given the wrong impression before.  Luckily my friends know and are understanding and still realize that yes I enjoy being just friends","score":5,"comments":[]},{"body":"Seeing a post about the other side of \"the friendzone\" from the girl's perspective really blew my mind back when I still had NiceGuy^TM tendencies. \n\nIt was heartbreaking to read about how this girl really thought she had a good friend up until the dude like tried some shit. I think that post was one of the things that really started my transition from NiceGuy^TM to an actually nice guy.","score":3,"comments":[]},{"body":"I think they kind of have a point regarding this though. All male friends I had at some point showed me they weren’t in it for friendship. I’m not saying all men are like this, but considering my personal experiences all of them have been.","score":3,"comments":[{"body":"It gets better as you get out of high school \n\nWell, for me it did at least. Teenagers are fucking stupid","score":3,"comments":[]}]},{"body":"Oh okay so it the same old tiring, bullshit argument anyone with a group of guy friends has heard a million times? Yawn. It's getting really old and here's why it's bullshit.\n\nIt's bullshit because propping each other up and making someone feel good is literally what friends are expected to do. All those compliments you gave to her, all those nights you stayed with her on the phone, any time you were there for her, is all normal friend behavior. It's not \"simping for mAh queen so she'll give me sex.\" \"Simping\" is what friends do sometimes.\n\nIt's not a matter of her leading you along and using you. It's a matter of her treating you like a friend. If you had feelings for her you should of made your sexual/romantic intentions clear. And if you haven't made them clear, you don't have the right to bitch and moan about it. It's on you. You were the one with those feeling for her. You felt them, now you have to deal with the unfortunate consequences of having unreciprocated feelings.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Because they still have a relationship even if not a romantic or sexual one, and both of them are (hopefully) able to manage their feelings like functional adults?\n\nI feel sad for guys who think sex is the only possible \"benefit\" from hanging around women. They're really missing a lot in life.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Perhaps there is something OTHER than their looks?","not_safe_for_work":false,"locked":false,"body":"","score":509,"comments":[{"body":"First they bitch endlessly that women don’t date normies, now they’re bitching that women date normies. Make up your minds, guys!","score":283,"comments":[{"body":"Schrodinger's Chad","score":153,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They're INCELS. The only thing they do is complain.","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Literally ten minutes ago my husband had my on the ground dying laughing because he said “I have yet to make a sandwich” in a weird way in reference to the new Pokémon game. \n\nI have no idea why I was laughing so hard, but it was hilarious and that’s exactly why I’m with him! We make each other laugh and he has an awesome personality. And he’s a pretty average looking dude according to conventional  standards. \n\nIncels don’t understand how relationships work","score":52,"comments":[{"body":"Oh lawd that part of the game is cracking me and my bf up too! \n\nI was showing off all the different kind of sandwiches I can make and he was all like ‘I’ve never made a sandwich, can you make one for me?’ And as soon as he said it, we were down for the count lmao","score":16,"comments":[]}]},{"body":"I wonder if those normal-looking guys with girlfriends tend to go around calling women \"foids\" and speaking about them as if they are property... or maybe, just maybe, they DON'T do that and instead spend time cultivating hobbies and a personality so they have something interesting to talk about when they meet women? And speak respectfully towards them?\n\nOh wait, that's what \"bluepilled normie cucks\" do when they're part of \"soyciety\" ... those poor normies, getting girlfriends and living as functional members of society. \n\nMaybe learn how to be more of a normal person, and someday you too could live happily within society?\n\nMy fiance is not particularly tall, he's overweight, and apparently he's not considered attractive by many women, and would probably be considered a \"normie\" by the incels - but I think he's super hot. He makes me laugh, he has goals and ambitions and hobbies, he gets along well with everyone in my family. And he makes it clear everyday that he cares about me as a person.","score":42,"comments":[]},{"body":"They actively deny the fact that it's not their looks but their abhorrent personalities and blatant misogyny that makes them insufferable to be around. It's simultaneously fascinating and pathetic","score":111,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It always amuses me when they acknowledge the fact that plenty of normal-looking men have female partners, but they apparently don’t have the self-awareness to put two and two together.","score":60,"comments":[]},{"body":"See, his _first_ problem is calling human beings NPCs. (This guy at least calls women _women_ rather than females or, 🤢, foids.) It's important to remember we're all human, for better and for worse.\n\n\nIn a lot of ways this guy isn't in terribly deep. He's _so close_ to realizing it's because of personality. They claim to think this is a lie, but then, they think we lie to them out of a malicious desire to see them suffer, so that might not get him very far.\n\n\nThese guys think growing a personality is much harder than it is, so they 1. Don't want to bother since they think it's a lot of work - it's tiring, it takes time, and judging success is tricky; and 2. Women must **also** find it too difficult to bother which makes them hypocrites for wanting men to do it.","score":55,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Normal person: oh well I see normal people like me dating women. That means I must have a shot.\n\nIncels: everyone sucks but me!","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I have yet to get a taste of this \"foid privilege\" they claim we all have","not_safe_for_work":false,"locked":false,"body":"","score":40,"comments":[{"body":"I love it that every single answer is something they get absolutely furious at women for (supposedly) doing.\n\nAnd there's no trace of irony or self awareness there at all. Biggest hypocrites in the world.","score":22,"comments":[]},{"body":"Me waiting on that privilege I've never had.","score":11,"comments":[]},{"body":"I wonder if any of them have tried some of the VR chat rooms with a female avi.","score":7,"comments":[]},{"body":"Never mind that there are way more women than there are billionaires, and that the billionaires can afford to be picky.","score":6,"comments":[]},{"body":"Sweet Jeebus, Skippy. If it happened once in a porn it's gospel isn't it?","score":3,"comments":[]},{"body":"Those guys have no grasp of reality.","score":3,"comments":[]},{"body":"I like how when presented with all kinds of freedom their first thought is for the guys they'd go fuck.\n\nIf I was a woman tomorrow I'd probably buy a strapon and go join an LGBT book club.","score":2,"comments":[]},{"body":"you’re all already parasitic enough 😂","score":1,"comments":[]}]},{"title":"Like you'd ever go fight in a war","not_safe_for_work":false,"locked":false,"body":"","score":37,"comments":[{"body":"That's a really shortsighted self destructive view lol. \n\nHelping women or hanging out with women out of unconditional kindness and empathy lead me to have a few female friends.\n\nAnd those friends taught me a lot about how to talk to women and what women actually find attractive. They helped me with my social skills, self esteem and confidence. \n\nI was a late bloomer who only lost virginity at 24 yo. But if I didn't have female friends, I just know that I never would have had a girlfriend. \n\nWhen you meet a single woman and then you show empathy, understanding and kindness to them without expecting anything in return, that's a huge relationship green flag, it's great for healthy relationships and conflict resolution, a lot of women really find that attractive. \n\nHaving this little empathy and being utterly close minded like this, that's what's making you an incel. Even if you somehow learn how to attract someone, she won't stay for long if you keep this way.","score":9,"comments":[{"body":"Can you get a girlfriend with no female friends? Is that possible?","score":1,"comments":[{"body":"Im not quite sure it applies for all men, for some men who are especially talented or trained at talking to women maybe they don't even need female friends. \n\nI guess this is just my perspective as someone who went through a depressed lonely virgin phase and only learned how to really be attractive at my mid or late twenties.\n\nIn the end the day, it can be difficult for shy or introverted men like me, it took years of self improvement for me but a guy has to at least be open minded enough to be friends with women so that he can naturally figure out what they actually want or what makes them happy. It's a basic minimum starting point.","score":1,"comments":[]}]}]},{"body":"Well these incels would die on their first military Deployment because loads are too overweight to even do the job, also they won’t have any knowledge of what they’re doing, to be honest they wouldn’t even get into the military with their mindset, let alone their health problems as well. \n\nPlus I don’t want an incel with me when I go into the army because he’ll be moaning about women and he could potentially attack my love of my life and I couldn’t have that. \n\nIncels will never get into the military","score":4,"comments":[]},{"body":"Should be mandatory for all incels to be in the military on the front lines. Good luck militarycels.","score":9,"comments":[{"body":"Having been on the front lines, no thank you. If I had to share a foxhole with Skippy... Let's make them their own unit instead.","score":13,"comments":[]}]},{"body":"If they do help women it's only because they wanna get in their pants... Who's the selfish one?","score":3,"comments":[]},{"body":"I love how they think women have just evolved genetically over the past few hundred years since we’ve been experiencing wars","score":2,"comments":[]},{"body":"The idea of the Nuclear Family was coined in 1920.","score":2,"comments":[]}]},{"title":"so basically, women trash... according to this guy","not_safe_for_work":false,"locked":false,"body":"","score":34,"comments":[{"body":"What an idiot.","score":13,"comments":[{"body":"Thats very nice. I can think of other words.","score":3,"comments":[]}]},{"body":"Which platform is this ? \n\nHow does insta and FB allow these things ?","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Trajectories actually show it's men who are more single and lonely and while singlehood will arise, more women are actually open to dating the same man at the same time than men. Main reason monogamy is dying? If we're honest, it's a majority issue with heterosexual males. They live off their \"evolved biology\" when a lot of women don't. Women are more likely to get educated and live off fact and reason. Women have been studied to have a brain crossing where analytics but also empathy is as to where men are more brain crossed for physical work. \n\nNow I'm not saying all men should be slaves like ancient Hebrews, but well, maybe it's a great place to train incels and the manosphere out of their shitty selves.","score":4,"comments":[{"body":"Do you have a source that says it's dying? Because that sounds super hyperbolic.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I'm a young woman in the IT sector, freshly promoted and I haven't slept with my boss...guess I must be doing something wrong 🤔","score":3,"comments":[]},{"body":"one incel complains about how “all women are taken” another one complains that “theyre all single and have too big an ego to date [me]” can theeeey pick a narrative ?","score":3,"comments":[{"body":"I dont think they can follow logic to pick a narrative","score":3,"comments":[]}]},{"body":"Wow. Can't believe my gay wife who works from home has been sleeping with all these men behind my back for promotions smdh","score":3,"comments":[]},{"body":"Source: Trust me bro","score":2,"comments":[]}]},{"title":"You incels thrive off confirmation bias. You believe it, then you see it, then you feel justified. Wrong way to live.","not_safe_for_work":false,"locked":false,"body":"","score":102,"comments":[{"body":"Is he complaining that they wear too little and also complaining that they cover up in the same fucking post?","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"oh no, not women dressing how they want!\n\nhow dare we!? how dare we dressing however the hell we want? shame on us! shame i've said!\n\n...oh wait, i don't care what incels think","score":51,"comments":[{"body":"I'd say fuck incels, but please don't fuck the incels.","score":25,"comments":[{"body":"please, for your own good, you will regret it","score":11,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I have never physically cringed so hard in my life and bro thinks he IS the main character","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Ah, yes.  When forced to exit a building with alacrity during the winter, people dressed for the comfort of the indoors complain about the temperature outdoors.  How surprising /s. How dare they dress for comfort in the classroom rather than being ready to survive Artic Circle /s. \n\nAlso, in what world does any tank top, but particularly one that meets dress codes for schools, leave anywhere even vaguely close to 90% of the breast exposed? Unless he's complaining about those nipple baring, body building tanks and muscle tees men like to wear to the gym?","score":30,"comments":[{"body":"Right? I used to live north and I dressed for the building I'm in for 8 hours, not the outside that I'm in for 3 minutes.","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Bro these are kids, this is sick!! 12 to 19 year old young men are being indoctrinated into this mindset and it’s disgusting 😭😭😭","score":25,"comments":[{"body":"For real it makes me sick. Its a plague on our young men. MRAs are a fucking scourge. Every single problem men face is solved by feminism. \n\nIt doesn't excuse what they say but most of these guys are just teens who have been stolen from polite society by some cretin on that website.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"What a weak willed simpleton.","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I know we are supposed to black out usernames. but this is absolutely fucking disgusting and he WANTS TO ADOPT A CHILD","not_safe_for_work":false,"locked":false,"body":"","score":942,"comments":[{"body":"FBI OPEN 🆙","score":529,"comments":[{"body":"This guy definitely read Lolita and though Humbert was the good guy. Absolutely fucking repulsive","score":363,"comments":[{"body":"Dog the whole reason of lolita if for you to distrust Humbert due to his unreliable narrative","score":148,"comments":[]},{"body":"I once heard a woman say that the way Humbert described how he \"loved\" Lolita was her favourote description of romantic love. I nearly threw up. Like who would say something like that?","score":121,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"CHILDREN CANNOT CONSENT YOU DISGUSTING MUPPET","score":395,"comments":[{"body":"To add to this—people absolutely can be traumatized by something that they don’t remember. Trauma is a physical injury to the brain that results in emotional injury. Memory is not a prerequisite for trauma.","score":267,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Actually needs to be reported that's a pre meditated plan to adopt and sexually abuse a child.","score":370,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He's trying so hard to justify pedophilia lmao. He'll end up in jail in a few years for sure.","score":220,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No, please. My mind just started imagining an innocent child being loved and taken care of, but then their primary caregiver SAs them. Who the fuck does this????What a fucking piece of shit of a human being! Just no. I think i'm gonna go cry.","score":216,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He didn’t physically “hurt” me, but that doesn’t mean I was okay. He never forced me, he told me he loved me more than anyone could, he was related to me. I didn’t want to hurt him, so I was quiet. People like this do not know what love is. Prison is nicer than they deserve.","score":161,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Your sarcasm has been noted and filed in the proper receptacle","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"Maybe don’t abuse anyone because we’re all human beings with our own struggles. \n\nIt’s not hard.","score":6,"comments":[]},{"body":"Damn straight Skippy! I don't want your ugly virgin eyes on my Staceys and Beckys!","score":3,"comments":[]},{"body":"\"God made girls, God made girls, he stood back and told the boys I'm about to rock your world, then God made girls\".\n\n[God Made Girls - Raelynn](https://youtu.be/tl1uv6gB4hE)","score":2,"comments":[]},{"body":"Yeah, I don't think a lot of people think Amber Heard was a very angelic being. Cause women are people too, and run the gamut from the horrible to the lovely.\n\nIncels are just upset some of us dudes treat women like human beings.","score":1,"comments":[]}]},{"title":"He later deleted what he said, but not soon enough","not_safe_for_work":true,"locked":false,"body":"","score":29,"comments":[{"body":"\"see the goodness in his heart\"\n\nAs Jesus said: It is easier for a camel  to go through the eye of a needle, than for someone to see goodness in incels' hearts.","score":16,"comments":[]},{"body":"What a sick freak","score":12,"comments":[{"body":"It was honestly as flabberghasting as it was repulsive. Like sometimes it's hard to believe the people who say stuff like this  online are real, like I couldn't  even imagine saying such things in a million years.","score":7,"comments":[{"body":"Yes and you just know he wrote that whole thing out while jacking off too. Just remember. Hells fire burns hot and instead of crying for sex they'll be crying for water soon enough if they keep this up.","score":5,"comments":[]}]}]},{"body":"If there was goodness in him at all he wouldn’t predate on children.","score":12,"comments":[{"body":"💯","score":5,"comments":[]}]},{"body":"I am genuinely shocked that they have the gall to talk like this to non-incels. It is so fucked and I find it completely insane that they could even remotely think that their point of view on the subject of paedophilia would be even remotely accepted by anyone.","score":9,"comments":[{"body":"Exactly. There is no way anyone who isn't in that mindset would think it's okay.","score":5,"comments":[]}]},{"body":"To report an incident involving the possession, distribution, receipt, or production of child pornography, notify your local FBI office or file a report on the National Center for Missing &amp; Exploited Children (NCMEC)'s website at www.cybertipline.com, or call 1-800-843-5678. Your report will be forwarded to a law enforcement agency for investigation and action. Here is a [video link](https://www.youtube.com/watch?v=bbF6ZWnKRqc) on how to report child exploitation. You can also file a report at the [Internet Watch Foundation](HTTPS://iwf.org.uk/). They're based in the UK but work internationally.\n\nTo report an incident or suspicious situation that may involve child sex trafficking, call the National Human Trafficking Resource Center (NHTRC) at 1-888-3737-888, or file a confidential online report at https://humantraffickinghotline.org/report-trafficking. \n\nTo report obscene material sent to a child, a misleading domain name or misleading words or images on the Internet, file a report on the National Center for Missing and Exploited Children (NCMEC)'s website at www.cybertipline.com, or call 1-800-843-5678. Your reports will be forwarded to a law enforcement agency for investigation and action.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IncelTear) if you have any questions or concerns.*","score":5,"comments":[]},{"body":"Sweet Jeebus! That's just begging to be reported!","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"My brother being a borderline incel POS.","not_safe_for_work":false,"locked":false,"body":"","score":155,"comments":[{"body":"My condolences for having to put up with that shit.","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Don't give him the attention he craves. Stop after one clear \"no\".","score":42,"comments":[]},{"body":"This is far more than ‘borderline’ my friend","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Just cut him loose already, it might be a kind of damage limitation, which you might be the safest method\n\nOr anonymously isse him a therapy session, if you still see any hope in him...","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I don't think there's anything borderline about it. When men start comparing women to inanimate objects in relation to her \"worth,\" that's verifiable incel behavior. I'm sorry you have had to endure that, hopefully it's feasible for you to go LC cuz he'll probably just get worse.","score":20,"comments":[]},{"body":"He’s not one of the lads, he doesn’t have friends that’s why he tells you this, and easiest way to stop it is by not replying to the weird “brags” he sends you. \n\nHe wants attention, don’t give him any if he’s doing something that makes you uncomfortable.","score":15,"comments":[]},{"body":"Ouch. \n\nI feel for you this is what it was like being a bi dude growing up around straight guys who liked to make homophobic and misogynistic jokes back to back. The fact that you're his sister and he's saying this shit is pretty appalling. I read the captions last and just assumed he'd only say this shit to his brother who he thinks will bro up with him and let it slide.","score":11,"comments":[]},{"body":"Please be careful around him. Lock your doors if you live with this person. \n\nThe fact that he talks to you about other women like this, is deeply inappropriate, and that's without touching upon the misogyny and sexism.\n\n\"Hot Polish MILF slut\" is not how you discuss your day with your sibling. IMO it is clear that he is comfortable being inappropriate towards you. He also feels entitled to your attention.\n\nCarry pepperspray if it's legal. Stay safe.","score":10,"comments":[]},{"body":"Hes not a borderline incel, he is an incel. Dont entertain him, ignore him","score":8,"comments":[]},{"body":"“borderline”\n\nyou’re biased in his favor","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"“YoU aReN’t ImPoRtAnT” 🙄","not_safe_for_work":true,"locked":false,"body":"","score":172,"comments":[{"body":"Projecting hard as always","score":43,"comments":[{"body":"Then this same Incel will make a post on incels.is \"*Why do foids(women) hate us.*\".","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Gosh, he really showed you.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"So superior he ain’t got any bitches.","score":30,"comments":[{"body":"I love that they're super self deprecating one day and then act like this the next day.","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You know what important people aren’t doing?\n\nTry to convince strangers they’re important.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My self esteem and mental health is already in the crapper, but dearest Incel, you can't make me feel worse than I already do. U3U","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"And yet there they are giving you their time","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Someone is sad that he isn't important","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Me? reducing my self-esteem? bitch do you know who you're talking to?, a hint is on my username ***PRINCESS*** kitty\n\nbitch, im royalty, the fuck are you? like do you know how important a motherf\\*cking princess is?\n\nthat's right, less important than a queen but more important than a duchess\n\nmy holes prints money, im a vaginal capitalist, they are more important than any incel, and so much more important than you, you're just a typical western incel\n\nnow bend the knee hoe 🤣🤣🤣\n\n&gt;!... ok that was a little extra, but you know me 🤣!&lt;","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I think this dude got into something he probably shouldn't have imbibed...","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"At least someone told him to get help. That’s refreshing.","score":3,"comments":[]},{"body":"Twilight Zone theme song intensifies.","score":3,"comments":[]},{"body":"When the shrooms are REALLY good.","score":2,"comments":[]},{"body":"He needs therapy","score":1,"comments":[]},{"body":"Given the demographic of young, socially maladjusted males between 18-25 on the site, it's not surprising one or two might end up displaying schizophrenic behaviours.","score":1,"comments":[]}]},{"title":"I like that word, self profitable","not_safe_for_work":false,"locked":false,"body":"","score":78,"comments":[{"body":"&gt;they can get simps just from existing online\n\nI exist online. Where are all my simps at??","score":55,"comments":[{"body":"Right! It’s almost as if… these guys are delusional 😂","score":24,"comments":[]},{"body":"I'm right here","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You must ALWAYS remember this: When incels say \"women,\" they are talking about 19-year-old Instagram exhibitionists.","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Men can (and do) do all those things, too.","score":23,"comments":[{"body":"men can earn big bucks without selling or exposing their bodies\n\nand no \"women can do onlyfans!\" can deny that","score":16,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I don't know, period cookies sound very unsanitary.","score":21,"comments":[{"body":"Most things on the list would most likely be a bio-hazard","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"only them can come up with such ideas","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"In theory, yes.  All they need is to buy a domain and customize an e-commerce platform on it, perform a ton of SEO, register with a cam service/only fans, set up and link profiles on, Facebook, Instagram, Twitter, Snapchat, YouTube and TikTok. Set up a members only discord server. Then create posts/content for all those pages and make sure they update regularly to funnel new subscribers to the ACTUAL paid content and retail merchandise. Then also continue to produce both free tier marketing content and subscriber paid content every day forever lest the algorithms decide you are no longer relevant and bury you.  \n\nNo problem, I'm shocked every woman doesn't do it. 🙄","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Drugs are bad mmmkay?","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"I sometimes wonder if properly prescribed psychedelics/MDMA would be good or bad for these guys","score":6,"comments":[{"body":"A little ego death might help these dudes out.","score":6,"comments":[]}]},{"body":"Is anyone else hearing White Rabbit in the background?","score":3,"comments":[]},{"body":"[deleted]","score":2,"comments":[{"body":"Mr. Mackey","score":1,"comments":[]}]}]},{"title":"After I posted \"Vampire Goes on a Date\" five-page webcomic, I got this gem of a message... still not gonna delete my comic. Sorry. UwU","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[{"body":"Clearly you hit the mark with the comic.  \n\n\nFunny that, right?  Showing a man trying to physically abduct a woman get torn to pieces and he's got a problem with that?  To the point where he goes after you?  \n\n\nVery very telling.","score":10,"comments":[]},{"body":"I liked your comic a lot","score":5,"comments":[]},{"body":"you don't have to delete anything, if he doesn't like it, well too bad for him","score":5,"comments":[]},{"body":"Lol this dude is so pressed. 😂 poor little baby","score":3,"comments":[]},{"body":"I don't see a problem with the art.","score":6,"comments":[]},{"body":"Meanwhile the incels create drawings of men killing women in violent ways.","score":5,"comments":[{"body":"I just thought the idea of the turning tables to be delightfully dark and cathartic when conceptualizing my little comic. Also, the Incel wasn't based on anyone in paticular, he was a caricature (though, let's be real, the caricatures are surprisingly real, too.)\n\nAnd I was inspired by _Two Sentence Horror Stories_  (TV show on The CW and Netflix) and the works of Jhonen Vasquez, specifically his short _Meanwhile\n..._ comics in _Johnny the Homicidal Maniac_.","score":2,"comments":[]}]},{"body":"\"Dating short men isn't enough!!! 😭 wahhh you have to drop to your knees for every short guy you see!!!!!!! Love and companionship isn't enough you owe me sex!!!!!!!!! Height nazi!!!!!!!!!!!!! 😭\"","score":4,"comments":[]},{"body":"ja ne, i see you are a woman of culture","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You didn't even mention his height and somehow he found a way to get to that, and then accuse YOU of heightism. The way they bend reality is truly astonishing at times.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I believe this Reddit group can help the law enforcement in Idaho.","not_safe_for_work":false,"locked":false,"body":"These murders in Moscow l, ID have all the hallmarks of an incel. The girls would qualify for “Stacey’s” (I guess from what I’ve read on IT) and the guy would have been a “cuck” (also a guess). It was targeted. Whoever killed those poor girls obviously had premeditation. We caught that Tennessee weirdo.","score":0,"comments":[{"body":"Looked up the incident (as the OP didn't bother to link to anything).  So far there's no information on who may have done this, so I'm not sure what you think this sub can do.","score":2,"comments":[]},{"body":"How do you think we can help?","score":2,"comments":[{"body":"I dont know really. Maybe someone posted on Incel site. I know a lot of people on this Reddit thread keep a close eye on that site. Maybe the guy has posted like the Tennessee guy? I mean if the internet could find that guy that fucked with cats maybe we can find this one?","score":1,"comments":[{"body":"Maybe, but I would bet good money that the FBI are already keeping a close eye on these sites. Still, if anyone can help them, that would be great.","score":2,"comments":[]}]}]}]},{"title":"Incel wants me to be raped, tortured and murdered because…my boyfriend is tall 😂","not_safe_for_work":true,"locked":false,"body":"","score":57,"comments":[{"body":"Why do they get so aggressive over height? Why?","score":17,"comments":[{"body":"Because it’s something they can scapegoat for their shortcomings instead of taking responsibility for their shitty attitudes and actions.","score":9,"comments":[{"body":"i hate that its probably the truth \nthats lowkey sad","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"He probably shed a tear the second he read the word \"blowjob\"","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My husband is 6’3 and I’m 5’2. Had too many butthurt incels tell me I’ll ruin his genetics 😂\n\nEdit: you guys won’t believe who’s in my dms rn lmao","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My girlfriend is also 5'2\" and she used to date a guy who was 7' tall, and here I am only 6'3\".","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I wonder who they hate more, tall guys or women?","score":10,"comments":[{"body":"Both because of their extremist virgin ideology that tall men = chad, as there isnt tall women, like my ex was born woman at birth and shes 6’2 and aye its normal but for them thats not it because they have short everything.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"ok, it's pretty clear you hate tall men, but what about tall women? im 6'0\",\r should i be with men my height too? or should i go for short men instead?\n\nor even better, taller than me?","score":7,"comments":[{"body":"It's very simple. \n\n- date a man your height: you're settling for betabucks\n- date a shorter man: you're lying and are cheating with Chad\n- date a taller man: you're indubitably a whore for Chad only.\n\n\nI don't understand why you don't see this 😉","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Yeah we are like the nazis...not you","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"They want oppressed so badly","score":8,"comments":[]},{"body":"Actually, we dont think about you at all.","score":3,"comments":[]},{"body":"They want to feel oppressed so than they can use it against people but they are not and never will be oppressed because they are cucking themselves, and that’s their own fault","score":5,"comments":[]},{"body":"Nope, nobody cares enough about yall for this. Interesting \"fantasy\" though","score":6,"comments":[]},{"body":"Skippy, nobody wants this to happen but you. Nobody thinks about you but you.","score":2,"comments":[]},{"body":"I agree with everyone else. We don't care enough about you to gas you. You give yourselves too much credit.","score":2,"comments":[]},{"body":"They’re living in a fantasy world.","score":3,"comments":[]},{"body":"I mean, I've heard about rape fantasies, but THIS? This is a whole new level of masochism.","score":2,"comments":[]},{"body":"Which women has he spoken to in order to get this impression?","score":1,"comments":[{"body":"The ones in his paranoid imagination.","score":1,"comments":[]}]}]},{"title":"My theory as to why is because we deal with harassment from morons like you.","not_safe_for_work":false,"locked":false,"body":"","score":293,"comments":[{"body":"\"Not even Chad cocks\" said the boy who didn't realize exactly how repressed he sounds","score":104,"comments":[{"body":"Like sir, just because Chad cocks are the epitome of happiness to YOU doesn’t mean the rest of us don’t have something else going on","score":20,"comments":[]},{"body":"Was also thinking this lol. He really sounds like he's lusting for that chad cock himself.","score":54,"comments":[{"body":"But fr tho, who isn’t lusty for chad’s *girthy* **cock**.","score":22,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Guy is clearly jealous he's not getting Chad's dick","score":30,"comments":[]},{"body":"\"To add to the top, they get Chad's dick freely\"\n\nYet another accidental confession that what the incels truly desire is Chad's dick lol. And they're just salty that Chads don't fuck them.","score":16,"comments":[]},{"body":"Ioo Teacher Teacher, Pick me! Pick Me!\n\nWomen are angry around you because you want them to have all the human rights of a rusty spoon","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Have they ever considered that touching a penis is not what most women have as their life goal…","score":13,"comments":[]},{"body":"&gt;they get Chad dicks freely\n\nSo do the Chads dicks get a friend to drop them off at  my apartment building or is this some auto ship program I have to enroll in?","score":38,"comments":[{"body":"You have to sign up for it. I think it's at Chadmeet.based\n\nUnfortunately, there's a long application process and an even longer waiting period though. In 'Merica it's easier to get a gun than a Chad.","score":24,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"What exactly is the \"pity look\"?","not_safe_for_work":false,"locked":false,"body":"","score":56,"comments":[{"body":"It's probably a glance and small grin that we all do quickly to one another, but has been editorialized into oblivion by him.","score":35,"comments":[{"body":"Or the you have been staring at me and I am waiting to see if you are going to say something but no you will just stare... it is totally not super uncomfortable to be stared at... protip: yes it is do not stare! It is not cute it is creepy!","score":6,"comments":[]}]},{"body":"I’ll take “making up scenarios in my head” for $300, Alex.","score":20,"comments":[]},{"body":"I don't even understand the point. What was he expecting her to blow him on the spot like what?","score":13,"comments":[{"body":"Yes. What else? Thats a normal reaction when meeting a guy. /s","score":5,"comments":[{"body":"People be just walking around blowing each other in the street.","score":3,"comments":[{"body":"Imagine if that became a common greeting.","score":2,"comments":[]}]}]}]},{"body":"&gt;...driped out????","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"These idiots may be the worlds worst mind readers.","score":8,"comments":[]},{"body":"An incel misreading a social situation? Surely not.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Watch him go from Virgin to Veteran sex-haver in just a few hours!","not_safe_for_work":true,"locked":false,"body":"Posted this in another sub a few months ago because I didn’t know about this one. He has since removed the account associated with the posts. Another creep with a bunch of vile opinions. It is funny to look back and laugh at the deluded hypocrisy of this string of posts. I hope he becomes a true sex-haver, or whatever the fuck it is that he thinks will make him happy.","score":22,"comments":[{"body":"Now that's what i call ascencion! from incel to chad in mere hours!\n\noh wait nevermind, he's totally lying","score":5,"comments":[{"body":"Yep totally lying to feel better, because what they don’t understand is that there’s nothing wrong being a virgin, we all start as a virgin and whoever mocks or bullies you for it isn’t mature enough.","score":2,"comments":[]}]}]},{"title":"Less than half of these crab scumbags would feel happy for a 30yo colleague that escaped incel","not_safe_for_work":false,"locked":false,"body":"","score":37,"comments":[{"body":"Wait, they think 30 is old? \n\nThat’s mad.","score":28,"comments":[{"body":"Most of these incels are horny, bullied teens who think that if they aren't getting it at 14 they never will and they are doomed forever.","score":20,"comments":[{"body":"Are they bullied though? \n\nIf they think people existing near them is “mogging” then they aren’t really to be believed when they claim to be bullied.","score":7,"comments":[]}]},{"body":"If you are 30+ and have lived like an incel, then yes, it is.","score":2,"comments":[]},{"body":"These incels believe 25 is even too old because they go by what society says as well as what others say like when they mock them abs tease them for being a virgin, it’s definitely sad they believe this because everyone has their time at different times, and that’s okay just don’t dwell on it but unfortunately incels do","score":2,"comments":[]}]},{"body":"Misery loves company, and these are the bottom of the barrel.","score":15,"comments":[]},{"body":"Does ascended mean had sex?","score":4,"comments":[{"body":"Yes a lot of incels pay for sex but most of them do not consider that ascension. To incels “ ascending” is when you have sex without paying for it.","score":10,"comments":[]}]},{"body":"This is the saddest part. They went to the internet to find people like them, people who would make them feel better about an aspect of themselves they feel bad about... And they find this crowd. A mixture that concentrates hate and squashes humanity.","score":5,"comments":[]},{"body":"They just others to dwell in the turmoil with them.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The worst part of having a new Twitter is not having this stuff filtered","not_safe_for_work":false,"locked":false,"body":"","score":20,"comments":[{"body":"If women want to settle down after their prime then why are incels single???","score":9,"comments":[]},{"body":"Twitter disappearing under musk is the best it can happen to it","score":10,"comments":[]},{"body":"That's funny,  because my husband and I have a lot of differing opinions on things.","score":3,"comments":[]},{"body":"People are still using Twitter?","score":1,"comments":[]}]},{"title":"racist incel is upset I’m dating my Hispanic boyfriend","not_safe_for_work":false,"locked":false,"body":"","score":580,"comments":[{"body":"\"Like me\". You can bet your life, if the woman were dating a white man, he'd find some other excuse to make it about himself.","score":121,"comments":[{"body":"I completely agree, no matter what they’re always gonna have a reason to be hateful","score":50,"comments":[]},{"body":"Not to mention, no one is inferior to a piece of shit like this dude.","score":29,"comments":[]}]},{"body":"don’t they cry that women only want white men? lol they don’t even remember their own rules","score":72,"comments":[{"body":"They’re a mess","score":31,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Aryan blood... Do facist morons really not know that real Aryans live in Iran and are anything else than snowy white and blonde or are they ignoring it systematically?","score":54,"comments":[{"body":"nazis steal a lot of symbols and words from other cultures... probably aren't smart enough to come up with something on their own..","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Literally!! They make no sense at all","score":21,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"People who think like this are such a mystery to me. They care so much about the most mundane shit.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What a perfect example of a pure aryan, crying like a baby that a women won’t date him. Also what does he hope to achieve by sending this too you XD","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Who the fuck does this guy think he is?","not_safe_for_work":true,"locked":false,"body":"Even if this is a joke, you don't joke about that type of stuff.","score":265,"comments":[{"body":"Also because this he of course was showing me unwanted dick pics and asking to fuck, so if he's telling the truth and he really does have a girlfriend, then he's cheating (or trying to cheat)","score":88,"comments":[{"body":"Nah I don’t believe he has a gf. Not with the things he’s saying","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Most incels are probably going to die alone not by their looks but because of their shitty personalities.","score":52,"comments":[{"body":"Yep, some of them can look good, but then they do shit like this and wonder why they can't get any.","score":22,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Ohhhh, this is nasty AF!","score":35,"comments":[{"body":"He's a sick man","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"\"Annd blocked\" 🤡 \n\nThe audacity of this clown","score":30,"comments":[]},{"body":"The sad part is that this trash bin actually believes he’s in the right here. Even though he’s clearly worth less than recycled trash.","score":21,"comments":[{"body":"I think even less then trash to be honest.","score":10,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I cannot help but laugh at the fact he changed chats to be deleted immediately. He's knows he's wrong and he ran away. What a dipshit 🤦🏼‍♀️","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"He wants to \"worship\" women to bring others down?","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"It’s either they exclusively wants white girls (particularly slavic or fully Russian girls) or Asian girls, I’m starting to see a pattern…","score":8,"comments":[{"body":"He is a Neckbeard","score":3,"comments":[]}]},{"body":"This entire plan depends on women caring what these morons think of them... and we don't.","score":3,"comments":[]},{"body":"\"prime-aged females,\" that phrase makes me sick to my stomach","score":5,"comments":[]},{"body":"hey, im always down for some worshiping, if that includes money too\n\nbut it's de geso, and im not 14, asian, virgin, with a borderline flat and childish body or from kemono friends","score":2,"comments":[]},{"body":"I worship Jesus","score":1,"comments":[]}]},{"title":"\"think about it logically\"- 🤓","not_safe_for_work":false,"locked":false,"body":"","score":99,"comments":[{"body":"I mean... this has been floating around longer than most incels. I think it's literally in meme/copypasta territory now","score":36,"comments":[{"body":"I really hope it's a meme too, but these men are insane enough to actually believe this","score":15,"comments":[{"body":"No I mean I think this was posted on like Facebook 8 years ago or something idk. It's been repeated word for word so much that I think it's a joke. \n\nBut yes, fair, a lot of incels are definitely looking at it and scratching their chins and nodding like it made some kind of point.","score":13,"comments":[]}]}]},{"body":"This dude’s PornHub history has the word “incest” in it quite a few times, I am certain.","score":13,"comments":[]},{"body":"\"Who benefits?\"\n\nWell if she grows up to be a nice, responsible woman, then I'd say I did a good job at parenting. Because as a father, I would want her to do well in life, accomplish her goals, and get married if she wants to. But why would I even care what she's doing in the bedroom as a responsible adult? \nThis guy doesn't want a daughter, but a slave.\nSure she should help me around the house and what not, but what this guy is implying here is disgusting.\nIf he genuinely thinks like this, I sincerely hope he won't get any children. \nGod...","score":22,"comments":[{"body":"I don't think the children would be safe if I'm honest","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I saw this sooo many times, it must be a copypasta at this point","score":3,"comments":[]},{"body":"And the alternative is.....","score":5,"comments":[]},{"body":"We didn’t get it the first 50,000 times this was posted here, but thanks.","score":5,"comments":[]},{"body":"Jesus christ having a prolific arse period!!\n\nThis must be rage bait?","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Getting some bitches should be your last concern at this point","not_safe_for_work":false,"locked":false,"body":"&amp;#x200B;\n\nhttps://preview.redd.it/x1tgxt25hb2a1.png?width=500&amp;format=png&amp;auto=webp&amp;s=5d2e4f9fac7bb6a64a042dc5af4e2967da3ca809","score":39,"comments":[{"body":"Because no body likes that kind of cheese.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'd rather fuck Pennywise than an incel.","score":14,"comments":[{"body":"Ayo Pennywise seems to have a very nice personality. Have some respect for the guy it might not be easy every day and he treats everyone equally.","score":3,"comments":[{"body":"Exactly! He hates everyone equally.","score":3,"comments":[{"body":"And I think that’s a great principle to live by","score":2,"comments":[]}]}]}]},{"body":"To be honest there are many reasons why someone lives with their parents or doesn't work, not necessarily an incel","score":14,"comments":[{"body":"I think most people understand that. You can be a billionaire playboy and still have an incel mindset. It really comes down to refusing to better yourself, love yourself, and care for yourself, then expecting somebody else to love you unconditionally.","score":3,"comments":[{"body":"Loving yourself, caring for yourself, and bettering yourself are all privileges many people can't afford","score":1,"comments":[]}]},{"body":"This sub has a gigantic hate boner for unemployed men and I will never understand it.\n\nApparently to some of these people, disabled people don't exist and nobody can contribute to society without having a job","score":5,"comments":[{"body":"You're being downvoted but you're absolutely correct. So many posts on this sub are painfully ableist","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"title":"Yes. Yes it is.","not_safe_for_work":false,"locked":false,"body":"","score":83,"comments":[{"body":"It's a violation of privacy. Everyone's body is theirs. It's a trademark technically by law. Without permission, you can't photo someone's photos for gain, financial or sexual.","score":42,"comments":[{"body":"Unless you're a member of the Paparazzi they have copyright over the individual image as their IP.","score":13,"comments":[{"body":"Which is complete bullshit and should be illegal. Dubai has anti paparazzi laws don't they?","score":17,"comments":[{"body":"The UK has Anti Revenge porn laws though and taking a picture of someone without their concent in private is also illegal","score":8,"comments":[{"body":"America needs that law.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I agree and yes they do, Ironically enough","score":4,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Why would you violate someone's privacy for no good reason? Nobody wants to be sexualized while commuting on the bus, running errands or going to the shops. Be a normal person and use porn to wank...it's literally made to be used for sexual purposes. There are billions of sexy pics and tons of free porn. No need to be a creep except for the purpose of being weird and creepy.","score":16,"comments":[]},{"body":"Guys like him are why Japan literally had to pass a law requiring the flash on cell phone cameras to be permanently turned on.","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I had someone take a picture of me at the airport recently. He had the flash on and clearly didn’t realize. I turned around and glared at him because I couldn’t think of the right thing to say, but I like to think the embarrassment on his face was enough to say he won’t do that again. I felt disgusted after that.","score":7,"comments":[]},{"body":"Ok then buster.\n\nI want you to imagine a greasy, middle aged Karen following you and snapping photos of you. You wouldn’t be happy with that would you?\n\nThen don’t follow women and take pictures of us.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"No, we want you to leave that stupid site so you can grow up","not_safe_for_work":false,"locked":false,"body":"","score":77,"comments":[{"body":"Dude, society didn’t make you defend pedophiles, romanticize rape and glorify violence. That’s all on you. You made those choices.","score":36,"comments":[]},{"body":"What laws specifically make incels suffer I wonder.","score":28,"comments":[{"body":"Laws that don't let them own and rape women, probably.","score":25,"comments":[]},{"body":"The ones about consent","score":10,"comments":[]}]},{"body":"&gt; that’s simply a natural response to the life full of snottiness Soyciety has forced down his throat\n\nNope, sorry. I have met people who have endured so much worse than the things incels bring up as harmful for them. Their response? To help and support the people around them so that nobody else has to go through what they did or at least not be alone while they do so.\n\nLashing out might be an emotional response, but it is still one that you choose to give into! The rest of us do not choose the paths you go on. That’s why we choose to leave you behind. You give in to the worst of your impulses","score":22,"comments":[]},{"body":"If losing my basedness means I get to lead a happy and normal life? Sign me up","score":22,"comments":[{"body":"Chad.","score":6,"comments":[]}]},{"body":"And he whines about normies wanting him to \"turn on his former brocels\" when that is EXACTLY what they all do, if one of them actually finally somehow gets what they all want (sex) and \"ascends\". They are immediately betrayers, who needs to be shamed and doxed. When I asked one of them who dmed Me why he would stay among such \"friends\", he said that if any of them got sex, they were never real incels to begin with, and they don't like infiltrators. Morons. They want no help.","score":17,"comments":[]},{"body":"Why is he trying to sound scary? Bro you sound edgy at best, knock it off 😂","score":11,"comments":[]},{"body":"The only thing I want from an incel is to not be around me.  I do not want to deal with their shit.\n\nIf they think that someone wants them dead and to shit on their graves, they  are fucked up in the head because I guarantee you no one is thinking about them at all.  Unless they are are in people's faces with their awkward, needy selves.\n\nI've gotten pointlessly addicted to reading about these train wrecks so I don't know what that says about me.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I'm noticing an option you conveniently didn't add... (hint: it's yourselves)","not_safe_for_work":false,"locked":false,"body":"","score":48,"comments":[{"body":"Option: their own miserable disgusting characters. \n\nI mean blaming others is part of their pathetic lifestyle and mind set.","score":15,"comments":[]},{"body":"I see.....\nAs I'm a jew and part of this conspiracy who wants to join my Harem and make sure that all the incels are doomed to masturbation","score":11,"comments":[{"body":"I am offering myself as your x wife. Let’s destroy them","score":6,"comments":[{"body":"Ok X-Wife let's go adopt some children because we don't have time to incubate them and I wouldn't want to cheat on my girlfriend then we can doom the Incels to bashing the helmet crab","score":5,"comments":[]}]}]},{"body":"The jews?? The n word? These are random💀","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"As a Black man with Jewish family members, I'm sorry for making you stub your toe this morning. :P","score":5,"comments":[]},{"body":"I should be used to it but everytime i see one of these undoubtedly not black incels use the n-word is still shocks me","score":4,"comments":[]},{"body":"Another possible option: each other, like crabs in a bucket","score":7,"comments":[]},{"body":"I'm in 4 out of 6 of those categories, so it's probably me, its my fault","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Pure narcissism at this point. Wtf is wrong with these people?","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"First comment is a woman sharing her r4p3 story and an self proclaimed incel calling her THAT","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"He chose the behaviour, let him face the consequences. \n\n\nOh look, he already is, when nobody wants to date him.","score":4,"comments":[]}]},{"title":"During the pandemic, it was already settled science that vaccines work. You being too stupid to understand basic science that is over 100 years old does not invalidate it. There is no need for censoring when you are a complete and total idiot.","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"Rich coming from the place of gathering on .is that regularly bans people for having a different idea, no matter how harmless.","score":6,"comments":[]},{"body":"&gt;Why do you need to censor it?\n\nIf we were in a burning building and the fire alarm was going off, and people were being instructed to leave the building, it would make perfect sense to censor people who were lying and saying \"the building isn't really on fire!!!if you go outside they're going to shoot you!! because it's 1. A fucking confusing  lie that causes panic and confusion and 2. Puts people at risk for burning to death. \n\nThat's why. It's not bc we think you're against the government; I don't give a fuck if you don't like the government. It's about basic public safety.","score":4,"comments":[]},{"body":"is not censoring, it's ignoring the stupid anti vaxxers, because if it was about censoring then all the anti-vaxxers and covidiots would already be censored heavily","score":4,"comments":[]}]},{"title":"Yeah no, this one is on you, we do not condone it nor want it.","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"Suicide is a personal choice. We all want you to go to therapy. Big difference.","score":8,"comments":[]},{"body":"Incel doesn't comprehend suicide vs homicide.","score":3,"comments":[]},{"body":"what? that doesn't make any sense whatsoever\n\nme ignoring you doesn't change a damn thing","score":2,"comments":[]},{"body":"Incels *explicitly* tell each other to \"LDAR\" or outright \"KILL YOURSELF BECAUSE YOU'RE A SUB-7FT. VIRGIN!!!111!\" 🙄 \n\nThey bully each other to stay in the cult, discourage any non-sexual interests as \"copes\" and the millisecond one does tow the line, they're dubbed \"fakecel\" and excommunicated from the cult, so members self-sabotage any chance of real improvement to stay with their \"brothers\".","score":1,"comments":[]},{"body":"I don’t want anyone incel or not to commit suicide it’s definitely something I will say a big NO too, because it’s a saddening time for loved ones to go through. \n\nI’ll say go to therapy, if you are suicidal speak to someone about it, like contact your suicide helpline and get yourself mental health treatment as much as you can.\n\nIf your an incel and sex is what you want and intimacy isn’t what you really want then there’s no harm with paying a sex worker for it because you get experience as well as you wouldn’t be a virgin no more and therefore can move on with your life there’s some normies who pay for sex and also chads too who pay for it and some keep going up them until they’ve found themselves a GF","score":1,"comments":[]},{"body":"meanwhile incels actually, directly, willingly, kill us, then brag and threaten to kill us again. quit playing the victim, y'all lost that privilege the second ER the likewise happened","score":-1,"comments":[]}]},{"title":"So if you’re simply not attracted to someone it’s fine not to want to be with them. Huh.","not_safe_for_work":false,"locked":false,"body":"","score":244,"comments":[{"body":"Okay, listen blackpilledn... (nope, not gonna even address you by your username. Be better): nobody is trying to gaslight you into being gay. It doesn't work that way. If you _choose_ to believe in clearly horrible beliefs that repels women, and have a misogynistic worldview, then you are **voluntarily choosing** to make it harder for you to attract women. You are a \"volcel\" because you _choose_ to be.\n\nIt's simple: _choose_ to reject misogyny. _Choose_ to reject echo chambers like Incels.is that only pile on to keep you down. The other members of that forum are _not_ your comrades that celebrate your life's successes. They are not a support group; they are a crab pot, and crawl at you and bring you down for even trying to better yourself.\n\nChoose better. Choose to leave inceldom.","score":75,"comments":[]},{"body":"so they get to reject people they are not attracted to but women are not allowed to? **make that make sense**","score":77,"comments":[{"body":"It's part of that not seeing women as actual human beings thing they do.","score":43,"comments":[]},{"body":"Duh because objects cants say no. It’s not his fault that women aren’t property he can’t buy and sell!","score":20,"comments":[]}]},{"body":"Nobody is gaslighting them.\n\nWe’re quoting them.","score":41,"comments":[]},{"body":"So close... so damn close to getting it","score":25,"comments":[]},{"body":"Incels aren't even capable of attracting \"ugly foids\" and have had frequent meltdowns over the fact that they were desperately trying to get with \"landwhales,\" who had the self-respect to *not* be as desperate as incels and tell said incels to kick rocks. \n\nIncels are \"volcels\" because they repeatedly and consistently PROVE to believe their own bullshit instead of getting their shit together. Hell, it's to the extent that they worship a dead idiot terrorist who was too scared and incompetent to even TALK to the pretty white women he felt entitled to! \n\nSo incels are volcels because they *choose* to be too toxic and antisocial for any woman in her right mind to want and'll sooner blame their appearance than their behavior.","score":28,"comments":[]},{"body":"So, what you sayin' is...\n\nNobody can force you to be with someone you don't like and feel attracted to, and that it's ok to have standards, likes and dislikes?\n\nwould you look at that","score":15,"comments":[]},{"body":"This guy can’t attract any woman, let alone one he thinks is ugly.","score":10,"comments":[]},{"body":"They seem to have trouble using language. Somebody should tell them there are free dictionary apps.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Every time they mention roast beef flaps, I become more certain that they've never seen a vagina. Or roast beef for that matter.","not_safe_for_work":false,"locked":false,"body":"","score":903,"comments":[{"body":"&gt; Children love you for who you are, not what you have\n\nThats a fucking lie-","score":440,"comments":[{"body":"Seriously. I'm relieved bc it's 100% obvious this person has zero experience being around children. I love my children but jfc they would be garbage grownups. My kids are pretty great for their ages, but it's a nonstop job to remind them of how to behave.","score":281,"comments":[{"body":"And that thing about never having to argue about what to eat? This person has never met a human child, which is definitely for the best.","score":121,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"fr either its complete bait which, I've never understood that, ive seen so many posts of them saying \"oh we love trolling IT nerds by making ourselves look like complete monsters, epic prank, we sure gottem\" or they dont even remember how terrible kids in school were and theres no way these losers didn't get bullied in school. I mean im no psych profiling expert but to be so convinced that women are evil, \"chads\" are assholes etc theres no way they didnt get bullied in school and then form their whole view about how shitty children behave.","score":70,"comments":[]},{"body":"What this disgusting rant boils down to is that children are easier to manipulate, control, and abuse. Literally every single one if his points is: \"Adult women expect you to treat them like human beings with their own lives, hopes, and free will, but ain't nobody got time for that when you can much more easily control and manipulate children into being your sex slaves!\"\n\nAnd that's literally all these guys MO. Don't better yourself or do absolutely anything to make yourself a human being people actually want to be around. You can continue to be a raging dumpster fire of a person, just find some poor girl (the younger the better) who doesn't know any better and is easy to use and abuse.","score":65,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Easy to get along with? Thankfully this person doesn't spend time with children and it shows. They're literally all ego. They have zero manners because they're not fully developed in all ways.","score":259,"comments":[{"body":"Fr fr kids can be the best and worst thing at the same exact time. Like I've worked with kids when I was a babysitter and sub at a daycare and they can be super friendly and funny AF but they also usually don't have filters, can say some of the meanest stuff without batting an eye, and have a lot less impulse control, etc. Some kids are super polite, but that's not really the norm lol. If a kid thinks someone is fat or ugly they will just say it without thinking much of it lol, kids are chaotic AF 😂","score":73,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"It's sickening knowing that you could walk past somebody like this in the store and you would have *no idea.* I'm baffled that these people even exist. The internet was a mistake. \n\nStuff like this is why I don't trust strangers at all, and don't talk to anyone outside of my immediate family and friends. I would rather be safe than sorry.","score":79,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If you think a CHILD is “objectively hotter” you need to be in prison, never mind the rest of this post","score":204,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Clicked this image and saw it expand way too much. Somebody just please tell me it's a go for a crusade","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"🙄 Unlike you, we don't actively take glee in the thought of your demise","not_safe_for_work":false,"locked":false,"body":"","score":16,"comments":[{"body":"I want them to go to therapy, work on themselves and to stop bitching online. I also want them to just leave me alone and to never talk to me but I'm like that with the \"Chads\" as well. \nEveryone needs to go to therapy\n\nYou would think the wedding ring on my finger would be enough for them to leave me alone, but no. Hell I had a guy hit on me when I was 5 months pregnant.","score":4,"comments":[]},{"body":"I’m constantly scanning my environment like the terminator to identify sub 5 males to look down on","score":8,"comments":[]},{"body":"Most of the time I dont even recognize people I know, when I am out in public.  Let alone sub 5 males.","score":3,"comments":[{"body":"I had a girl that I went to elementary school with. Kindergarten all the way to 6th grade. I can't remember names for the life of me. So I was like \n\"Oh Lisa \" and she looks at me and goes \"Lesley\" and I missed the mark. It wouldn't have been so bad if she hadn't remembered me but she did.","score":1,"comments":[{"body":"😳","score":1,"comments":[]}]}]},{"body":"Women don't want you dead. They just want you to leave them alone. Also stop the rape/murder fantasies. You come off as a total dick.","score":6,"comments":[{"body":"\"total dick\" is an understatement","score":2,"comments":[]}]},{"body":"More projection.\n\nIncels are the ones committing murders. \n\nNobody’s bothering them.","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"'Incel factor' shouldn't be ruled out in Idaho killings: Former Unabomber investigator","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"DUH...\n\nWe didn't call it \"incel\" way back then, but anyone with half a brain knew this was related to him being bad with the ladies.  \n\n\nEDIT: Or rather likely due to that.","score":2,"comments":[]},{"body":"Inces be getting shitty. It doesn't matter if not all of them are doing this. The percentage of this group is a lot higher than most groups. Woman as a group? Very, very nearly mom existent percentage of shooters. White males? Pretty high percentage in number of all shooters. Incels? If not equal to, probably have surpasses that of white men.","score":2,"comments":[{"body":"Correct me if I’m wrong but aren’t the majority of incels white dudes with a small percentage of  ethnic minorities","score":4,"comments":[{"body":"I wouldn't doubt it.","score":1,"comments":[]}]}]},{"body":"Could’ve told you from the start it would be likely an incel.","score":1,"comments":[]},{"body":"You know incels are becoming a problem when mainstream news networks are talking about them so openly.","score":1,"comments":[]}]},{"title":"We want you to leave because your \"Blackpill\" is all lies, falsehoods and delusions. Learn reality and how things really are.","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"He used a lot of words to say absolutely nothing. He could have just typed “waaaaaah” for the same effect. Another example of them making stuff up to get mad about. They think that we haven’t seen the way that they try to stop their fellow incels from actually moving on and improving their lives. Presumably they want to stay miserable and alone, because that’s the only way that they know how to be.","score":5,"comments":[]},{"body":"I’ll go on record as saying that I’m very open to seeing ‘ElliotRodgerGod’ who is ‘LanzaMaxxing’ suffer","score":4,"comments":[]},{"body":"Im not actively wishing suffering upon incels but I'm also not going to shed any tears over it, considering most of their suffering is self-inflicted. \n\nAn exception to this is the pedo ones. Those guys can [DATA EXPUNGED].","score":2,"comments":[]},{"body":"As with all cults, religions and conspiracies...you are angry towards the wrong people. If you think good looking people run the world, you are dead wrong. Look at all those goblins like Elon Musk, Mark Zuckerberg or Jeff Bezos...none of them are good looking, half of them aren't even terribly intelligent. They are just utterly ruthless and come from old money. They suck the life out of the planet and destroy society and humanity's future...you should be angry towards those leeches. \n\nMen and women are in the same boat...we're equally fucked. Everytime you spout misogynistic/racist/ideological nonsense, a pos like these mofos comes in their pants from the lowly peasants quarreling. And of you cannot see this bigger picture, you might not be as smart as you think you are.","score":2,"comments":[]},{"body":"I’m not going to lose any sleep over some basement-dwelling douche choosing to wallow in his own misery, tbh.","score":1,"comments":[]},{"body":"/r/ImTheMainCharacter","score":0,"comments":[]},{"body":"just leave us alone 😭 do y'all incels have nothing else to do besides whine about not getting women? Y'all dont have hobbies, jobs, friends, or any stress about ANYTHING else?","score":-1,"comments":[]},{"body":"[removed]","score":0,"comments":[{"body":"Your submission has been removed due to violating Rule 2. Do NOT encourage any harm towards anybody, no matter the circumstance. Thank you for your understanding.","score":1,"comments":[]}]}]},{"title":"Why The Far Right Are So Weird About Sex | From #NoWanks to hating female sexual empowerment, the far right has a weird relationship with sex. VICE’s Tim Hume explores the “manosphere’s” links... | By VICE | Facebook","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[{"body":"Yeah, there is a lot of crossover with those groups. Like how we see common sentiments posted here, r/niceguys and r/neckbeardthings \n\nUse of “cuck” is something that I’ve noted before. They use it to mean basically anything that isn’t outright woman-hating raging misogyny. With incels, even being friends with women gets described as “cucked”.\n\nA lot of alt-right mindset has made its way into the incels. They even use “Pepe the frog” all the time. It’s all a bunch of angry little men, who start out thinking that trolling and being edgy is cool. Over time they become desensitised to the sick shit that they post. So they become more extreme. \n\nMost of it seems to lead back to them needing to blame an “other” group for everything that they hate about their lives. Instead of taking responsibility for themselves.","score":9,"comments":[{"body":"The use of \"cuck\" stands out to me because cuckoldry is a kink / lifestyle many take part in, it isn't something to be ashamed of for those who enjoy it, clearly they just hate all sexually liberated or empowered people, especially women and in most cases of cuckoldry the woman is the empowered one","score":3,"comments":[{"body":"That’s pretty much the basis for the right-wing, along with praising the rich and hating the poor. They’re obsessed with everyone else’s sex life. Wanting to force people to live by their beliefs. Like Texas has a law banning the sale of sex toys, and you’re not allowed to own more than six dildos. They really have an issue with women enjoying their sex lives.\n\nIncels have just assimilated the language and imagery of the alt-right. From what I’ve heard, Steve Bannon is partly to blame. He sees them as another group within his online army of angry young men, spreading hate and disinformation.","score":2,"comments":[{"body":"Makes sense that they flock to the right especially since they hate women, it's the right that's banning abortions, banning contraceptives, they want people with uteruses to be baby machines","score":3,"comments":[]}]}]},{"body":"Well cuck me","score":2,"comments":[]},{"body":"We need to claim Pepe the Frog because Pepe is hilarious.","score":1,"comments":[]}]}]},{"title":"Yet they do because unlike you, they are kind human beings . You are only humanoid. See the light and be kind and human too. We are waiting for you","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"I don't get the point of the mental gymnastics to just hate on women and even men in healthy relationships based on respect, kindness and equity.","score":7,"comments":[{"body":"The point is so they avoid looking into the mirror at all costs.","score":3,"comments":[]}]},{"body":"heh, I feel called out. One of my ex was burned and had half his face melted. He was a wonderful human being, and I definitely didn't date him out of pity. He was a painter who helped us renovate. So he wasn't rich either.\nAnd I wasn't his only date either. He had girlfriends, and he's married with kids now. He's just a wonderful 3 dimensional person with a hilarious sense of humor and just genuine kindness.\n\n\nIn short, all the things you are lacking, dear incels on .is","score":2,"comments":[]},{"body":"Air Force Times regularly does human interest pieces on airmen severely injured in combat living their lives. Full lives, with friends and lovers, hobbies and work. By severely injured I mean lost multiple limbs, had their hair, ears and noses burned off, significant deformities caused by injury.  I imagine the other services' papers also carry such stories.  Plenty of examples, if you bother to actually look for them.","score":1,"comments":[]},{"body":"ah yes cause as we all know, burnt face = rich","score":1,"comments":[]}]},{"title":"Statistics...","not_safe_for_work":false,"locked":false,"body":"","score":281,"comments":[{"body":"Their perpetual refusal to acknowledge single women exist really leads to some interesting mental gymnastics.","score":212,"comments":[{"body":"plus his maths includes the newborns, and the really elderly women\n\nthat baby that just was born 5 minutes ago? she already has a boyfriend\n\nthat 95 year old lady down the road?, yep, boyfriend!","score":120,"comments":[{"body":"The thought of a baby mogging an incel is somehow hilarious to me","score":84,"comments":[{"body":"I'm pretty sure i've seen that exact thing here before. some incel getting jealous about girls getting excited about a new baby in a stroller or something of that ilk.","score":42,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Also there are lot of women that date....you know.... not men","score":44,"comments":[]},{"body":"Not to mention the lesbians 🤣","score":29,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"&gt;There is twice as many men as there are women\n\nso, given that the whole female population is almost 4 billion, that means that there's almost 8 billion men, for a grand total of 12 billion humans\n\nMaths!\n\nwait, what do you mean we're 8 billion with almost an exact 50/50 split? NONSENSE!","score":71,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Wait until he finds out there are more women than men in the world","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I love how much of a hard on they have for making up statistics.","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Me, a lesbian, who doesn't have \"my own boyfriend\":","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This incel loves both Kanye and apartheid","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"Apartheid ended about 30 years ago. Dude reminisces about a white supremacist regime that doesn’t exist anymore, what a loser.","score":5,"comments":[{"body":"They're always harking back to the \"good old days\", when men were men, and the \"inferiors\" knew their place.","score":2,"comments":[{"body":"Funny thing is, these people forget that those they love to imagine being oppressed fought back and sometimes returned the violence inflicted upon them.","score":1,"comments":[]}]}]},{"body":"The fact that he doesn’t understand why it’s inappropriate, goes a long way to explaining why he’s an incel. As usual, it’s not his looks. Just like it’s not Kanye’s looks or height that are the issue. The guy apparently can’t even recognise Kanye’s repeating pattern of inappropriate behaviour. It’s common knowledge that he has mental health issues, that he refuses to get treatment for. Guess that’s why an incel relates to him.","score":2,"comments":[]},{"body":"What a weird thing for this incel to be angry about.","score":0,"comments":[]}]},{"title":"Drinking tap water makes me gay &amp; less attracted to CP // Openly admits to watching CP","not_safe_for_work":false,"locked":false,"body":"","score":241,"comments":[{"body":"TLDR: “I dont get hard from watching ch*ld pornography anymore after drinking tap water because the jews spiked it with estrogen” \n\nYou really cant make this up","score":256,"comments":[{"body":"How on earth do you become that detached from reality? I truly don't get it.","score":99,"comments":[{"body":"These kind of things are nuts but have a linear progression. You start believing one small thing - \"my disability money is being stolen by welfare leeches\". Once you believe that one thing, it's like a stair. You step up onto it and the next step becomes a little more accessible. Next thing you know, you're at the top of the staircase, and the shit you're saying is just insane, like \"illegal immigrant drug dealers are coming to out fentanyl in my kid's candy!\"\n\nWhat's really sad is that it's very hard to deconstruct, but very easy to get to. Deradicalization is a lot slower and harder than radicalization. Once someone hits a certain point it's going to be hard to yank them back to reality.","score":46,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Do these morons just think there’s a specific non-drugged water source for Chads? Where’s the water that turns Chad femme?","score":112,"comments":[{"body":"How do you think Stacys exist? THEY won't tell you the truth but let me clue everyone here in. Need to be quick before their Beta slave hunters known as \"po-liceee\" find me....\n\nSee, in the beginning, Chads were everywhere. But there were only a limited amount of Stacys. Naturally the most rich and powerful Chads hoarded the natural-born TruStacys for themselves. But between Lowborn Chads rising up for what's rightfully theirs and their fellow High Chads waging war to acquire more Stacys for their harems, the Chads almost wiped each other out.\n\nIt was then that, secretly, the Council of Chads was formed to address the matter. TruStacys were a prize, yes. But all this conflict would mean Chads would die out if a compromise wasn't reached. Thus did the Council of Chads turn to their best bros, men who were almost as good looking, but also extra smart: the Brads.\n\nUsing this new thing called \"science\" the Brads informed the council that they had developed a way to turn thlese unruly lowborn Chads into Stacys, if only they could be convinced to submit to the process. The easiest way was to trick them, so the Brads used their influence in Civilzation's infrastructure to lace simple drinking water with the chemical. Only The Council and other High Born Chads would be able to afford pure, uncontaminated water. It worked, and ever since there has been a relative balance between Chads and Stacys, thanks to the unwitting sacrifice of the Lowborns.\n\nEDIT: God dammit i shouldn't have done this. Now I'm thinking up more to add to this absurdity. Maybe if people want more I'll write up more of the Secret History of Chads and Stacys","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I hear everytime cartmans voice, when reading similar shit.","score":58,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This is your brain. 🥚\n\nThis is your brain on incel ideology. 🍳\n\nAny questions?","score":54,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"To avoid looking it up, CP is child porn and JB is jailbait","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If they were putting things in the water to stop people being aroused by that shit - I would support it… weirdly enough.","score":45,"comments":[]},{"body":"That is a lot to digest in a very small amount of words.\n\n- Man thinks Jews are putting estrogen in water to feminise the population.\n\n- Man thinks that this has been turning him gay.\n\n- Man admits to having CP and is annoyed that his being more gay stops him enjoying it.\n\n- Man goes on to say that he had been gay in the past, had \"dehomosexualised\" and is once again annoyed that Jews are turning him gay again.\n\n- Man outlays plan to degay himself again.\n\n- Man is called out on watching child porn and defends it as not being child porn because it has (older) children in it.","score":40,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Found Another One In The Wild (On a post about how OP is sick of how women are sexualized and otherwise treated unequally) BONUS: Dudes Mansplain about how being a woman is actually not as hard as being a woman","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"Woman: \"Everyday I face the possibility of violence, dehumanization, objectification, infantilization, and more because of my gender\" \n\nMan: \"Yeah, well, I can't get my dick wet, so we're even!!!\"","score":16,"comments":[{"body":"Exactly! Holy crap you can't even make this shit up they're so cliche.\n\nAlso, they won't even admit we're even, they think they still have it worse. This is a Christian cis het dude too. 🙄🤣","score":4,"comments":[]}]},{"body":"Complains he can't even get \"friend zoned\", when he would surely complain about how he got \"friend zoned\".","score":9,"comments":[]},{"body":"Women, on average, work 90% the number of hours that men do. This is largely due to there being over twice as many women in part time work as men, fully 25% of all women in the workforce are part time, not because women as a whole are spending less time at work.  And despite working 90% of the hours, women only get about 80% of the pay.  In fact if you go to the bureau of labor statistics, you can look up, across the board, the extreme differences in pay based on gender and race despite the experience, job duties and qualifications being the same. The US military,  across the branches, has ongoing studies on how white men promote faster than any other demographic in the military and has been instituting policies, like removing names and pictures from packages going before the promotion boards.  \n\nAlso, if \"beauty standards\" come from women's jealousy, why are most fashion designers men and why are dress codes for femme presenting people, even for little 6 year old girls in elementary schools, largely based on not \"distracting\" or turning men on sexually?","score":5,"comments":[]},{"body":"Well, he's right about one thing. Women choose lower paying jobs.\n\nFor example, men choose jobs like: Mechanical engineer, doctor, pilot\n\nWhile women choose jobs like: Female mechanical engineer, female doctor, female pilot","score":6,"comments":[]},{"body":"That was a messy read. Beauty standards were created by men, that's just a fact for both genders. Some women perhaps enforce these standards in modern times but I cannot think of an example where women have set the standard. The standard exists because it is based on what men find attractive in women. Male beauty standards exist because it's what men perceive is attractive about men. Western beauty standards can probably be attributed to the Ancient Greeks and with the exception of the Spartans, their view on women was abysmal. \n\nWhat's more revealing is the emotional rant. He doesn't understand his own issues and is projecting that hard onto women; the needs he talks about women having isn't something I recognise, it's stereotypes he's decided are facts. Women generally being more able to talk to one another about their issues is a good thing actually and more men should forge similar relationships.\n\nHe's not wrong in men being emotionally uneducated but his experience with an emotionally neglectful mother has discoloured his reasoning. I know therapy is a classic reddit response but this seems like its still negatively affecting him. Also childbirth is still dangerous. Now more dangerous in places like the USA thanks to abortion apparently not being a reproductive right anymore.\n\nThis is more of the oppression Olympics, just don't be a duck and listen sincerely when people express their issues. If your knee-jerk reaction is always \"but what about my issues :(\" you're not listening and probably about to be a dick.","score":3,"comments":[]},{"body":"Oh yes, because someone's feelings getting hurt, because people are rightfully trying to protect themselves from proven danger is wayy worse than being sexualized for having a body!","score":3,"comments":[]},{"body":"How the hell would he know, he gets no right swipes? He may get tons of them. Just not from the girls he swipes right on .","score":2,"comments":[]},{"body":"The first guy doesn’t believe in sex before marriage, but he’s using Tinder 🤦‍♂️ These idiots keep using a famously shallow app that’s frequently used for hookups, to find their supermodel, virgin, wannabe trad-wife.\n\nWTF has being in a college town got to do with friendships? The entire town isn’t going to be students. If he can’t even make friends, then it’s clearly not his looks that are the issue.\n\nThe second guy clearly needs professional mental health treatment. Taking his issues from his childhood, and using that as an excuse to be a dick to women. If he got locked outside and told to go away, then perhaps he’s just really annoying, and always has been. One of those assholes, with an entitled attitude, that means they can’t take a hint.","score":2,"comments":[]},{"body":"Why are you on tindr if you don't believe in sex before marriage. I didn't want hook ups so I didn't go on dating websites because that's they are. Especially tindr. He could be on Christian mingle or some shit","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Bro… humans aren’t objects","not_safe_for_work":false,"locked":false,"body":"Straight from Youtube Shorts comments","score":20,"comments":[{"body":"&gt;A woman's value is never her own.    \n\n\nBelieve that all you want there, bub...a woman will never be your own either.","score":5,"comments":[{"body":"Facts","score":3,"comments":[]}]},{"body":"He completely failed in making the argument that he thinks he did. Also, his example is music videos 🤦‍♂️","score":4,"comments":[{"body":"Argument ad music videoum?","score":2,"comments":[{"body":"Sounds about right","score":2,"comments":[]}]}]},{"body":"I'm legit not sure if this was written by an incel or a very depressed radfem.","score":4,"comments":[]},{"body":"People aren't cargo, mate","score":2,"comments":[]},{"body":"Men make those videos, kid. They reflect men’s fantasies, not reality. \n\nYou cannot assign value to another human being. We exist outside your puny mind’s reckoning.","score":2,"comments":[]},{"body":"Lmao, imagine genuinely believing that your inherent worth as a person depends on the braindead opinions of other people","score":1,"comments":[]},{"body":"And we value does he have; on the internet and forever screaming into the void. Empty vessels tend to make the most noise. Empty, useless, cretin. I think he should stay online though, this way he's only a block button away from being what he is in real life: annoying, loud mouth, maiden less, tactless, tasteless, bitter bitch boy.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"Found in Facebook wild.","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"Facebook is a goldmine for nasty things and people.","score":6,"comments":[]},{"body":"I just love how they openly show off their red flags. One would wonder why they are never able to get a lady with such enlightening views. 🙄","score":5,"comments":[]},{"body":"This why I deleted my Facebook account","score":4,"comments":[]},{"body":"Guaranteed that he cries about why his mother never loved him, before ranting about how women are sluts for not having sex with him.","score":5,"comments":[]},{"body":"Im just surprised he actually changes underwear often enough to use it as a comparison to the “cock carousel”","score":3,"comments":[]},{"body":"Why tf can't we expose and dox these people lol","score":2,"comments":[]}]},{"title":"Sure buddy...","not_safe_for_work":false,"locked":false,"body":"","score":30,"comments":[{"body":"This is why they're hopeless and will die alone","score":11,"comments":[]},{"body":"This is so... screwed up.","score":7,"comments":[{"body":"Happy Cake Day?","score":2,"comments":[{"body":"Thanks! 😊","score":3,"comments":[]}]}]},{"body":"Totally normal and healthy","score":6,"comments":[]},{"body":"Nice...cockroaches...its been 28y since the Rwandan genocide on the Tutsi, that began with calling them cockroaches and snakes on the radio and ended with over a million Tutsi dead in a few months. \n\nDehumanizing women, or any group of people tbh, will not fix the void within you. Hate has never solved anything.","score":5,"comments":[]},{"body":"“Degenerate and emotionally unstable” he does realise that he’s on an incel forum, right? A bunch of porn addicted, rape apologists, who want to fuck children, and cry that their dicks are dry. The guy is actually making an argument against himself, and his buddies.","score":5,"comments":[{"body":"Exactly! They don't realise that the anger, hatred and all those negative feelings they spew on the forum ARE EMOTIONS and because one tiny daily detail will ruin their day, they are quite literally VERY emotional unstable.","score":3,"comments":[{"body":"Completely agree. When they’re not whining about how unfair it is that women won’t fuck them or displaying their anger issues, then they’re talking about killing themselves. They are peak emotional instability. Which is why many of them are clearly in need of professional mental health treatment.","score":2,"comments":[]}]}]},{"body":"I still think if they hate women so much,  they should just go fuck each other.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Things incels say","not_safe_for_work":false,"locked":false,"body":"","score":1852,"comments":[{"body":"the entitlement of them mf's lmao\n\nwhat he meant wasn't that they stole \"two men the lifetime chance of having two beautiful wives\"\n\nbut that they stole ***him*** the chance of having one","score":453,"comments":[{"body":"You can't steal something that doesn't exist","score":207,"comments":[{"body":"Savage","score":80,"comments":[]}]}]},{"body":"Even with these two ladies unavailable, I doubt that does anything to his chances. Anything at all. To his very slim chances.","score":228,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Imagine getting triggered by the sight of 2 lesbians because you can't stop viewing all women as a zero sum game that reminds you of all the pussy you've never gotten","score":182,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Sir I guarantee you that gay women are precisely not who you want to marry if your ultimate motivation for marriage is to have unlimited access to sex…","score":149,"comments":[{"body":"Strongly doubt those dudes care about consent ☠️","score":50,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"By that logic alone the existence of gay men already makes his argument invalid","score":78,"comments":[{"body":"And gay men are more in percentage even so there are less straight men than straight women yet they still fail 😂","score":38,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"How about you and your good friend date each other instead","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"did r/peniscels get banned","not_safe_for_work":false,"locked":false,"body":"I made a troll post on there and i made those guys mad. And after like a week, i did not get replies anymore. I went to check, and didn't find anything. If it got banned, thank god.","score":28,"comments":[{"body":"Yupp,  they found refuge elsewhere.","score":17,"comments":[]},{"body":"Their only mod got banned. You can’t have a sub without any mods.","score":8,"comments":[{"body":"Oh","score":2,"comments":[]}]},{"body":"They moved to r/soycels","score":5,"comments":[{"body":"Soy? that's the best prefix they could find? Aren't they obsessed with calling other people soy-boys or something?","score":7,"comments":[{"body":"Yeah, but going off of the sub bio it looks like the name is to refer to us normal people, they're calling us the \"soycels\" meanwhile incels are just innocent sad lonely men","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"They can’t never hide cause they somehow need to incorporate “cels” into every fucking name, title and noun.","score":2,"comments":[]},{"body":"Huh, it’s totally empty for me? Did they sense I had more game then them and refused to let me in?","score":1,"comments":[{"body":"It's empty for me too, they're too scared to post anything because they fear they'll suffer the same fate their precious r/peniscels met","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"I just published a book about Elliot Rodger and why Incels kill","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"The author: Chad Bradford....I'm dying!","score":5,"comments":[{"body":"Yeah, it was the author's choice to use a pseudonym, so I left it up to them to decide. There is a singer and an ex-baseball player with the same name, but I doubt there will be any confusion.","score":2,"comments":[{"body":"It's perfect!","score":1,"comments":[{"body":"I'll let them know you said that.","score":1,"comments":[]}]}]}]},{"body":"Most of these are just basement dwellers, but there are definitely some that need watching closely.","score":2,"comments":[{"body":"Absolutely. You'd be surprised by how many take their victims status seriously enough to act out.","score":3,"comments":[]}]}]},{"title":"Do Incels evolve?","not_safe_for_work":false,"locked":false,"body":"I'm curious, have any if you ever witnessed an Incel get out of their Narcissistic Breakdown?","score":1,"comments":[{"body":"The ones that buy into the black pill devolve.","score":4,"comments":[]},{"body":"At level 15 they become redpilled, at level 24 they become incels and at level 36 they become rapists\n\n\"WHAT? incel is evolving?\"\n\n\\*evolving music\\*\n\n\"CONGRATULATION! your INCEL evolved into RAPIST!\"","score":4,"comments":[{"body":"I'm now terrified to have a daughter... incase she encounters one in the wild","score":4,"comments":[]}]}]},{"title":"The nurses in my psych ward fantasize about getting raped by me","not_safe_for_work":false,"locked":false,"body":"","score":174,"comments":[{"body":"His delusions are presumably why he’s locked up.","score":143,"comments":[{"body":"Someone looking at you means they are actually fantasising about being brutally raped by you. Beyond insane thought process.\n\nAnd yes, he is genuinely in a psych ward/mental institution based off his posts. Let's hope for society's sake he stays there.","score":76,"comments":[{"body":"It sounds like they need all males nurses on his ward. Guys like him are a danger to any women around them.","score":32,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I was just going to say...","score":19,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"As someone who has bpd I can confirm that she definitely went home and had an amazing time with her bf and didn’t give him a second thought XD","score":54,"comments":[]},{"body":"You can tell this guy lives a rich inner life. His fantasy world is super interesting. He should write a fiction book someday.","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Wow. The voices in this guy's head are singing barbershop together 😳","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"How does he know she has bpd? I once met someone who was convinced every girl that looked at him had BPD because he was attracted to them “I just know” 🙄 dude she was monitoring you so she could chart.","score":28,"comments":[{"body":"This guy clearly exaggerates things in his head so \nI’m guessing she is nice most of the time but sometimes gets mad when he or the other patients are misbehaving. Instead of seeing this as a person going through a normal range of emotions, he thinks she must have BPD. He is also probably trying to bring her down to “his level” in his mind. Clearly he has some mental illness if he’s in there, so she has to also have one in order for him to be better than her.","score":19,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"It's their job to keep an eye on you, dummy.","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Because we're not stupid and can see right through that shit?","not_safe_for_work":false,"locked":false,"body":"","score":80,"comments":[{"body":"“If women like people with good personalities, why isn’t my fake personality winning them over?”\n\nYou’re not as good at hiding your personality as you think buddy","score":76,"comments":[{"body":"Yeah, looks don't matter, but personality does.  Also helps if you have a moral compass.","score":12,"comments":[]}]},{"body":"Huwhat? Your literal entire post contradicted itself from the start.\n\nYour personality is that of a manipulative abusive selfish narcissistic extremely judgmental and immature man. You do extremely poorly of hiding that even in other contexts and posts man. You'd be a blatantly huge red flag 5 to 10 minutes within dating any woman. \n\nSo obviously you can't somehow trick a woman into liking you based on personality duh. 🤦‍♂️","score":44,"comments":[]},{"body":"B..c you lack personality. Incels are so dense, they can't fake it!","score":23,"comments":[]},{"body":"Some men can do that. Some abusers can hide their true self for years. Women get stuck in abusive relationships all the time and what’s disgusting here is that these guys wish they could pull off the ruse long enough to trap and abuse a woman too.\n\nThey can’t do it because it’s hard and they’re too lazy to do anything difficult that takes any amount of effort.","score":22,"comments":[{"body":"Incels are abusive men who are absolutely shit at hiding how terrible they are. Abusive men are typically very charismatic and sociable. Incels have none of these skills.","score":14,"comments":[]}]},{"body":"I mean…yeah, men do this. And they’re abusive. What’s your point?","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"« Divorce raped » 😬 they wanna be oppressed so bad","score":16,"comments":[]},{"body":"\"Why can't I just fake my way into a relationship?\"\n\nBecause you're a shut in who doesn't know how socializing works who can't fake his way into a relationship.","score":12,"comments":[]},{"body":"Because that’s a deranged thing to do??","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How dare we disrespect them?!","not_safe_for_work":false,"locked":false,"body":"","score":60,"comments":[{"body":"Polite rejection bad, harsh rejection bad,telling the truth about not being attracted to them bad,lying and trying to ''soften the blow'' bad  so basically the only acceptable response for them is for her to drop on her knees and suck them off on the spot ??","score":59,"comments":[{"body":"☝️","score":6,"comments":[]}]},{"body":"\"I have a boyfriend\" and \"You are not my type\" are disrespectful, yes, but only if they are trying to be. The wording in this situation is absolutely correct and is really respectful, so posting that is really cringe.\n\"I have someone better than you waiting for me\" and \"Sorry, I only date humans\" are examples of disrespectfulness, \"I have a bf\" and \"I don't date skinny people\" are completely valid points.\n\nThe third and fourth one are directly bad, but only on certain situations. Giving a fake phone to escape someone you feel unsafe with is correct; giving a fake phone to someone to mess with them is not","score":18,"comments":[]},{"body":"So, literally ANY rejection is disrespectful?","score":12,"comments":[{"body":"(read in Snape's voice, with extra emphasis on the first syllable) Obviously.\n\n/s","score":4,"comments":[]}]},{"body":"That's actually nice to know, so I'll keep doing this.","score":25,"comments":[]},{"body":"Okay, and that’s why women lie about having boyfriends. Can’t risk upsetting potentially violent men. Disgusting that they respect the claim of a man on us more than our own desires.","score":18,"comments":[{"body":"Even that’s not enough to stop them. They demand proof of the boyfriend, and if you actually do have a boyfriend they’ll keep asking you to leave him claiming they can treat you better than your boyfriend can.","score":10,"comments":[]}]},{"body":"And this is why women do in fact lie about having a partner. Not because it's more respectful - it's not; being truly respectful would require honesty, would it not? - but because, of those answers, it's the least likely to get us killed.","score":6,"comments":[]},{"body":"Again with the fucking percentages","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"An incel came up with another Gilead Rip-off, how original","not_safe_for_work":false,"locked":false,"body":"","score":31,"comments":[{"body":"\"Given a woman at 17 whether or no he has a job\" \n\n\"Marry as many women as he can support\" \n\nI get it, you want to be a lazy pos and neet with a sex slave, but at least be consistent with your garbage logic.","score":11,"comments":[]},{"body":"This is the single best use of this meme I have ever seen","score":9,"comments":[]},{"body":"Weather or not...\n\n\nHeh.","score":6,"comments":[{"body":"It's hard to not spell check these guys","score":3,"comments":[{"body":"I know, but is it even worth it? It's just frustrating when the idiots don't know how to speak their own language. And I get it. A lot of just use voice to text. But for heaven's safe try and proof read.","score":2,"comments":[{"body":"I'm not the grammar police, but all of these posts are my 6th grade English teacher's worst nightmare.","score":3,"comments":[{"body":"I know, right?","score":2,"comments":[]}]}]}]}]},{"body":"Dumbass can't even keep consistent.","score":4,"comments":[]},{"body":"Once again, incels have hijacked something that a woman created. They did it with the term \"incel\", which was coined by a woman, and now they've done it to Margaret Atwood, and her \"Handmaid's Tale\".\n\nCan't incels ever come up with anything original? Are they always this intellectually lazy?","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Degenerate","not_safe_for_work":false,"locked":false,"body":"","score":699,"comments":[{"body":"When the 4chan commenter is speaking sense you've spent too much time on the internet.","score":185,"comments":[]},{"body":"That reply 😂😂😂 but seriously use your cousin to help you engage with the opposite sex and learn how to treat them cos you really need the help and then when you go the bar you can get a woman you're NOT related too","score":85,"comments":[]},{"body":"no, your cousin isn't \"trying to fuck you\" she just cares about you","score":59,"comments":[]},{"body":"A family member is trying to help him and he's considering incest? Wtf","score":51,"comments":[{"body":"Too much porn","score":17,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Anon wants his cousin to be trying to fuck him.","score":30,"comments":[]},{"body":"Everything the cousin is doing is completely normal except for the massage part, it raises an eyebrow. Or maybe everyone's cousins give them massages and my family is weird.","score":32,"comments":[{"body":"Nope my family is the same we never gave massages and that is a little strange but maybe it was more of a pat on the back to cheer them up and he considers it a massage because the hand slightly moved left to right.","score":12,"comments":[]},{"body":"My mum's training to be an esthetician and she massages my whole family. It isn't sexual though","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"theyre just revolting arent they? imagine finding your cousin - who you thought you were close to - was thinking like this?\n\nurgh","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Their delusion continues to grow","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"60,000. Worldwide.  They couldn't elect a flea on a stray dog.","score":15,"comments":[]},{"body":"Go for it. After Trump we all need a laugh.","score":9,"comments":[]},{"body":"This whole incel thing is really disturbing","score":7,"comments":[]},{"body":"Yeah, I doubt it. Probably wouldn't get as many votes as some of the joke votes. I'm guessing the Incel Party would come in below Donald Duck in terms of votes.","score":5,"comments":[]},{"body":"I can't wait to see this train wreck! But then incels aren't known for their follow through or ability to do things not (in Minecraft). So I'm a little disappointed I wouldn't get to see the Black Pill Party","score":5,"comments":[]},{"body":"I can't see how they think they can become political in one country when there's so few of them worldwide. Did they just assume that somehow they can all go and vote wherever they set up at?","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Why do they think they have so many members? I keep seeing them talk about their uprising and things like that, as though they could actually amass any kind of power, but... There's hardly any of them, especially compared to populated cities/countries. \n\nPlus, considering they're an online community, aren't they kind of too spread out to all rise up in one area? \n\nThey seriously just don't think about anything.","score":4,"comments":[]},{"body":"GOP isn't enough?","score":10,"comments":[]},{"body":"JFL","score":3,"comments":[]},{"body":"In what country? I swear Americans keep forgetting other countries exist","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I have a higher sex drive than most males, so I know you're lying about all of it.","not_safe_for_work":false,"locked":false,"body":"Incels all are degenerates who lie.","score":193,"comments":[{"body":"My favourite part is the pure irony. Incels seem to have so much knowledge on women with such little interaction. It's laughable","score":130,"comments":[{"body":"It's like letting someone do surgery who hasn't even gotten their Associate's Degree.","score":37,"comments":[{"body":"It’s like someone thinking they’re qualified to perform brain surgery because they have tumors in the parts of their brain that control judgment and fine motor skills.","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Sometimes incels says that womans have low sex drive but also that all of them are whores that have a ridiculous number of sex per day. lol  Zero sense.","score":74,"comments":[{"body":"Schroedinger's Vajayjay.","score":36,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"\"Lose affection\" wait until they find out you can experience non sexual affection- romantic or even platonic affection are valid","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"Of course you won't literally die from not having sex.\"\nThen you don't NEED sex my man. You just really WANT sex. Totally different.","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You’ve never seen a man who has never had sex live a happy life?\n\nDalai Lama seems pretty happy.\n\nSo does the current pope.\n\nI mean, these are pretty prominent people (probably because most people don’t define themselves by their sexual experience) but you’d have to be wilfully ignorant to ignore prominent people who don’t have sex.","score":27,"comments":[{"body":"Right. Many monks and such life fulfilling lives without ever having sex.","score":21,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Women have low sex drives but incels also think women are whores who have a unreasonable amount of sex. Make it make sense 🤦‍♀️","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"There is no bone to break you idiot","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"Not that I believe this story -it’s not the same as a bone break, but you can actually snap your willy- I doubt you could do it through wanking though, so this is likeliest to be bullshit","score":16,"comments":[{"body":"\"Energetic masturbation\" is listed as one of the most common causes.","score":9,"comments":[{"body":"I stand corrected","score":3,"comments":[{"body":"Given that you have to forcefully bend or thwack the damn thing while it's erect, I'm rather concerned about what exactly these guys are doing during masturbation to make that a common cause.  Sex, I get.  Lots of moving parts there.  But masturbation?","score":6,"comments":[]}]}]}]},{"body":"Why would he be afraid of the docs doing blood work on him? What terrible truths does he think are hiding in those diagnostics? What could possibly be worth ignoring potential health problems?","score":13,"comments":[{"body":"You wanna Pavlov them into being decent individuals?","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"What the blackpill does to a MF, now he's dickless, literally and figuratively\n\nand you'll never have sex calling women \"tuna wallets\", what kind of women would go like \"oh yes, he's calling me sexist names, i must have sex with him\"\n\nit's not like you could even if you had the chance 🤣🤣🤣","score":14,"comments":[]},{"body":"Obviously you crack your dick and it starts glowing like a glow stick, duh /j","score":5,"comments":[]},{"body":"you can break a dick but not from jerking off","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He damaged his nerves, just to give the full background, but not even me is mocking him for that.\n\n( and it Is something not even I am doing it means it's  too much for real)\n\nBut don't worry Incely-boy you are what you are because it was already inside you.\n\nLong story short: Incely-boy and I are in a very similar point of the spectrum, we share a similar environment background, a similar school background, a similar family background ( even if mine was worse) and i'm pretty sure he's got an high I.q. too\n\nBut we got very different outcome so...\nNice amout of excuses, Incely-boy","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"That old chestnut again, eh?","not_safe_for_work":false,"locked":false,"body":"","score":16,"comments":[{"body":"What \"rights\" do they think men are \"losing\"?","score":11,"comments":[{"body":"To be fair men have lost rights. Not to buy and sell women soooo I guess that’s one","score":2,"comments":[]},{"body":"They're pissed off because they're losing privileges. I had this argument with a friend one gay marriage came around. He was so infuriated when I told him that marriage was a privilege not a right. We are no longer friends, and I frankly don't miss him.","score":5,"comments":[]}]},{"body":"I guess I'm a meminist then.","score":7,"comments":[]},{"body":"Binary gender is fake you heard it here folks","score":8,"comments":[{"body":"All gender is fake, even agender, we're gonna have to stick with schrodinger's gender now.","score":3,"comments":[]}]},{"body":"So he won't acknowledge the binary genders?\n\n\nDid anybody tell him? No? That's gonna be a rough awakening...","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My g how am I betraying anyone? How is wanting people to be equal betrayal? Plus this shit ain't a war. and why do they think supporting people and letting them be whatever gender makes them comfortable a bad thing? Like let people be who they want to be dumbass","score":3,"comments":[]},{"body":"If I'm a traitor for being a male feminist then Palpatine was right, it IS treason then.","score":6,"comments":[{"body":"Hey feminists are smarter, better educated, happier, and have more sex so I mean…\n\nEdit statistically speaking","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What happened with AdvocateDoogy?","not_safe_for_work":false,"locked":false,"body":"tbh i just find him a really strange character and check up on his profile every 3 months or so. but hella comments from him are getting downvoted and hes saying hes not a groomer? i havent done much deep research into this guys lore but can someone fill me in on what happened? just seems like hes in denial about the whole thing lol and apparently you guys dont like him now or wtv\n\nthanks\n\nalso he hasnt posted in like a month lol - his last post was the one i was talking about","score":1,"comments":[{"body":"My understanding was that he was caught trying to groom some people via DMs and, upon evidence being presented, has been removed from IT.","score":13,"comments":[]},{"body":"He groomed a girl from the age of 13 to start dating him when she turned 18.\n\nGot caught out by some incel who did a deep dive on his Discord and various posts.\n\nGot removed as a mod from here.\n\nThat's about it.","score":10,"comments":[]},{"body":"Dang. I left IT for a while, come back and a guy who I thought was cool turns out to be a predator?\n\nReddit sure is crazy sometimes.","score":6,"comments":[{"body":"no offense but i sort of wasnt surprised lol. now that the cats out of the bag, the guy was really fugly (i dont think its a problem cause the guy is a pedo). anyone who looks that bad yet is so against the crowd who realistically looks just like him has to be in some sort of denial lol","score":-10,"comments":[{"body":"Did you think he was always ugly or are you saying that because he turned out to be a pedo? If it’s the former it ironically goes against the stated purpose of this sub and proves the blackpill.\n\nEdit: did you delete your reply? I can’t see it.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Man was a pedo","score":6,"comments":[]},{"body":"Groomer who made cringe comics.","score":5,"comments":[{"body":"I always knew why they got so little engagement but nobody wanted to say it.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Didn’t he groom a 12 year old?","score":4,"comments":[{"body":"yeah some guy dmd me explaining it thats insane man..\n\nhow u gonna get exposed by the people you love and the people you hate and they collabing?? lmfaoooo","score":8,"comments":[]}]}]},{"title":"No, you cannot be improved through surgery, you're still giant anal sphincters.","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"you can spend billions on your face, and still be a twat","score":8,"comments":[{"body":"I mean women do love twats from time to time, but only in highschool and college lol","score":-10,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Instead of working on something that he can actually improve, he posts fantasies about things that he can’t. They always have extremely unrealistic expectations. Whether that is transforming themselves into a Chad or the unicorn woman, who is a supermodel, virgin, nymphomaniac that wants to be an incel’s trad-wife.\n\nThey need to grow out of these ridiculous fantasies, and learn to live in the real world.","score":6,"comments":[]},{"body":"I don't remember the specific name but there is an extreme cosmetic surgery where they break all your facial bones and reconstruct them. It's not even legal in my country* and the recovery is long and hurtful. \n\nThen he can have his leg broken, be a couple of inches taller at che cheap price of not being able to run.\n\nThen he can go under extensive skin surgery to remove the scars.\n\nThen he can take whatever Michael Jackson took to bleach his skin.\n\nThen he can get a liposuction and have his muscles enhanced with surgery, because roids will give you acne\n\nAt this point he should be a millionaire to afford all this shit and still he'll be a walking face palm meme with a rotten soul.\n\nDude,what if you grow a beard and actually do some kind of sport? It's cheaper\n\n* Edit: I forgot to specify it's allowed if is needed for health issues or if you survive a car crash but not for cosmetic issues","score":5,"comments":[]},{"body":"I know a plastic surgeon who can make him a dolphin... https://youtu.be/KjEmcIQE9L4","score":5,"comments":[{"body":"Don't give them ideas...given what dolphins are infamous for.","score":3,"comments":[]}]},{"body":"Even if it was possible to turn into someone else entirely, surgically or otherwise, I doubt it would be affordable for  these basement dwelling, unemployed, fuckwits. And unless a whole new brain was included it would be a waste of money anyway.","score":3,"comments":[]},{"body":"Sounds like someone is thinking about hitting themselves in the face with a hammer.","score":2,"comments":[]},{"body":"*Giant anal sphincters*. A beautifully humorous way of saying \"giant assholes\". r/BrandNewSentence","score":2,"comments":[{"body":"Thank you!","score":1,"comments":[]}]}]},{"title":"Self improvement work, but you know, it is more than just being","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"&gt;\\-Wake up early every day **(bare minimum)**  \n&gt;  \n&gt;\\-Shower daily **(bare minimum)**  \n&gt;  \n&gt;\\-Brush teeth **(bare minimum)**  \n&gt;  \n&gt;\\-Good hygeine **(bare minimum)**  \n&gt;  \n&gt;\\-Dress better **(bare minimum)**  \n&gt;  \n&gt;\\-Get a basic job **(bare minimum)**  \n&gt;  \n&gt;\\-Graduate college **(very common, not really special)**  \n&gt;  \n&gt;\\-Get a haircut **(bare minimum)**  \n&gt;  \n&gt;\\-Get a good career **(very common, not really special)**  \n&gt;  \n&gt;\\-Try not to think so negatively **(common sense)**  \n&gt;  \n&gt;\\-Better diet, no sugar **(very common, not really special)**  \n&gt;  \n&gt;\\-Avoid alcohol, drugs **(very common, not really special)**  \n&gt;  \n&gt;\\-Take supplements **(very common, not really special)**  \n&gt;  \n&gt;\\-Move out of parents' house  \n&gt;  \n&gt;\\-Get a decent car **(very common, not really special)**  \n&gt;  \n&gt;\\-Invest for retirement **(very common, not really special)**  \n&gt;  \n&gt;\\-Have plenty of hobbies **(bare minimum)**  \n&gt;  \n&gt;\\-Occasional exercise **(bare minimum)**  \n&gt;  \n&gt;\\-Try to talk to people, attempt to make friends **(bare minimum)**  \n&gt;  \n&gt;\\-Attempt \"online dating\" **(bare minimum)**\n\nIf you think this is self improvement then **you don't know what self improvement means.** It's a constant process and encompasses much more than just bare minimum common sense stuff like this, everyone, including me, are always growing and improving day by day.\n\nSelf-improvement should also include **open-mindedness and humility**, the growth mindset of constantly taking personal responsibility for one's own life and always trying to see what can they do to make it better.\n\n**What you are kinda doing is the opposite.**\n\nYou are saying you have done everything, reached the supposed ending of the self improvement challenge or something...?\n\n**You did not put in a sincere effort** at actually trying to learn or listen to what sort of men are women are attracted to and have no idea what you should be doing. Because it's clear that you only listen to looksmaxx/redpill/blackpill stuff. It's the women who set the standards, not the men, and yet you assume that you already know all of what they want and that they should be attracted to you now. In other words yes it's all \"wasted effort\" but that's only because **you are close minded and arrogant.**","score":18,"comments":[{"body":"This is kind of like saying you attempted to complete a 10k but all you really did was pay the entrance fee.  You didn't train and you didn't even bother to show up on race day, but you still expect to receive the first place medal and prize money because you \"attempted\".","score":3,"comments":[]},{"body":"sometimes I hope that the incel sees a well put comment like this on their BS.\n\nBut they don't want to see that, they don't want to put the effort","score":3,"comments":[]},{"body":"I find these bare minimum comments kind of irrating because they imply that you need to be special or unique to find a partner. And then people act surprised that incels claim you need to be a top 1% man to have a chance. \n\nPlease tell what you yourself have to offer.","score":-2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That was just a list of things that people do while existing. The closest he got to self-improvement was actually trying to make friends. The fact that he only said “attempt” suggests that he was unsuccessful. Which further suggests that his social skills need improvement. That would be actual self-improvement, to develop skills that he lacks, and use those skill to make friends and improve his life.\n\nOh, and online dating. Ugh. These guys never learn. The odds are massively against you with sites like Tinder, because the ratio of men to women is at least 3:1. Plus those sites tend to be incredibly shallow. They lack the skills to even make friends, but expect to attract some incredibly beautiful woman on a site with such poor odds. It’s like them deciding to learn to swim, by doing a cross-Atlantic swim.","score":10,"comments":[{"body":"&gt;The fact that he only said “attempt” suggests that he was unsuccessful.\n\nEven if this is just semantics and he was successful in making friends. What friends? male incel friends? Friends that he may not have healthy relationships with? Literally everyone can have friends.  \n\n&amp;#x200B;\n\n&gt;Oh, and online dating. Ugh.\n\nIt's like he wants a trophy for just attempting to install an app and use it lol. Absolutely no details whatsoever regarding his profile/bio or any experiences he had with it.","score":6,"comments":[{"body":"Definitely not male incel friends. Unless he wants to start a literal circle jerk.\n\nThe thing is, that having friends typically makes us better people. Some people have families that they don’t get along with. This seems particularly true with incels. Friends are the people that should help us to learn to put other people first. We would go out of our way to help them, because we care about them. That’s important if incels ever expect to have a relationship. They need to be able to navigate friendships, before they can ever hope to handle relationships.\n\nI suspect that his experiences with online dating were a bare minimum profile, much like his bare minimum list of “self improvements”, then only swiping on women that probably get hundreds of swipes. Only to not get any matches.","score":5,"comments":[]}]}]},{"body":"Imagine, your achievent as an adult is learning to brush your teeth in 7 years😪\n\nIf this guy did not associate himself with the incel community, it would be a wholesome post from a seriously depressed person at r/congratslikeimfive\n\n“I managed so much in 7 years despite having a depression” \n\nInstead of “i did basic adulting and nobody noticed and awarded me”","score":3,"comments":[]},{"body":"Notice none of these things have to do with being a better (or more interesting) person. That, plus the fact he's posting on a site like .is, may be his problem.","score":4,"comments":[{"body":"He thinks himself to be have perfected or finished the \"self-improvement\" challenge, that women should totally be attracted to him...for literally being a normal guy with a job....oh and he \"tried\" or \"attempted\" to practice social skills, make friends and install Tinder on his phone...very rare, special and difficult work apparently.","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}