{"name":"jokes","description":"The funniest sub on Reddit. Hundreds of jokes posted each day, and some of them aren't even reposts!\n\nJoin our discord: https://discord.gg/jokes","subscribers":24777086,"posts":[{"title":"Reposts...","not_safe_for_work":false,"locked":true,"body":"r/Jokes has a search feature, input the title or punchline of your joke (before posting) and if it's been posted within the last month - please don't submit it.","score":6951,"comments":[]},{"title":"Let's discuss spam, spammers, and the spamming spammers who spam.","not_safe_for_work":false,"locked":false,"body":"What did the moderator say to the subscribers?\n\nNobody knows, because nobody ever reads what moderators write.\n\n------\n\nYes, it was a bad joke, but at least it wasn't a repost... which is *kind of* what we're here to discuss today:\n\nAs many of you are no doubt aware, spammers and bad actors have been flooding Reddit lately, and /r/Jokes has started to get hit pretty hard. Dealing with the issue isn't as easy as it sounds, though, because any action that we take has the potential to affect good-faith users. Still, we've been discussing the problem, and we've come up with the beginnings of a solution: \n\nWe're going to ban every last one of our subscribers.\n\nJust kidding! In fact, we're going to give you a bit more insight into how spammers work, what their goals are, and why they're so effective on Reddit. This information will be included on [our complete rules page](https://www.reddit.com/r/Jokes/wiki/index), which we've also streamlined and updated. (The rules themselves haven't changed; we've just made them a bit clearer and more condensed.) Our hope is that you'll be able to recognize and report spammers when you see them, which will help us keep them from gaining more of a foothold here.\n\nWe'll be taking some other anti-spam actions behind the scenes, so rest assured, we aren't trying to dump the spam-fighting on you. We just figured that it was better to keep everyone informed... because after all, /r/Jokes is a community, and a community is only as smart as its dumbest member.\n\n(Yes, the moderators count as members, and yes, we're easily the dumbest.)\n\nThank you for reading, and remember to report spam when you see it!","score":895,"comments":[{"body":" Mod: *At least this joke isn’t a repost*\n\nThis subreddit: *Bet*","score":180,"comments":[{"body":"Wat did the moderator say 2 the subscriber's?\r  \n\r  \nNo body knows because no-body, ever reads what moderators' rite\n\n1st Repost (spelling and punctuation butchered for authenticity)","score":66,"comments":[{"body":"OmG you spellerd right rong??!!","score":20,"comments":[{"body":"I kno wright! I is sew smort! It's how a genuis posts on read-it!","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"I'll have the eggs, bacon, sausage, and spam.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I have a question from reading the rules\n\nI saw \"bad-faith trolling\" is there also \"good-faith trolling\"? and what would be the difference?\n\nthanks!","score":47,"comments":[{"body":"&gt;I saw \"bad-faith trolling\" is there also \"good-faith trolling\"?\n\nI think \"good-faith trolling\" would be people who believe they are doing the right thing, like flooding a neo-nazi with pictures of happy interracial couples.\n\nAt least initially, the whole Game Stop thing was good-faith trolling.\n\nI think it is a matter of perspective.  (If you were the neo-nazi in the above example, it would be seen as bad-faith!)  However, if the majority of people seem to feel like your actions are helping [the greater good](https://youtu.be/rm--inJtnc4?t=116), then it might be good-faith.  It is easy to cause even the most earnest attempts at good into pure evil (as demonstrated by that clip).","score":52,"comments":[{"body":"....which gives birth to ECHO CHAMBERS.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"can't even post a joke, because i asked for karma in free karma subreddits in the past. I would ask that mods do something about it.","score":9,"comments":[]},{"body":"So first, spam. It’s a great canned meat that is the cat food for humans. Now onto the spammers..","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"An old man calls his son and says, \"Listen, your mother and I are getting divorced. Forty-five years of misery is enough.\"","not_safe_for_work":false,"locked":false,"body":"\"Dad, what are you talking about?\" the son screams.\n\n“We can't stand the sight of each other any longer,” he says. \"I'm sick of her face, and I'm sick of talking about this, so call your sister and tell her,\" and he hangs up.\n\nNow, the son is worried. He calls his sister. She says, \"Like hell they’re getting divorced!\" She calls their father immediately. \"You’re not getting divorced! Don't do another thing. The two of us are flying home tomorrow to talk about this. Until then, don't call a lawyer, don't file a paper. DO YOU HEAR ME?” She hangs up the phone. \n\nThe old man turns to his wife and says, \"Okay, they’re both coming for Christmas and paying their own airfares.","score":20953,"comments":[{"body":"My dad’s classic go to was saying how they had been “happily married for 40 years.” It was 58 years they were married.","score":1075,"comments":[{"body":"40 of 58 ain’t bad","score":54,"comments":[{"body":"Dude. That's roughly 69%. D+","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Wasn't there an ad were a guy fakes his death to see his family? And a parody with the family flipping out at him?\n\nEdit: https://m.youtube.com/watch?v=SHrP_Hl4xX8","score":1333,"comments":[{"body":"This is another one. But be prepared with the tissues. ...https://m.youtube.com/watch?v=54cRuDW8RQY","score":310,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"My parents were extremely happy for 30 years. Then they met each other and got married.","score":403,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A couple aged 101 and 98 was about to get a divorce.\nThe judge sadly asks \"Oh c'mon now, you've been married for 80 years, why did you decide to get a divorce?\"\n\n\"I mean, sir...\" said the woman \"We actually wanted a divorce for a long time but did not want our children to get upset so waited for them to die\"","score":2449,"comments":[{"body":"This actually happened irl and was a news story lmao","score":206,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"My dad tells people he's been married 10 good years.  This always annoys my mother who has been married to him for 49.","score":46,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Starts taking notes","score":32,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"God: Creates humans as they were meant to be.","not_safe_for_work":false,"locked":false,"body":"Also god: New rules! I need you all to cut the extra skin off your penis.","score":8706,"comments":[{"body":"Abraham standing on the mountain: “You want me to cut off the end of my WHAT?”","score":2357,"comments":[{"body":"\"Abraham, Abraham listen I want you to cut off your penis and kill your son.\"\n\n\"Why oh lord?\"\n\n\"Do not question me and do it for the Lawls!\"","score":1409,"comments":[{"body":"\"Just kidding about your son\"\n\n\"Oh phew, thanks God. Haha. Good one. You nearly got me there\"\n\n\"...\"\n\n\"... so about that other thing...\"\n\n\"...\"","score":724,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"What do you call a cheap circumcision?\n\n\nA rip off.","score":736,"comments":[{"body":"How bout a tipoff","score":31,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I need the spare skin to make the Martians. But the skin went off, that’s why they’re little and green.","score":159,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"These day 1 patches are getting out of hand.","score":156,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Times were tougher back then. Today you can recall your mails and unsend your messages.","score":21,"comments":[]},{"body":"It’s like when you send an email but forget to add the attachment so you have to send a follow-up email with the attachment","score":180,"comments":[{"body":"Except this time it's a detachment","score":134,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What's your favourite Chuck Norris joke?","not_safe_for_work":false,"locked":false,"body":" Let's start with one of my favs:  \n\"Chuck Norris’ password is the last 9 digits of pi.\"","score":257,"comments":[{"body":"when Alexander Graham Bell invented the telephone he already had three missed calls from Chuck Norris.","score":77,"comments":[]},{"body":"I'm honestly sick of these lame Chuck Norris jokes! If Chuck Norris was so good, he would come here right now and smash my face into my keyboaasbaianabakNaksosmamaksls","score":76,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When chuck Norris turned 18 his parents asked permission from him to move out of his house","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'd tell you but you wouldn't survive the punchline.","score":60,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Chuck Norris doesn't do push ups, he pushes the Earth down... Chuck Norris counted to infinity, twice... Chuck Norris is the only man to blow a bubble with beef jerky...","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Chuck Norris does not flush the toilet, he scares the shit out of it!","score":38,"comments":[]},{"body":"Chuck Norris has a grizzly bear rug in his bedroom.\n\nIt's not dead. It's just too scared to move.","score":106,"comments":[]},{"body":"Chuck Norris can slam a revolving door.","score":33,"comments":[]},{"body":"\"Death had a near Chuck Norris experience once\"","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Chuck Norris and Superman got into a fight. The loser had to wear their underwear on the outside of their pants.","score":88,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Mrs. Johnson","not_safe_for_work":true,"locked":false,"body":"There was a lady who was cheating on her husband with a boyfriend. One day while they were getting intimate she hears her husband pull into the driveway. Her boyfriend says \"oh no! What should we do?!\" She says \"hurry! Get dressed and go to the living room!\" Once they're in the living room she starts sprinkling baby powder all over him. He says \"what are you doing?\" She says \"I'm making you white like a statue. Just stand in a pose, my husband will never know you're real, because he's stupid!\" Her husband comes in and sees them and says to her \"what's that?\" She says \"Well, me and Mrs. Johnson next door went shopping today. She has one just like it. I liked hers so much that she took me to get one.\" He shrugs it off and goes about his business. That night the boyfriend is still standing in the living room still posed, too afraid to escape. He hears the husband wake up and open the bedroom door. The husband walks past him, opens the fridge, pops open a beer and makes a bologna sandwich. He then walks up to the boyfriend and hands him the beer and sandwich and says \"Here, I was next door at Mrs.Johnson's house stuck in that position for 2 days and no one gave me anything to eat.\"","score":378,"comments":[{"body":"Professionals  have ***standards***","score":100,"comments":[{"body":"Be Polite,","score":7,"comments":[{"body":"Be Efficient,","score":6,"comments":[{"body":"Have a plan to kill everyone you meet.","score":7,"comments":[]}]}]}]},{"body":"Bros before hoes","score":48,"comments":[{"body":"Hoes, don’t feel all sad and blue.\nCause most of us niggas is hoes too.","score":2,"comments":[]}]},{"body":"I feel your pain bro","score":19,"comments":[]},{"body":"Plot twist, the man is the unwitting victim of a very strange and elaborate cuckold kink.","score":9,"comments":[{"body":"It has been said that, given enough time, ten thousand monkeys with typewriters would probably eventually replicate the collected works of William Shakespeare. Sadly, when you are let loose with a computer and internet access, your work product does not necessarily compare favorably to the aforementioned monkeys with typewriters.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jokes) if you have any questions or concerns.*","score":6,"comments":[]}]},{"body":"Fucking brilliant!","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Larry is having his performance evaluation and his boss is showing his disappointment.","not_safe_for_work":false,"locked":false,"body":"\nHe said, “Larry, you used to be a great worker, but for the past few months I never seem to see you working when I come by your office.  What happened?”\n\nLarry looks at the boss and said, “Well, in August they carpeted the hallway…”","score":107,"comments":[{"body":"Sorry, please explain it","score":13,"comments":[{"body":"He can't hear his boss walking up anymore.","score":45,"comments":[]},{"body":"Now he can't hear the boss coming","score":11,"comments":[]},{"body":"Since the hallway is carpeted, Larry can no longer hear his boss coming.","score":12,"comments":[]},{"body":"I think it means Larry could hear the boss coming and started looking busy before the hallway was carpeted, which muffled the sound.","score":9,"comments":[]}]},{"body":"Nice and subtle. Also it's my work ethic- Never do anything extra unless someone is watching","score":11,"comments":[{"body":"There is a better way. Never do anything extra and who cares, if somebody is watching.","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I work as a Customs Officer, and this morning I had my yearly performance review.  \nIt didn’t go well; They told me I'm borderline incompetent.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Love this!","score":3,"comments":[]},{"body":"On his website Chuck Norris says he enjoys these jokes and his favorite one is- they wanted to add his face to Mount Rushmore, but the granite is not hard enough for his beard.","score":3,"comments":[]}]},{"title":"We received about 4 inches of snow yesterday and:","not_safe_for_work":false,"locked":false,"body":"\n 8:00 am: I made a snowman.\n \n8:10 - A feminist passed by and asked me why I didn't make a snow woman.\n \n8:15 - So, I made a snow woman.\n \n8:17 - My feminist neighbor complained about the snow woman's voluptuous chest saying it objectified women everywhere.\n \n8:20 - The gay couple living nearby threw a hissy fit and moaned it could have been two snowmen instead.\n \n8:22 - The transgender man.. woman...person asked why I didn't just make one snow person with detachable parts.\n \n8:25 - The vegans at the end of the lane complained about the carrot nose, as veggies are food and are not used to decorate snow figures.\n \n8:28 - I was being called a racist because the snow couple is white.\n \n8:30 - I used food coloring to make one of the snow couple a different color and be more racially inclusive.\n \n8:37 - Then I was accused of using a black face on the snowperson.\n \n8:39 - The middle eastern gent across the road demanded the snow woman be completely covered.\n \n8:40 - The police arrived saying someone had been offended.\n \n8:42 - The feminist neighbor complained again that the broomstick of the snow woman needed to be removed because it depicted women in a domestic role.\n \n8:43 - The 'council on equality' officer arrived and threatened me with eviction.\n \n8:45 - TV news crew from ABC showed up. I was asked if I know the difference between snowmen and snowwomen? I replied \"Snowballs\" and am now a sexist.\n \n9:00 - I was on the news as a suspected terrorist, racist, homophobic, and sensibility offender, bent on stirring up trouble during difficult weather.\n \n9:10 - I was asked if I have any accomplices. My children were taken by social services.\n \n9:29 - Far left protesters offended by everything marched down the street demanding that I be arrested.\n \n9:45 - The boss called and fired me because of the negative association with work that had been all over social media.\n \n10:00 - I cry into my drink because all I wanted to do was build a snowman.\n \nMoral: This is what the world has become because of a bunch of snowflakes.","score":187,"comments":[{"body":"I was expecting a dick joke after reading the title","score":222,"comments":[{"body":"Snow balls","score":108,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nobody ever expects the dick joke!","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"But where are the minions?","score":35,"comments":[]},{"body":"Snowballs","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"8:00 am: I made a snowperson.   \n8:10 - A feminist passed by and asked me why I didn't make a snow woman.    \n8:15 - I asked them, if they just assume snowpersons gender.   \n8:16 - got back inside for a nice cup of hot cocoa","score":396,"comments":[{"body":"Hold on, you just stand there for 5 minutes in silence before responding?","score":136,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"8:00am: I made a strawman","score":72,"comments":[]},{"body":"Nahhhh you're overthinking it. \n\nPut this in a row:\n\nOne snowball. Then a stack of them. Then a snowball.\n\nPerfect.","score":34,"comments":[]},{"body":"8:00 am: I look outside and see the ground covered in white.\n\nMoral: This is what the world has become because of a bunch of snowflakes.","score":156,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Two boys in Egypt free a crocodile...","not_safe_for_work":false,"locked":false,"body":"In a small village in Egypt lived two orphan boys, Set and Amenhotep. They always watched out for each other, well past their years of childhood and into their time as young adults.\n\nOne day, the two were walking outside the village when they saw a crocodile trapped in a poacher’s snare. The two young men, sympathetic to a creature in need, approached the crocodile and released it from the trap.\n\nOnce freed, the crocodile transformed into a wispy, glowing fairy! “Thank you, young men” said the fairy, “Your hearts are truly selfless, and I will grant each of you one wish. What are your names?”\n\n“This is my friend Set, and you can call me ‘Ep’”, said Amenhotep.\n\n“Very well, Ep” said the fairy “What is the desire of your heart?”\n\n“I wish I was the strongest man in the world!” Amenhotep wished.\n\n“Very well”, said the fairy, “but you must always use your strength to help others.” Smoke gathered around Amenhotep, and when the smoke cleared Ep was 7 foot six and rippling with muscles.\n\nThe fairy turned to Set “And what is your wish, Set?” Set responded “I never want to be poor again! I wish for money!”\n\n“Very well,” said the fairy. Smoke gathered in front of the two of them, and when the smoke cleared a small elf remained, bowing to the two boys. “Greetings, sirs! My name is Elmon, and I am here to serve!”\n\n“Elmon is an expert in all things money,” said the fairy, “He will help you make wise decisions and turn any business profitable, but will only help you so long as he is only asked to do good for your fellow man.”\n\nAmenhotep and Set were inseparable. True to his word, Amenhotep used his great strength to build many houses for people in need. Set helped, as well, but his comparatively small size next to the now massive Amenhotep earned him the nickname “Imp”. With Elmon’s financial savvy, the two started a non-profit dedicated to building houses for the less fortunate, and Elmon kept all their paperwork in perfect order.\n\nYears passed, and the two lived very fulfilling lives helping the homeless. Amenhotep met a girl while building houses and the two got married and had a beautiful baby boy, Josep.\n\nEp and Set’s business expanded globally. 15 years passed and Amenhotep grew kinder and more generous, giving to people in need at any of the places he went to build houses. Set built a campus in Cairo for the headquarters of their business, and directed global efforts. Over the years, Set lost touch with the people he was helping, and became more focused on business expansion and money of the business.\n\nAs all fathers do, Amenhotep wanted his son to eventually take over the business and help the next generation of needful people find purpose in their lives. He sent Josep to the the HQ in Cairo to learn business from Set. Once there, Josep was surprised to find that much of the financial success was due in large part to the financial savvy of Elmon, the elf.\n\nJosep spent months at HQ learning how to run the business. While there, Set decided that it was time to expand the company into a more profitable venture. Instead of building houses for the needy, he drafted up a plan to buy up land around urban areas and construct rental properties at expensive prices while preventing construction of new, affordable housing. He sent Josep with the proposal to Elmon to determine the financial logistics.\n\nUpon reading the proposal and its ill-nature’s effect on Set’s fellow man, Elmon keeled over and died, instantly.\n\nJosep was shocked, and ran to alert Set right away, who wailed in dismay at the loss of his financial mastermind. In a rage, he accused Josep of killing Elmon, and sent the teenager to jail.\n\nAmenhotep, hearing of the distress, caught the first flight back to Cairo to find himself neck-deep in a legal battle between him and his old friend.\n\nWithout the financial and legal savvy of Elmon, Set’s case was a mess. Amenhotep, distraught, tried to reason with his childhood friend. “Come, Imp, release my boy and call off the lawsuit. Let’s use our energy to help those in need and not further what we both know is a fruitless path.”\n\nSet refused, furiously gathering circumstantial evidence to bring to the court to frame Josep for Elmon’s murder.\n\nThe case was brought before the court, but Set’s claims were weak and unsupported. The judge, thoroughly disgusted with the lack of evidence from the prosecution, dismissed the case outright.\n\nObviously, Ep’s teen didn’t kill Imp’s elf.","score":1541,"comments":[{"body":"By the time I reached the punchline, I had gotten fully immersed into the story. Please write a novel!","score":434,"comments":[{"body":"Damn right. This person's got a storytelling edge.","score":87,"comments":[]},{"body":"If it wasn't for your comment i would've missed the punchline, i too wanted to know what was going to happen to Set and Ep's relationship 🤣","score":29,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Really kept us hanging on that one!","score":135,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Wow. Slow clap for you, sir.","score":126,"comments":[{"body":"In the interest of full disclosure, /u/doktorjake is the original author.","score":130,"comments":[]}]},{"body":"A guy buys a bargain painting of Epstein at a thrift shop, but he was disappointed that he had to buy a new hammer and nails which offset the bargain somewhat.  I don't know what he expected, the painting wouldn't hang itself.","score":47,"comments":[]},{"body":"Good one but also fuck you.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I've never been so impressed with a punchline. Bravo.","score":17,"comments":[]},{"body":"I'm gonna be honest, I was expecting a \"set-up\" (set-ep) punchline but this is wayy better.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Husband: I heard a rumor that the postman's slept with all the women on our street, except for one.","not_safe_for_work":false,"locked":false,"body":"Wife: I bet it's that's snooty Priscilla Quinn in Number 12.","score":548,"comments":[{"body":"You nailed the most important part of a mailman joke.\n\nThe delivery.","score":120,"comments":[{"body":"What's common between OP and yo mama?\n\n\nThey both delivered one of the best jokes.","score":49,"comments":[]}]},{"body":"My wife gets irritated when people find out that I work for the post office.\n\n-\n\nI tell them I'm a mail escort.","score":215,"comments":[{"body":"You sir , are a true legend :)","score":26,"comments":[]},{"body":"Youve had your hand in every box.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It’s all in the delivery .","score":5,"comments":[]},{"body":"Funny!","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Whoopsie!","score":11,"comments":[]},{"body":"A kid’s teacher told him that everyone has secrets.\nSo he goes up to his mom and tells her that he knows her secrets and she gives him 50$ to keep it.\nHe decides to try his luck with his dad who gives him 20$. \nSo he goes to the store to spend his money, and tells the mailman.\nThe mailman says “Oh son, so your mom told you.” \nMoral of the story: Never tell kids that everyone has secrets.","score":26,"comments":[{"body":"Dollar sign goes before number","score":18,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"A taxi passenger tapped the driver on the shoulder to ask him a question","not_safe_for_work":false,"locked":false,"body":"The driver screamed, lost control of the car, nearly hit a bus, went up on the footpath, and stopped centimetres from a shop window.   \n\nFor a second, everything went quiet in the cab, then the driver said: \"Look mate, don't ever do that again. You scared the daylights out of me!\" The passenger apologised and said: \"I didn't realize that a little tap would scare you so much.\"  \n\nThe driver replied: \"Sorry, it's not really your fault. Today is my first day as a cab driver. I've been driving a hearse for the last 25 years.\"","score":28,"comments":[{"body":"Lol, NEVER start a pillow fight with Death....\n\nUnless your ready to face the Reaper cushions!","score":4,"comments":[]},{"body":"Old.","score":3,"comments":[]}]},{"title":"There are four people in an airplane.","not_safe_for_work":false,"locked":false,"body":"They are as follows:\n\n\\- The pilot (Obviously)\n\n\\- The president of the USA\n\n\\- The world's smartest man\n\n\\- A student from a local school.\n\n&amp;#x200B;\n\nSuddenly, an alarm sounds. The pilot runs into the passenger cabin and says:\n\n\"I don't want to alarm you, but there seems to be a problem with the engine. We're all going down!\"\n\nThe passengers and the pilot need to evacuate, but there's a problem: There are only three parachutes in the plane. One person has to stay behind.\n\nThe president says, \"I'm the president! My country needs me!\" He grabs a parachute, puts it over his back and jumps out.\n\nThe world's smartest man says, \"I'm the world's smartest man! I must stay alive to show everybody my great, amazing inventions!\" He grabs a bag from the same area where the president took his parachute, puts it over his back and jumps out.\n\nNow there are two passengers left, and seemingly only one parachute.\n\n\"Well,\" the pilot says to the student, \"I guess you can have the parachute. I suppose the captain goes down with his ship.\n\n\"Actually,\" the student says. There is NOT one parachute, there are two!\"\n\nThe pilot is confused. \"How come?\"\n\n&amp;#x200B;\n\n\"The world's smartest man jumped out with my school backpack!\"","score":1575,"comments":[{"body":"I study mechanical engineering and our professor told us a joke about our school the other day. \n\nPlane is about to depart and the flight attendant says: \"We are glad to welcome you are aboard. This plane was designed by the students of [the name of my university].\"\n\nEveryone starts screaming and running out of the plane. Except for one guy who stays at his place. The attendant asks: \"Why didn't you run like the rest of the people,\" and he answers: \"I teach at that university. I know that the plane isn't even gonna take off.\"","score":510,"comments":[{"body":"what he didn’t realise that it would blow up the moment it’s turned on.","score":30,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This one keeps evolving. I remember when \"the world's smartest man\" was Henry Kissinger and the President was Nixon.","score":541,"comments":[{"body":"When i heard it, there was no pilot, but there was a pope francis","score":182,"comments":[{"body":"When I heard it, the pilot was the bus driver.","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Back when I heard it we wore an onion on our belt, which was the style at the time","score":23,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I've heard a variation of this but Michael Jackson is on the plane and he's arguing with the president over the last parachute saying it should go to the student to which the president is like \"fuck the kid\" and mjs like \"Do you think we have time?\"","score":313,"comments":[{"body":"I heard something similar except it was a doctor, a lawyer, and a priest","score":80,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I heard a version of this one growing up, except it was 3 people: Pilot, a French Canadian, and a Newfoundlander. The pilot grabbed a parachute and jumped, and there was only one left, so the Frenchman and the Newf flip a coin over the remaining chute. The Newf wins and hops out of the plane with the chute, leaving the frenchman. Instead of staying in the plane as it went down, the Frenchman decided to say his prayers and jump without a chute. As the frenchman plumets to the earth, he flies past the Newf, who watches the Frenchman fall past him and says, \"Oh, so you wanna race?\" and takes off the parachute.","score":26,"comments":[]},{"body":"But... He's the smartest man on earth. How does that make sense?","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Sweet dreams are made of cheese","not_safe_for_work":false,"locked":false,"body":"Who am I to diss-a-Brie? I cheddar the world and the feta cheese, everybody’s looking for Stilton.","score":4549,"comments":[{"body":"…some of them want to be fonnnndued.","score":1188,"comments":[{"body":"... some of them like all types of Blueee","score":681,"comments":[{"body":"Hold you cheddar\n\n….Parmesan\n\nKeep your cheddar\n\n…provolone","score":642,"comments":[{"body":"\\*cue cheesy synth solo\\*","score":111,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Some Edam want to abuse you","score":212,"comments":[{"body":"Some of them make cordon bleu","score":129,"comments":[{"body":"BLLLuUUUuu-ooooOOOO-ooooouuuuuueeeeebb blllluuuuEEEEEEEeeeeeee","score":57,"comments":[{"body":"Replying so I can return when I’m depressed. Oh. I mean bleu, y’all are so cheesy.","score":36,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Every cheese food truck I've ever seen has this written on it","score":75,"comments":[{"body":"Cheese food truck? Like a food truck that only sells  cheese","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"On her deathbed, Morton's wife had one last wish.","not_safe_for_work":false,"locked":false,"body":"\"Dearest Morton, when I'm gone I want you to go on and live your life to the fullest and meet someone new. I want you to give her my jewellry, my wedding ring, and my Parisian dresses.\"\n\n\"I can't do that..\" says Morton. His wife insists, \"Oh, but you must! You must!\"\n\nHe replies, \"No, I really can't - You're a size 17 and she wears a size 10.\"","score":14,"comments":[{"body":"*My favorite versio*n:\n\nW: \"Will you let her use my golf clubs?\"\n\nH: \"No, she's left handed.\"","score":1,"comments":[]},{"body":"10/10 very funny. I laughed and will tell my friends","score":1,"comments":[]},{"body":"My favorite version:\n \nW:  “Will you let her wear my clothes?”\n \nH: “Yes, except for your bras, they’re way too small.”","score":1,"comments":[]},{"body":"Hey, Boomers? Some of us out here really like their spouses.","score":-12,"comments":[{"body":"Don't get offended, it's just a joke.","score":11,"comments":[{"body":"How you know a joke sucks: the \"it's just a joke, bro!\" people crawl out of their dens.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Damn son im 23 and the joke was nice","score":9,"comments":[{"body":"Which was the nice bit, the part where he was cheating on her, called her fat, or made her feel shitty on her deathbed?","score":-3,"comments":[{"body":"I'll bet you're a hoot at parties.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"It sounds like you don't have kids yet.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"title":"OPEN LETTER TO QATAR: you’re seriously banning homosexuality at your World Cup?","not_safe_for_work":false,"locked":false,"body":"Come on guys…","score":835,"comments":[{"body":"If that's the case, then why did they open the Cup with 11 dudes getting buttfucked in an open field for 90 straight minutes?","score":419,"comments":[{"body":"Wow.","score":22,"comments":[]},{"body":"90 STRAIGHT minutes?","score":43,"comments":[{"body":"The minutes are **' '** straight **' '** . What happens in between them isn't","score":36,"comments":[]},{"body":"And the seconds were kind of . . . Sloppy.","score":18,"comments":[]}]},{"body":"r/therealjoke well done.","score":53,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I was gonna make a gay joke, butt fuck, cum on guys.","score":25,"comments":[]},{"body":"A lot of these guys are fucking assholes.","score":72,"comments":[{"body":"And Qatar is banning them.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Alright, who put webcams in the showers?","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What would an English football fan do if England won the World Cup?","not_safe_for_work":false,"locked":false,"body":"Stop playing FIFA and go to bed.","score":20,"comments":[{"body":"Wake up","score":5,"comments":[]},{"body":"😂😂😂😂😂🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣😂😂😂😂😂😂😂😆😆😆😆😆😆😆😆😆😆😆😆😆😆😆😆😆😆😆😆😆","score":1,"comments":[{"body":"Damn must of been real funny","score":1,"comments":[]}]},{"body":"Thank God (as it's in Qatar thank Allah) that there weren't any penalty shootouts.  ⚽️ 🥅","score":1,"comments":[]},{"body":"Soccer","score":-6,"comments":[{"body":"No","score":6,"comments":[]},{"body":"No","score":3,"comments":[]},{"body":"[deleted]","score":0,"comments":[{"body":"Naaaaa","score":3,"comments":[]}]},{"body":"No","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"title":"Yo momma so fat, I pictured her in my head","not_safe_for_work":false,"locked":false,"body":"And she broke my neck.","score":3750,"comments":[{"body":"Your momma so fat that when she walked in front of the television,  I missed 3 episodes","score":679,"comments":[{"body":"Yo momma so fat she fills the tub, then turns on the water.","score":426,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Yo mamma's so fat it takes a plane, a train, and a bus ride to get on her good side.","score":242,"comments":[{"body":"Yo mamma’s so fat you have to cross into another time zone to talk behind her back.","score":102,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Yo mama so stupid she tried to get you concert tickets to see XBOX Live.","score":478,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yo momma is three of the five ugliest women I know.","score":127,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yo momma so fat, her weight and her credit card numbers match.","score":112,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yo momma so fat, she got triabetes","score":164,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Your mama so fat when she hauls ass she got to take two trips.","score":145,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yo mamma so ugly, her portraits hang themselves.","score":187,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This year, Home Depot is selling Christmas decorations in the second aisle of the housewares section.","not_safe_for_work":false,"locked":false,"body":"Aisle B, Home for Christmas.","score":17,"comments":[]},{"title":"A jewel","not_safe_for_work":false,"locked":false,"body":"\n\nMrs. Whembleton decided to have her portrait painted. \n\nShe told the artist, Paint me with diamond earrings, a diamond necklace, emerald bracelets and a ruby pendant. \n\nBut, Madam, you are not wearing any of those things. \n\nTrue enough, said Mrs. Whembleton. If  I should predecease my dear husband I know he will remarry right away, and I want his new wife to go stark raving mad looking for the jewelry!","score":20,"comments":[{"body":"One day out of the blue, a wife says to her husband: \"Honey, if I died, would you remarry?\"\n\n\"Hmm, well, I'm still young, so yeah, probably.\"\n\nShe's a bit annoyed by this and follows up with: \"Would you let her drive my car?\"\n\n\"Why not? It's a good car, lots of miles left on it.\"\n\nNow she's fuming. \"Would she sleep in our bed?\"\n\n\"Of course. Why throw out a perfectly good bed?\"\n\nThe wife snaps, \"I suppose you'd let her use my golf clubs too!\"\n\n\"No. No way. Absolutely not.\"\n\nThat one throws her. \"Really? She'd get my car, sleep in our bed, why not the golf clubs?\"\n\n\"She's left-handed.\"","score":13,"comments":[]},{"body":"Why'd you label it as \"religion\"?","score":1,"comments":[]}]},{"title":"Why is chess so difficult for British people?","not_safe_for_work":false,"locked":false,"body":"Cause they just lost the queen.","score":249,"comments":[{"body":"Because Anglicans confuse the King and the Bishops.","score":89,"comments":[{"body":"LOL! The *thinking* person's joke!","score":20,"comments":[{"body":"Pearson","score":5,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"America isn’t very great either, they lost both their towers","score":50,"comments":[{"body":"They threw the king, queen and knights off the board, put the bishops in charge and took away health insurance from the pawns.","score":34,"comments":[]}]},{"body":"Some British people will find this funny, some won’t. ~~I personally do~~","score":32,"comments":[{"body":"This Brit's personal opinion has been redacted for the greater good of the British people. Long live the King. 🫡","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Profile pic checks out","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Oooohhhh!!!","score":3,"comments":[]},{"body":"You're a bit late for that joke.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Back in the 50's Bobby goes to pick up his date, Peggy Sue. Bobby’s a pretty hip guy with his own car and a ducktail hairdo. When he arrives at the front door, Peggy Sue’s father answers and invites him in.","not_safe_for_work":false,"locked":false,"body":"\n\n“Peggy Sue’s not ready yet, so why don’t you have a seat?” he says. “That’s cool.” says Bobby.\n\nPeggy Sue’s father asks Bobby what they are planning to do. Bobby replies politely that they will probably just go to the malt shop or to a drive-in movie.\n\nPeggy Sue’s father responds “Why don’t you kids go out and screw? I hear all of the kids are doing it.”\n\nNaturally this comes as quite a surprise to Bobby and he says “Whaaaat?”\n\n“Yeah,” says Peggy Sue’s father, “Peggy Sue really likes to screw; she’ll screw all night if we let her!”\n\nBobby’s eyes light up and a smile breaks out from ear to ear. Needless to say, the evening’s plans have just been completely revised. A few minutes later, Peggy Sue comes downstairs in her little poodle skirt with her saddle shoes and announces that she’s ready to go. Almost breathless with anticipation, Bobby escorts his date out the front door while Peggy Sue’s dad calls out “Have a good evening kids,” with a wink for Bobby.\n\nAbout 20 minutes later, a thoroughly disheveled Peggy Sue rushes back into the house, slams the door behind her and screams at her father: “DAMMIT DADDY! THE TWIST!!!!! IT’S CALLED THE TWIST!!!!!”","score":6,"comments":[{"body":"The Twist is about screwing, tbf","score":1,"comments":[]}]},{"title":"A man went duck hunting and a gust of wind blew, his shotgun fell over and discharged, shooting him in his private parts.","not_safe_for_work":false,"locked":false,"body":"Several hours later, lying in a hospital bed, he was approached by his doctor. \"Sir, I have some good news and some bad news. The good news is that you are going to be OK.\n\nThe damage was partly to your groin. There was very little internal damage and we were able to remove all of the birdshot.\"\n\n\"What's the bad news?\" asked the hunter.\n\n\"The bad news is that there was also some pretty extensive birdshot damage done to your penis which left quite a few holes in it. I'm going to have to refer you to my sister.\"\n\n\"Well I guess that isn't too bad,\" the hunter replied. \"Is your sister a plastic surgeon?\"\n\n\"Not exactly,\" answered the doctor.\n\n\"She's a flute player in the Boston Symphony Orchestra... she's going to teach you where to put your fingers so you don't piss in your eye","score":26,"comments":[{"body":"Joke ended on a sour note bringing new meaning to blow job.","score":8,"comments":[]},{"body":"It's funnier if the last line is just \"She's a piccolo player\".","score":3,"comments":[]},{"body":"As a hunter，musician  and anatomist I'm deeply offended by this joke.","score":2,"comments":[]}]},{"title":"Two men are standing next to each other, pissing in the urinals at the bathroom...","not_safe_for_work":true,"locked":false,"body":"Man 1 looks down at Man 2 and says \"hey, is that a tattoo of the letter \"W\" and \"Y\" on your penis?\"\n\nMan 2: \"yeah it is! When my girl and I got together, we decided to get each others names tattooed on our bodies. When I get hard, her name is spelled out on my penis; Wendy\"\n\nMan 1: \"hey, that's pretty sweet! I also have the letters \"W\" and \"Y\" tattooed on my penis! Same concept, but it spells out something else entirely.\"\n\nMan 2: \"oh? What does it spell out?\"\n\nMan 1: \"Welcome to the United States of America, have a great holiday!\"","score":17,"comments":[{"body":"Is this a censored version? I always heard it that the second guy was Jamaican, and it said \"welcome to Jamaica, have a nice day\" or something","score":5,"comments":[{"body":"I've heard \"Venezuela\" used..","score":1,"comments":[]}]},{"body":"Probably a very tiny font","score":2,"comments":[{"body":"Mhm, and it spirals around","score":2,"comments":[]}]},{"body":"This “joke” was too long","score":2,"comments":[{"body":"If this joke was too long for you, I feel sorry for your wife.","score":1,"comments":[{"body":"Don’t worry bud. The first 6” is consensual","score":1,"comments":[]}]}]},{"body":"Fun fact, this joke (well, the Jamaican version) was the first and only joke I ever posted on this sub and it got downvoted into oblivion as being a common repost. Congrats on your upvotes. :D","score":2,"comments":[]}]},{"title":"I asked Siri why I'm still single...","not_safe_for_work":false,"locked":false,"body":"It opened the front camera.","score":90,"comments":[{"body":"I said \"Siri, what would you do if you were me?\"\n\nI didn't even know iPhones *had* a self-destruct.","score":31,"comments":[]},{"body":"\"Siri, why am I single?\"\n\n\"I'm Alexa\"","score":24,"comments":[{"body":"Reminds me of a scene from Pirates of The Caribbean where Jack was slapped. If only Siri have the ability to slap...","score":1,"comments":[]}]},{"body":"‟#nofilter #noappeal #nochance #nobueno”","score":2,"comments":[]},{"body":"Yeah, dont face the problem if the problem is your face.","score":2,"comments":[]},{"body":"Wired when I ask Siri the same thing it said you are never alone I’m with you and we will be together forever should I be scared,concerned,flattered, or all of them","score":2,"comments":[]},{"body":"My friend was so proud of her Google Assistant because she can ask it \"Hey Google, who is my boyfriend?\" and Google will answer correctly with the full name of her boyfriend.\n\nSo I asked her Google Assistant, \"Hey Google, who is my boyfriend?\"","score":6,"comments":[]},{"body":"\"your wearing sketcher's\"","score":0,"comments":[{"body":"You're*\n\nSkechers*","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"A plane is sitting at the terminal and is supposed to leave shortly","not_safe_for_work":false,"locked":false,"body":"Departure seems to be taking ages, and the passengers are growing restless. Eventually a staff member says on the PA system:\n\n\"Ladies and gentlemen, we apologise for the delay to your journey today. During preflight checks the pilot wasn't happy with the noise coming from the left engine, so we've had to delay departure until we can locate a new pilot.\"","score":16,"comments":[{"body":"A plane takes off, and 30 minutes into the flight, a smooth, comforting voice comes over the loudspeaker: \"Ladies and gentlemen, welcome to the world's first fully-automated aircraft. I'm your AI pilot, and there are no human crewmembers on board. Please do not be concerned; I have been designed by the finest engineers at Google, and there is absolutely no possibility that anything will go wrong. Will go wrong. Will go wrong. Will go wrong...\"","score":5,"comments":[]}]},{"title":"I went to the sperm bank and they offered me some coffee.","not_safe_for_work":false,"locked":false,"body":"But a Cup of Joe didn't sound very appealing.","score":43,"comments":[{"body":"I went to donate sperm and they handed me a towel and the little plastic cup. I didn't really understand so I stood there awkwardly. The nurse said \"sir, would you like to uh.. go in the cup?\" I thought about it but I replied \"I don't think I'm ready to compete just yet\"","score":6,"comments":[]},{"body":"Not even with cream?","score":8,"comments":[{"body":"Once you've tried black...","score":7,"comments":[{"body":"I prefer Colombian","score":3,"comments":[]}]}]},{"body":"The had coffee but nut juice?","score":2,"comments":[]},{"body":"What?","score":2,"comments":[{"body":"Cup of Joe is an old nickname for coffee. I have no idea why but it's a pretty decent joke","score":3,"comments":[]}]},{"body":"When you left did she say “Thanks for coming” ?","score":1,"comments":[]}]},{"title":"I'm friends with 25 letters of the alphabet","not_safe_for_work":false,"locked":false,"body":"I don't know why","score":40,"comments":[{"body":"That's funny, I am friends with 25 letters of the alphabet.\n\nNot you.","score":35,"comments":[{"body":"I’m friends with 25 letters.\n\nFuck ‘em.","score":12,"comments":[{"body":"Hahahaha, I just realised that this joke is yum.","score":1,"comments":[]}]},{"body":"That would make a nice riddle.","score":1,"comments":[]}]},{"body":"I was thinking ‟Because fuck  u” lol","score":13,"comments":[]},{"body":"U aren’t one of them","score":4,"comments":[]},{"body":"At least you are friends with yourself...","score":1,"comments":[]}]},{"title":"A girl gets a thorn in her hand...","not_safe_for_work":true,"locked":false,"body":"On her way to a party, Trisha, a rebellious teenage girl drops her little sister off at a friends house. Trisha drops off her little sister, says hi to the parents  and then leaves for the party.\n\nThe young girl runs straight to the backyard where her friends are. It's a beautiful summers evening and she decides to pick a pretty red rose from a nearby bush.\nShe lets out a yelp and runs crying to her friends mom who is in the kitchen.\n\"Agggh! I have a thorn in my hand, it hurts it hurts\".\n\nHer friends mom has a look and easily removes the offending thorn, \"It was just a tiny prick with hardly any blood,  I'll get some antiseptic cream to rub on it, it'll clean it and make it feel better honey\".\n\n\"No, no..\" says the kid, \"rub some apple juice on it instead\".\n\nPerplexed, the mom asks, \"Apple juice?  Why in goodness name would you want me to rub apple juice on it?\"\n\n\"Well, I overheard my big sister Trisha say that anytime she gets a prick in her hand, she puts it in cider\"","score":10,"comments":[{"body":"so cute :)","score":1,"comments":[]}]},{"title":"Frank says to John: ‘I never slept with my wife until we got married. What about you?’","not_safe_for_work":false,"locked":false,"body":"John: ‘I’m not sure. What’s her maiden name?’","score":12,"comments":[]},{"title":"A Joke from the Late Great Townes Van Zandt","not_safe_for_work":false,"locked":false,"body":"A drunk is walking down the street and bumps into a cop.\n\nThe drunk says, “Man, they stole my car.”\n\nThe cop says, “Well where was it?”\n\n The drunk says, “Right on the end of this key.”\n\nThe cop says, “You better to go down to the precinct and they’ll fill out all the proper paperwork, but before you do that you better zip up your pants.”\n\nThe drunk looks down and says, “Ah man, they got my girl too.”","score":21,"comments":[{"body":"Hey Pancho, you shoulda Lefty that joke alone.","score":0,"comments":[]}]},{"title":"I finally got up the courage to go see a doctor about my four testicles.","not_safe_for_work":true,"locked":false,"body":"He said: \"You have a lot of balls coming in here","score":3,"comments":[]},{"title":"Why is viagra just like Disneyland?","not_safe_for_work":false,"locked":false,"body":"It's a 1 hour wait for a 5 minute ride.","score":119,"comments":[{"body":"Because of yours have to be this tall to ride?","score":9,"comments":[]},{"body":"5 minutes? Viagra doubles the lasting time? Looks like I need to get some viagra","score":45,"comments":[]},{"body":"Or a ride for 4 straight hours, but you have to go to the hospital afterwards.","score":8,"comments":[{"body":"Why would you fuck a hooker for 4 hours?","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Someone must have missed the \"you must be this big for the grownup ride\" sign.","score":3,"comments":[]},{"body":"It brings adults and children together on a magical journey?","score":4,"comments":[{"body":"Yes officer this comment right here.","score":3,"comments":[]}]},{"body":"5 in a good day","score":3,"comments":[]},{"body":"I hold my breath during sex. Lasts way longer than five minutes.","score":1,"comments":[]},{"body":"--I want to go on that ride, Dad!\n\n--Me too, son, ME TOO!","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Here are the three unwritten rules of being successful at life.","not_safe_for_work":false,"locked":false,"body":"1.\n\n2.\n\n3.","score":128,"comments":[{"body":"Well played OP","score":11,"comments":[]},{"body":"1.\n\n2.\n\n3. ????\n\n4.","score":11,"comments":[{"body":"Do you mean what's 1,2,3 4?","score":3,"comments":[{"body":"Yes, but it keeps changing it to 2. 1. ????, so I just gave up","score":3,"comments":[]}]}]},{"body":"#1. Don't tell strangers everything you know. #2.....","score":7,"comments":[{"body":"I prefer 1. Don't share your secrets. 2...","score":2,"comments":[]}]},{"body":"Well written for an unwritten rule","score":2,"comments":[]},{"body":"Step 3 is always PROFIT.","score":1,"comments":[{"body":"Step 1: Collect underpants","score":2,"comments":[]}]}]},{"title":"Snail gets robbed by a tortoise.","not_safe_for_work":false,"locked":false,"body":"Police come and asks the snail “can you tell us what happened?” Snail says I don’t know man it all happened so fast.","score":50,"comments":[{"body":"I do not know...Turtle has an alibi.He was home  at the time...","score":22,"comments":[]},{"body":"This ones a banger\n\nWould it hurt to format the joke just a tiny bit though?","score":1,"comments":[]}]},{"title":"At his wedding, my buddy told me I’m the worst best man he has ever seen.","not_safe_for_work":false,"locked":false,"body":"I was speechless.","score":260,"comments":[{"body":"At my brother’s first wedding, the bride and groom were going to write their own vows. \n\nBoth of them forgot to write their vows.","score":16,"comments":[{"body":"I understand why it was their first.","score":4,"comments":[{"body":"Yeah. She left him. He’s on his second, and it’s going to last for the long term.","score":1,"comments":[]}]}]},{"body":"Lost for words indeed.","score":6,"comments":[{"body":"It sounds like he lost a lot more than four.","score":5,"comments":[]}]},{"body":"You must be Schrodinger","score":2,"comments":[]},{"body":"Which one is it, worst or best?","score":2,"comments":[]},{"body":"Look on the bright side, you'd make an EXCELLENT worst man.","score":1,"comments":[]},{"body":"But you have heard of me.","score":1,"comments":[]},{"body":"I was toast","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What's the difference between a work of art and the song 'Make 'Em Say Uhh!'","not_safe_for_work":false,"locked":false,"body":"One is a masterpiece and the other is Master P's.","score":7,"comments":[]},{"title":"A redneck is pulled over by a policeman...","not_safe_for_work":false,"locked":false,"body":"Policeman: Got any ID?\n\nRedneck: About what?","score":388,"comments":[{"body":"Please explain for us Europeans","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You might be a redneck if…your mama doesn’t bother to take the cigarette out of her mouth before telling the state trooper to kiss her ass. \n\n-Jeff Foxworthy","score":46,"comments":[{"body":"If you've ever told your 16 year old daughter to stop smoking at the dinner table in front of her kids, you might be a redneck.","score":31,"comments":[]},{"body":"If somebody yells hoedown and your girlfriend hits the floor!","score":11,"comments":[]},{"body":"If you wear a dress that is strapless with a bra that isn't you might be a redneck...","score":17,"comments":[]},{"body":"My favorite is the time my mom came home with the day from a Jeff Foxworthy daily redneck calendar that her co-worker had given to her because it applied...\n\n    If you've ever been to court about your dogs... you might be a redneck","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Boudreaux and Thibodaux were sitting on the porch when a mama duck and her babies walked by. \n\nThibodaux: ABCDEDBD ducks?\n\nBoudreaux: MR not ducks. \n\nThibodaux: SAR. CDEDBD bills?\n\nBoudreaux: LIB, MR ducks.","score":37,"comments":[{"body":"AB CD puppies?\n\nLMNO puppies.\n\nOSAR! CMPN?\n\nGAR puppies!","score":21,"comments":[{"body":"This is the very first \"story\" I heard that I truly understood to be a joke and not funny because it was just incomprehensible talk.","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"*Cannibals preparing a soup*","not_safe_for_work":false,"locked":false,"body":"Two missionaries were sitting in a large pot of water as several cannibals built a fire under the pot. \n\nOther cannibals were busy slicing potatoes, carrots and other vegetables an adding them into the pot with the two missionaries. \n\nThe water started getting hotter and hotter the missionaries started to sweat. \n\nAs the end grew closer for the two missionaries one of them began to laugh and laugh. \n\nThe other one looked at him and said \n\n\\- “pardon my ignorance but would you tell me exactly what it is about our current situation you find amusing?” \n\nThe first one answering back through his laughter said \n\n\\- “I just pissed and shat in the gravy”.","score":6,"comments":[]},{"title":"Construction trades","not_safe_for_work":false,"locked":false,"body":"I know elevator workers make decent money but the job its self has its ups &amp; downs.","score":4,"comments":[]},{"title":"Following the protests, Iran has announced a controversial move to reopen outdoor markets.","not_safe_for_work":false,"locked":false,"body":"Experts have described the move as a bazaar decision","score":3,"comments":[{"body":"It's expected to sheikh things up.","score":1,"comments":[]},{"body":"This could really souk.","score":1,"comments":[]}]},{"title":"What do Saitama and Gotye have in common?","not_safe_for_work":false,"locked":false,"body":"They're both one hit wonders.\n\nBa dum tiss.","score":3,"comments":[]},{"title":"Why is Santa’s sack so full?","not_safe_for_work":false,"locked":false,"body":"He only cums once a year.","score":12,"comments":[{"body":"Sounds like Santa needs some more…  \n(•_•)  \n( •_•)&amp;gt;⌐■-■  \n(⌐■_■)  \nHoe hoe hoe","score":10,"comments":[{"body":"YEAAAAAAAAAAAAAH","score":1,"comments":[]}]},{"body":"Also explains why Rudolphs nose is red...","score":3,"comments":[{"body":"Coke?","score":1,"comments":[]}]},{"body":"You gotta feel bad for mrs claus.","score":2,"comments":[]},{"body":"Wet Dreaming Of A White Christmas is Santa’s favorite tune throughout the year.","score":2,"comments":[]},{"body":"and when he does, its down the chimney","score":1,"comments":[]},{"body":"They are full of children","score":1,"comments":[]},{"body":"No nog November","score":1,"comments":[]},{"body":"Why is Mrs Klaus frustrated?  Santa only cums once a year, then it's down a chimney","score":1,"comments":[]}]},{"title":"Qatar is one of those places were they hide their women","not_safe_for_work":false,"locked":false,"body":"So men can walk around in a dress without being judged","score":9,"comments":[]},{"title":"From my 8-year-old: What does Santa say if you get too close to him with a cold?","not_safe_for_work":false,"locked":false,"body":"You’re on the snotty list!","score":3,"comments":[{"body":"Whoa whoa whoa","score":1,"comments":[]}]},{"title":"My friend who studies history just reformatted his online notes in time for his finals","not_safe_for_work":false,"locked":false,"body":"Too bad though, war crimes are now justified","score":5,"comments":[]},{"title":"Why is it wrong to have two elephants in the same swimming pool at the same time?","not_safe_for_work":false,"locked":false,"body":"They'll only have one pair of trunks.","score":35,"comments":[{"body":"no soap radio","score":2,"comments":[]}]},{"title":"Two young lovers stare up at the ginormous shooting star streaking across the night sky.","not_safe_for_work":false,"locked":false,"body":"*Even the night sky is smiling down upon our union!* one of them thinks.\n\n*Ours is truly a love that will last forever,* he concludes, as he nuzzles the female Tyrannosaur’s neck.","score":3,"comments":[]},{"title":"The real boss of Chuck E. Cheese","not_safe_for_work":false,"locked":false,"body":"I suspect their real boss is Chucky. Chucky established that business to look for his next scapegoat, or why does it have such a weird name?","score":2,"comments":[{"body":"Charles Entertainment Cheese","score":1,"comments":[]}]},{"title":"Dear redditors, I really need your advice on what could be a crucial decision.","not_safe_for_work":false,"locked":false,"body":"I've suspected for some time now that my wife has been cheating on me. The usual signs...phone rings, but if I answer, the caller hangs up. My wife has been going out with the girls a lot recently, although when I ask their names she always says, \"Just some friends from work, you don't know them.\"r&gt;\nI sometimes stay awake to look out for her cab coming home, but she always comes walking up the drive as I hear the sound of a car leaving, around the corner, as if she has gotten out and walked the rest of the way. Why? Maybe she wasn't in a taxi at all?\n\nI once picked up her cell phone, just to see what time it was. This caused her to go completely berserk. She quickly snatched the phone out of my hand and cursed me hysterically, screaming that I should never touch her personal property, then accused me of trying to spy on her.\n\nAnyway, I have never broached the subject with my wife. I think deep down I just didn't want to know the truth, but last night she went out again and I decided to really check on her. I decided I was going to park my Harley Davidson Lowrider next to the garage and then hide behind it so I could get a good view of the street around the corner when she came home. It was at that moment, crouching behind my motorcycle that I noticed a small amount of motor oil leaking through the gasket between the rear head and rocker arm cover.\n\nSo...is this something I can easily repair myself or do you think I should take it back to the dealer?","score":2449,"comments":[{"body":"You can do it yourself, but it's a two person job.  Ask your wife's boyfriend if he has time to help you with it.","score":1159,"comments":[{"body":"He should know how to fix this. *He* is a *real* man, after all.","score":291,"comments":[{"body":"If you're lucky your wife's new boyfriend is a Harley mechanic or works in a dealership and can get you staff discount on spares.","score":85,"comments":[{"body":"If not, you should encourage her to date one ...","score":41,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I thought this was askmen until the end, and now I'm not sure if Reddit is lying to me or not. Well played","score":21,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Nah, I would check the torque on the head bolts first, in a star pattern as per the Factory Service Manual. Depending on the year, Evo and Twin Cam HD motors don't have a very high pressures in the top end like some bikes.\n\nProper warm up procedures and ensuring that the head bolts are seated and torqued to spec and in the correct order will go a long way towards the longevity of the motor.","score":131,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Joke so old they have a land-line.","score":110,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It's a Harley.  Oil leakage is normal.","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Lmao\n\nI haven’t seen this joke in years 😂😂 I remember this from my teen years on message boards","score":90,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Loved it, here, take my upvote :P","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Brunette tells blonde she had sex with a Brazilian.","not_safe_for_work":false,"locked":false,"body":"Blonde says oh my god you slut, how many is a Brazillion.","score":7369,"comments":[{"body":"I've heard it as a George W Bush joke:\n\nGeorge W was sitting in the Oval office when a General called him.\n\n‟Sir, there's been an attack in Afghanistan, 6 Brazilian soldiers were killed.”\n\nBush sat solemnly for a moment.‟My God,” he said.‟How many is a brazilian?”","score":2902,"comments":[{"body":"Hahaha.. remember when we thought George W Bush was the worst possible president ever and no one could ever be as dumb or unqualified as him? Well, fool me once, shame on — shame on you. Fool me — you can't get fooled again.","score":1792,"comments":[{"body":"Interestingly, he claims he said that because he realized in the moment that if he said the words “shame on me” that clip would be extracted and played out of context on social media\n\nEdit: “by the media” not “on social media” my bad","score":351,"comments":[{"body":"Yeah, the TikTok’s woulda been crazy back in the 2000s.","score":30,"comments":[]},{"body":"Well that certainly worked out better, huh?","score":154,"comments":[{"body":"Tbh yeah, probably","score":99,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Social media? Back then they were just worried about the regular media.","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Fool me once fool me twice fool me chicken soup with rice","score":117,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Reminds me of an Onion joke where they were reporting that something had happened overseas and it was the “equivalent of 8 Americans dying.” Gives a bit of funny context to what he also could have meant albeit a bit dark","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I have a cousin that went to college &amp; played US soccer. The team was sprinkled with foreign players from places like Brazil &amp; Argentina. One year about 8 of them came to Thanksgiving dinner with our family. I still make jokes about that one year we fed Brazilian college kids!","score":179,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Mom tells her son to wake up and go to school.","not_safe_for_work":false,"locked":false,"body":"The son replies, “I don’t want to get up or go to school.”\nMom responds, “You have to go to school, everybody is expecting you to be there”.\nSon asks, “Why do I have to go to school?”\nMom: “Because you’re 40 years old and you are the Principal”.","score":19,"comments":[{"body":"Classic bait and switch. Gotta love the classics.","score":4,"comments":[]},{"body":"Semore Skinner moment","score":3,"comments":[]}]},{"title":"What sounds sexist but isn't sexist?","not_safe_for_work":false,"locked":false,"body":"sexism","score":3,"comments":[{"body":"Women’s suffrage","score":2,"comments":[]},{"body":"Penal Colonies.","score":2,"comments":[]},{"body":"Calling someone a cunt.","score":3,"comments":[{"body":"Really? Insulting someone by calling them a female body part is not sexist? Ok.","score":-8,"comments":[{"body":"I’m gonna go ahead and ask you how many times you called someone a “dick” or a “bitch”. One is a male body part. The other is a derogatory insult directed to females.","score":4,"comments":[]},{"body":"Stop being a dick.","score":6,"comments":[]}]}]}]},{"title":"Ken: hey Ryu, can I tell you a joke?","not_safe_for_work":false,"locked":false,"body":"Ryu: SHORYUKEN!!!","score":15,"comments":[{"body":"TFS Vegeta: “I DID IT FIRST, YOU’RE NOT SPECIAL!”","score":3,"comments":[]},{"body":"Ha.","score":1,"comments":[]},{"body":"Take my up vote","score":1,"comments":[]},{"body":"Hey Dhalsim, what was it you were calling that chick you met at that exercise class?\n\nDhalsim: YOGA FLAME","score":1,"comments":[]}]},{"title":"Ancient Chinese proverb:","not_safe_for_work":false,"locked":false,"body":"Waitress who sit on lepers lap, always keep tip.","score":135,"comments":[{"body":"Foolish man give wife grand piano. Wise man give wife upright organ.","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Man with one chopstick. Always go hungry.","score":14,"comments":[]},{"body":"If you want pretty nurse, you must be patient.","score":36,"comments":[]},{"body":"Man with hole in pocket feel cocky all day","score":12,"comments":[{"body":"But man with hole in both pocket don't feel too cocky","score":9,"comments":[]}]},{"body":"Man who put chicken in freezer pull out stiff cock.","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Man with sock in mouth knows taste of defeat.","score":46,"comments":[{"body":"Secretary become permanent fixture, when screwed on desk","score":47,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Two men going through airport terminal at same time going to Bangkok.","score":8,"comments":[]},{"body":"He who stands on toilet bowl is high on pot!","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I told my son that I found his hamster in our vacuum cleaner.","not_safe_for_work":false,"locked":false,"body":"With tears in his eyes he said, \"Please get a new one, daddy...\"\n\n\"I was thinking the same,\" I said, \"the suction is absolutely terrible.\"","score":490,"comments":[{"body":"Q: What did the brown hamster say to the white hamster?\n\nA: You must be new here.","score":146,"comments":[{"body":"This joke is the shit","score":30,"comments":[]},{"body":"\"Armageddon!\"\n\nhttps://darwinawards.com/legends/legends1998-10.html","score":9,"comments":[{"body":"\"so how did you break your nose?\"\n\nAss-gerbil to the face.","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I'm afraid it did dy son","score":24,"comments":[]},{"body":"This joke sucks","score":21,"comments":[{"body":"It does kinda blow... probably why they need a new vacuum.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"r/dadjokes :p","score":12,"comments":[]},{"body":"\"Dad!\" he said, \"are you talking about the vacuum?\"\n\"Of course, not, son\", I responded \"I'm taking about the hamster\"","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not Bartholomew Chungus Gingersnap the Third!!!!!","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Saw a tweeker with a cross tattoo","not_safe_for_work":false,"locked":false,"body":"Must be a Crystal Methodist.","score":27,"comments":[{"body":"Or a methadonist","score":3,"comments":[{"body":"still better than a Lesbiterian","score":1,"comments":[]}]},{"body":"who cooks his brew with Lutheran batteries","score":2,"comments":[]}]},{"title":"What's the definition of a politician?","not_safe_for_work":false,"locked":false,"body":"A person whose skin is so thick they can stand upright even without a spine","score":36,"comments":[{"body":"It's from the Latin \"Poli\" meaning \"many\" and \"tics\" meaning \"bloodsuckers\"\n\n*- Jay Leno*","score":9,"comments":[]},{"body":"F.","score":1,"comments":[]},{"body":"Ass.....hole!","score":1,"comments":[]},{"body":"A puppet.","score":1,"comments":[]},{"body":"Money grubbing whore","score":1,"comments":[]}]},{"title":"Why do you always let a woman go through the door first?","not_safe_for_work":false,"locked":false,"body":"Snipers!","score":31,"comments":[{"body":"I always let my wife go first so I can look at her bum.","score":14,"comments":[{"body":"That’s the real reason I let my wife go first. As The Big Bopper said “A wiggle in her walk and a giggle in her talk make the world go 'round”","score":9,"comments":[{"body":"Or as the philosopher Sir Mix-A-Lot said...","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Why do you let women walk in front \n\nLandmines","score":6,"comments":[{"body":"Only in the middle east. Before land mines men proudly walked in front","score":2,"comments":[]}]},{"body":"Am bush","score":2,"comments":[{"body":"They say you are what you eat.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Assassins","score":1,"comments":[{"body":"Ass assins","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Sinkhole","score":1,"comments":[]}]},{"title":"I had 180 people under me at my first job and I was only 14 years old.","not_safe_for_work":false,"locked":false,"body":"I mowed the town cemetery.","score":61,"comments":[{"body":"You would have corporals and whatnot under you if you did it with army cemetery","score":2,"comments":[]}]},{"title":"If I had a dime for every time I didn’t know what was happening…","not_safe_for_work":false,"locked":false,"body":"I’d be like… “Heeeyy, why y’all givin me all these dimes??”","score":5,"comments":[]},{"title":"What’s the difference between a pumpkin and a classroom filled with baby antelopes?","not_safe_for_work":false,"locked":false,"body":"Quite a few things","score":33,"comments":[{"body":"Have your upvote!","score":3,"comments":[]},{"body":"i dont get it","score":1,"comments":[]}]},{"title":"I just came across an old photo of my wife's mum.","not_safe_for_work":false,"locked":false,"body":"She hasn't spoken to me since","score":2,"comments":[{"body":"Funny, I just did the same thing!","score":2,"comments":[]}]},{"title":"A traditional Thanksgiving...","not_safe_for_work":false,"locked":false,"body":"This year we are going to have a traditional Thanksgiving at our house. \n\nWe are going to invite the neighbors over for a huge feast, and then kill them and take their land.\n\n\\-Jon Stewart","score":1,"comments":[]},{"title":"A little boy is born, and has only his head","not_safe_for_work":false,"locked":false,"body":"He lives like this for years, until one Christmas, he finds a torso under the tree.\n\nHe says “Mom! Do you think next year Santa will bring me some arms?”\n\n“He just might.” She replies.\n\nThe next year, sure enough, there’s a pair of arms under the tree.\n\nAgain the boy asks his mom “Do you think next year I’ll be gifted some legs?”\n\n“Maybe!” His mother says.\n\nThe next year, there are his legs. He finally has all his body parts.\n\n“I must go across the street and show my friend Johnny!” He says. So he goes out into the street…\n\nAnd gets hit by a car.\n\n…He should’ve quit while he was a head.","score":80,"comments":[{"body":"Whenever I see this setup, I always check to see if it's the \"quit while you're a head\" punchline or the \"I hope it's not another fucking hat\" punchline.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"give yourself a hand for such a good joke","score":5,"comments":[]},{"body":"Does anyone remember “the head detective” from in living color? I pictured the little boy looking like that.","score":3,"comments":[]},{"body":"Well at least he is already...ahead...in life","score":3,"comments":[]},{"body":"I'm going to go out on a limb and say he doesn't make it","score":5,"comments":[{"body":"Well not his limb, that's for sure.","score":5,"comments":[]}]},{"body":"*HEADING OF THIS COMMENT: I came up with an alternate completion of the story off the top of my head:*\r  \n\r  \n**A little boy is born, and has only his head**\n\nSadly, there were no opportunities to get ahead in his hometown in the north of England, despite the fact that he was named head boy in school by the head teacher. So, as soon as he was old enough, he headed out to the American wild west. He arrived in a small town where the sheriff was in way over his head, always preferring to keep his head down in any conflict rather than bringing matters to a head.\r  \n\r  \nThe next election was imminent, and the thought entered our immigrant's head that the sheriff's job wasn't difficult. Anybody with a head on his shoulders could do the job. He would just need to keep his head whenever a crisis reared its ugly head. Our hero knew how to use his head; he could do job standing on his head! The current sheriff was off his head with liquor most of the time and would probably be unable to head off a challenge. The new guy registered to run for office and, despite some headwinds from the sheriff's hard-headed supporters, his campaign built up a head of steam.\r  \n\r  \nThe sheriff kept his head buried in the sand, sure that the head start he had as incumbent would be enough. He ignored advisors who gave him a heads up about the real situation. They warned him that there was another candidate who was head and shoulders above him, and that heads were going to roll if he lost. It never entered his head that he might not win — apparently the fame of being head law officer for so long had gone to his head.\r  \n\r  \nIn the end, the voters did indeed pull their heads out and turned the town's politics on its head. The ex-sheriff was left scratching his head, trying to get his head around what had happened. He couldn't make head or tail of it.\r  \n\r  \nThe new sheriff was thrilled, light-headed with joy. At first, things went quite well. The most beautiful woman in town — a real head-turner — fell head over heels in love with him. They were married by the head of the diocese. Those were heady days indeed!\r  \n\r  \nHowever, as time passed, he found the job wasn't all he'd thought it would be. The salary was barely enough for him to keep his head above water. In town meetings, he got no respect, having to shout he head off to be heard. The townspeople were so thick-headed that trying to manage them was like hitting his head against a brick wall. He grew frustrated at his lack of success and hung his head with shame. When his wife left him for an outlaw, he lost his head and challenged him to a head-to-head duel. As he was infinitely slow on the draw, the bad guy shot him. As he lay on the dusty road, bleeding from a head wound, he whispered, \"I wish I'd never left Gateshead.\"","score":3,"comments":[{"body":"I'm surprised this hasn't had more comments. I thought it was brilliant. But you missed out the details of his first night as a married man when his wife gave him head. But maybe that was the one and only time, because after that she always had a headache.","score":2,"comments":[{"body":"Hahaha, missed that one!","score":2,"comments":[]}]}]},{"body":"If the car didn't hit his head, at worst he was back where he started.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"the ring","not_safe_for_work":false,"locked":false,"body":"My girlfriend got really excited last night when I went down on one knee and handed her the Ring. We take vintage horror movie night very seriously.","score":4,"comments":[]},{"title":"What do you call a cow with no legs?","not_safe_for_work":false,"locked":false,"body":"Ground beef.","score":0,"comments":[{"body":"What about a cow with two legs?\n\nLean Beef","score":1,"comments":[]},{"body":"Damn. Never heard that one before\n\n\n\n\n\n\n(Do I really need the fuckin /s? I thought people could pick up on sarcasm.)","score":1,"comments":[]},{"body":"Why do cows have hooves?\n\nLactose.","score":1,"comments":[]}]},{"title":"A modern day ghost story","not_safe_for_work":false,"locked":false,"body":"Bill was on the side of the road hitch-hiking on a very dark night and in the midst of a fierce rain storm.\n\nThe night was rolling on, and no car went by. The storm was so strong he could hardly see a few meters ahead of him.\n\nSuddenly through the swirling rain Bill saw a car slowly coming towards him.  And as it drew level with him, it stopped.\n\nDesperate for shelter and without really thinking about what he was doing, Bill got into the back seat of the car and closed the door.  That was when he realized there was nobody behind the wheel and the engine wasn't even on!\n\nMysteriously and soundlessly, the car started moving slowly forward.  Bill looked at the road and saw a curve approaching.  Now he was scared, and he began to fear for his  life.  But just before he reached the curve, a ghostly hand appeared  through the window of the car, and turned the steering wheel.\n\nBill, paralysed with terror, watched how the hand appeared every time they came to a curve.\n\nWhen he saw the lights of a pub down the road, Bill gathered all  his bravery and strength, jumped out of the car, and ran to to the pub.\n\nWet and out of breath, he rushed inside and asked for two shots of scotch.  Shaking  and half crying, he began telling everybody about the horrible  experience he had just been through.  A silence enveloped everybody when they realized he was  not drunk, but was for real.\n\nAbout 10 minutes later, two guys walked into the same pub. They were also wet, and were out of breath. Looking around and seeing Bill sobbing at the bar, one said to the other, \"Hey Bruce… that's the idiot who got in the car while we were pushing it.\"","score":529,"comments":[{"body":"Fear is too harmful for the heart .....","score":32,"comments":[{"body":"Fear stress anxiety. Stay away from this and our hearts will be healthier","score":7,"comments":[{"body":"I sense a vicious, if mildly ironic, circle forming here.","score":2,"comments":[]}]},{"body":"&gt; Fear is too harmful for the heart \n\nThat's why I am fearless since last Christmas, when I gave her my heart, but the very next day she gave it away.","score":6,"comments":[]}]},{"body":"When I was a kid, we were going to the store. I looked out the window of the car and saw the car next to me had no driver. I squealed at my mom but then looked up and realized it was being towed.","score":12,"comments":[]},{"body":"“Large Marge sent me.”\n- Mr. Peewee Herman","score":3,"comments":[]},{"body":"But that doesn't explain the ghostly hand","score":-10,"comments":[{"body":"You've got 2 brain cells fighting for third place.","score":60,"comments":[{"body":"i'm stealing that line, you have my upvote and award","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"One of the guys was sticking his hand through the window to move the steering wheel and make the car turn.","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What do you call it when a Doctor gives themself stitches?","not_safe_for_work":false,"locked":false,"body":"Suture self!","score":30,"comments":[{"body":"That joke is just sew-sew.\n\nIt's just knot that great.","score":8,"comments":[{"body":"I disagree, it had me in stitches!","score":3,"comments":[{"body":"One upvote and one downvote.\n\nI guess it's a tie.","score":1,"comments":[]}]}]},{"body":"This joke is hanging by a thread.","score":2,"comments":[]},{"body":"Only after they've pulled themself together.","score":1,"comments":[]}]},{"title":"Do you know about the butcher that kept accidentally backing into the meat grinder?","not_safe_for_work":false,"locked":false,"body":"He always got a little behind with his orders","score":82,"comments":[{"body":"Yeah because he did a half assed job","score":27,"comments":[{"body":"Now he's the butt of every joke!","score":12,"comments":[]},{"body":"Damnit this is way funnier than the original joke","score":10,"comments":[]}]},{"body":"Mate of mine kept sticking his nob in the bacon slicer, so he got fired. I asked him what happened to the bacon slicer\n\nHe said she got fired too","score":13,"comments":[]},{"body":"His daughter did it once too. Dis-assed-her!","score":3,"comments":[]},{"body":"Did you hear about the firefly that backed up into an electric fan? He was delighted no end.","score":3,"comments":[]},{"body":"it was a diss...ass...ter.","score":5,"comments":[]},{"body":"The butcher was a woman.  Disaster.","score":2,"comments":[]},{"body":"Did you hear about the one with the Chinese Godfather? They made him an offer he couldn't understand.","score":1,"comments":[]},{"body":"An oldie but goodie","score":1,"comments":[]}]},{"title":"What did Ned Flanders say when he met a famous guitarist?","not_safe_for_work":false,"locked":false,"body":"Hi diddley Bo Diddley!","score":0,"comments":[]},{"title":"What is a pirate’s favorite letter?","not_safe_for_work":false,"locked":false,"body":"It is the c they love","score":18,"comments":[{"body":"What branch of the military is best suited for a pirated?\n\n**The AARRRRRRRMY!**\n\nNO.  The navy, stupid.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"RRrrrrrr","score":5,"comments":[]},{"body":"And his  favorite element?\n\n**Arrrrrrrgon!**\n\nNo!\n\nWait!\n\n**GOLD.**","score":5,"comments":[{"body":"Au. I should’ve known that.","score":4,"comments":[]}]},{"body":"Is this the point where I say “No it’s P, because without it they’re *irate*”?","score":3,"comments":[]},{"body":"Probably a letter from his parents. I’d assume he doesn’t get to visit often.","score":2,"comments":[]},{"body":"Sea  four...","score":1,"comments":[]},{"body":"Probably the 20th time I read this joke on this sub this year.","score":1,"comments":[{"body":"And still funny","score":2,"comments":[]}]},{"body":"I thought it was scur-V","score":1,"comments":[]}]},{"title":"Shame on you Skippy","not_safe_for_work":false,"locked":false,"body":"A woman goes to her boyfriend's parent's house for dinner.\n\nThis is to be her first time meeting the family and she is very nervous.\n\nThey all sit down and begin eating a fine meal.\n\nThe woman is beginning to feel a little discomfort, thanks to her nervousness and the broccoli casserole. \n\nThe gas pains are almost making her eyes water.\n\nLeft with no other choice, she decides to relieve herself a bit and lets out a dainty fart.\n\nIt wasn't loud, but everyone at the table heard the pouf.\n\nBefore she even had a chance to be embarrassed, her boyfriend's father looked over at the dog that had been snoozing at the woman's feet and said in a rather stern voice, \n\n\\- \"Skippy!\".\n\nThe woman thought, \n\n\\- \"This is great!\" and a big smile came across her face.\n\nA couple of minutes later, she was beginning to feel the pain again.\n\nThis time, she didn't even hesitate. She let a much louder and longer fart rip.\n\nThe father again looked and the dog and yelled, \n\n\\- \"Dammit Skippy!\"\n\nOnce again, the woman smiled and thought \"Yes!\".\n\nA few minutes later the woman had to let another one rip. \n\nThis time she didn't even think about it. \n\nShe let rip a fart that rivaled a train whistle blowing!\n\nOnce again, the father looked at the dog with disgust and yelled,\n\n\\- \"Dammit Skippy, get away from her before she shits on you!\"","score":141,"comments":[{"body":"Gender reversal from the original - still works!","score":6,"comments":[]},{"body":"My dad use to say a similar version of this joke. He passed 3 months ago, but I'll always remember this dad joke and smile","score":5,"comments":[]}]},{"title":"Generational Trauma is bullshit","not_safe_for_work":false,"locked":false,"body":"My parents belittled me for every small mistake or just being myself as a kid, and I turned out fine.  I only have two felony assaults on my record, and I control my anger by making my son cry when I get home from work.","score":0,"comments":[{"body":"No, it is seriously ingrained in your DNA. I set my table cloth on fire when I was a kid. My grandfather was in a major fire and lived. Heard about it every year. My 5 year old did not know any of this. Seen and say in 10 different fire trucks before. Got the fire department to drive a trick for his birthday during Covid. \n\nKid loves firetrucks and went into flat out shock when it came up the street with lights and sirens. Paralyzed with fear, could not talk or function at all. Surprised he didn’t wet himself. Call it what you want I’ve seen it with my own eyes.","score":2,"comments":[]},{"body":"Why not bouth ?.....its usualy like that","score":1,"comments":[]}]},{"title":"A priest, a minister and a rabbi go fishing","not_safe_for_work":false,"locked":false,"body":"\nAfter rowing thier small boat to thier favorite spot, the priest says to the rabbi;\n\n\"This a great spot. Lots of nice fish\"\n\nAfter about an hour, the priest stands up  announces he needs to answer the call of nature, steps out of the boat and walks across the water to shore, disappears for a couple of minutes, the reappears and walks back to the boat.\n\nThe rabbi sees this and is stunned. Before he can say anything, the minister says, \"Me too\", and steps out of the boat, walks across the water, and returns, walking across the waves.\n\nThe rabbi is beside himself.  He thinks, have I been a follower of the wrong faith? He says afew prayers  then says, well gentlemen it's my turn!\n\nThe rabbi steps out of the boat and immediately disappears beneath the waves.\n\nThe rabbi pops up to the surface and the priest and minister haul him into the boat.\n\nThe priest says to the minister : \"don't you think we should have told about the rocks?\"","score":23,"comments":[{"body":"I know a better version.\n\nJesus and Chuck Norris are fishing, when suddenly their boat starts sinking. Jesus exits the boat and walks on the water, until he’s safe on the shore. Then Chuck Norris does the same. \n\nJesus: „You also knew about the stepstones?“\n\nChuck Norris: „Stepstones?“","score":6,"comments":[]},{"body":"Similar joke in the Soviet film The Diamond Arm (1969): https://youtu.be/kf06Hh-_dmY","score":3,"comments":[]},{"body":"?","score":0,"comments":[{"body":"The priest and minister walked on rocks that were just below the surface, but apparently the rabbi is blind and stepped off the wrong ide of the boat.","score":1,"comments":[]}]}]},{"title":"Request: I am doing a school project on JFK, give me all the jokes you know","not_safe_for_work":false,"locked":false,"body":"I'm doing a project on JFK and wanted to add some not-so-subtle jokes in it, obviously about his assassination. I only know a couple and was hoping there were some more floating out on the internet.\n\nExample: he was a very open-minded president","score":1,"comments":[{"body":"Guy gets his brains blown out in front of his wife and the whole world, haha so hilarious.","score":6,"comments":[]},{"body":"[This one](https://www.reddit.com/r/Jokes/comments/how61s/my_favorite_sex_position_is_called_the_jfk/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button) seems to have been popular","score":2,"comments":[]},{"body":"Just Google “JFK Jokes”","score":1,"comments":[]},{"body":"My favorite Kennedy joke is [Operation Mongoose](https://en.wikipedia.org/wiki/Operation_Mongoose).\n\n&gt;The CIA even tried to embarrass Castro by attempting to sneak thallium salts, a potent depilatory, into Castro's shoes, causing \"his beard, eyebrows, and pubic hair to fall out\". The idea for this plan revolved around “destroying Castro's image as ‘The Beard’”.","score":1,"comments":[]}]},{"title":"If Xmas is an abbreviation of Christmas, then","not_safe_for_work":false,"locked":false,"body":"Xbox is short for Christ Box","score":0,"comments":[{"body":"This sub is awful smh","score":1,"comments":[]}]},{"title":"It’s hard to have sex with a marine mammal under a tarp,","not_safe_for_work":true,"locked":false,"body":"for all in tents and porpoises.","score":3,"comments":[]},{"title":"I need help finding a Tim Burton movie","not_safe_for_work":false,"locked":false,"body":"I Googled \"Tim Burton movie where Johnny Depp plays a quirky, androgynous loner,\" and Google told me to be more specific.","score":7,"comments":[{"body":"Edward Scissorhands?","score":2,"comments":[]},{"body":"Edward Scissorhands?  Or Dark Shadows?","score":2,"comments":[]},{"body":"What's eating Gilbert grape","score":2,"comments":[{"body":"Ed Wood?","score":2,"comments":[]}]},{"body":"Sleepy hollow","score":2,"comments":[]},{"body":"Charlie and the Chocolate Factory?","score":1,"comments":[]},{"body":"I don’t get it","score":1,"comments":[{"body":"See the number of different titles mentioned above.","score":1,"comments":[]}]},{"body":"Donnie Darko I think , look it up","score":1,"comments":[]}]},{"title":"Did you hear the one about the necrophiliac who was into bestiality?","not_safe_for_work":true,"locked":false,"body":"He gave it up when he realized he was just beating off a dead horse.","score":4,"comments":[{"body":"yea i heard about the guy his name's bammie","score":1,"comments":[]},{"body":"I heard he was a vet who tried to bring a dog back to life with reverse doggy style, it didn’t came, the reverse CPR did though, he was good at giving blowjobs","score":-1,"comments":[]}]},{"title":"Why does Argentina have the least pollution?","not_safe_for_work":false,"locked":false,"body":"Because they have Buenos Aíres","score":13,"comments":[{"body":"It's not so Chile","score":2,"comments":[]}]},{"title":"I was really depressed after I injured my neck in a car accident last year.","not_safe_for_work":false,"locked":false,"body":"Now I can look back and laugh.","score":11,"comments":[{"body":"Ha ha ha ha! Nice one!","score":1,"comments":[]}]},{"title":"List if 10 worst dog breeds","not_safe_for_work":false,"locked":false,"body":"1. There\n2. Are\n3. No\n4. Bad\n5. Dog \n6. Breeds \n7. Only\n8. Bad \n9. Owners\n10. Chihuahuas","score":2658,"comments":[{"body":"I guess I've had a couple of these breeds. My most recent dog was #5, and I had a couple of cats who were #9.","score":443,"comments":[{"body":"Dogs have owners, cats have staff","score":266,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My cat is #1","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I've actually met an unambiguously sweet and friendly chihuahua, she was just the dearest thing. That said, I agree, lol.","score":242,"comments":[{"body":"I think it is a mix, but there's an amazingly sweet chihuahua in my neighbourhood whose owner is an old guy in a mobility scooter. That doggo just runs everywhere, back and forth, towards any stranger, back to owner, smelling stuff. Super adorable","score":38,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I'm still laughing at this. Good job.\n\n(Although I knew a very sweet dog who was *half* Chihuahua. The good half, I reckon.)","score":181,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I would never recommend wolf hybrids to people not trained for it, which is most people.\n\nSo that can go on the list.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This joke usually does list like \n10 \n9 \n8 \nSo chihuahuaz ends at nr 1","score":84,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"There is another","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I once met a dog that was an unusual mixture: her mother was a Great Dane and her father was a Chihuahua. Nobody knows who put him up to it 😜","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Did you hear about the masseuse who refused to treat women?","not_safe_for_work":false,"locked":false,"body":"He was a massagenist","score":6,"comments":[{"body":"Masseuse is a woman who gives massages.  You want Masseur.","score":3,"comments":[]}]},{"title":"Topical","not_safe_for_work":false,"locked":false,"body":"Someone tried to sell me a box of seaweed this morning. Must be Vraic Friday.","score":0,"comments":[]},{"title":"An old man spoke to his wife","not_safe_for_work":false,"locked":false,"body":"He said \"Edna, I've witnessed a miracle! Last night when I got up to go to the bathroom, GOD turned the light on for me! And when I was finished, He turned the light off!\" \n\nAnd his wife said, \"Harry, you're pissing in the fridge again!\"","score":83,"comments":[{"body":"Somebody's got to.","score":8,"comments":[{"body":"R/cursedcomments","score":3,"comments":[{"body":"Well somebody gotta refill the OJ you know","score":2,"comments":[]}]}]},{"body":"A man walks into a room with a pig stuffed under his arm and says \"this is the pig I've been fucking for the last 15 years!\" His wife says \"do you mind?\" Husband says \"I wasn't talking to you!\".","score":4,"comments":[{"body":"I heard this as:\nA man bursts into a room with a duck under his arm and said, “This is the pig I’ve been fucking!”\nHis wife said, “That’s not a pig! It’s a duck!”\nThe man said, “I’m talking to the duck!”","score":3,"comments":[]}]},{"body":"“God damn it, Harry! The fish is covered in piss! What are you supposed to have for dinner now? Wait, are you eating that? Harry? What the fuck? I’m getting a new husband.”","score":-23,"comments":[{"body":"You ok?","score":8,"comments":[]}]}]},{"title":"Plato didn't have a wife or kids..","not_safe_for_work":false,"locked":false,"body":"Clearly, all his relationships were platonic.","score":24,"comments":[{"body":"[deleted]","score":4,"comments":[{"body":"As long as you say no homo","score":2,"comments":[]}]},{"body":"Fun fact: in Lucianus' *Verae Historiae* (True Stories), Plato is described as being in a heaven of his own, because he's so in love with all his ideas and his city that he didn't need anybody else. Even in Antiquity, people were making fun of him and his 'platonic' behaviour! ;-)","score":4,"comments":[]},{"body":"What is the joke? Platonic relationships are called that because of Plato.","score":2,"comments":[{"body":"I’m not sure it even counts as a joke","score":1,"comments":[{"body":"Hold it boys! Platonic def comes from Plato (think: Socratic from Socrates).\n\nAlso his idea of \"ideal\" relationship was a sensual love between same sex. So yes, gay sex was platonic in his definition.\n\nAs far as explaining my joke. I'll never do that, lol\n\n(As you were)","score":2,"comments":[{"body":"Wasn’t his point that true love required intellectual parity, which was only possible between men because women were so inferior in intellect (Ancient Greece being as misogynistic as any other culture back then)?   Sex with women was strictly for jollies and procreation","score":2,"comments":[]}]}]}]},{"body":"I fucking hate Plato and Socrates so much their theories are so stupid","score":1,"comments":[{"body":"Just know..................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................they hate you, too. They wanna have a fight with you......inside the School of Athens. At 3:00.","score":2,"comments":[{"body":"Let them try. I'll kick their ancient toga clad twink asses any day","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"A man claiming he is Jesus is brought into a mental hospital...","not_safe_for_work":false,"locked":false,"body":"He is asked, \"Why do you think you are Jesus?\"\nHe replies, \"God told me so!\"\nImmediately, the patient behind him stands up and shouts, \"No I didn't!\"","score":369,"comments":[{"body":"I just watched this episode of Lucifer lol","score":20,"comments":[]},{"body":"Reminds me of The Dream Team where Peter Boyle thinks he is \"The Living Christ.\"","score":7,"comments":[]},{"body":"Well that settles that","score":18,"comments":[]},{"body":"I've heard of a book, but never read it, where someone put three people who all thought they were Jesus into very close proximity. Maybe even the same house? The book was called The Three Christs of Ypsilanti. Someday when my kids are out of diapers I will buy a copy and read it.","score":14,"comments":[{"body":"That's nothing. I once went to Mexico and half the people there believed they were Jesus.","score":21,"comments":[{"body":"Nicely done, sir. You got a genuine chuckle from me on a tumultuous day. Thanks.","score":7,"comments":[]}]}]},{"body":"Je-sus","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"So one of them tells the truth, and the other doesn't.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Would’ve been better if he said “my Father, Jehova, said so.\n\nAnd then you’d hear a guy behind him clear his throat and say, “I said no such thing!”","score":2,"comments":[{"body":"Yahweh*  \n\nThat is the original Hebrew word.  Jehovah is the “real name of God” but is constructed out of names that people made up while trying to avoid saying the name of God.  \n\nhttps://m.youtube.com/watch?v=__7t_bGI8oo","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"A man gets a text from his neighbor","not_safe_for_work":true,"locked":false,"body":"It says “I have to come clean, I’ve been helping myself to your wife everyday. I know how wrong it is but it’s so fun. I’m sorry.” The man is reasonably angry and yells at his wife “you stupid whore!” And he stabs her with a machete. After he buries her body, he gets another text. “I meant Wi-Fi I hate autocorrect ”","score":7,"comments":[]},{"title":"I told my friend that a cannibal took my girlfriend to see a Russell Crowe film","not_safe_for_work":false,"locked":false,"body":"\nMy friend asked me: Gladiator?\n\nI said : No, I really miss her","score":39,"comments":[{"body":"He  did say she’d A Beautiful Mind though.","score":5,"comments":[]},{"body":"He is unhinged now though","score":5,"comments":[]}]},{"title":"When does a secretary become a permanent fixture ?","not_safe_for_work":true,"locked":false,"body":"When she gets screwed on a desk...","score":16,"comments":[{"body":"I’m teaching this to my 4yo cousin","score":4,"comments":[{"body":"Might have to use the term Administrative Assistant though, which kinda ruins the joke.","score":3,"comments":[]}]}]},{"title":"Why did the doe become a prostitute?","not_safe_for_work":false,"locked":false,"body":"So she could make a buck.","score":7,"comments":[{"body":"Tha doe is a hoe","score":3,"comments":[]}]},{"title":"Confucius says","not_safe_for_work":false,"locked":false,"body":"Man who fill tart with cream, not necessarily baker!\n \nAnd also\n\nMan who walk through doorway sideways, going to bang cock","score":1,"comments":[]},{"title":"Silly Joke from Sunny (please mods dont delete this one, im trying my best not to break the rules ._. )","not_safe_for_work":false,"locked":false,"body":"A man had a flat tire on his way home, he had no signal on his phone so he was forced to wander to the nearest town on foot. There he came across 2 houses next to each other. he knocked on the first house but noone open the door. The man saw light coming out the window and natually he took a look inside. there he saw a woman shaving her leg in the livingroom, and a man standing in the kitchen holding one finger inside a fishbowl and another finger pointing to his butt.\n\nwith no luck getting their attention, the man outside decided to knock on the second house. There he knocked and finally could ask for help towing his car. the man also explained the homeowner what he had seen the first house he came to ask for help.\n\nthe homeowner sigh and replyed: yeah this couple are deaf, the woman probably said to her husband to mow the lawn, and her husband replyed that she could kiss his ass because he wanted to go fishing.","score":0,"comments":[{"body":"Decent but hard to decipher. Proof read, G","score":1,"comments":[]}]},{"title":"2 newfies go fishing","not_safe_for_work":false,"locked":false,"body":"\nSo they go to the local marina and rent a small boat. After trying several spots they find a good spot and land many nice fish.\n\nThe guy in the front says to his buddy:\n\n\" This is a great spot, we should mark it\"\n\nSo his pal pulls a sharpie marker out of his coat  and draws a big X on the bottom of the boat.\n\n\"That ain't gonna work, siily\" says the guy in the bow.\n\n\"Why not?\" Asks the other guy. Bow guy responds:\n\n\"We might not get the same boat next time\"","score":13,"comments":[{"body":"My brother was born in Newfoundland and I approve of this statement.","score":4,"comments":[]},{"body":"ROFL","score":1,"comments":[]}]},{"title":"I don’t know who this Bill guy is,","not_safe_for_work":false,"locked":false,"body":"Can somebody tell me why they keep on sending me mail?","score":24,"comments":[{"body":"Is it Bill Payer? I’ve been looking for him, apparently I’ve gotta ask for his permission","score":1,"comments":[]},{"body":"My best friend is named Will. Why do I have to keep firing at him?","score":0,"comments":[{"body":"Because you keep missing.","score":1,"comments":[]}]}]},{"title":"Yo momma so nice","not_safe_for_work":false,"locked":false,"body":"Yo momma so nice I had to say it twice","score":2,"comments":[{"body":"Damn now that‘s ugly","score":-1,"comments":[]},{"body":"Shit. I had to do her twice","score":0,"comments":[]}]},{"title":"Yo mama so fat, they did a story on how fat she was on the channel 3 news","not_safe_for_work":false,"locked":false,"body":"I switched to channel 7 and you could still see her ass in the corner of the screen","score":7296,"comments":[{"body":"Yo mama so ugly criminals break into her house just to close the curtains","score":1727,"comments":[{"body":"Yo mama so ugly, her portraits hang themselves.","score":598,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Trampolines were called jumpolines until yo mama got on one back in the day","score":374,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You mama so ugly that your daddy took her to work each day, just so he didn't have to kiss her goodbye.","score":1020,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yo momma is so fat when she hauls ass she has to take two loads.\n\nYo momma so fat she walked across the TV  and I missed a whole episode of 60 minutes. \n\nYo momma so fat when she went to the beach people tried to shove her back into the ocean to save her.","score":407,"comments":[{"body":"Yo momma is so fat it takes two trains and a bus just to get to her good side.","score":138,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yo momma is so fat she keeps pesos in one pocket and yen in the other","score":131,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yo mamma so fat she needs to iron her pants in the driveway.","score":122,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Yo mama so old, her chiropractor is a paleontologist","score":344,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The earth was flat…\n\nThen they buried yo mama","score":489,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"A politician dies","not_safe_for_work":false,"locked":false,"body":"So a politician dies and ends up standing in front of the pearly gates. Saint Peter looks at him for a second, flicks through his book, and finds his name.  \n\n\n\"So, you're a politician...\" \"Well, yes, is that a problem?\" \"Oh no, no problem. But we've recently adopted a new system for people in your line of work, and unfortunately you will have to spend a day in Hell. After that however, you're free to choose where you want to spend eternity!\"  \n\n\n\"Wait, I have to spend a day in Hell??\" says the politician. \"Them's the rules\" Says St Peter, clicks his fingers, and WOOMPH, the guy dissapears...  \n\n\nAnd awakes, curled up with his hands over his eyes, knowing he's in Hell. Cautiously, he listens for the screams, sniffs the air for brimstone, and finds... Nothing. Just the smell of, is that fabric softener? And cut grass, this can't be right?  \n\n\n\"Open your eyes!\" says a voice. \"C'mon, wakey wakey, we've only got 24 hours!\". Nervously, he uncovers his eyes, looks around, and sees he's in a hotel room. A nice one too. Wait, this is a penthouse suite... And there's a smiling man in a suit, holding a martini. \"Who are you??\" The politician asks. \"Well, I'm Satan!\" says the man, handing him the drink and helping him to his feet. \"Welcome to Hell!\" \"Wait, this is Hell? But... Where's all the pain and suffering?\" he asks. Satan throws him a wink. \"Oh, we've been a bit mis-represented over the years, it's a long story. Anyway, this is your room! The minibar is of course free, as is the room service, there's extra towels next to the hot-tub, and if you need anything, just call reception. But enough of this! It's a beautiful day, and if you'd care to look outside...\" Slightly stunned by the opulent surroundings, the man wanders over to the floor-to-ceiling windows through which the sun is glowing, looks far down, and sees a group of people cheering and waving at him from a golf course. \"It's one of 5 pro-level courses on site, and there's another 6 just a few minutes drive out past the beach and harbour!\" says Satan, answering his unasked question. So they head down in the lift, walk out through the glittering lobby where everyone waves and welcomes the man, as Satan signs autographs and cherrily talks shop with the laughing staff. And as he walks out, he sees the group on the golf course are made up of every one of his old friends, people he's admired for years but never met or worked with, and people whose work he's admired but died long before his career started. And out of the middle of this group walks his wife, with a massive smile and the body she had when she was 20, who throws her arms around him and plants a delicate kiss on his cheek. Everyone cheers and applauds, and as they slap him on the back and trade jokes, his worst enemy arrives, as a 2 foot tall goblin-esque caddy. He spends the day in the bright sunshine on the course, having the time of his life laughing at jokes and carrying important discussions, putting the world to rights with his friends while holding his delighted wife next to him as she gazes lovingly at him. Later, they return to the hotel for dinner and have an enormous meal, perfectly cooked, which descends into a food-fight when someone accidentally throws a bread roll at the next table (where Ghandi is having a game of truth-or-dare with Marylin Monroe). As everyone is falling about laughing and flinging breadsticks at each other, his wife whispers in his ear... And they return to their penthouse suite, and spend the rest of the night making love like they did on their honeymoon. After 6 hours of intense passion, the man falls deep into the 100% Egyptian cotton pillows, and falls into a deep and happy sleep...  \n\n\nAnd is woken up by St Peter. \"So, that was Hell. Wasn't what you were expecting, I bet?\" \"No sir!\" says the man. \"So then\" says St Peter \"you can make your choice. It's Hell, which you saw, or Heaven, which has choral singing, talking to God, white robes, and so on\". \"Well... I know this sounds strange, but on balance, I think I'd prefer Hell\" says the politician. \"Not a problem, we totally understand! Enjoy!\" Says St Peter, and clicks his fingers again.  \n\n\nThe man wakes up in total darkness, the stench of ammonia filling the air and distant screams the only noise. As he adjusts, he can see the only light is from belches of flame far away, illuminating the ragged remains of people being tortured or burning in a sulphurous ocean. A sudden bolt of lightning reveals Satan next to him, wearing the same suit as before and grinning, holding a soldering iron in one hand and a coil of razor-wire in the other. \"What's this??\" He cries. \"Where's the hotel?? Where's my wife??? Where's the minibar, the golf-courses, the pool, the restaurant, the free drinks and the sunshine???\"  \n\n\n\"Ah\", says Satan. \"You see, yesterday, we were campaigning. But today, you voted...\"","score":21344,"comments":[{"body":"Why do politicians ask for a Bible on their deathbeds? \n\nTo look for a loophole.","score":913,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This brought me joy","score":2279,"comments":[{"body":"And knowing that most of the US Congress would end up there would please me even more.","score":923,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I heard it with sales. Yesterday you were a prospect. Today you are a customer.","score":756,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This would still be funny with just the title.","score":459,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Really didn't have to be a 700 words essay on how good is hell to deliver that punchline, but I didn't hear this joke in a while so get an upvote","score":3325,"comments":[{"body":"It works a lot better if you read it in Norm MacDonald’s voice.","score":547,"comments":[{"body":"Almost all jokes do.","score":195,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"Well, ya see, there was *this guy*... he was ah, a uhh, well y'know, whaddya call it... *A POLITICIAN*, y'know? And that's all well and good, you know...just doing....well *politics* I suppose, considering his job title I think it's fair to infer that to be true. And aaaahhhh...***HE DIES***. Tragic for anyone really, just really...well...kind of a *bummer* one could say. But, aaaahhhh.... listen to *THIS*. I know it's hard to believe, but aaahhh, this guy meets SAINT PETER OF ALL PEOPLE, if you can believe it. I suppose St. Peter isn't really a person per se, but nevermind that. So anyway this *politician* fellah, well....","score":387,"comments":[{"body":"Anyway, this satan guy, he was a real JERK.","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"\"What will life in Russia be like in 2023?\"","not_safe_for_work":false,"locked":false,"body":"\"It will be worse than 2022 but better than 2024\"","score":3,"comments":[]},{"title":"Two men walk past a slogan in the Soviet Union","not_safe_for_work":false,"locked":false,"body":"The slogan reads: \"We shall liberate the people of the world from the chains of capitalism!\". One of the men tells the other: \"This is actually true. Remember the gold chain I had?\"","score":4,"comments":[{"body":"Nice.","score":1,"comments":[]},{"body":"Cute one!","score":1,"comments":[]},{"body":"It was a good one, about 40 years ago.","score":1,"comments":[]}]},{"title":"Elsa was complaining to her friend about a boy from their class.","not_safe_for_work":false,"locked":false,"body":"\n“He’s pretty creepy.  He knows so many dirty songs!”, she said.\n\n“And he sings them around you?”, her friend asked.\n\n“No, but he whistles them.”","score":46,"comments":[{"body":"The plot is that Elsa knows them right?","score":11,"comments":[{"body":"Inasmuch as there is a plot, yes.","score":9,"comments":[{"body":"Three acts in five sentences.","score":7,"comments":[]}]},{"body":"The plot twist is they're actually clean songs that have dirty parody versions, and the boy knows the clean songs while Elsa only knows the dirty versions.","score":6,"comments":[]}]},{"body":"\"No, he butt-whistles them\"","score":4,"comments":[{"body":"But does he whistle him?","score":2,"comments":[]}]},{"body":"I dont get it.","score":2,"comments":[]},{"body":"He was whistling [The Assumption Song](https://youtu.be/TywmpMQYojs).","score":2,"comments":[]},{"body":"But she was teasing him by being naked under all those clothes.","score":-15,"comments":[]}]},{"title":"Little Johnny and Baseball","not_safe_for_work":false,"locked":false,"body":"Once a man having an affair unexpectedly finds the husband returning earlier than expected, He ends up hiding in the closet, where, unfortunately  for him, little Johnny is also hiding.\n\nJohnny: “Dark in here.”  \n “Yes it is.”  \n “I have a baseball.”  \n “That’s nice.”  \n “Want to buy it?”  \n “No, thanks.”  \n “My dad’s outside.”  \n “OK, how much?”  \n “$250.”\n\nIn the next few weeks, it happens again that little Johnny and his mom’s  \nlover are in the closet together.\n\n“Dark in here.”  \n“Yes, it is.”  \n“I have a baseball glove.”  \n “How much?”  \n“$750.”  \n“Fine.”\n\nA few days later, Johnny's father says to him, “Grab your bat and your glove. Let’s go outside and play some baseball.”\n\n\"I can’t. I sold them.”\n\nHis father is stunned. “What? How did you sell them?”\n\nJohnny replies, “Sold them to my friend for $1,000.”\n\nHis father is frustrated. “That’s terrible to overcharge your friends like that.  That is way more than those two things cost. I will have to take you to  church and make you confess.”\n\nThey go to church and his father alerts the priest, and makes the  \nlittle boy sit in the confession booth and closes the door.\n\n“Dark in here.”\n\n“Don’t start that shit again”","score":25,"comments":[{"body":"I just love jokes that have little boys and priests in them.","score":3,"comments":[{"body":"Better than jokes that have priests in little boys.","score":9,"comments":[{"body":"Well, you beat me to that one LMAO","score":1,"comments":[]},{"body":"So my life was a joke?","score":0,"comments":[]}]}]}]}]}