{"name":"learnprogramming","description":"A subreddit for all questions related to programming in any language.","subscribers":3555309,"posts":[{"title":"New? READ ME FIRST!","not_safe_for_work":false,"locked":true,"body":"# Welcome to /r/learnprogramming!\n\n## Quick start:\n\n1. New to programming? Not sure how to start learning? See [FAQ - Getting started][faq-start].\n2. Have a question? Our [FAQ][faq] covers many common questions; check that first. Also try searching old posts, either [via google][google] or via reddit's search.\n3. Your question isn't answered in the FAQ? Please read the following:\n\n## Getting debugging help\n\nIf your question is about code, make sure it's **specific** and **provides all information up-front**. Here's a checklist of what to include:\n\n1. A [**concise but descriptive title**][debugging-title].\n2. A [**good description**][debugging-description] of the problem.\n4.  A [**minimal**, **easily runnable**][debugging-posting], and [**well-formatted**][debugging-formatting] program that demonstrates your problem.\n5. The output you expected and what you got instead. If you got an error, include the **full** error message.\n\nDo your best to solve your problem before posting. The quality of the answers will be proportional to the amount of effort you put into your post. Note that title-only posts are automatically removed.\n\nAlso see [our full posting guidelines][debugging] and the [subreddit rules][rules]. After you post a question, **DO NOT** delete it!\n\n## Asking conceptual questions\n\nAsking conceptual questions is ok, but please check [our FAQ][faq] and search older posts first.\n\nIf you plan on asking a question similar to one in the FAQ, explain what exactly the FAQ didn't address and clarify what you're looking for instead. See our full guidelines on [asking conceptual questions][conceptual] for more details.\n\n## Subreddit rules\n\nPlease read [our rules][rules] and [other policies][policies] before posting. If you see somebody breaking a rule, report it! Reports and PMs to the mod team are the quickest ways to bring issues to our attention.\n\n\n  [faq-start]: https://www.reddit.com/r/learnprogramming/wiki/faq#wiki_getting_started\n  [faq]: https://www.reddit.com/r/learnprogramming/wiki/faq\n  [google]: https://www.google.com/#q=site:reddit.com%2Fr%2Flearnprogramming\n  [wiki]: https://www.reddit.com/r/learnprogramming/wiki/index\n  [debugging]: https://www.reddit.com/r/learnprogramming/wiki/index#wiki_getting_debugging_help\n  [debugging-title]: https://www.reddit.com/r/learnprogramming/wiki/index#wiki_writing_a_good_title\n  [debugging-description]: https://www.reddit.com/r/learnprogramming/wiki/index#wiki_writing_a_good_description_of_the_problem\n  [debugging-posting]: https://www.reddit.com/r/learnprogramming/wiki/index#wiki_posting_code\n  [debugging-formatting]: https://www.reddit.com/r/learnprogramming/wiki/index#wiki_formatting_code\n  [conceptual]: https://www.reddit.com/r/learnprogramming/wiki/index#wiki_asking_conceptual_questions\n  [rules]: https://www.reddit.com/r/learnprogramming/about/rules\n  [policies]: https://www.reddit.com/r/learnprogramming/wiki/index#wiki_rules","score":827,"comments":[{"body":"If you're reading this then it means you're trying to learn on your own, which is awesome. Don't be afraid to not know something, everyone starts from nothing. Be proud of anything you make. ","score":861,"comments":[{"body":"Can I make good money self educated? ","score":61,"comments":[{"body":"There's plenty of success stories here about getting jobs and being self-taught! You can do it, just gotta be dedicated. ","score":94,"comments":[]}]}]},{"body":"How about if there's input or output, give an example of what you think should be happening VS what is happening.\n\nI suppose that can be part of the error message if applicable. ","score":43,"comments":[{"body":"Shouldn't that always be included?","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Good idea; edited.","score":13,"comments":[]}]},{"body":"I'm not sure exactly how reddit works but if it has post templates then a part of this would definitely be useful as a post template","score":18,"comments":[{"body":"Unfortunately, post templates aren't a thing on reddit AFAIK :(","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Google and Stack Overflow, and even Reddit is used a lot by Junior and some Senior Programmers, but...","not_safe_for_work":false,"locked":false,"body":"... what about YouTube?  How often do working programmers use YouTube for knowledge?","score":122,"comments":[{"body":"Hardly ever. When you have a problem and are looking to solve it, Google and SO can get you the results before the YouTuber even finishes asking you to like the video.\n\nAlso YouTube's recommendation algorithm is way too good at distracting me.","score":306,"comments":[{"body":"On matters of repair, YouTube does the job.","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I use it to understand a concept. It is a gold mine when you find someone who can verbally explain to you how something works.\n\nFor example when learning a new CMS or just a framework the documentation often goes too much into detail before actually explaining the overall concept. Some video creators often know where they struggled and will basically guide you through it.","score":35,"comments":[{"body":"I watched a 3 hour tutorial on building a site with Laravel. It definitely had holes in the overall knowledge, but it showed me enough to understand the concepts I'd need to use for the whole project.\n\nPersonally though the best case would be having a video series that compliments a blog/wiki that basically does a video demo of the concepts described in writing.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Just some new info at relaxed pace. When I really need to know, vids aint cutting it.","score":36,"comments":[]},{"body":"I don't use it at all. Way too low information throughput.","score":89,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Primarily for entertainment really, there’s some great channels with very competent developers but it’s a different platform for a different purpose.","score":12,"comments":[]},{"body":"Very, very rarely.\n\nReading is much more efficient, and you can't copy and paste from a video.\n\nWritten content is also more likely to be edited so that it's concise and correct. Most videos aren't rehearsed, so they're just someone rambling about a topic off the top of their head.\n\nThe only time I'd prefer video is if it's a difficult theoretical concept that I want to understand, and then I'm going to seek out a professor or expert, and I'm going to look for high-quality content that's either a highly-rehearsed lecture, or a professionally-produced video with high-quality animations and figures, where a lot of rehearsal and editing went into it.","score":33,"comments":[]},{"body":"I don’t use it for on the job “fix this bug” or “develop this feature” work, but to learn a new skill/language or research a protocol I find it very useful","score":9,"comments":[]},{"body":"Videos and courses are too slow the more senior you get it's just articles, blogs, and papers at the top.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Why knowledge of Linux OS is so important?","not_safe_for_work":false,"locked":false,"body":" I saw many top tech companies ask  knowledge about Linux. Why it is so  important? And I would like to any free resource to learn about Linux  from the very beginning.","score":293,"comments":[{"body":"Because it's used a lot in servers. Linux pretty much runs the internet. So knowing a few basics won't go amiss.","score":411,"comments":[{"body":"Linux ~~pretty much~~ runs the internet.","score":226,"comments":[{"body":"Sad Windows Server noises","score":108,"comments":[{"body":"The fact that windows servers make noises is the problem.","score":145,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not even Microsoft uses Window Server","score":42,"comments":[{"body":"Even if you write a server in ASP.NET you would likely run in on Linux/Docker.","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Nothing beats a good Windows IIS with ASP classic setup, besides everything else 👍","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Lots of people have said why it's important.\n\nBut why you need to know it or what you need to know?\n\nI think for most devs it's a matter of practicality. A means to an end. In a way - it's no different knowing your preferred desktop OS. \n\nYou need to have a basic understanding of where things are and how to interact with them. And just like learning an OS it usually comes over time vs a tutorial. That's because it's not really a skill - it's more of an understanding.\n\nObviously, the first thing is the terminal. In this context that's the number one way you'll be interacting with it. Locally, that's macOS's terminal or Window's WSL. Or, Docker on your local system. This is a tools in itself and you should 'own' it. Take the time to customize it your liking. It's very easy to do and makes your life a lot better.\n\nThen you have basic file system navigation. Where are config files stored? Where are the binaries (executables/programs)? How you list files and directories? How do you navigate to them? How do you view or edit them?\n\nFrom there it's getting used to Bash. Let's look at an simple example.\n\nWP CLI is a cli tool for WordPress. It allows you to do stuff via the command line that you either can't do (easily) otherwise or do it faster. \n\nThe install directions:\n\n    curl -O https://raw.githubusercontent.com/wp-cli/builds/gh-pages/phar/wp-cli.phar\n\nIf you don't have any experience in Linux this is just nonsense. But, if you have any experience this is a common command and install method.\n\n`curl` - simplified - is like a web request with out a browser. `-O` is a flag. It tells curl to save the results instead of outputting them to the terminal. So, this command calls that url and saves the file.\n\nSave it where? Another thing that comes from experience. Your context in the CLI is almost always where you at the moment. If you run that command in the `/some/random/directory` it will save the file there.\n\n    php wp-cli.phar --info\n\nThis assumes you already have PHP installed on this system. `php` is the binary. This command is telling PHP to run `wp-cli.phar` and `--info` tell it to output information about itself.\n\n    chmod +x wp-cli.phar. \n    sudo mv wp-cli.phar /usr/local/bin/wp\n\n`chmod` tells Linux to make this file executable - specifically with the `+x` flag. But the command itself is about permissions. Who can read, write, edit, or run.\n\n`sudo` is telling Linux to run the `mv` command as admin. Higher permissions. Why? Because you are moving it to a more global area intended to be used by any user on the system. `mv` is move but also acts as the renaming function in Linux. Now that our file is executable lets move it to space all users can access. And let's rename it so we don't have to type all those characters. \n\n---\n\nI'm sure people will come in behind me and say I'm technically wrong about this or that. And they aren't wrong. But it doesn't *really* matter most times. The important part is that this simple task isn't foreign to me.\n\nWhen you're starting out a lot of your interaction will be tooling. Most frameworks using CLI to generate projects or build assets or whatever. If you're looking for a bug and somebody asks you if you've \"tailled the log file\" that shouldn't confuse you. Where are log files stored and what is `tail`? `tail -f /var/log/php/error.log` just allows you to view the log in real time as it gets written to.\n\nYou don't need to know Linux like a System Administrator. But you should know like how to use it like you know your desktop OS. In the above example it's the same task as installing an `.exe` on Windows. Instead of downloading an installer and doubeclicking you run a few commands in the terminal.\n\nMy first real experience was years ago. And, honestly, kinda outside what a dev should do, but we often find ourselves in that situation. Was working at a small web shop that had no backups for all our client sites. I took it upon myself to make that happen.\n\nIt took me one week to do the following:\n\n* install Linux on some hardware we had\n* setup SSH so I could log in remotely from my desk\n* write a Bash script that would\n * SSH into our production server\n * `rsync` the files from the production server to the local server\n* write another Bash script that would automatically\n * tarball (like .zip) the backups into weekly and monthly\n * remove old weekly and monthly\n* put those two Bash scripts into Cron (runs Bash scripts on a schedule - part of Linux)\n\nThat is a trivial task for a System Admin. Even now I could probably still get it done in under a day. But it was a huge undertaking for me at the time.\n\nBeing a \"master\" Linux user is never going to secure you a dev job. However, having a base level understanding and ability to accomplish basic tasks is expected. Perhaps not as a fresh graduate or new hire - but very quickly in your career. And if you happen to develop those skills they can be a nice selling point for hiring you over somebody else.","score":74,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The reason Linux is important is because most of the world runs on it. Pretty much any server, container, embedded system, etc runs Linux in some capacity.","score":255,"comments":[{"body":"It’s also heavily related to all main operating systems, and since it’s open source you can know everything about it.\n\nIf you know Linux well, knowing about other things is easy.","score":59,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Skills for Software Engineer vs Web Developer","not_safe_for_work":false,"locked":false,"body":"I recently got a PhD and I have decent programming skills in Python and some in C++. I'm considering a career change to Software Engineer or Web Developer. What are the actual skills that are most important for each of these positions?","score":541,"comments":[{"body":"Check this [roadmaps site](https://roadmap.sh/) to get an idea on what you will most likely have to learn across your journey in whatever programming path you decide to take.","score":484,"comments":[{"body":"Not OP but as someone entering the field after a career change and not really knowing what to learn for the pathway I want to go down, this is so useful thank you!","score":109,"comments":[{"body":"Not OP but you're welcome.","score":66,"comments":[{"body":"Not OP but I appreciate that!","score":26,"comments":[]},{"body":"Not not OP, but thank you again!","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Oh wow, this is super helpful! I’m someone who’s already started making the transition, but really useful to see this too!","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Love these comments questioning why you're looking into this after a PhD even though career change after a  PhD is very normal. Generally if you do a PhD it's because you love the field and have at least some interest in an academic career. If by the end you have lost the love, or for whatever reason an academic career is no longer desirable or practical (for example, lack of suitable postdoc opportunities in your field), then it's completely fine to be like \"What next?\". Most PhD graduates I know pivoted to something else, often only after graduating.","score":156,"comments":[{"body":"Asking *what* their PHD was is a perfectly fine question IMO, if they are interested in programming theres a good chance their PHD is in an adjacent field and the comments can make better suggestions rather then the generic answers that are always told.","score":57,"comments":[]},{"body":"Exactly, plenty of time to pivot, and your skills will translate somehow.","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"What did you learn in your PhD? Your last post says that you did neuroscience/robotics. That combination sounds like it’d like you up nicely for something in ML/AI. Why even consider webdev rn?\n\nBut to answer your question, here are a few important general SWE skills: \n\n1) know how to read other people’s code\n2) follow your org’s code style guidelines\n2a) including meaningful variable names \n3) have a good git workflow\n4) unit test religiously\n5) ask for help when you’re stumped, but not before putting in an honest effort.","score":119,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"[C++] What is the difference between vector&lt;int*&gt; and vector&lt;int&gt;*?","not_safe_for_work":false,"locked":false,"body":"I know that the first one is saying that the vector is going to contain integer pointers, but what's the second one saying? That the entire vector set is going to be one giant pointer?","score":11,"comments":[{"body":"The second one is just a pointer to a vector&lt;int&gt;. In plain English that second type says, \"at this location you will find a vector&lt;int&gt;\"\n\nCompared to the first type in plain English, \"inside this vector you will find locations that integers will be found at\"","score":15,"comments":[{"body":"So if the line of code I'm looking at says this:\n\n    list&lt;int&gt;* adj;\n\nThen what it's saying is that \"adj\" is a pointer to a list that contains integers?","score":9,"comments":[{"body":"Yup. That's right.","score":4,"comments":[{"body":"Thanks!","score":3,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"vector&lt;int\\*&gt; - a vector of addresses of integers\n\nvector&lt;int&gt;\\* - an address of a vector of integers\n\nfirst one is a book full of memory locations, each of which should have an integer there\n\nsecond one is a memory location of where a book full of integers should be","score":8,"comments":[{"body":"Thank you!","score":2,"comments":[]}]},{"body":"In general, you can read C/C++ type declarations backwards to make more sense of them.\n\nThe first is a vector of pointers to integer values.\n\nThe second is a pointer to a vector of integer values.\n\nE.g. variables assigned these types would look like this in memory:\n\n    1st var: addr 0x123 contains vec[int*, int*, int*, ...]\n    2nd var: addr 0x456 contains addr 0x789 contains vec[int, int, int, ...]\n\nIn practice, the standard containers only use a bit of automatic storage and allocate the rest dynamically (on the heap) so really your vector variable is probably just a pointer and some metadata anyway underneath...\n\nu/donnydonnydarko Just to make sure you saw the edit above (code block)","score":4,"comments":[{"body":"Oh wow, that’s a good tip! Also, I’m a little confused on how a scope resolution operator works. So is it used to define a method outside of a class that hasn’t had the method defined within the class yet? Such as:\n\n    class Hello{ \n    void sayHello(); \n    }; \n    void Hello::sayHello(){ \n    cout&lt;&lt;“Hello”&lt;&lt;endl; \n    }\n\nDid I use that correctly?\n\nEdit: I just saw the code stuff that you added, I think that makes sense! I'm still trying to get a solid grasp on the heap and stack stuff, but I think your code block example explains what you're saying pretty well. One is a vector of pointers to integers, the other is a pointer to a vector of integers.","score":1,"comments":[{"body":"Looks right to me IIRC.\n\nIt's just used to indicate which of something you're referencing. E.g. in your example, there could be another sayHello in the global scope, and another in a second class definition from another header included. So you scope to make sure you're defining the implementation for the correct one.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"vector&lt;int\\*&gt; is a vector of int pointers, and vector&lt;int&gt;\\* is a pointer to a vector of ints","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"In python, is it good practice to be relying on functions?","not_safe_for_work":false,"locked":false,"body":"Like if i make a function to specifically get a user input. And then make a separate function to append the user input to a existing list.\n\nLike this:\n\nSTART\n\nList=[]\n\nGetInput()\nAppendInput()\nDisplaylist()\n\nEND\n\nFunctions:\n\nGetInput()\n- uInput = input()\n- Return uInput\n\nAppendInput()\n- list.append(uInput)\n\nDisplayInput()\n-print(list)","score":13,"comments":[{"body":"You mean:\n\n    def getInput():\n        return input(\"what do you have to say? \")\n\n    def appendInput(arr, item):\n        arr.append(item)\n        return arr\n\n    def displayInput(data):\n        print(data)\n\n    if __name__ == \"__main__\":\n        data = getInput()\n        all_data = [] \n        all_data = appendData(all_data, data)\n        displayInput(data)\n\nYeah, that's normal. Certainly not for functions this simple, but yes, we rely on functions. And separating then out by concerns or logical units of work is normal.","score":21,"comments":[{"body":"Thats a very interesting take i usually just write out the code how ive written the pseudocode","score":3,"comments":[{"body":"Just saw your comment above.  Your instructor is probably trying to get you to see how to break up your code by concerns.  You have to start people off with baby steps.  The getInput function could easily develop into fetching data from a service, and as long as it returns the same data type, the program will function the same.  It's modularizing code","score":7,"comments":[{"body":"Yeah im starting to see that after youve commented. Ill just have to be patient and see the purpose. It makes a lot of sense now","score":2,"comments":[]}]}]}]},{"body":"For short functions like this, depends, for me, on context. This is wasteful and complicated:\n\n    def print_text(input_text)\n        print(input_text)\n    \n    if __name__ == \"__main__\":\n        print_text(\"print this string\")\n\nBecause the existing Python function is already concise and readable. That's not always the case though. I have the following in one of my projects:\n\n    class Current():\n        def time():\n            return str(datetime.now().strftime(\"%H:%M:%S\"))\n        def date():\n            return str(datetime.now().strftime(\"%Y-%m-%d\"))     \n\nBecause the project uses the current time in that exact format in a bunch of different places. So instead of including that whole datetime function with the formatting every time, I can just do\n\n    example = {\n               \"name\":\"example\"\n               \"time\": Current.time()\n               \"date\": Current.date()\n               }\n\nAnd it's nice and readable, and I don't have to be concerned about formatting matching.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Functions serve several useful purposes:\n\n- They break your code up into manageable bite-sized chunks of code. It's easier to look at a short function and understand what it does that to look at a 100-line block of code and understand that.\n\n- As long as you use meaningful names for your functions, the name can provide some brief documentation - a well-chosen name tells the reader of the code what that block of code (the function) actually does. This can save you writing a comment.\n\n- Functions provide re-usability. As long as you design your functions with suitable parameters you can often use the function in multiple places, which saves you having to write very similar code multiple times.","score":2,"comments":[]},{"body":"The input thing is a good example: it may only be one step now, but in a larger program you’d have a few layers of \n- checking that they entered the right kind of thing\n- checking that they entered the right length (not zero, not huge)\n- checking whatever else makes sense in context\n- asking again, if the above had a problem\n- transforming the input into the right format\n\n… and it’s nice to have that wrapped up in its own section. Then your other code doesn’t have to care about what’s in there, it can just trust that it’s getting the right result. This is easier to read, easier to change, easier to have multiple people work on, easier to reuse that function if you need similar input elsewhere,","score":2,"comments":[]},{"body":"There are no absolute rules, but it'd be a hard \"no\" from me. \n\nThe functions are so shallow that they only serve to rename existing Python functions. That makes the program *more* complex:\n\n* You now need to know this new API that adds no functionality.\n* You're taking perfectly sensible, simple inline code and moving it outside of regular flow.\n* You've also made the functions depend on variables external to themselves: data that's neither passed as an argument nor created within the function.","score":0,"comments":[{"body":"Dude i thought similar too, these functions seem so insignificant but my teacher is making us do bullshit like this.\n\nThanks for the response!","score":1,"comments":[{"body":"If it's for a class, don't fight it. Class exercises are often really contrived, particularly at the beginning. There's not really any other choice that won't frustrate students.\n\nBut at the same time, realize that you probably wouldn't want to write code like this for an actual codebase.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"I have been programming for years and I am questioning my skill level more everyday.","not_safe_for_work":false,"locked":false,"body":"So, this post is stemming from something that happened today (described closer to end of post... basically i genuinely asked a really silly question, making me completely question my skill set).\n\nAnyway, I have always been a computer guy but younger I was always more into hardware and building PC's. I messed around with html and CSS here and there, command line stuff. Remained at that same level of technological skills throughout junior high/high school years. Never got into full on programming until about 2018 (age 23 ?). That is when I started to write python for fun and got really into it, learned some JavaScript too, focused more heavily on python. Fast forward a year and I got a job at a small company duplicating RFID fobs because I had python on my resume and they could hire me on cheap, for a customer service position with my python skills as a bonus to help automate things (job wasn't all programming, primarily customer service, but I would be doing some programming on the side) I built a pretty crappy but working automation for the RFID fob duplication device (Proxmark 3) which involved some python scripting using subprocess etc and slightly customising an implementation of the C firmware of the RFID duplication device, to work better with said python scripts to automate the process for copying data of various RFID protocols. I left there after I felt I was a) bored of the project and b) underpaid ($20/hr, Canadian). But ever since then I have been programming anywhere from a few times a week to daily and have a few pretty cool side projects going, but I feel like for the amount of time I have been coding just does not stack up to my skillset. I asked a question on YouTube today that kind of made me feel like damn, I really don't know shit and I've been programming for how long? I asked this after a night of no sleep to be fair but it just made me feel like such a noob.\n\nThe question was related to tRPC and a possible equivelant setup for non typescript backend.\n\nQuestion I asked was:\"So - if i have an app where i am bound to using python on the backend for (django), how would I get something similar to tRPC? I am currently just going to use GraphQL but is there any way to get a similar setup to T3 stack with a python backend? Is my only option for something that measures up to go typescript backend?\"\n\nTo which the obvious answer was:\"Python is not typesafe. You can’t infer types from a language that isn’t typesafe lol\"\n\nwhich to be fair, I was thinking of mypy or the likes for enforcing pseudo type safety, but even then, its obviously a noob question. I just felt so embarrassed that after so long I would ask something so silly. I have just been reading about imposter syndrome and kind of felt like maybe I am better than I think but I just have imposter syndrome or something but now I'm just feeling like damn maybe i really don't have the grasp on this i think i do, but when i look at the time spent over the years I'm just like WTF. There's people who go 6 months programming from absolute beginner and find a job and are seemingly better than I am.\n\nReally and honestly is this a question I should feel stupid for asking for the amount of time I have been coding for? I seem to have this really strange phenomenon where I have done some advanced programming stuff yet maybe haven't got a grasp on some basic things (it seems). This is all exactly what has been stopping me from even applying anywhere. I don't know if i am really justified to think i suck or not. There is a point where you can do something you aren't great at too long i guess, but then on the other hand, if I'm just suffering from imposter syndrome I don't want to cut myself short. I have no idea what to do in regards to giving up or not.Anyways this post is entirely too long and turning into a rant but any insight would be so much appreciated.\n\nWhat has all your experiences been if anything similar?","score":14,"comments":[{"body":"The ocean is very, very wide, and so deep that no one has seen the floor.\n\nJust because we haven't been to all the islands, and just because we sometimes forget to put up the sails, doesn't make us bad sailors, eh?","score":49,"comments":[{"body":"That is a good way to think about it I suppose, thanks. I guess sometimes I just feel like a sailor who just called a pickup truck a mighty fine sailboat. lol.","score":10,"comments":[{"body":"Dunno bout you, but I can sail a truck if corporate wants me to.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I question my skills everyday since I found out about coding algorithms for technical tests. I feel stupid coz I struggle to solve easy ones on leetcode","score":13,"comments":[{"body":"Yeah, I'm struggling with practice technical tests too. But I think the point is they're harder than everyday stuff anyway, meant to be a challenge. Not necessarily meant to be 'easy' even if they are the easy ones, right.","score":3,"comments":[{"body":"It just sucks that companies test on these things and they never use them. There are other ways to test my skills, like asking me things that I know that's why you asked me for the interview","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"We all have our own skillsets that we bring to the table. That's why you develop software in a team, not by yourself. You can't be expected to know everything. The best teammates are the ones who know they don't know everything and come to the table with humility.","score":7,"comments":[]},{"body":"Typescript was only ever pseudo type-safe.  Once your app is in run-time there are no typescript types.\n\nBut there are typeguards, and you could implement something like one in python.\n\nPersonally I don't care who doesn't know the nuances of typescript or python.  If you told me you had 15+ years of experience working with C++ and you know nothing about typescript, I'd be an idiot to think you know nothing.","score":5,"comments":[]},{"body":"Thanks all for the words of advice, I definitely have some new insight from this thread. Actually this is one of my first few posts to Reddit after many years just lurking, and what great responses. Re-established my motivation to learn more and get better. Thanks for the words of advice.","score":5,"comments":[]},{"body":"Debatable to say Phython isnt type safe, and also this is not really an answer even if Pythons type safety doesnt work out of the box for whatever this is doesnt mean you cant use some technique or combination of tools  to make a similar thing work so I wouldnt say this is obvious at all. \n\nI think just beware of everyone trying to act all l33t in programming doesnt mean they know what they are talking about.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"C.S. degree dorks, can you help a humble self-taught here? Is there a name for this specific math formula?","not_safe_for_work":false,"locked":false,"body":"Is there a name for this piece of code? I see it in a lot of problems and it's common enough but also specific enough that I could see it having a name... It's used in this case to reverse an integer.\n\nIf it does have a name this seems like something you might learn in college.\n\nI don't know how to google this question or I would have done that.  \n\n\n\n\n       public int Reverse(int input) {\n\n            int result = 0;\n\n            while (input != 0)\n\n            {\n\n                result = (input % 10) + (result* 10);\n\n                input /= 10;\n\n            }\n\n            return result;","score":3,"comments":[{"body":"I’m not sure if there’s a name for this, particularly, but it may be included in a list of common *algorithms*? \n\nYour example, a reverse function, would likely be part of a language’s standard library because of how common and useful these particular algorithms are in everyday work. I’m thinking this would fall into the same category as sort algorithms and the like: very common algorithms that developers use but don’t want to write over and over again.","score":1,"comments":[]},{"body":"Reverse?","score":1,"comments":[{"body":"That's the name of the function that I created, I'm wondering if there's a name for the mathy part of what's inside the function","score":1,"comments":[{"body":"Not that I am aware of.  It's not a formula, exactly.  It's an algorithm.  The easiest way to do this is to convert to a string, and of course, it only works on base ten, but you can modify it to work with other bases.  You'll just get different answers (I believe) if you reverse this in base two, for example.\n\nIndeed, it's enough of a math trick that when I taught programming, we never covered this.","score":1,"comments":[]}]}]},{"body":"That's a while statement, inside a (nice and small) function.","score":1,"comments":[]},{"body":"Are you talking about the % operator? That’s called a Modulus operator, it gives you the remainder of a division.\n\nSo 7/3 is 2 and 1/3.\nWith integers, 7/3 is 2, and 7%3 is 1.\n\nYou can use that to reverse an integer because you can modulo (n%10) to get the last digit. You can divide (n/10) to get rid of the last digit. You can multiply by (n*10) to add a zero to the number.","score":1,"comments":[{"body":"I think he's looking for something like \"quadratic equation\".  That is, does this code have a name associated with it.  He's not curious about what it's doing or how it's doing it, but whether it's famous enough to have a name associated with it.","score":1,"comments":[]}]},{"body":"This is a while loop inside of a function. This is not something you learn in college. You learn it when you learn programming. This could be college. When you’re 45 or when you’re 13. It’s basic but important stuff. It’s too general to be named any sort of thing. You’ll do this countless times in your coding life.","score":1,"comments":[]},{"body":"There is no specific name to this algorithm. It just reverses the number, say if you input 1234 it will output 4321.\n\nIf somebody asks you what exactly this piece of code is? Then you can just say its “Iterative method to reverse a number”","score":1,"comments":[]}]},{"title":"How could an underachieving newly graduated programmer \"catch up\" with where my peers are?","not_safe_for_work":false,"locked":false,"body":"I'm just gonna say it how I feel. I'm a bad programmer. I'm not particularly smart or gifted, I struggle with my work-ethic, and I'm a slow learner. In other words, I have to try twice as hard as everyone else and burnout twice as fast.\n\nAs you can probably guess I graduated, but pretty mediocrely. I'm pretty incompetent and feel like there's a lot of holes in my knowledge which I should just know like the back of my hand. The thing is I don't know how I'm going to fill in the gaps of the last 2 years of the holes in my kowldedge. And I also don't know what I don't know. Where do I even begin trying to fix my skills?\n\nSometimes I wonder if maybe I just don't have what it takes to do this. I see a lot of my peers acing assignments and finishing programs and they're playing while I'm still struggling to meet the minimal requirements late into the night. Maybe I'm not smart enough for this? Should I consider doing something else with my life? I don't have any confidence to apply for jobs and I'm terrified of a technical interview but if I can't make this work the last 4 years of my life will be wasted and I'll be back at square 1.\n\nDoes anyone know what I need to do?","score":3,"comments":[{"body":"Not a zero sum field. You don't have to be the best, just a valuable contributing dev. Focus on getting good at what you do, narrow focus as needed and just find your lane.","score":1,"comments":[]},{"body":"&gt;but if I can't make this work the last 4 years of my life will be wasted and I'll be back at square 1.\n\nwell that part's not true. \n\ni knew a dude with a jazz degree from berkley that got promoted ahead of me and we're in data science. \n\ni don't really have advice. good programmers take an interest in programming. generally the tinkering type. trying to make stuff do exactly what they want it to. just life in rune goldberg form. if it hurts, like, stop. or embrace the hurt. 🤷‍♂️","score":1,"comments":[]}]},{"title":"How do you (self) study programming properly?","not_safe_for_work":false,"locked":false,"body":"Hey all,\n\nFirst I was asking on native language sub and why not to try here, wanting to see methods how do you study any languages and skills. I'm stuck on a certain video course and for a while contemplating if any of these is actually for me, or maybe not..\n\nI'm final year of IT school and have been studying JS since October this year. So far I glided through the school but now it's different thing - learn basic stuff, make some stuff and start applying for entry positions for FrontEnd. Take up some projects to do on myself and learn any framework, that's like that?\n\nHow do you study? How did you study at the beginning of learning programming?","score":14,"comments":[{"body":"read docs, code software, watch tuts, ask questions, google.","score":3,"comments":[{"body":"Roger that.","score":1,"comments":[]},{"body":"As a beginner, it felt like i was studying when i was practicing as I learned concepts. \n\nLike say for example, in the odin proj you learn about using the command prompt to navigate files and such. \n\nSo what id do is do the task and after im done with the task i wouod still tinker with what i learned just so i have a good understanding of whats happening and why something is happening.\n\nHowever this is just me, i never was good at taking notes hands on exp always worked for me.\n\n**if you want a solid take away from my comment** i suggest using flashcards containing a question and a answer to it. This is something i have yet to do but sounds like a really good idea since you can study anywhere.","score":1,"comments":[]}]},{"body":"Find a good resource. Follow along and make sure you understand the core concepts. Then try extending or using those concepts on your own.","score":2,"comments":[]},{"body":"Start a GitHub repo, write code out by hand rather than just copying and pasting (this helps sink in the syntax for me), create a README with notes summarising what you've learnt, once you get comfortable start solving some algorithms and simple projects, keep writing code, learn a framework.\n\nFor complex concepts watch YouTube videos, for example I struggled with CSS flexbox and a 15 minute YouTube video helped so much.\n\nIf you are unable to solve the problem, Google the solution and try to understand the solution so you can copy it in the future. It's not that uncommon where you have 0 idea how to solve a problem or you brute force a solution.\n\nTest your skills, do exams, complete a specialisation from Coursera.","score":1,"comments":[]},{"body":"The best for me has been to have a project I’m interested, and investigate topics as needed to move forward with it.","score":1,"comments":[]},{"body":"Beyond what the rest of the thread said, sign up for one of those \"code a day\" type websites that their you curveballs and just generally keep you honing and expanding skills. And just keep doing projects.\n\nThis site is ok for practice, although it could use better categorization. https://www.codewars.com/","score":1,"comments":[]}]},{"title":"Looking for insight/advice on a career change and what the road map looks like.","not_safe_for_work":false,"locked":false,"body":"I’m 48 and have the opportunity to redesign my work life.  I am considering learning to code and working my way up through the ranks over the next few years as an option.  My main question is what is a realistic timeline and road map to go from zero to hire-able as a jr developer?  As of now what seems to make sense is to do 1-3 month intensive self learning via things like freecodecamp and possible trying to build my own basic app.  Then do a boot camp for 6-9mos and then hope to land a reasonable paying job.  seem reasonable? I live in the bay area but am excited by the proposition of remote possibilities in the future.  Any thing you would edit here?  General advice or warnings?  What’s the market for older coders as opposed to fresh grads?  Any insight or advice appreciated.","score":27,"comments":[{"body":"Oof so I wrote a book on this entire subject after changing from opera singer to software engineer, so I have a lot to say on it. \n\nIn short, the way to do a career change is to learn the technical skills (with a learning plan in place and a good attitude to getting stuck or falling behind where you think you can be), find/create a community (be it through meetups, hackathon, online communities, social media, etc.), and then get good at communicating your value as a potential employee not only in documents like a cover letter/cv but in speech as well: basically reducing how much of a risk you seem to recruiters based on your different background. That means being able to spin/connect your previous job to software engineering in a convincing way.\n\nIf you can do all three of these things, then you can change careers. How long it will take is dependent on so many different factors, and if anyone anywhere tries to sell you the idea of \"buy this one thing and get a job in under X amount of time\" then they are crooks and you should ignore them.","score":12,"comments":[{"body":"Wow that’s super helpful.  Thanks.  As an example what was your timeline from opera style Niger to your first job?  Also what was your learning plan?  Self taught? Formal training? Etc?","score":3,"comments":[{"body":"I wrote a blog post about it \"back in the day\". Officially speaking, I did it in under a year, but I wasn't coming from absolute zero because I'd done some coding as a kid and also studied some logic and statistics. Full story is in the post though. My blog is really out of date so don't expect any new material though 😂\n\nhttps://blog.annamcdougall.com/how-i-became-a-junior-software-engineer-in-under-a-year-ckkmhiv9204kia6s10eb62ecd","score":5,"comments":[{"body":"This article is amazing. I'm starting out Computer Science next year; fresh out of highschool, and I don't have a coding background at all, but I'm picking up the basics during this summer holidays so I can at least have something under my belt.","score":3,"comments":[{"body":"Hey that's awesome! Be aware that CS often doesn't focus a lot on programming languages/ability and more on systemic thinking/concepts. If you enjoy coding then you should absolutely keep going on your own time though, as it will give you an extra tool to test/utilise those concepts. Just don't expect too much from your course itself!\n\n(full disclosure: this is info I've heard from many CS graduates, not something I've been through myself, and YMMV depending on your uni!)","score":4,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Can you share your book's info?","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Others have mentioned good advice, though I may add the following -\n\n**Economy warning**: with the current hiring market for devs, consider adding flexibility into the timeline. Instead of a 1-yr plan, maybe expand it to 2-yrs given layoffs, firings, hiring freezes, increased competition, etc. That said, some places are still hiring, so it isn't total gloom-and-doom. Example of how it took a person 1,000 job apps to get a job (with a degree): [1](https://www.reddit.com/r/csMajors/comments/yybzty/new_gradearly_career_international_never_give_up/)\n\n**Bootcamp warning**: some jump into a bootcamp for 3-6mo and manage to graduate. With prep beforehand this'll improve your chances and experience. I know some who got a job within a month of grad from a bootcamp (diff. yr &amp; economy timing) whereas others are still looking after almost 1yr. Or some who've been laid off and back into job searching.\n\n**Roadmap resources**: [1](https://roadmap.sh/), [2](https://github.com/kamranahmedse/developer-roadmap)\n\n**Self-taught / bootcamp to job example timelines** (note diff. entry yrs &amp; economy): [1](https://jenniferdewalt.com/), [2](https://www.reddit.com/r/learnprogramming/comments/yshl4i/comment/iw0cygz/?utm_source=share&amp;utm_medium=web2x&amp;context=3), [3](https://www.freecodecamp.org/news/inspirational-success-stories-from-self-taught-web-developers-4f6f375cf17d/)\n\nUnsure about the market for older coders but at the large company I work at, there's people in their mid-30s to late 40s like yourself upskilling and aiming to internally transfer into junior dev roles, which the company seems to be receptive of based on their yrs of loyalty, good performance reviews, output productivity history, etc. So while ageism may be an underlying note in all jobs and industries to some level perhaps, it doesn't appear to be all doom-and-gloom either since talent, productivity, and retention is the sought-after thing here.\n\n**Main advice imo**: focus on skill building and deep understanding through building projects and in time gain 3 impressive polished ones to put on resume and personal website for job applications. Simultaneously, study DSA / interview prep questions like on LeetCode since this can take months to get good at. If you are able to balance learning from small to incrementally larger projects with the side task of interview exams DSA in mind, this should set you up well to land interviews in time. Project building resources: [1](https://github.com/practical-tutorials/project-based-learning), [2](https://github.com/codecrafters-io/build-your-own-x), [3](https://github.com/MunGell/awesome-for-beginners), [4](https://www.theodinproject.com/)","score":7,"comments":[]},{"body":"I have been on the, almost, same road for several years, switching from ChemE to SE, and the only most important thing I can recommend is to stick to a road and do not try to spread your main focus. That is, if you want to become a React.js developer, focus solely on the tools, concepts, technologies directly related to React.js. Only after doing some projects, you can see you are improving. It takes time and in a year or so, you can understand code and contribute to some projects or create your own ones.","score":5,"comments":[]},{"body":"there certainly is some luck factor involved. I know a few people that went from no experience to getting hired in half a year and some took several years. some people find the right opportunities at the right time.","score":2,"comments":[]},{"body":"HEED MY WARNING. \nTURN AROUND WHILE YOU STILL CAN.\nPERSUE A LIFE IN HARMONY WITH NATURE OR BE FOREVER DOOMED TO LIVE IN LEGACY CODE HELL!","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Error in C","not_safe_for_work":false,"locked":false,"body":"    #include &lt;stdio.h&gt;\n    main(){\n        int a[10],i,g,j;\n        printf(\"Enter the elements of the array:\");\n        for (i=0;i&lt;10;i=i+1){\n            scanf(\"%d\",&amp;a[i]);\n        }\n        for (i=1;i&lt;100;i=i+1){\n           for (j=0;j&lt;10;j=j+1){\n            if (a[j]&gt;a[j+1]){\n             g=a[j];\n             a[j]=a[j+1];\n             a[j+1]=g;\n            }\n            \n           }\n        }\n        for (i=0;i&lt;10;i=i+1){\n           printf(\"%d\\n\",a[i]);\n        }\n        \n    }\n\n`Error:*** stack smashing detected ***: terminated`\n\n`Aborted`\n\nIam getting this error. Can someone help me","score":30,"comments":[{"body":"Think about your array. The valid indexes are 0 to 9 since you dimensioned it having 10 elements.\n\nNow think about your inner `for(j=0; j&lt;10;j=j+1)` loop - also okay as the loop stops at 9 because 9 is the largest integer less than than 10.\n\nAnd now, the problem comes. Think about the statement `if (a[j]&gt;a[j+1]){` - what happens when `j` is at the end of the loop, i.e. at `9`?\n\nSee the problem?","score":45,"comments":[{"body":"Thank you very much!","score":14,"comments":[]},{"body":"I would not have been able to describe the problem better. Nice!","score":6,"comments":[]},{"body":"I never had that error! That's cool!","score":3,"comments":[]}]},{"body":"Edit: (Misread the variables, please don't upvote this).\n\n&gt; int a[10]\n\n&gt; for (i=1;i&lt;100\n\n&gt; if (a[j]&gt;a[j+1])","score":0,"comments":[{"body":"Okay so does that mean it goes beyond the limits of the array?i mean the number of elements","score":2,"comments":[{"body":"Edit: (Misread the variables, please don't upvote this).\n\nYes, you have declared an array of 10 elements on the *stack* (makes sense?), and you're trying to get the 101th element in that array!","score":1,"comments":[]}]},{"body":"Why does that happen?I mean iam not really editing the contents of the array.No matter how many times the for loop runs it should work right?","score":-1,"comments":[{"body":"Accessing memory you are not allowed to, is undefined behaviour. Anything can happen. Your program might crash, it might not. A dancing gnome might appear on your screen. You cannot reason about what should or should not happen, as it's not defined.","score":3,"comments":[{"body":"He is right - it is my mistake. My old monitor (coupled with my old eyes.. hehe) read that as `i` instead of `j` in the illegal array access.","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}]},{"title":"Looking to get into Node.js","not_safe_for_work":false,"locked":false,"body":"I am on my downtime from work am working through freeCodeCamp's stuff I've got a beginner/barely intermediate level experience I would say experience with JS. I was told by some folks at work that I could expand into some other projects that could fast track me a bit more if I got into Node.js . So my question you guys is. Do any of you know a good project biased learning that I can do (so I can build up my portfolio while learning)? That is very cheap if not free.","score":5,"comments":[{"body":"I would take a look at The Odin Project, if I were you. It's catered towards complete beginners, but you could skim the contents and see where you might wanna \"drop in,\" if you'd rather skip that preliminary stuff. I know they have a path after Foundations that specifically tackles advanced JavaScript and Node.js.\n\nOh, and it's completely free and project-based. They have you upload all your things to GitHub. Mind you, there are no grades or tests or anything, so the judgement of whether your code is good or bad is your call. Cheers!","score":2,"comments":[{"body":"Thank you very much. I will look into it.","score":1,"comments":[{"body":"Happy to help! And if you're felling doubtful about it, they have user-submitted \"solutions\" to projects available to registered members. People have built some pretty cool stuff!\n\nI know one of their projects is having you recreate FaceBook from the bottom-up, so you'll have some pretty damn good webdev abilities if you go that route.","score":1,"comments":[]}]}]}]},{"title":"Adding Java to Path for Systemctl service for a Python App","not_safe_for_work":false,"locked":false,"body":"Hi all,\n\nI am hoping someone can help me with this. I am trying to run a python application, where one of the libraries relies on java to be installed. When I run this application from my terminal I get no errors.\n\nBut when I go ahead and set-up the application to run as a service, I get the following error:\n\n    'java' command is not found from this Python process. Please ensure Java is installed and Path is set for 'java'.\n\nCan anyone recommend what  I can change either to my app.service file or on the ubuntu server to get rid of this error?\n\n&amp;#x200B;\n\nThanks a lot!","score":3,"comments":[{"body":"Here are several ways to customize the `PATH` environment variable in a systemd service definition: https://askubuntu.com/questions/1014480/how-do-i-add-bin-to-path-for-a-systemd-service","score":1,"comments":[]},{"body":"The system PATH is usually just /usr/bin and /bin for cron type commands. To fix a similar problem with perl I just added a sim link in /usr/bin to point to /usr/local/bin/perl.","score":1,"comments":[]}]},{"title":"[JS / Jest] How to use Jest to test a class that uses private variables and calls its own functions","not_safe_for_work":false,"locked":false,"body":"I have a class Model.js that has many functions that depend on states of private variables and call helper methods. But I'm not sure the right way to mock these or spy on them in Jest.\n\n    clickBox(row, column) {\n            if (this.#gameState != 'rolling') {\n                if (this.isValid(parseInt(row, 10), parseInt(column, 10))) {\n                    this.#validation[parseInt(row, 10)] = parseInt(column, 10);\n                    this.#selected[parseInt(row, 10)].push(parseInt(column, 10));\n                    \n                    return true;\n                }\n            }\n            \n            return false;\n        }\n\nMy Jest would look something like this I think, but I'm lost on the implementation\n\n    describe(\"Model\", () =&gt; {\n        describe('#clickBox, () =&gt; {\n            it('should return false if gamestate does not equal rolling', () =&gt; {\n                // mock gameState to not be 'rolling'\n                // expect return false\n            })\n    \n            it('should return false if (row, col) is invalid', () =&gt; {\n                // mock gameState to be 'rolling'\n                // mock isValid to be false\n                // expect return false\n            })\n    \n            it('should set row[#validation] = column if not rolling and valid', () =&gt;         \n        {\n                // mock gameState to be 'rolling'\n                // mock isValid to be true\n                // expect private var state\n            })\n    \n            ...\n        })\n    }","score":3,"comments":[]},{"title":"How do i increase my programming \"stamina\"?","not_safe_for_work":false,"locked":false,"body":"I can't program more than 2h a day (even on weekends), by that time, my brain just sort of gets tired of thinking.\n\ni usually program for 1h - 1h 30m a day, but i have a feeling that it's too little.\n\nHow would i improve that? By just programming more?","score":5,"comments":[{"body":"Shorter sessions with breaks in between.\n\nNot even professional programmers program in blocks. Regular breaks are absolute key.\n\nSure, if you reach \"the flow\" it can happen that you program for a longer seesion simply because there, without distraction, you are so highly concentrated that time becomes irrelevant.\n\nReaching \"the flow\" is a different matter. Some programmers can reach it in a couple minutes, some take more time, some never really reach it and still are productive and very good to excellent programmers.\n\nIt is just like with running. You can increase the session time through training - yet, whether it is beneficial is a different manner.\n\nIt is far more beneficial to take breaks for a refresher of the mind than to force yourself to continue. If you force yourself, you will produce garbage code that only results in having to refactor and troubleshoot the next time.","score":6,"comments":[{"body":"THANKS!!!\n\nI'll try to create some sort of \"plan\" like:\n\nafter X amount of programming, rest Y amount of time","score":1,"comments":[]}]},{"body":"I think it's similar to anything, but take breaks, take up a couple of different tasks so you can switch up what you're doing without getting burnt out.\nBut you don't need to improve your stamina while it's \"for fun\", a lot of people who've been coding for years would still struggle with a 2 hour block when they know it's not a must-do and it's not a super important personal passion project. Stamina often comes either with how strong your drive is to reach a goal (say you're really close to making something you're very excited about) or from somebody else monitoring you so burnout isn't an option\nIf you ever have to work on a project for 3 or 4 or 5 hours for work it'll probably be a different story in regards to exhaustion as you now have goals and deadlines and timelines (and likely a new environment)","score":3,"comments":[]},{"body":"Have you ever wondered why classes in school are typically cca. 1h-long separated by 10-15 minute breaks? Now you know why.\n\nHuman brain is biologically incapable of several-hour-long uninterrupted concentrated effort. You can get up to 4h of peak performance per day, if you take regular breaks. You can squeeze in additional 2-4h of leisurely performance if you plan for it. Beyond that, you're in area of diminishing returns and at risk of serious burnout.\n\nA big factor in this is motivation. Be it internal (\"I want to do this\") and external (\"I need to do this\"). As it turns out, brain's main role is optimization - it tries to do as little at it must with as little effort as it can. Anything beyond that is uncomfortable.\n\nOff course, there's a huge variability between people in this area.","score":2,"comments":[]},{"body":"I'm working my way through self teaching and when I'm burned out I take a few Door Dash deliveries.  It's different enough, but engaging enough, to clear my brain's palette, so to speak.  When I get back I'm ready to go again. \n\n But there are lots of options.  I'd try something semi-active though.","score":1,"comments":[{"body":"Nice idea! I'll think of something to replace door dash","score":1,"comments":[]}]},{"body":"I find that programming in the morning is when I get most of my stamina and work done. I’ve usually gotten a decent amount of sleep and I’ve had some coffee to wake me up. It keeps me going for hours. Do other tasks towards the end of the day like documentation or commenting your code.","score":1,"comments":[{"body":"Now that you talked about it, i sort of relate!\n\nI only program in the morning on weekends, since i go to school in the morning, but whenever i program early i feel more productive!","score":1,"comments":[]}]}]},{"title":"Help in my quiz game in Python","not_safe_for_work":false,"locked":false,"body":"**CODE FIXED, THANKS FOR THOSE WHO HELPED**  \n\n\n*So this is a quiz game and the first (and only) question is a randomly generated math operation.*\n\n*That means the operation should look like this number1 operator number2 (for example: 2 \\* 7)*\n\n*I have many problems, one is that I couldn't find a way to randomly generate an operator so I ended up with spaghetti code which makes randomly generated problems.*\n\n*I'll explain the rest after the code because you'll need some context.*\n\n    / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / /\n\n**### Imports** `random` **for random numbers ###**\n\n    import random\n\n**### This is just dots for aesthetic purposes ###**\n\n    def dots():\n        print(\"...\") \n\n**### This just asks the user if they want to play the game, inputs the  answer to**  `playing` **, and if the answer is any other than** `yes` **it quits the game. Otherwise it continues. ###**\n\n    print(\"Hello.\")\n    dots()\n    print(\"Do you want to play a game?\")\n    playing = input()\n    if playing != \"yes\":\n        dots()\n        print(\"Very well then, come back if you change your mind :(\")\n        quit()\n    \n    print(\"Very well then, let's begin.\")\n    dots()\n\n**### This (I think) is where the messy code begins: we have two variables,** `number1` **and** `number2` **which will  be randomly generated.**\n\n**Then we have the** `operators` **list consisting of string type operators , and then we have the** `operator` **variable, which will choose a operator from the list.**\n\n**I had to do all this because I couldn't find a way to randomly generate operators. ###**\n\n    number1 = random.randint(1, 100)  \n    number2 = random.randint(1, 100)\n    operators = ['+', '-', '/', '*']\n    operator = random.choice(operators)\n\n**### What this does is, if** `operator` **is** `/` **for example, it will generate the result to that equation and assign it to** `resultado` **###**\n\n    if operator == '+':\n        resultado = number1 + number2\n    elif operator == '-':\n        resultado = number1 - number2\n    elif operator == '/':\n        resultado = number1 / number2\n    elif operator == '*':\n        resultado = number1 * number2\n\n**### Here it asks what does the operation equate to, and shows  this (for example)** `10 '+' 9`\n\n**Then your** `input` **gets assigned to** `answer`\\*\\*.\\*\\*\n\n**If your** `answer` **does not have the same value as** `resultado` **it prints the error message and then shows you the correct answer. If it does have the same value it shows you the congrats message. ###**\n\n    print(\"What does this equate to?\")\n    dots()\n    print(number1, operator, number2)\n    answer = int(input())\n    if answer != resultado:\n        print(\"Oh, you got it wrong :(\")\n        dots()\n        print(\"The correct answer is \" + str(resultado) + \".\")\n        dots()\n        print(\"But don't worry :) everyone makes some silly mistakes now and then ;)\")\n    else:\n        print('Congratulations')\n\n**### Now bellow I will print some of the error messages I'm getting ###**\n\n    Hello.\n    ...\n    Do you want to play a game?\n    yes\n    Very well then, let's begin.\n    ...\n    What does this equate to?\n    ...\n    17 / 99\n    0.1717171717171717\n    Oh, you got it wrong :(\n    ...\n    The correct answer is 0.1717171717171717.\n    ...\n    But don't worry :) everyone makes some silly mistakes now and then ;)\n\n**### I'd like some help so that when you input the correct answer it shows the congrats message, and also a way so that only 1 or 2 decimals appear and you don't have to input the entire value, thanks ###**","score":3,"comments":[{"body":"Update: The code is reading `answer` as a string, so it will never be the same as `resultado` which is a int\n\n    type(resultado)\n\n&lt;class 'int'&gt; type(answer) &lt;class 'str'&gt;\n\nI will update the code above to this\n\n`answer =` **int(input())**\n\n`if answer != resultado:`\n\nSo now `answer` has the value type int\n\n&amp;#x200B;\n\nUpdate: Now the code works and I get congrats message when I put the right answer in, except for when it's a division type equation.\n\nUpdate: Okay, I fixed the code\n\nBasically what was happening is I put `int(input())` so  `answer` would be the same data type as `resultado`, but when I had a division and the result was a float data type (0.232131) it couldn't be the same and it registered as an error, even if the answer was correct, so instead I changed `resultado` to a string `if answer == str(resultado)` and now it works :D\n\n    Hello.\n    ... \n    Do you want to play a game?\n    yes \n    Very well then, let's begin.\n    ... \n    What does this equate to?\n    ... \n    52 / 53\n    0.9811320754716981\n    Congratulations\n\n**but I still get way too many decimals (I only want 1 or 2)**\n\n&amp;#x200B;\n\nUpdate: The code is fixed, check comments to see how I fixed the decimals","score":1,"comments":[{"body":"Not int, you have to use float, because division answer will be floating type.\n\nYou can see my comment.","score":1,"comments":[]}]},{"body":"Firstly, let think your resultado will be float, so you have to convert answer to float also.\n```\nanswer = float(input())\n```\nFor decimal points, you have to use `round`, let think you want 2 decimal points.\n```\nresultado = round(resultado, 2)\n```","score":1,"comments":[{"body":"Thanks man, the code ended up looking like this:\n\n    answer = input()\n\nif float(answer) != round(resultado, 1):\n\nand then the message for if you get it right:\n\n    print(\"The correct answer is \" + str(round(resultado, 1)) + \".\")\n\nnow it works perfectly even when the answer is a int type :D","score":1,"comments":[]}]},{"body":"&gt; I'd like some help so that when you input the correct answer it shows the congrats message, and also a way so that only 1 or 2 decimals appear and you don't have to input the entire value, thanks\n\nOne way you might do this is to use an epsilon value. In this case, \"**e**psilon\" stands for the acceptable margin of **e**rror. You mark the answer correct if ...\n\n    if abs(resultado - answer) &lt;= epsilon:\n        # It's pretty close to right!\n\nI'll leave it up to you to define `epsilon`.","score":1,"comments":[]}]},{"title":"Best resources to prepare for C# bootcamp? Having fun so far but I want to do more.","not_safe_for_work":false,"locked":false,"body":"I've been using MVA to learn C# as well as the pluralsight pre-work I was assigned by my local bootcamp that I start in January. I have Visual Studio 2022 installed and all the tools I need for the bootcamp. I want to either contribute to projects before I start OR watch people contribute to projects/see the changes they made to the code. Can you recommend some other learning resources so I go in as prepared as possible? Thanks!","score":6,"comments":[{"body":"CS50x's first 6 classes. They are free and each has a problem to solve","score":2,"comments":[{"body":"Thank you","score":1,"comments":[]}]}]},{"title":"Learning Java before Python?","not_safe_for_work":false,"locked":false,"body":"I'm trying to get into programming as a career. I can't go to school, but I can take courses at home.   \nI was originally thinking of getting directly into web development, but it seems that the field is saturated with junior web devs. So, I'm thinking of just getting into normal software development, and maybe picking up web dev along the way.  \n\n\nI see that many recommend learning programming \\*through\\* learning a 'beginning' language like Python. Can you learn programming through learning a more advanced language like Java? If successful, will that make it easier to absorb fundamental coding concepts? And will that make it easier to pick up languages like Python? Also, will learning Java make it easier to pick up Kotlin, if I end up in Android development? And finally, is Kotlin practical for desktop and/or back end (server) programming?  \n\n\nThank you!","score":3,"comments":[{"body":"Yes, you can learn programming with your first language being Java or any other programming language. \n\nOverall, it doesn’t matter which programming language you pick because they’ll all teach you the fundamentals. And the fundamentals carry over from language to language. *It’s majorly just the syntax &amp; nuances that you’ll have to grasp.*","score":4,"comments":[]},{"body":"All fields are saturated with juniors. Web dev has the most juniors but web dev by far has the most jobs. Of all types of junior developers looking for their first job, I'd say web development has the highest ratio of junior developers which are below the level of competency actually required for a junior position. If you develop more competency than your average fresh bootcamp grad with only a few months of programming experience you're going to edge out a lot of your competition by default. Web dev is still the easiest path into the industry. \n\nPython has (debatably) beginner friendly syntax, but other than that I wouldn't rate is as less difficult than Java. Python is certainly advanced. While it doesn't have the long history of Java, its not a \"beginner\" language, just (debatably) beginner friendly. Java is a fine language to start with. If you learn one language really well, you will already know the majority of other popular languages out there. Most concepts overlap, its just syntax and language quirks that make up the the vast majority of differences between them. Kotlin is general purpose, you can use it for back ends or whatever you want really.","score":3,"comments":[]},{"body":"I’ve hired several Java developers into Python roles.\n\nJava as a technology is not in its ascendancy.\n\nWhistl starting anywhere is better than not at all; I’d argue that you’d be better of learning a technology that’s being used to develop new systems, rather than something that’s being used less and less in anything other than legacy enterprise systems.\n\nPython isn’t a beginners language. It’s just effective and economical.","score":2,"comments":[]},{"body":"1. It doesn't matter which programming language you start with. Eventually, the switch between the language is easy when you have good knowledge of one language. \n\n2. Choose what are you interested in most if you like app development go with Kotlin. \n\nMistakes I made:\n- In the last year of my college I was interested in app development so I try to learn Android development. \n- So, I learn Java first then Kotlin. At that time I realized that they both have the same concept just syntax is different. If I go back in time I would tell myself to learn Kotlin. So, you don't have to waste 3 months on the programming language. \n- Instead, you just learn kotlin and start building small projects on the go. \n\nFunny thing: \n- I got a job as a flutter developer and I have to learn Dart programming language. \n- It took me 4-5 days to learn the syntax.","score":2,"comments":[{"body":"Thank you.   \n\n\nIf I learned Kotlin, would it be relatively trivial to learn enough Java if I had to?","score":1,"comments":[]}]}]},{"title":"Javascript course for web designers","not_safe_for_work":false,"locked":false,"body":"Hi! My goal is to create websites that apply graphics design principles and animations. I've learned HTML and CSS, and planning to learn Javascript now.\n\nDo you guys know of an online Javascript course that's catered to web designers? I found SuperHi, but I wanted to explore other options before investing.","score":2,"comments":[{"body":"I'm not sure where to go for a \"web design\" focus on JavaScript, as usually web designers and web developers are split into those two specific categories, since they both require skills within different fields.\n\nAs far as webdev stuff goes, though, there are two (free) courses I'd highly recommend:\n\n* [The Essential Web Developer Course](https://upskillcourses.com/courses/essential-web-developer-course)\n* [The Odin Project](https://www.theodinproject.com/)\n\nI know freeCodeCamp's got some curriculums, too, but these are usually the most well-liked. As far as focusing on design, I would just try to apply what you've learned to start making personal projects that you're proud of. Always good to expand that portfolio, too. Godspeed!","score":3,"comments":[]}]},{"title":"How to display ToString from class to the Program.cs?","not_safe_for_work":false,"locked":false,"body":"I have an issue with set ToString in the method of ToString in Team class  since actual result doesn't display player info from those since I set team.value in the Program.cs\n\n`string info = $\"\\n=======Teams========\\n\";`\n\n`info += $\"\\n{TeamName}\\n\";`\n\n`info += \"\\n=======Players========\\n\";`\n\n`foreach (KeyValuePair&lt;string, Player&gt; player in Players)`\n\n`{`\n\n`info += player.Value.ToString();`\n\n`}`\n\n`public override string ToString()`\n\n`{`\n\n`return $\"Name: {PlayerName}\\nJersey: {PlayerJersey}\\nPosition: {PlayerPosition}\";`\n\n`}`\n\n&amp;#x200B;\n\nI am not sure if I am suppose to create a list or not since I am currently using dictionary...It is something I need to display from those.\n\n&amp;#x200B;\n\n`foreach (var team in teams)`\n\n`{`\n\n`if (team.Key == teamName)`\n\n`{`\n\n`Console.WriteLine(team.Value);`\n\n`}`\n\n`}`\n\n&amp;#x200B;\n\nLet me know if I have violates the community guideline or rules then I will take this down or modify if necessary.","score":2,"comments":[]},{"title":"How to decide on the class structure for a new OOP project?","not_safe_for_work":false,"locked":false,"body":"**BROAD QUESTION:**\n\nI often find myself struggling at the start of any OOP project when it comes to the design and connections of the classes. Do people just know the best methods of design? Or is it more that multiple structures could work, and it just comes down to picking your favorite?\n\nNow I'm not talking about the basics like Polymorphism, Inheritance, etc. but rather the choices of one option over another when there are multiple ways you could implement something.\n\n&amp;#x200B;\n\n**MY EXAMPLE:**\n\nI am trying to build a program that simulates a fight in a shooter videogame. A rough idea of the class structure would be:\n\n    //A basic clock that keeps track of the damages done and when they occured\n    class TimeLine\n        event Tick\n        float _interval\n        float _currentTime\n        (An undecided structure to hold the result damages, their times, and other data)\n    \n    //The classes of the different characters as each one might have different stats, weapons, abilities, etc\n    abstract class Character\n        Stats baseStats\n        \n        class Character1\n            Weapon weapon\n            Ability ability1\n            Ability ability2\n            ...\n    \n    //The classes for the different kinds of weapons characters might have\n    abstract class Weapon\n        class gun\n        ...\n    \n    //The class for the different abilities characters might have\n    abstract class Ability\n        class ability1\n        ...\n\nThe main struggles I have are with the best way to handle \"Has-A\" relationships and Events.\n\n**HAS-A:**\n\nIn my design, different characters could have different numbers of weapons/abilities or other stuff down the line. Is it better/worse/not important to have each Character class have the exact variables, or to do something where the parent class of Character has a List&lt;Weapon&gt;, List&lt;Ability&gt;...\n\n**EVENTS:**\n\nMy events question is initially tied to the \"Tick\" event I have in the TimeLine class which is essentially causing updates for all the objects for values such as CurrentCooldown or ReloadTime.\n\nI see the options as:\n\n1. Have every character, weapon, &amp; ability class have a reference to the timeline, and subscription to the \"Tick\" event, and a method that updates on tick.\n2. Have the Character have a reference to the timeline, and then call update methods in all weapons and abilities that it has.\n3. Don't use events and have an update method in the character called by the timeline, and that update method calls the weapons and ability's update methods.\n\nAs I type this, I am also wondering if events are meant for a more dynamic situation, where the weapons, abilities, and such aren't as pre-defined as my project has them.\n\n**STRUCTURE IN GENERAL:**\n\nAdditionally, there are a couple of questions about the structure in general.\n\n1. How much is too much abstraction? I could, in the gun class, have an Ammo component that handles the tracking of ammo, max ammo, etc. Or I could just have 3 int values of current, max, and bonus (for whatever else) with updates handled in the shoot method by a current--.\n2. If I am not having the variables for Weapons, Abilities, etc put in the Character1, Character2, etc classes, but instead have a List&lt;Weapon&gt;, List&lt;Ability&gt;, etc. Then is it better to not even have the Character# classes, and instead handle them as constructors? Like:\n\n&amp;#x200B;\n\n    // THIS STRUCTURE\n    \n    abstract class Character {\n        Stats baseStats //has HP, movespeed, etc\n    }\n    \n    class Character1 extends Character {\n        Weapon weapon\n        Ability ability1\n        Ability ability2\n    }\n    \n    // VS\n    \n    class Character {\n        Stats baseStats\n        List&lt;Weapon&gt; weapons\n        List&lt;Ability&gt; abilities\n        public Character(Stats, List&lt;Weapon&gt;, List&lt;Ability) {\n            this.baseStats = Stats;\n            ...\n        }\n    }\n\n&amp;#x200B;\n\nNOTES:\n\n* My main language is C#\n* If I need to explain anything else on my thought process, please let me know","score":3,"comments":[{"body":"The general issue here is that you're trying to solve the entire program at once. That is generally not how development is tackled. Development is an iterative process where we build out the system piece by piece. There's no grand masterplan that dictates what classes needs to exist. \n\nInstead, we create classes we see fit guided by guidelines, like SOLID. We also refactor to make sure that the codebase doesn't spiral into a hot-mess when we discover something that has become unnecessarily complicated.\n\n&gt; How to decide on the class structure for a new OOP project?\n\nYou don't. You discover it while building the project.","score":2,"comments":[{"body":"So, and correct me if I'm wrong, you might start building out classes, even if the connections between them aren't the most efficient, then come back and overhaul the process implemented if need be?","score":1,"comments":[{"body":"I try to make the connection efficient when I build them, or I might have some idea before I start on a small feature of how it should connect. \n\nIt is easier to see structures when you're working with single features rather than trying to visualise the entire system before building it.\n\nBut yes, refactoring is important, but it is not an overhaul. As you continue building out the application you will crash into things that worked fine for your previous changes, but no longer works for your newer changes. The solution is not to twist it to work with your new changes, but rather to refactor it, so it works elegantly with both the old changes and the new ones.","score":1,"comments":[{"body":"Looking at the Character class then, are you saying it would be fine to have the values as variables in the Character# or as List&lt;&gt;, and then adapt future code from that?\n\nand sorry, I think it may take more time than since i've posted this for me to swap to the mindset of not designing the structure of everything from the start.","score":1,"comments":[{"body":"That completely depends on the current feature you're trying to implement.\n\nWhen I build systems, I start with the features* it needs, and I tackle them one at a time. I do what makes sense for the feature I'm currently working on. \n\nWhat does that mean for you in this scenario? I don't know because you're not talking about any specific feature. When you implement a feature, you make a design decision that seems good at that point, and then you make changes to that design if necessary when you work on newer features.\n\nWe also have to think that there's no universal \"right\" or \"wrong\". We make decisions that might turn out to be imperfect, but when discovered, we'll learn from them and fix them.\n\n*Well, actually, I use user stories, but if we're going to get into user stories, story splicing and all that, then we'll be here all day.","score":1,"comments":[{"body":"I think what is confusing me then is how, in my mind, the whole piece seems to be one feature.\n\n\"Return the total damages dealt\"\n\nSo for that I need a Timeline, 2 Characters, and those characters need their weapons/abilities.\n\nBut it seems that all those parts are needed. I mean I could say that for starters there are no abilities and implement it later, but the idea that those structures are going to be there one way or another leaves me thinking they will need to be designed in the same feature.","score":1,"comments":[{"body":"Well, sure, but features build upon each other.\n\nI.e. \n\nThe player should be able to move the camera with a the mouse. \n\nThe player should be able to move the character with WASD (now you have a first-person game).\n\nThe player should have two different characters.\n\nThe player should have a shotgun.\n\nThe player should be able to fire the shotgun.\n\nEtc...\n\nYou can tackle all these things individually and slowly build up a complex system.\n\nIf you find that you have to do a bunch of things to implement a single feature, then you should break down that feature into smaller features.","score":1,"comments":[{"body":"Oh for sure, but the first feature would still have a lot more structure design usually, right?\n\nLike if I want to make a calculator, but the first feature is only addition. Then I need to structure the numbers, and \"+\" and the \"=\" output.\n\nBut if the next feature is subtraction, the numbers and output are already handled. And it's not like you could have done the single addition feature without them.\n\nI'm seeing the classes I lay out as the barebones that are needed for the first feature. I may be wrong, but that's why I'm having a hard time seeing separation of them.","score":1,"comments":[{"body":"Maybe a little more in some circumstances, I suppose, but still so little that it shouldn't need a planned design.\n\nIn your calculator example, one could argue that the ability to input numbers is one feature while doing an actual calculation is another. That way, each feature should be fairly small. Though now we're starting to get into contrived edge cases where most strategies for dealing with complex systems fall apart.\n\nIf you struggle to see a separation, then idk what I can say. I showcase above how you can separate things and solve one part at a time. I.e. dealing with the camera, character and movement separately from weapons for example.","score":1,"comments":[{"body":"That's true. And don't get me wrong, you have been very helpful in pointing out a lot! I think it's just one of those concepts I need to look at and think about some more.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]}]}]}]}]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Favicon For Chrome Extensions Manifest V3","not_safe_for_work":false,"locked":false,"body":"I created a chrome extension for manifest V2 that uses favicons. I used \"permissions\":  [\"chrome://favicon/\"] to make it work. I had no issues with this, but now, they are forcing everyone to upgrade to manifest V3. Trying the same thing in manifest V3 does not work. It keeps saying that i am not allowed to load the local resource. How do I use favicons in my chrome extension for manifest V3?","score":2,"comments":[{"body":"There doesn't seem to be any actual documentation for the Manifest V3 favicon API yet, but this discussion thread talks about it: https://groups.google.com/a/chromium.org/g/chromium-extensions/c/qS1rVpQVl8o/","score":1,"comments":[]}]},{"title":"Could Swift do this?","not_safe_for_work":false,"locked":false,"body":"So, I’m completely new to programming. Had a little look at HTML and Python before but really barely anything as didn’t have the time to dedicate to it.\n\nI don’t really know much about all the different languages, but I know Swift is for iOS. I’m just curious to know if it’s possible to be able to create what I’d like to create with it or not.\n\nBasically, with all the different smart home eco systems there are, I’d like to know if it’s possible to create an app that can control them all, and create widgets too, etc?\n\nI know the Alexa app can literally do this, but perhaps I don’t like the user interface?\n\nSo, I’m wondering if I’d be able to create my own to do this? And would it be really complex to try something like this - or is it fairly reasonable?","score":2,"comments":[]},{"title":"[C++] I'm trying to practice defining methods outside of classes and using the scope resolution operator. Why am I getting errors for the following code?","not_safe_for_work":false,"locked":false,"body":"    #include &lt;iostream&gt;\n    using namespace std;\n    class Greeting(){ \n        public: \n            void sentence(); \n    }; \n    void Greeting::sentence(){ \n        cout&lt;&lt;\"Hello\"&lt;&lt;endl; \n    } \n    class Leaving(){ \n        public: \n            void sentence(); \n    }; void Leaving::sentence(){ \n        cout&lt;&lt;\"Goodbye\"&lt;&lt;endl; \n    }\n    int main() { \n    Greeting::sentence(); \n    Leaving::sentence();\n    return 0; \n    }\n\nI've tried a few things to fix it, but I'm still not seeing what I've done wrong. I've tried looking up examples, and from what I could find, I think I have the syntax right.","score":2,"comments":[{"body":"Your methods aren't static, so you need an actual instance of those classes to operate on, e.g.\n\n    Greeting g;\n    g.sentence();","score":1,"comments":[{"body":"It’s still showing errors :( What I'm specifically trying to do is to use the scope resolution operator in the main function to differentiate between the method (which has the same name in both classes) within each class","score":1,"comments":[{"body":"Class declarations don't have parenthesis after them. So no, you did not have the syntax correct. Please put more effort into checking your code and diagnosing problems yourself for trivial issues.","score":0,"comments":[{"body":"Yeah, another poster figured it out and told me already, thanks though!","score":1,"comments":[]}]}]}]},{"body":"`class Greeting()` is not valid syntax, because classes don't take parameters.","score":1,"comments":[{"body":"🤦‍♂️","score":1,"comments":[]},{"body":"Thanks! Idk why I didn’t catch that, I usually do.","score":1,"comments":[]}]},{"body":"The problem is in your class declarations.\nyour class declarations should look like this:\n\n```cpp\nclass Greeting {\npublic:\nvoid sentence();\n};\n\nclass Leaving {\npublic:\nvoid sentence();\n};\n```\nbut instead you've done it like this:\n```cpp\nclass Greeting(){\npublic:\nvoid sentence();\n};\n\nclass Leaving(){\npublic:\nvoid sentence();\n};\n```\nFix those two things and your code should compile just fine.","score":1,"comments":[{"body":"Thanks! It compiles now, but what I’m specifically trying to do is to use the scope resolution operator in the main function to differentiate using the method in each class. For example:\n\n&amp;#x200B;\n\n    int main(){ \n    Greeting::sentence; \n    Leaving::sentence; \n    return 0; \n    }\n\nBut it’s giving me an error saying that it’s a call to a non-static member function without an object argument. Do I have to make an object first before being able to use the function? Is there a way I can use the method with just the scope resolution operator?\n\nEdit: nvm, I literally just put the word static in front of the function name when I declared it and it worked, lol","score":1,"comments":[]}]}]},{"title":"c++ - How does a double know to store only numbers from an input stream, but would error if it were given the number explicity, such as double thing = 22f?","not_safe_for_work":false,"locked":false,"body":"If I input \"22f\", the program returns \"22\".\n\nThis tells me that val, a double, is only storing 22 and ignoring f?  However, if I input \"f22\", it will return 0 instead, as if it can't read past the f.  Why is this behavior different?\n\nEDIT: Then I input \"+11\" and it returned 11.  Wat.  -\\_-\n\n    int main()\n    {\n        char ch;\n        std::cin &gt;&gt; ch;\n        std::cin.putback(ch);  //ch put back into c input stream\n        std::cout &lt;&lt; ch &lt;&lt; std::endl;\n    \n        double val;\n        std::cin &gt;&gt; val;  \n        return val; \n    \n        std::cin.get();\n    }","score":0,"comments":[{"body":"It always behaves the same way: it reads up to the first character that isn't allowed as part of the type in question, and leaves that character unread. From \"22f\", everything up to the 'f' is allowed as part of a `double`, but the 'f' isn't, so it is left and the number 22 is returned. In \"f22\", the very first character is one that isn't allowed, so nothing is read, the stream is put into the fail state, and the 0 is irrelevant. In any case, nothing is ignored, as it would be pretty useless if reading one value caused the rest of the input to be ignored, making it impossible to read that part of the input.","score":1,"comments":[]}]},{"title":"How do you store a method output into a variable? (Java)","not_safe_for_work":false,"locked":false,"body":"I'm trying to take user input then scan it against a list of words in a file and then have it print out if it's a prefix, infix or suffix \n\nFor example: \n\nUser input: f \n\nOutput: fox - prefix \n              Queen - not found \n              Perfect - infix \n              Bookshelf - suffix","score":1,"comments":[{"body":"&gt; How do you store a method output into a variable?\n\n\nYou assign the return value to a variable\n\n`String result = myMethod(“f”);`","score":1,"comments":[]},{"body":"    public String doubleWord(String str) {\n        return str + str;\n    }\n\nYou can see that we define what is going to be returned with the first `String` keyword on line 1.\n\nThen the return value is what will we get from running the function, so:\n\n    String returnString = doubleWord(\"tu\");\n\nWould set `returnString` to `\"tutu\"`","score":1,"comments":[]}]},{"title":"How do I maximize my chances of getting an internship?","not_safe_for_work":false,"locked":false,"body":"\\`tl;dr: what to do for max probability of acceptances (r[esume](https://imgur.com/a/pZW8Moy))\n\n&amp;#x200B;\n\nI know this is not ask careers or anything, but this is relevant, stay with me for a second.\n\n&amp;#x200B;\n\nHi! \n\nOkay so, I want to maximise my chance of getting an internship, what do I learn/make for that? I have school stuff to do too, so I don't have a lot of time and thus I want to spend time doing the thing that gives me maximum return. \n\n&amp;#x200B;\n\nStuff about me:\n\n\\- [My Resume](https://imgur.com/a/pZW8Moy)\n\n\\- CS, Math Major, Undergrad, Sophomore in the US with meh GPA\n\n\\- [My 'Projects' (github.com)](https://github.com/ibzimh?tab=repositories) (Nothing too special here, most of them are just school projects)\n\n\\- Languages in order of proficiency: JavaScript, Python, Java, C\n\n&amp;#x200B;\n\nI was thinking learning something like React or SQL or something would be helpful since many of the places I've applied to have been like we need someone who knows SQL stuffs and well react or angular or HTML/CSS etc. would be helpful and not super hard since I know JS and wouldn't have to start from the start yk.\n\nOr maybe I should learn something else?\n\nOr maybe I should make some projects because companies like those a lot.\n\n&amp;#x200B;\n\nWhat do you think?","score":0,"comments":[{"body":"It seems you may have included a screenshot of code in your \npost \"[How do I maximize my chances of getting an internship?](https://www.reddit.com/r/learnprogramming/comments/z2dk6l/how_do_i_maximize_my_chances_of_getting_an/)\".\n\nIf so, note that posting screenshots of code is against \n/r/learnprogramming's [**Posting Guidelines**](https://www.reddit.com/r/learnprogramming/wiki/index) (section **Formatting Code**): please **edit** your post to use one of the \n[approved ways of formatting code](https://www.reddit.com/r/learnprogramming/wiki/index#wiki_formatting_code). \n(Do NOT repost your question! Just edit it.)\n\nIf your image is not actually a screenshot of code, feel free to ignore \nthis message. Automoderator cannot distinguish between code screenshots \nand other images.\n\nPlease, *do not contact the moderators* about this message. Your post is still visible to everyone.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/learnprogramming) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Can someone explain the cloud concept of permissions, access control, credentials, secrets, keys?","not_safe_for_work":false,"locked":false,"body":"I understand that these cloud concepts are related but I’ve never fully understood them. I sort of get how we can create a single instance/set of resources and then allow others access to them through a few other systems. Just struggling to make sense of this whole aspect of the cloud.\n\nThanks","score":1,"comments":[{"body":"The details will be different from one provider to another, but the basic idea is:\n\n* A *principal* is an identity of somebody or something who has a certain level of permissions. It can be a user account belonging to a human, or a service account that represents the permissions owned by a particular program/instance.\n* A client can use credentials to prove that it is allowed to act as a certain principal. For example, a service account might require a client key/secret key combination (basically just an auto-generated username and password) and a user account might require an OAuth token.\n* An administrator can associate each principal with one or more roles.\n* Each role grants a particular set of permissions on certain objects. For example, Google Compute Engine has an \"admin\" role that grants permission to do whatever you want with GCE instances. It also has a more limited \"OS login\" role that only grants the permissions needed to log into instances, but not to do other things like creating/deleting them. And you can create custom roles that grant other subsets of permissions, or only grant access to resources with particular attributes.\n\n&gt; I sort of get how we can create a single instance/set of resources and then allow others access to them through a few other systems.\n\nI don't really understand what you mean by this.","score":1,"comments":[]},{"body":"This is kind of a big question.\n\nIt seems like you understand the concepts, maybe you're more curious about the implementation, or examples of some of them? \n\nHere's something, I'm not sure if I have all the terms down, either, though:\n\nUser credentials are pretty common. Authenticate your user account with user/pass. That account has permissions granted to access information. Something like Reddit Gold gives you permission to access some other subreddit. That's an example of access control. \n\nKeys are usually something like a Shared Key or Public/Private keys. In order to access an API I might need to use a shared key in a request header to have access to the resources.\n\nSecrets, as I've been learn about them, are things like passwords or shared keys that need to be protected. A web server will be able to access the secrets in a way that they don't need to be deployed with the application code, and developers don't have access to help prevent sharing these secrets, accidentally or maliciously.","score":1,"comments":[]}]},{"title":"BEGINNER PROJECT PYTHON","not_safe_for_work":false,"locked":false,"body":"Hey,\n\nI'm trying to find beginner python projects that have if else, loop, function, list and or tuples and dictionnairies in them. \n\n\nIf you have a website or have some similar projects put it in the comment thanks!!! \n\n**** IMPORTANT NOTE**** \n\nThey have to have the answers/solution to the projects to see if I was on the good track or not\n\n\nthank you &amp; much love 😌🫶🏾","score":2,"comments":[]},{"title":"raise NoSectionError(section) from None configparser.NoSectionError: No section: 'mysql' https://dpaste.org/7CZmf","not_safe_for_work":false,"locked":false,"body":"I am create a database.con file   \n`\\`\\`\\``\\[mysql\\]  \ndatabase\\_type               = mysql  \nserver                      = localhost  \nport                        = 3306  \ndatabase                    = test  \nprivileged\\_account          = rohan  \nprivileged\\_account\\_password = root  \napplication\\_account         = apprunuser  \nconfiguration\\_file          = /etc/mysql/mysql.cnf  \npid-file = /tmp/spam.pid  \nshow\\_warnings = False  \nlog\\_errors = true  \ngeneral\\_log\\_file = true  \n\\`\\`\\`  \n\n\n  \nTraceback (most recent call last):\n\n  File \"[database.py](https://database.py)\", line 276, in &lt;module&gt;\n\nscan.hacktheplanet()\n\n  File \"[database.py](https://database.py)\", line 127, in hacktheplanet\n\nresult\\['result'\\] = c.do\\_check(self.config)\n\n  File \"/home/thor/Downloads/database/plugins/mysql/check\\_configuration\\_general\\_log.py\", line 32, in do\\_check\n\ngeneral\\_log\\_file = configuration.getboolean('mysql', 'general\\_log\\_file')\n\n  File \"/usr/lib/python3.8/configparser.py\", line 828, in getboolean\n\nreturn self.\\_get\\_conv(section, option, self.\\_convert\\_to\\_boolean,\n\n  File \"/usr/lib/python3.8/configparser.py\", line 808, in \\_get\\_conv\n\nreturn self.\\_get(section, conv, option, raw=raw, vars=vars,\n\n  File \"/usr/lib/python3.8/configparser.py\", line 803, in \\_get\n\nreturn conv(self.get(section, option, \\*\\*kwargs))\n\n  File \"/usr/lib/python3.8/configparser.py\", line 781, in get\n\nd = self.\\_unify\\_values(section, vars)\n\n  File \"/usr/lib/python3.8/configparser.py\", line 1149, in \\_unify\\_values\n\nraise NoSectionError(section) from None\n\nconfigparser.NoSectionError: No section: 'mysql'\n\ni am sharing code here [https://dpaste.org/7CZmf](https://dpaste.org/7CZmf)","score":3,"comments":[]},{"title":"[React] How can I make form inputs by mapping through nested state?","not_safe_for_work":false,"locked":false,"body":"I'm looping through the form data to make a few inputs in this form. This part is working great. My issue is then loopping through the task array to make inputs for the tasks. It's not working. The console says x.task.map is not a function. How should this be rewritten? I feel like logically it would work but I must not be writing the code correctly. TIA\n\n    \n    const [ WorkExperienceFormData, setWorkExperienceFormData ] = useState(\n          [{jobTitle: \"\", date: \"\", task: [\"\"], id: uuidv1()}]\n    );\n    \n    \n    function WorkExperienceForm( { WorkExperienceFormData, handleChangeExperience } ) {\n    \n        return (\n            &lt;&gt;\n                {WorkExperienceFormData.map((x, i) =&gt; {\n                    return (\n                        &lt;form&gt;\n                            &lt;input \n                                value={x.jobTitle} \n                                type=\"text\" \n                                onChange={e =&gt; handleChangeExperience(e, i)}\n                                placeholder=\"Position, Company\"\n                                name=\"jobTitle\"\n                                \n                            /&gt;\n    \n                            {x.task.map((y, index) =&gt; {\n                                return (\n                                    &lt;input \n                                    value={y.task} \n                                    type=\"text\" \n                                    onChange={e =&gt; handleChangeExperience(e, index)} \n                                    placeholder=\"Task\"\n                                    name=\"task\"\n                                /&gt;\n                                )\n                            })}\n                        &lt;/form&gt;\n                    );\n                })}\n            &lt;/&gt;  \n        );\n    };","score":1,"comments":[]},{"title":"is recursion something that people either get or don't","not_safe_for_work":false,"locked":false,"body":"Context, I've taken data structures and algorithms and willl take functional programming next semester, it's the second class in our CS core, and I've followed along this semester and done some assignments with some of my friends who are taking it this semester. I've noticed that some people really hated data structures and algorithms because it's just painful debugging and long careful coding vs functional programming where it's far fewer lines of code, but harder to think about. I have some friends who are very good at recursion, like grind out an assignment whereas I would stare at 3 lines of code thinking about it for \\~30 minutes and have to take a break and start agian because trying to think about the recursion is so mindboggling, I've tried multiple techniques but recursion seems to just not be my thing","score":2,"comments":[{"body":"To all following commenters: please, do not bring up the old circlejerk \njokes/memes about recursion (\"Understanding recursion...\", \"This is \nrecursion...\", etc.). We've all heard them n+2 too many times.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/learnprogramming) if you have any questions or concerns.*","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I mean, even people who know recursion now, didn't ten years ago.  So they didn't get it back then.   So people can definitely learn it, but as with anything, some people are going to be incapable of doing it, and some *could* do it if they had a lot of tutoring.\n\nIf you have friends, have them talk aloud their thinking process.\n\nI will say it took a while for it to click for me, so I didn't get it for a while, but now I get it.","score":2,"comments":[]},{"body":"I was in the same boat as you for a while, then suddenly it clicked for me. It was actually binary trees that helped me out","score":1,"comments":[{"body":"I did a sudoku solver. That really nailed recursion down for me.","score":1,"comments":[]}]},{"body":"I think recursion is like any other new way of thinking, from mathematics and languages to science and music, it will \"click\" faster for some people than for others, but almost everyone can get there eventually. Most likely, you just haven't found that one explanation that works for your brain.\n\nFor me, the concept of recursion as a rope or string being coiled with a \"break point\" to unfurl it, is what made recursion stick. \n\nThat said, I've seen at least 5 other ways of thinking about recursion which just confuse me. So my guess would be that you just need to find \"the\" explanation that works for you.","score":1,"comments":[]},{"body":"If you're looking for resources, SICP and HtPD were a big help to me. They risk being overkill if you're already taking classes dedicated to these subjects, though.","score":1,"comments":[]},{"body":"&gt; functional programming where it's far fewer lines of code, but harder to think about\n\nI don't think it's intrinsically harder to think about. It's just a very different way of thinking compared to iteration. If you learn iteration first it will be different to think differently about the solutions you write. If on the other hand you have experience with recursion and induction from mathematics it will be way easier because you have the practice.\n\n&gt; I've tried multiple techniques but recursion seems to just not be my thing\n\nYou will get there with more practice. It's a skill you can definitely learn and it is not a skill reserved for a few chosen ones.","score":1,"comments":[]},{"body":"Practice!\n\nI only really nailed recursion after going through the recursion exercised here: https://codingbat.com/java","score":1,"comments":[]},{"body":"Very few things have such a high barrier that you would need that line of thinking. Think about how you learned recursion and if there were holes in your knowledge when you did so. Whether it is the fundamentals of recursion or applied examples, it usually boils down to the repetitive practice of these concepts.","score":1,"comments":[]},{"body":"It being your thing or not is not a thing, IMO.  It's not an ice cream flavor.  You might not use it often, depending on what you're working on, but just throwing your hands in the air because you have a notion that it may not be your thing is not what you want to settle for.\n\nRecursion is:\n\n* Not very different from normal function calls at all. Learn how the [call stack](https://en.wikipedia.org/wiki/Call_stack) works. Function definitions are sort of blueprints for execution - sort of like classes vs. objects. The actual stack frames on the call stack are like the \"objects\" in that analogy. Recursion is more special conceptually than it is mechanically under the hood.\n* Recursion usually carries out some kind of \"delegation\". For example, many recursive solutions (not all, but many) take off one small piece of the problem, and then hand off the entire rest of the problem to another recursive call. Only when that recursive call finishes can you combine the results into a final answer, and so on up back up the chain to the original/root call. Every time you call deeper and deeper, you're just piling stack frames onto the call stack, waiting for the subordinate call to finish its work.  The subordinate call with the easiest workload is the one that hits the base cases - it has no more work to delegate, so it's able to immediately give back its own answer without any further calls.\n\nKeyword here is stack.  Think of a literal stack.  What happens when you put things on a stack? You can't get the things on bottom until you pop things off the top. First in first out (FIFO).\n\nThe call stack works in tandem with the program counter. The program counter is very dumb, it just points to the next instruction. The call stack is a way of restoring variables/data from different function calls previously captured on the call stack, as well as return addresses for the program counter to jump back to.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Japanese ⇔ code review &amp; advice","not_safe_for_work":false,"locked":false,"body":"Hi, I'm a sophomore at a Japanese university and study programming by myself. \nHaving no mentor or personal coach, I want someone who offers me to review my project. \nIn return for the kind help, I can teach Japanese. I hope someone gets interested in this and contact me.","score":10,"comments":[{"body":"Can you give short description of your projects and it's tech stack","score":2,"comments":[]},{"body":"I'd be down. I can teach C#, Java, Python, or Unity.","score":2,"comments":[]},{"body":"Frontend/Fullstack dev/teacher here. If you’re getting into JS/TS, React and Node I’d be happy to exchange reviews for language exchange!\n\nよろしくお願いします！","score":2,"comments":[{"body":"Thank you for the description. I would like you to have a review of my portfolio site and some advice for the study method. \nDoes it work for you?","score":1,"comments":[]}]},{"body":"What programming languages?","score":1,"comments":[]},{"body":"If it's related to web development I would be able to help.  \nLet me know!","score":1,"comments":[{"body":"Thank you for your help! It’s a web development. I want you to review my portfolio site. If you accept this request, could you send me a message to talk about details through chat? Sincerely waiting for your response. Thank you!","score":1,"comments":[]}]},{"body":"Thank you for the all comments! \nI’m working on web development and embarrassingly, don’t even proceed to React or Vue… I’m just sticking to vanilla js. \nSo I guess it would be a simple review of JavaScript. \nIf you offer the review, please send me a message!","score":1,"comments":[]}]},{"title":"Strange Problem when comparing input to a &lt;string&gt; vector","not_safe_for_work":false,"locked":false,"body":"I ask the user for input, then compare the input to a vector of strings at a given index. I check to see if the user input matches the string stored at a given index of the vector. But even when the input and the vector match perfectly it always enters the if brach that indicates they don't match.\n\nThis is in c++\n\nThe odd thing is is that I works when I use older compilers, but when I use -std=c++17 I get this problem???","score":1,"comments":[{"body":"It's probably impossible to give you a good answer without seeing the code. But if your program compiles successfully but has different behavior with different values of `-std=`, then it probably means you have a bug causing undefined behavior that you were inadvertently relying on somehow.","score":1,"comments":[]}]},{"title":"How do you \"system restart\" a virtual machine?","not_safe_for_work":false,"locked":false,"body":"I have a DigitalOcean virtual machine (droplet) and every time I start it I get the message:\n\n    System Restart Required\n\nI restarted my computer but it doesn't fix the problem.\n\nHow do you \"system restart\" a virtual machine? Is there a way to fake restart it with the command line?","score":1,"comments":[{"body":"Just type sudo reboot while ssh'ed into the droplet","score":1,"comments":[{"body":"Thank you!","score":1,"comments":[]}]}]},{"title":"Any good youtube channels for coding streams without anyone talking?","not_safe_for_work":false,"locked":false,"body":"Hi guys I am looking for high quality coding videos where it's just someone coding without talking, more long format stuff amd specifically web development, something relaxing, nice background music or ambient sounds is a plus\n\nI am not looking for educational content, I find this type videos relaxing and I like watching it before I go to sleep","score":0,"comments":[{"body":"This sub about _learning_ programming, not whatever you're asking for here","score":7,"comments":[]},{"body":"ASMR coding videos are there in YT","score":3,"comments":[{"body":"Thanks, didn't think of that search term but it perfectly describes what I want","score":1,"comments":[]}]},{"body":"I don't know of any on youtube, but Twitch has many livestreams from coders who don't talk. They are easy to find in the \"Software and Game Development\" section if you look for the ones that have less than 5 viewers. The streamers who don't talk are the least popular, but if it's what you like, just sort by viewers from lowest to highest.","score":2,"comments":[{"body":"Thanks I'll check that out","score":1,"comments":[]}]},{"body":"Can't you just play videos on mute with whatever audio you like?","score":2,"comments":[{"body":"It's different, most live coding style videos I found are meant to be Durations which means they stop a lot to explain or engage if it's live, I like just watching something being created without all the extra explanations, there is a channel on YouTube with some videos that I liked but not enough and I couldn't find anything similar\n\n[link to video](https://youtu.be/bSMZgXzC9AA)","score":0,"comments":[]}]},{"body":"Make your own videos?\n\nAnd if you don't want to code yourself copy pasta some random code from GitHub and do some nice fade in effect in e.g. power point which you can play back the rest of your truly depressing sounding life","score":1,"comments":[{"body":"God damn.","score":2,"comments":[]}]}]},{"title":"What are some tips that is suggested to dev to make their merge requests easier to process and make it easier for someone to want to review it","not_safe_for_work":false,"locked":false,"body":"I was walking the Taro's live stream talking about tips to improve as a developer. One of the points they mentioned was spending more time in documenting and justifying the reason for the pull request. \n\nseveral point include:\n\n* if you're doing a front end feature, show a gif of the feature of the intended result of the code.\n* link to the ticket that you're working on\n* if you are submitting parts of a ticket then outline the overall parts you will break down to resolve the issue. \n\nThey had mentioned working on clear Pull Requests helps to build trust between you and your team as it helps your team to see you as dependable. Does anyone have any tips or experiences where it made it easier for their PR to be review?","score":7,"comments":[{"body":"I try to make my PR as short as possible. If something can be broken into chunks, then submit each chunk separately - aint nobody want to review a 1,000 line PR. Sometimes it has to be done, but really try to make more bite-sized ones.\n\nI link to the story or bug in the comments. This is good not only for the code reviewer, but anyone else that is looking at the history. I usually have a brief description of the thing (good for title), a link, confirmation that tests are in (and any other important testing info), and usually bullet out my thoughts as to why i did it this way instead of another way.\n\nI dont go overboard in the comments, but i do really like to make sure the reviewer can see my thought process because that usually makes for extremely good feedback.\n\nI dont do front-end stuff, but the gif in the comments sounds pretty cool :p","score":5,"comments":[]},{"body":"Keep the PR/MR on topic. If you're already touching a file for some ticket-related work it's fine to do some extra cleanup in that file, but don't go and start changing things in a bunch of unrelated files.","score":3,"comments":[{"body":"Sure, but you got tips on how to make the PR/MR clearer for the person reviewing it to understand since jumping in and trying to read someone else's code isn't always the easiest to pick up.","score":1,"comments":[{"body":"Comments. As many as necessary. \nVariable names. Logical names make a huge difference. \nFiles changed. Keep them as small as possible.","score":1,"comments":[]},{"body":"Generally speaking, whoever's reviewing the PR should be fairly comfortable with the codebase already so it shouldn't be that much overhead for them to understand what's going on. One thing you can (and should) be doing on this front is to make sure you're following any established patterns within the codebase in terms of style, architecture, etc.","score":1,"comments":[]}]}]}]},{"title":"Why would you add 8 bytes to a buffers length, and then subtract the buffers current position from the new length?","not_safe_for_work":false,"locked":false,"body":"So a colleague and I were looking at some code today and couldn't really think of a reason the author might have done this. There was no comments.\n\nThe pseudocode is essentially like\n\nfileStream = read file as stream\n\nsize = fileStream.length + 8 - fileStream.cursorPosition\n\nmemoryStream = MemoryStream.ReadFromFile(fileStream, size)\n\nmemoryStream.cursorPosition = 0\n\n---\n\nSo, let's assume the cursor was at the 0th position, this would result in the memory stream containing 8 extra bytes. That's fine. But if we're at the end of the stream, the cursor would be equal to the streams length, so the entire new memory stream will only contain 8 bytes. \n\nI really don't get it. \n\nWhy not just set the memory stream to be equal to the original streams length?\n\nIt is possible this is a bug, but I really want to know if there is some valid reason the original developer might have written it this way, and I just can't figure it out. \n\nAnyone here know?","score":2,"comments":[{"body":"&gt; So, let's assume the cursor was at the 0th position, this would result in the memory stream containing 8 extra bytes. That's fine. But if we're at the end of the stream, the cursor would be equal to the streams length, so the entire new memory stream will only contain 8 bytes.\n\n&gt; I really don't get it. \n\nIn either case, the code will read N bytes and allocate N+8 bytes, so I'm not sure why you'd be confused about the special case where N=0 and not about the general case.\n\n&gt; Why not just set the memory stream to be equal to the original streams length?\n\nThe first possibility that comes to mind is that something later on is going to concatenate another 8 bytes of data to the end of the same buffer, and the developer wanted to preallocate enough space in order to avoid unnecessarily copying the data.\n\nAnother possibility is that something expects to be able to read data from the buffer in 8-byte chunks (maybe as part of an unrolled loop or something?) and so they added enough padding so that you can still do that even if the data isn't a multiple of 8 bytes, without the risk of reading past the end of the buffer. (I've seen this kind of thing done in code that used SIMD intrinsics for high performance.)\n\nBut without context, I'm just guessing.","score":1,"comments":[{"body":"So for the first part, I was saying like when the current cursor position N &lt;=8 specifically, you know you will at least be able to fit the file in the new stream\n\nBecause it is Len + 8 - N\n\nBut in the case we have already read past 8 bytes, we will be allocating a stream with a capacity smaller than the original file\n\nAssume we have read 14 bytes, so N is 14.\n\nLen + 8 - 14\n\nSo we actually allocate a value less than Len. \n\nIn the cases you mentioned, I agree that could be the intention. But for this case, it doesn't make sense to me","score":1,"comments":[{"body":"You didn't say which language you're talking about, but I was assuming that `ReadFromFile` reads starting at the current file position. If so, the buffer will always be big enough, because `fileStream.length - fileStream.cursorPosition` is the number of bytes from the current position until the end of the file.","score":1,"comments":[]}]}]}]},{"title":"computer science gcse pseudocode","not_safe_for_work":false,"locked":false,"body":"We have been learning pseudocode but I still have no clue what to do in most questions. Is there any good video or resources that teach pseudocode?","score":1,"comments":[{"body":"This is why they shouldn't teach pseudocode, esp. in an intro course.  I know the idea sounds appealing.  People think \"they should think of things at a high level then translate it to code\".\n\nHowever, it's hard to write pseudocode for several reasons.\n\n* it's not a real language, so it can be anything\n* it's hard to write it when you don't have any idea how to solve the problem...the idea is to ignore the syntax and outline a solution, but when you're a beginner, it's hard to do this\n* you have the Goldilocks problems, either too much detail or too little...the more programming you know, the more detail you add\n\nSo some people basically write out the pseudocode like a program, talking about arrays, calling functions, doing assignment statements.  That's probably at the level to aim for.  Write the code as if it were, say, Python, then just write it in English.\n\nI think pseudocode makes much more sense as you gain more experience.\n\nI was listening to a talk maybe 15 years ago.  Although I was at a technical conference, it was about being a novice vs. being an expert.  Novices need very explicit instructions as they know nothing and want to be reassured that they didn't miss any steps.  Experts, on the other hand, don't need every detail spelled out for them.  They can leave out lots of details and other experts will understand.\n\nMy suggestion is to use Google.  Search for \"how to write pseudocode\".  Or look for some YouTube videos.  Sometimes it's that simple.  Also, check if the teacher has been covering the material in class.","score":1,"comments":[]}]},{"title":"Event sourcing, projections and snapshots. Should I denormalize?","not_safe_for_work":false,"locked":false,"body":"Event sourcing, projections and snapshots. Should I denormalize?\n\nI'm learning event sourcing now, and I'm having trouble knowing where (or if) i should normalize my data.\n\n### As far as I know, this are the core concepts:\n\n* Event sourcing is a pattern that consists of storing entities (or something similiar) as a timeline of events.\n* Projections process events to construct a state until certain point in time.\n* Snapshots are stored states of projections.\n\n### Implementation details:\n\n* I'm using MySQL as an event store.\n* I'm using Redis as a snapshot store.\n* Projections are objects that connects to both stores. They get the latest snapshot and process the new events, updating it's current state.\n* Strongly consistent, because I'm querying the event store directly.\n\n### Entity modeling\n\n* Users can have many teams.\n* Teams can have many users.\n\n### Problem\n\nI need to aggregate the events in this format:\n\n```json\n{\n  \"id\": 1,\n  \"name\": \"Lorem\",\n  \"team\": {\n  \t\"id\": 2,\n  \t\"name\": \"ipsun\",\n  \t\"description\": \"dolor sit\",\n  }\n}\n```\n\n### Solution 1\n\nMy first tought is to make the projection consume, not only the user related event, but also all teams related events. That way I can keep the current state of the teams and, when necessary, \"join\" the user with the team it's refering to.\n\nThe major drawback that I can think of is the large amount of space the storing of these snapshots will consume. If a have 'S' snapshots per user, 'U' number of users and 'T' amount of teams, the number of duplicated data I will have is approximately: S * U * T\n\n### Solution 2\n\nMy second thought is to make two projection: one for the user, one for the team, and them \"join\" then later.\nThe problem I see with this solution is the need for two database/cache trips. One for the team, other for the user, and because I depend on the information of one to start with the other, they can not be done asynchronously.","score":1,"comments":[]},{"title":"Does imposter syndrome affects many people who are in programming?","not_safe_for_work":false,"locked":false,"body":"Same as title.","score":865,"comments":[{"body":"I've been slinging code for almost 13 years and I question myself regularly. Just acknowledge it's a thing. An insecurity and I push forward. I still wonder if I'm going to make it in the industry. It's weird.","score":464,"comments":[{"body":"Going on 8 years here…same. Every Monday I wake up wondering if this is the week someone realizes I’m just winging it and let’s me go. I’m stepping into a lead role for the second time and I worry about letting my team down.","score":72,"comments":[{"body":"I think the problem is when comparing ourselves to the 10x devs, I feel like I can do my job, but some people can do so much more than me it feels bad sometimes.","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"There are  only 2 kind of Programmers:\nThe ones with imposter Syndrom  and the ones with  an god complex.","score":840,"comments":[{"body":"And often they're just the same guy on different days","score":548,"comments":[{"body":"It depends on if my script works or not","score":67,"comments":[{"body":"I'm currently working on learning Rust to breathe a 3rd or 4th life into my SDET career... finally got my science fair api working inside docker.  For the first couple days it was non stop \"who TF am I kidding, I may just be too old to learn a new way of doing everything, the syntax is all wonky, the compiler is whiney as shit... man I suck at this.\" then I finally got it working... telling me the time and handling JSON queries in and out and I converted to \\[Bender voice\\] \"Awwww yeah!\" in about one heartbeat.","score":27,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It is a small line between I'm a genius and What fuck I'm doing in my life.","score":218,"comments":[{"body":"Relatable.","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I'm currently finishing my CS bachelor's degree and looking for my first job in the industry.  Every time I walk into an interview I think I don't know anything, that I learned nothing in UNI and that I am a fraud. I had a couple of promising interviews so hopefully I'll get hired soon and start climbing the IT ladder.","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Coding Bootcamp recs?","not_safe_for_work":false,"locked":false,"body":"I am looking for a part-time remote coding bootcamp that I can complete while working full time. I am interested in web development and front-end languages, but I am also looking to learn more about back-end if possible. \n\nI am currently between CareerFoundry and Codesmith. Are these programs worth the investment and time? And are there any other boot camps that have engaging remote programs that I may be missing?","score":1,"comments":[{"body":"The Odin Project is effective and completely free","score":2,"comments":[{"body":"I am also planning on completing the Odin Project. I have a few different goals in mind for learning.","score":1,"comments":[]}]},{"body":"TOP was already recommended, but Upskill's [The Essential Web Developer's Course](https://upskillcourses.com/courses/essential-web-developer-course) might also be worth looking into. From what I know, they're both project-based, which is always a plus.\n\nThe benefit of these is that they're both free, so there's nothing to worry about when it comes to spending money!\n\n&amp;#x200B;\n\nEdit: It's always smart to be wary of \"job guarantee\" bootcamps. Most of these have very strict stipulations that are - for some reason - not immediately displayed on the course checkout page.\n\nParaphrased from CareerFoundry: in order to be eligible for the job guarantee refund, for example, students must have completed all of the job prep modules, and must be doing the following weekly: apply to 5 jobs, reach out to 5 individuals, conduct 2 \"informational interviews.\" Then, you must also complete 3 personal portfolio projects within 3 months of the job prep course, or 2 hosted on your own-made website.","score":1,"comments":[{"body":"thanks for the recommendations! I’m already aware of TOP and planning on completing it. I hadn’t heard of Upskill’s course so I’ll add that to my list as well!\n\nAnd that’s good advice for the career placement aspect of bootcamp. I’ll definitely keep it in mind. Thank you!","score":2,"comments":[{"body":"Happy to help! TOP alone is pretty beefy in terms of what it'll give you. Once you have an account, step into the later modules and take a peek at project submissions; it's incredible what you'll be able to do.","score":1,"comments":[]}]}]},{"body":"I'm a bootcamp grad, seriously consider going to school instead, sure it gave me the basics, and a couple projects under my belt but I'm a year out, and I can say that it was actively a waste of money.\n\nI've had interviews that were going well, they looked at a couple projects and when they asked where I went to school, I mentioned I went to a bootcamp. The interviewer scoffed and said they were only accepting people with a BA and ended the interview.\n\nFor some people it's life changing and the best thing in the world for them, but for most bootcamp grads it was a money hole.","score":1,"comments":[]}]},{"title":"NEED HELP I am having problem in decision control instruction (i just started learning c)","not_safe_for_work":false,"locked":false,"body":"  \n\n\\# include &lt;stdio.h&gt;\n\nint main( )\n\n{\n\nint i = -1, j = 1, k, l ;\n\nk = !i &amp;&amp; j ;\n\nl = !i || j ;\n\nprintf ( \"%d %d\\\\n\", i, j ) ;\n\nreturn 0 ;\n\n}\n\nThe output of  this program is -1 1 \n\ni dont understand how -1 comes. can someone explain me how -1 comes please","score":1,"comments":[{"body":"Your assignment in the beginning is int i = -1; And your printf at the end is (%d, i); The code in the middle does nothing to change i. So your output for i will always be -1.","score":2,"comments":[]},{"body":"assignment statements are *not* mathematical rules that permanently apply to a variable, you cannot state\n\nk = !i &amp;&amp; j\n\nand then change i or j and expect k to change, the language just doesn't work that way. some functional languages can be made to do this, but c and anything that looks like c will not\n\nyou can set i and j... and *then* do\n\nk = !i &amp;&amp; j\n\nand that will fill k accordingly, and then print out k... but the order matters, this is like writing instructions for a friend, they're going to start at the top of the instructions and work their way down, they're not going to bounce back and forth between lines","score":1,"comments":[]},{"body":"Well you're really just printing i and j alongside, which you've defined in line 4: ```int i = -1...``` there's no mistery, K and L are not changing the value of i and j because they are not references.","score":1,"comments":[]}]},{"title":"Marine API","not_safe_for_work":false,"locked":false,"body":"Hi! I'm making an app in SwiftUI for my personnal project and I absolutely need a marine api... so like the fishbase api. Since the fishbase api is not working anymore I have to look for another one. help please!","score":8,"comments":[{"body":"What do you mean by marine API?","score":5,"comments":[{"body":"An API with the marine species like Fishbase","score":3,"comments":[]}]},{"body":"Maybe check some of these out: https://www.programmableweb.com/category/fishing/api","score":3,"comments":[]},{"body":"Following. Ive been curious about this as well. The fishing ones were not what I was looking for.\nSpecifically, a corals API database and a awuarium hobbiest saltwater fish/inverts","score":2,"comments":[]},{"body":"You might have better luck asking in a fish-related subreddit, where people know more about fish","score":1,"comments":[]},{"body":"[removed]","score":-3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[removed]","score":-4,"comments":[{"body":"???? Just help me ;(","score":-5,"comments":[{"body":"[removed]","score":0,"comments":[{"body":"So ? That's not my problem","score":-2,"comments":[]}]}]}]}]},{"title":"Looking for an advice!","not_safe_for_work":false,"locked":false,"body":"Hi guys, I started learning JavaScript, HTML, and CSS **about a month ago**; I want to make a switch in my career and become a web developer, but there is **this** **one** **question** that won't go out of my mind:\n\nA lot of times, when I'm practicing on CodeHS or freeCodeCamp, there are some problems where I get **stuck**. If I'm stuck for too long, I research, find an answer, and ultimately solve the problem, but I often can't remember the solution since I just googled it or can't fully understand why it worked.\n\nSo, I would like to hear some advice from more experienced people:\n\nShould I only move on when I truly understand how this or that line of code worked, or move on when things work as they should and not pay too much attention, at least for now?","score":2,"comments":[{"body":"Have a journal, where you type up these kind of happenings. As for stay or continue at problem, it is up to you and how you learn best. \n\nAnd if I my ask, why did you start at the front? It is valid and fine, im just curious. I started at the backend and worked my way through databases, apis and whatnot to the front.","score":2,"comments":[{"body":"Well, when I was doing my research on where to start, I had a chance to speak with a software engineer who has 13+ years of experience working in this field, and he recommended starting with some basic JavaScript + HTML/CSS.\n\nBesides that, many people who take their first steps in becoming a programmer tend to start by learning these tools (At least that’s my conclusion after researching the internet).\n\nLet’s see, though. When I’m more or less familiar with the abovementioned stuff, I will check what’s going on on the server side of things. I’m curious about node.js but don’t want to try to learn everything all at once, you know?","score":1,"comments":[{"body":"You cant and wont learn everything at once. :) you have to pace, take it a step at a time. This is maraton till grabe, not a sprint. There is no rush. \n\nWeb dev is easy(ish) to start from light js and html/css, but that didnt cut it for me. I dont care how things look, I care how they function, so BE was logical choise for me.\n\nI just love building data-highways, transforming and tinkering objects, requests, data, models... I like how almost all of it happens visually in my head, as you cant really \"see\" the change you make irl.\n\nAs I got exp things didnt seem so... Straight-cut between FE and BE anymore, and nowadays I work as fullstack, but that is how it was in the beginning.","score":1,"comments":[{"body":"Great to hear your story! It’s always nice to see people who succeeded in their programming path!\n\nWhat I can tell so far is that I rather spend a day thinking about the logic that I need to use to write JavaScript code than to markup and style a web page. Don’t get me wrong, applying some nice looks to the page and seeing no errors in HTML/CSS validator are fun too, but the feelings I get when my JS code does what it should be doing are addicting! 🤣\n\nI think the front end has an edge with beginners like me because one can directly see what they just wrote, which can be important during the first steps in this career.","score":2,"comments":[{"body":"Hah.\n\"What I can tell so far is that I rather spend a day thinking about the logic that I need to use to write JavaScript code than to markup and style a web Page\".\n\nThis is excatly why I chose the back end. 😆 C# for me tho.","score":1,"comments":[{"body":"Oh, C# and the remaining “C” languages 🤓 They remain mysterious to me for now 😃","score":1,"comments":[]},{"body":"I’m watching Harvard CS50 as we speak and it went from a programming language that looked like a game a child would play on his iPad to C in 30 seconds 🤣","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]}]},{"body":"By the way, thanks for your recommendation 🙏","score":1,"comments":[]}]},{"body":"&gt;Should I only move on when I truly understand how this or that line of code worked, or move on when things work as they should and not pay too much attention, at least for now?\n\nIf your goal is to understand how to write code, what do you gaining by copying code you do not understand?","score":1,"comments":[{"body":"Of course it’s my goal to understand in the end, but since I’m relatively new to programming, I’m still searching for the right ways to learn. That was the point of my question.","score":1,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What to do with an error message: \"Unhandled exception. System.Collections.Generic.KeyNotFoundException: The given key 'string team' was not present in the dictionary. [...]\" in C#","not_safe_for_work":false,"locked":false,"body":"A full error message: Unhandled exception. System.Collections.Generic.KeyNotFoundException: The given key 'string team' was not present in the dictionary.    at System.Collections.Generic.Dictionary\\`2.get\\_Item(TKey key)    at Program.&lt;&lt;Main&gt;$&gt;g\\_\\_AddPlayer|0\\_5(String team, &lt;&gt;c\\_\\_DisplayClass0\\_0&amp; ) in /Users/ten/Desktop/NMAD/homework3-stybjs/Program.cs:line 147    at Program.&lt;Main&gt;$(String\\[\\] args) in /Users/ten/Desktop/NMAD/homework3-stybjs/Program.cs:line 28\n\n&amp;#x200B;\n\nI am having problem with entering an input because it won't proceed as I expect this. \n\n`while(true)`\n\n`{`\n\n`Console.Write(\"Enter a player position: \");`\n\n`string playerPosition = Console.ReadLine();`\n\n&amp;#x200B;\n\n`if(teams[team].Players.ContainsKey(playerPosition))` \n\n`{`\n\n`Console.WriteLine($\"The player's position {playerPosition} already exist on the team {team}\");`\n\n`continue;`\n\n`}`\n\n&amp;#x200B;\n\n`else`\n\n`{`\n\n`return playerPosition;`\n\n`}`\n\n`}`\n\n`void AddPlayer(string team)`  \n`{`  \n `string playerName = PromptPlayerName(team);`  \n `int playerJersey = PromptPlayerJersey(team);`  \n `string position = PromptPlayerPosition(team);`  \n `teams[team].Players.Add(playerName, new Player(playerName, playerJersey, position));`  \n`}`\n\n&amp;#x200B;\n\nI am new to this reddit community, so let me know if I did not follow this community guideline, I will take down or modify if necessary.","score":1,"comments":[{"body":" You need to make sure your dictionary contains the key before you access it.\n\n    if(teams.containsKey(team)){\n        …\n    }","score":3,"comments":[{"body":"and one more thing for switch case\n\ni am not sure if this is a proper to do this\n\n`AddPlayer(\"string team\");`\n\nsince I created a method \"void AddPlayer(string team)\" so what should i do?","score":1,"comments":[]}]}]},{"title":"Missing gsed and bc in git bash","not_safe_for_work":false,"locked":false,"body":"Hi!\n\nI'm trying to run a script written in bash using git, because I'm using windows. However, bc and gsed are \"commands not found\". I'm new to programming, but I've tried to solve this a few diffent ways, but with no success.\n\n&amp;#x200B;\n\nI tried using chocolatey -  didn't work.\n\nI tried installing it with MINGW64 - didn't work.\n\nI tried crying -  didn't work.\n\n&amp;#x200B;\n\nThe main problem is that even though it says that it has been installed, I can't find in the directories to put in git and neither can I use them when following a direct installation tutorial.\n\n&amp;#x200B;\n\nHow can I solve this? I lost a day and 80% of my sanity in this thing that I thought would take ten minutes.\n\n&amp;#x200B;\n\nThanks!","score":1,"comments":[{"body":"Have you considered getting cygwin instead based on the limitation of git bash?","score":1,"comments":[]}]},{"title":"What kind of field of study can you find information to improve netcode for games?","not_safe_for_work":false,"locked":false,"body":"Im interested to see what goes into netcode for games and what is required to understand and (make?) netcode.\n\nI get the obvious answer is Computer info science but i want to know whats the sub category that entails netcode. Just like how theres software development, web development, etc","score":2,"comments":[{"body":"Video game networking is a fascinating subject. It combines math (for prediction), security, computer networking (certainly helps to understand stuff like TCP vs UDP), clock sync problems, and more. It's a big area.\n\nI'd probably suggest grabbing a big book on the subject and skimming through it. There are lots. Maybe \"Development and Deployment of Multiplayer Online Games.\"\n\nFor me, when I got excited about it, I started by trying to write a tiny 2D spaceship game, from scratch, that used client side prediction and had 100ms of fake lag. It was very educational.\n\nA lot of modern game networking is very focused on how to do things with specific game engines. If you're going to be using Unity, you probably want to learn specifically Unity networking stuff unless you plan to go your own way and write custom networking whatnot. And game lobby providers are practically their own industry these days, so you can learn how to integrate with those or learn to write your own (or just don't and have users explicitly connect to each other).","score":2,"comments":[{"body":"Awesome thanks for the insight ill look into finding a book for that! Ill check out your recommendation","score":1,"comments":[{"body":"Without going all the way to \"big book\", I wrote a few articles about exactly this topic: https://gabrielgambetta.com/client-server-game-architecture.html","score":1,"comments":[]}]}]},{"body":"Networking?","score":1,"comments":[{"body":"Well shit, you got me there","score":1,"comments":[]}]},{"body":"I'd look source code of existing games, and read docs for engine.","score":1,"comments":[]}]},{"title":"How to implement recursion for a tree?","not_safe_for_work":false,"locked":false,"body":"Imagine there is a tree, where every node has a list of elements, except the leaf nodes (they have null instead), and I need to create a list that is a concatenation of all the lists of each child.\n\nFor example, if I have a tree like this:\n\n    Root [1,2,3]/\n    ├─ Leaf A [NONE]/\n    ├─ Child B [4,5,6]/\n    │  ├─ Child C [7,8]\n    │  │  ├─ Leaf D [NONE]\n    │  ├─ Leaf E [NONE]\n    │  ├─ Leaf F [NONE]\n    ├─ Child G [9,10,11]\n    │  ├─ Leaf H [NONE]\n\nI would like to get `[1,2,3,4,5,6,7,8,9,10,11]`.\n\nThis is what I have thought of so far:\n\n    //This is a pseudocode\n    \n    global_list = []\n    \n    def traverse_node(node):\n        if node.value is None: // Guard Clause for a leaf node\n            return\n        global_list.extend(node.value)\n        for child in node.children:\n            traverse_node(child)\n    \n    traverse_node(root)\n\nAs you can see, this is basically an accumulator pattern, where I have a global state of accumulating all the elements.\n\nIf I remove the global accumulator, I can think of this:\n\n    //This is a pseudocode\n    \n    def traverse_node(node, prev_list=None):\n        if prev_list is None:\n            prev_list = []\n    \n        if node.value is None:\n            return prev_list\n    \n        prev_list.extend(node.value)\n        for child in node.children:\n            prev_list.extend(traverse_node(child)\n    \n        return prev_list\n    \n    traverse_node(root)\n\nMy question is, which one is a better way of dealing with a problem like this? Having a global accumulator, or building the list by passing it back to its caller? Is there a third approach I am missing?","score":1,"comments":[{"body":"To all following commenters: please, do not bring up the old circlejerk \njokes/memes about recursion (\"Understanding recursion...\", \"This is \nrecursion...\", etc.). We've all heard them n+2 too many times.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/learnprogramming) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"In your second example, there's no point in making `prev_list` a parameter, since you're never passing anything other than the default value. It can just be a local variable initialized to `[]`.\n\nAside from that, I would expect the first one to be *slightly* more efficient because it makes fewer intermediate list copies, but it has the major downside of using mutable global state, which can easily lead to bugs. You can get the same performance advantage without the global variable by using a helper function:\n\n    def concatenate_lists(root):\n        result = []\n        traverse(root, result)\n        return result\n    \n    def traverse(node, result):\n        if node.value is not None:\n            result.extend(node.value)\n        for child in node.children:\n            traverse(child, result)\n\nOr, if you don't mind being a bit more \"clever\", you can do the same thing using a nested function instead of explicitly passing the result list as a parameter:\n\n    def concatenate_lists(root):\n        result = []\n        def traverse(node):\n            if node.value is not None:\n                result.extend(node.value)\n            for child in node.children:\n                traverse(child)\n        traverse(root)\n        return result\n    \nOr you could do the same thing with an object, with the result list being a (private) property. There are lots of pretty much equivalent ways to do it.","score":2,"comments":[]}]},{"title":"GameDevelopment: VSCode with something like lsd2,raylib or Unity","not_safe_for_work":false,"locked":false,"body":"I am a complete beginner, want to start learning tho. I know some basic c++ and have done easy tasks for university with it aswell. VSCode works for me but I had some issues setting up lsd2.\n\nI know Unity is a big thing for „indie“/newbie developer but I am scared it will be too overwhelming for me. \n\nWill unity make everything easier for me in the long run? ( so far I only thought about simple 2d games)","score":1,"comments":[{"body":"Yes, Unity probably will be the easiest option, it is rather beginner friendly and there is a plethora of learning material online.","score":2,"comments":[]}]},{"title":"Career for Web development degree","not_safe_for_work":false,"locked":false,"body":"Hi everyone,\n\nI will graduate at Community College with AAS/ Web development degree. But I’m not confident about finding a job without experiences, plus I’m also not confident about coding. I pretty like Java, python, or Linux but sometimes I have to look it up online to solve my assignments. Do you have any ideas for me to prepare before having interview or look for a job without experiences? \n\nThank you.","score":1,"comments":[{"body":"If you'd like to prepare for an interview, Leetcode problems would probably help, since many companies these days just pull straight from there. Knowledge of how to solve them will also help as the problems just require knowledge of important data structures like hashmaps, arrays, linked lists, trees, BFS, DFS, etc.\n\nIn addition, maybe try building out some websites using common frameworks? Many companies these days use libraries like React, Angular, Svelte, Solid, etc. so maybe try one of those in order to learn practical experience that you will likely use on the job?","score":2,"comments":[{"body":"Thank you so much","score":1,"comments":[]}]}]},{"title":"How can I separate plain text from a hyperlink while using concatenation in javascript?","not_safe_for_work":false,"locked":false,"body":"The goal for my assignment is to utilize loops and arrays to list city council members. The format being Ward 1 Cam Gordon, and so on. The issue I’m having is making Cam Gordon a hyperlink while having Ward 1 be plain text. I’ve tried everything I can think of and I can’t seem to separate the two. It just shows the line of text as one hyperlink.","score":1,"comments":[{"body":"The answer to this depends on how you're generating and formatting your output.\n\nIf you're generating HTML text, then you need to put the `&lt;a&gt;` and `&lt;/a&gt;` tags around only part of your output.\n\nIf you're creating DOM nodes, then you need to make separate calls to `createElement` and `createTextNode` and append them to the parent element one after the other.\n\nIf you can share your actual code, you'll probably get more useful suggestions.","score":1,"comments":[{"body":"Okay I’ll post a screenshot in a sec.","score":1,"comments":[{"body":"As explained in the [subreddit's guidelines](https://www.reddit.com/r/learnprogramming/wiki/index#wiki_formatting_code), please post your code as properly-formatted text instead of a screenshot.","score":1,"comments":[{"body":"[https://jsfiddle.net/#&amp;togetherjs=mqpMLOzMhF](https://jsfiddle.net/#&amp;togetherjs=mqpMLOzMhF)\n\n&amp;#x200B;\n\nany help is appreciated","score":1,"comments":[{"body":"Try using `console.log()` to print the HTML strings before you add them to the document, so that you can see exactly what's being generated. It looks to me like your quotes and &lt;&gt; brackets are incorrectly matched, so you're not correctly closing your `&lt;a&gt;` tag when you think you are.","score":1,"comments":[{"body":"Would you be willing to show me what you mean in the file?","score":1,"comments":[{"body":"    let myLink = '&lt;h1&gt;&lt;a href=\"' + urls[i] + '&gt;\"&lt;/a&gt;&lt;/h1&gt;';\n\nThe closing `&gt;` is inside the double quotes for the `href` attribute, so it doesn't actually mark the end of the opening tag. Instead you have one `a` element with an `href` attribute and then the junk `&lt;/a` *inside* the opening tag (which the browser ignores). Since there's no closing tag, the `&lt;a&gt;` element extends all the way to the end of the document.\n\nWhatever text you want to be linked should go *between* the opening `&lt;a&gt;` and closing `&lt;/a&gt;` tags, so you'll need to fix that too.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]}]}]}]},{"body":"If you don't mind my asking, why not just let the whole string be the hyperlink?","score":1,"comments":[{"body":"I would definitely do that but I have a feeling i’d lose points since the finished product should look like his example. He doesn’t have the wards as hyperlinks.","score":2,"comments":[{"body":"“His” being my professor","score":1,"comments":[]}]}]}]},{"title":"How to build a dependency","not_safe_for_work":false,"locked":false,"body":"So I believe I have pretty decent knowledge about writing code and building my own code but what always frustrated me is building third-party libraries.\n\nI am currently working in C++ on a small chess game I wrote a year ago to add computer mixer into it. I ran into a problem and thought it would be good to update my main dependency - Qt6. So I uninstalled it and then learned that I can't really install it cuts online installer due to region ban. Therefore I need to build it from source but I get multiple cmake and ninja errors every time even so it seems I followed guide in readme. And I don't get why for the C++ library I need to install things like Perl and Ruby, md4c etc.\n\nI'm interested if there are some general advices if how to get to build third-party libs? Or maybe even advices for Qt itself. I'm close to desperate now and think of moving the project to some more solid language like Go or Kotlin","score":7,"comments":[]},{"title":"Need help to covert this c++ code into x86 assembly language , any suggestion help would be appreciated","not_safe_for_work":false,"locked":false,"body":"\\#include &lt;iostream&gt;\n\nusing namespace std;\n\nvoid draw\\_v\\_pattern(int);\n\nint main()\n\n{\n\n\tdraw\\_v\\_pattern(13);\n\n\tsystem(\"PAUSE\");\n\n\treturn 0;\n\n}\n\nvoid draw\\_v\\_pattern(int rows)\n\n{\n\n\tint cols = 2\\*rows-1, mid\\_col = cols/2, curr\\_row, curr\\_col;\n\n\t// this for loop loops over the N-1 top rows of the V pattern\n\n\tfor (curr\\_row = 0; curr\\_row&lt;(rows - 1); curr\\_row++) \n\n\t{\n\n\t\t// this for loop prints all of the spaces before the first asterik for the row\n\n\t\tfor (curr\\_col = 0; curr\\_col&lt;curr\\_row; curr\\_col++)\n\n\t\t\tcout &lt;&lt; \" \";\n\n\t\t//print the first asterik for the row\n\n\t\tcout &lt;&lt; \"\\*\";\n\n\t\t// this for loop prints all of the spaces in between the two asterisks for the row\n\n\t\tfor (curr\\_col = curr\\_row + 1; curr\\_col&lt;(cols - curr\\_row - 1); curr\\_col++)\n\n\t\t\tcout &lt;&lt; \" \";\n\n\t\t//print the second asterik for the row, followed by a line return\n\n\t\tcout &lt;&lt; \"\\*\\\\n\";\n\n\t}\n\n\t// This for loop prints all of the spaces before the asterik on the bottom (final) row\n\n\tfor (curr\\_col = 0; curr\\_col&lt;mid\\_col; curr\\_col++) \n\n\t\tcout &lt;&lt; \" \";\n\n\t//print the final asterik, followed by a line return\n\n\tcout &lt;&lt; \"\\*\\\\n\";\n\n\tcout &lt;&lt; endl &lt;&lt; endl;\n\n}\n\n&amp;#x200B;\n\n**Assembly code :** \n\n; Program template\n\n&amp;#x200B;\n\n.386\n\n.model flat,stdcall\n\n.stack 4096\n\nExitProcess proto,dwExitCode:dword\n\nROWS = 11      ; this can be changed to any value between 2 - 16; the correct V pattern should be \"drawn\" in memory in all cases\n\nCOLS = 2\\*ROWS-1\n\nMID\\_COL = COLS/2\n\n.data\n\nV BYTE 32\\*ROWS dup (?) ; the memory allocated for the V pattern\n\ncurr\\_row BYTE ? ; this refers to the current row in the pattern being processed\n\n; count is used to refer to a row in memory, such as 0x00404000 (row 0), 0x00404020 (row 32), 0x00404040 (row 64), etc\n\n; You need to use count to move between the different rows in memory\n\n; HINT: think about incrementing or decrementing count by 32\n\ncount DWORD 32\\*(ROWS-1)   ; you can change the initial value depending on if you want it to count up or down\n\n&amp;#x200B;\n\n.code\n\nmain proc\n\n&amp;#x200B;\n\n; IMPLEMENT THIS\n\n; IMPLEMENT THIS\n\n; IMPLEMENT THIS\n\n; IMPLEMENT THIS\n\n; IMPLEMENT THIS\n\n&amp;#x200B;\n\n\t\n\n\tinvoke ExitProcess,0\n\nmain endp\n\nend main","score":0,"comments":[{"body":"This is the job of a compiler. You don't need any special tools, this is literally what a compiler was written to do.","score":3,"comments":[]},{"body":"Did you try running it through a compiler? That usually does the trick.","score":2,"comments":[{"body":"basically assembly code structure is given I have to write the code while equivalent to mentioned c++","score":1,"comments":[]}]},{"body":"[godbolt](https://godbolt.org/) can do this for you, if you don't want to muck around with compiler flags.","score":1,"comments":[]}]},{"title":"Code bootcamp","not_safe_for_work":false,"locked":false,"body":"I’m looking to enroll into an immersive boot camp. I’m in between momentum or tech elevator and am looking for advice or suggestions/ success stories etc.","score":0,"comments":[{"body":"Hey have you looked into the sub r/codingbootcamp? They have a semi-active community and history of posts you can browse through, including on ones like tech elevator [1](https://www.reddit.com/r/codingbootcamp/search/?q=tech%20elevator&amp;restrict_sr=1&amp;sr_nsfw=).","score":2,"comments":[{"body":"Thank you so much!!!!!","score":1,"comments":[{"body":"No prob! I know some of the more specific ones can be hard to find sometimes, just learned about r/ExperiencedDevs today for example. \n\nAs an alumnus from a bootcamp, I will say I typically recommend to ppl to self-teach (way cheaper and accomplishes same thing) if you have the discipline without enforced structure. In some bootcamps you end up self-teaching anyways and using external resources vs curriculum or resources gained via bootcamp. Could link some resources or you can prob see a few in the bootcamp sub or elsewhere in this r/learnprogramming one. Best of luck in whichever one you choose!","score":2,"comments":[{"body":"I appreciate your advice so much! I would love for you to link me resources!!","score":1,"comments":[{"body":"General advice for any self-taught dev is to focus on two things: learning through building projects and studying for future interview exams (DSA, leetcode, etc.). In order to apply to jobs, you'll need 3 portfolio projects on your resume and ideally a personal website (can even be a free, non-custom template website to show custom portfolio projects). You'll also need to be able to solve easy and medium level leetcode problems (tho this can depend on company and luck).\n\nFree online resources for self-teaching &amp; building developer projects:\n\n* [Developer roadmap](https://roadmap.sh/)\n* [The Odin Project](https://www.theodinproject.com/)\n* [Project based learning](https://github.com/practical-tutorials/project-based-learning)\n* [Build your own x](https://github.com/codecrafters-io/build-your-own-x)\n* [Awesome for beginners](https://github.com/MunGell/awesome-for-beginners)\n* [Free programming books](https://github.com/EbookFoundation/free-programming-books)\n\nExamples of people doing the above to get developer jobs: [1](https://www.reddit.com/r/learnprogramming/comments/yshl4i/comment/iw0cygz/?utm_source=share&amp;utm_medium=web2x&amp;context=3), [2](https://www.freecodecamp.org/news/inspirational-success-stories-from-self-taught-web-developers-4f6f375cf17d/), [3](https://jenniferdewalt.com/)\n\nIn terms of interview prep, I wouldn't worry about LeetCode or DSA for the first few months of self-teaching, but give yourself \\~3 months at least of near-daily 1-3hrs studying LeetCode and DSA to get into the swing of things. YouTube is a great source like [NeetCode's Blind-75](https://www.youtube.com/watch?v=KLlXCFG5TnA&amp;list=PLot-Xpze53ldVwtstag2TL4HQhAnC8ATf) interview problem walkthroughs. It isn't a situation where you spend months slowly building small to larger projects and finally make 3 fancy ones to put on your resume, then apply to jobs. You may not pass any interviews then. You'd need both these projects (3x impressive ones on resume) and the ability to solve completely separate, unrelated interview exams via problems seen on sites like LeetCode's easy to medium level. Hopefully that makes sense. I'd first start with The Odin Project then work your way through other resources as you'd want while balancing in LeetCode interview problems.","score":1,"comments":[{"body":"Thank you!! This is great advice!","score":1,"comments":[{"body":"You're welcome! Wish I'd known the above before I did a coding bootcamp (one of the most expensive R.I.P.) so like to help others prevent a similar situation when possible. Some may still prefer bootcamps if they have savings, safety net, ppl to support them financially etc. and need the structure and class friends. There's then cheap bootcamps that seem to have decent quality like Launch School or Nucamp. But I'd strongly recommend trying to get as far as possible solo because really everything you'd need for a junior dev job can be found online these days. And resources like The Odin Project have online social communities for informal classmates via Discord or Reddit if needed.","score":1,"comments":[]}]}]}]}]}]}]}]},{"title":"JavaScript problem","not_safe_for_work":false,"locked":false,"body":"Hello everyone,\n\n&amp;#x200B;\n\nI'm trying to learn JS but experiencing some problem for 2 or 3 days. When I write a variable in fuction JS doesn't running it but when i copy paste same code it is running. And this is driving me crazy.. \n\n&amp;#x200B;\n\nI've tried to download Node.js and tried make some changes from terminal. But got error about it and i didn't complete the installation. Also downloaded Pretier extension and add some shortcuts like for example when i typing cl VS Code automatically converts it to console.log() Is it the problem?\n\n&amp;#x200B;\n\nHere is the [link](https://codepen.io/mehmet-albayrak-the-encoder/pen/mdKXZEo?editors=1111) for my code.","score":1,"comments":[{"body":"VS Code has some shortcuts that will change what you type, but the important thing is if the resulting code matches what you intend or not. Do you have wrong code that VS Code won't let you correct or does the code look as you expect and just doesn't work?  Also, are you having any problem running your code on Codepen? I'm not sure how that link is relevant to the problem.","score":1,"comments":[{"body":"When i type arr.lenght, vs code doesnt correct lenght or “lenght” correction doesnt appear. Since i did this changes i am experiencing these issues. But strange in Codepen same problems happens to.. When i type same code it’s not running (even i copy it from vs code to codepen also) but when i copy it from instructor’s code (same code) it is running. This is really tragicomic situation lol","score":1,"comments":[{"body":"Codepen is very bad at checking errors and making suggestions.  Did you save your file in VS Code before typing that? It is very important to save the file at least once and have a proper extension of .js for javascript. VS Code decides how to interpret the code based on the file extension and not from looking at the code itself.  This is because VS Code supports many different programming languages and some of them have very similar syntax.","score":1,"comments":[{"body":"Yeah i checked all of things..But as i said, when i copy paste from instructor’s code it is running but when i type same code and log it to the console (console.log(‘…’ + str) only conclusion is “…”","score":1,"comments":[]}]}]}]},{"body":"In regard to the matter of nodejs. What do you get when you type \"node -v\" in the console? Do you get an error message or a version number? If you get an error message, then node is not installed properly.","score":1,"comments":[{"body":"I got error message.. but i dont remember exact message. I realize node.js didnt installed properly but my only concern is maybe i may broke something when i tried to complete installation","score":1,"comments":[{"body":"The only thing you can break by installing nodejs is a previous installation of nodejs.","score":1,"comments":[]}]}]}]},{"title":"Are there any part time coding or code related jobs you can get as an undergrad?","not_safe_for_work":false,"locked":false,"body":"I’m in a Bachelors computer science program and I was wondering if there were any part-time jobs I can start working to get while in school.\n(Just looking for some guidance)","score":1,"comments":[{"body":"Part-time internships ?","score":1,"comments":[]}]},{"title":"Help with ArrayList - Collections Framework JAVA","not_safe_for_work":false,"locked":false,"body":"This code is what I have so far \n\n* Create an ArrayList of 1000 random numbers\n* Start the StopWatch\n* Look for an Integer using the sequential search method\n* Report the amount of time taken\n* Sort the array (Collection framework sort)\n* Start the StopWatch\n* Look for an Integer using the sequential search method\n* Report the amount of time taken\n* Start the StopWatch\n* Look for an Integer using the Arrays binary search method\n* Report the amount of time taken\n\nimport java.util.ArrayList;\n\nimport java.util.Arrays;\n\npublic class SearchExample\n\n{\n\npublic static int seqSearch(int\\[\\] myArray, int target)\n\n{\n\nint index = -1;\n\nfor (int i = 0; i &lt; myArray.length; i++)\n\n{\n\nif (myArray\\[i\\] == target)\n\n{\n\nindex = 1;\n\n}\n\n}\n\nreturn index;\n\n}\n\npublic static void main(String\\[\\] args)\n\n{\n\nStopWatch sw = new StopWatch();\n\nArrayUtil star = new ArrayUtil();\n\nint\\[\\] cube = star.randomIntArray(1000, 10000);\n\nsw.start();\n\nseqSearch(cube, 3);\n\nsw.stop();\n\nSystem.out.println(\"Unsorted array - Amount of time taken: \" + sw.getElapsedTime());\n\nsw.reset();\n\nInsertionSorter sorter = new InsertionSorter();\n\nsorter.sort(cube);\n\nsw.start();\n\nseqSearch(cube, 3);\n\nsw.stop();\n\nSystem.out.println(\"Sorted array - Amount of time taken: \" + sw.getElapsedTime());\n\nsw.reset();\n\nsw.start();\n\nArrays.binarySearch(cube, 3);\n\nsw.stop();\n\nSystem.out.println(\"Binary search - Amount of time taken: \" + sw.getElapsedTime());\n\nsw.reset();\n\n//-------------------------------------------------------------------------------------------------------------------\n\ncube = star.randomIntArray(1000, 10000);\n\nArrayList&lt;Integer&gt; arr = new ArrayList&lt;&gt;(Arrays.asList());\n\nfor (int i = 0; i &lt; cube.length; i++)\n\n{\n\narr.add(cube\\[i\\]);\n\n}\n\nfor (int i = 0; i &lt; cube.length; i++)\n\n{\n\nif (a\\[i\\] == value)\n\n{\n\nreturn i;\n\n}\n\n}\n\nreturn -1;\n\nsw.start();\n\nseqSearch(cube, 4);\n\nsw.stop();\n\nSystem.out.println(\"Unsorted array list - Amount of time taken: \" + sw.getElapsedTime());\n\nsw.reset();\n\nsorter.sort(cube);\n\nsw.start();\n\nseqSearch(cube, 4);\n\nsw.stop();\n\nSystem.out.println(\"Sorted array list - Amount of time taken: \" + sw.getElapsedTime());\n\nsw.reset();\n\nsw.start();\n\nArrays.binarySearch(cube, 4);\n\nsw.stop();\n\nSystem.out.println(\"Binary array list search - Amount of time taken: \" + sw.getElapsedTime());\n\nsw.reset();\n\n}","score":0,"comments":[]},{"title":"Are there free courses online who are equivalent to a Computer Science degree?","not_safe_for_work":false,"locked":false,"body":"I see many courses on sites like [EdX](https://www.edx.org/), and I do wonder - Can you use those **free** courses to have the same knowledege (not including projects) as someone who have a first degree in Coumpter science?\n\n[or on MIT's site](https://ocw.mit.edu/search/?d=Electrical%20Engineering%20and%20Computer%20Science&amp;s=department_course_numbers.sort_coursenum)","score":1,"comments":[{"body":"Information these days is pretty much free. You can find any amount of knowledge on any topic to any depth for free online. \n\nThat's only part of what you get in a degree though. You'd miss out on practice, feedback, guidance, collaboration, networking, motivation... \n\nSo yes, you can find all the knowledge contained in a university degree online. But I wouldn't say that makes it equivalent to a degree.","score":3,"comments":[]},{"body":"Yes, definitely.\n\nIt won't be easy. It will take a lot of effort and time. \n\nLook at *OSSU Computer Science*.\n\n(and also at the **FAQ** here).","score":1,"comments":[]}]},{"title":"Black Friday/Cyber Monday deals?","not_safe_for_work":false,"locked":false,"body":"I know everything is everywhere for free, however I found a few resources I loved that I paid for.\n\nSome Udemy courses for math at $10, SoloLearn(very basic quick coding syntax intro I could do on mini breaks at work) for $6.  CourseraPlus.\n\nAnything you found you had enjoyed?  I was looking at DataCamp and 365DataScience, both have a year for \\~$100.  \nFor Azure certifications I tried Whizlabs, cloudacademy, cloudgurus etc.  I decided against them as I like the free MSLearn track.\n\n&amp;#x200B;\n\nIm interested in data science, math, maybe some IT certs etc.  Hacking/Pentesting things like Hackthebox to get into for the future.  As a paid course it should have graded exercises, quizzes, labs, practice tests etc otherwise Id watch free lectures on Youtube.  \nThank you","score":1,"comments":[]},{"title":"Tutorial H*LL","not_safe_for_work":false,"locked":false,"body":"As the title suggests, I am currently in tutorial hell. I was learning Python, and have some experience with data analysis, but have been showing a lot of interest in Web Development. I don't want to start over, but I also don't want to continue in something I don't really want. When it comes to Web Development, where's the best place to start, and/or should I stick with learning Python at this time?","score":0,"comments":[{"body":"I don't think you're in tutorial hell at all. When you repeat this process for the 4th or 5th time, that's when you're in tutorial hell\n\nStart some web development and see if you like it more than Python data analysis. The Odin Project is a good place to start","score":2,"comments":[{"body":"Ya, \"tutorial hell\" typically seems to mean when you haven't developed your ability to problem solve on your own, and rely on following tutorials to the letter to get anything done.","score":2,"comments":[]}]},{"body":"I think the best way to avoid tutorial hell is to pick a small, concrete project, something that tutorials don't directly cover, and make that. Make a website that does something that you'd like. Look up how to do things you need it to do to accomplish your goal.","score":1,"comments":[]}]},{"title":"Is Java or Python best suited for file management?","not_safe_for_work":false,"locked":false,"body":"With 'best suited', I mean with the shortest and most simple to read code.\nI'm thinking of cloud based file management using API","score":1,"comments":[{"body":"If it's going to be a web service solution, I'd say the answer is \"whichever you're most comfortable with\". If you're equally happy with either, then flip a coin.","score":7,"comments":[]},{"body":"The answer as always is \"it depends on context\". A Java dev is going to find Java more readable and vice-versa.\n\nIn the general case with no other constraints, Python is more \"batteries included\" and less verbose than Java, as well as having syntax closer to natural English.","score":6,"comments":[]},{"body":"If your criteria is \"shortest and most simple to read code\", it's pretty hard to beat Python.\n\nBoth would be great. Java can be really nice with a modern IDE, but it's going to result in 2x as much code to do the same thing.","score":3,"comments":[{"body":"More like 4x","score":2,"comments":[]}]}]},{"title":"Multiple Firefox instances selenium Python","not_safe_for_work":false,"locked":false,"body":"Title. I got two scripts and I need them to both open Firefox and run a similar script Simultaneously but it only allows me to have 1 open at at time\n\nEdit: headless Firefox","score":1,"comments":[{"body":"Is the issue that both are starting Firefox with the same profile maybe?\n\nYou can start Firefox with different profiles by pointing it to different profile directories:\n\n[https://docs.telemetry.mozilla.org/concepts/profile/profile\\_creation.html](https://docs.telemetry.mozilla.org/concepts/profile/profile_creation.html)\n\nFor example:\n\n    firefox --profile /tmp/p1\n    firefox --profile /tmp/p2","score":1,"comments":[]}]},{"title":"I installed Nginx and it wiped out my backend server?","not_safe_for_work":false,"locked":false,"body":"Im trying to create a backend endpoint server with a DigitalOcean virtual machine (droplet)\n\nI got a domain from Freenom, I set up the A and CNAME records, I could successfully navigate to:\n\n    http://reeeeee.tk/api/movies\n\nbut it was an unsecured connection and Postman couldn't connect to it. \n\n\nI read on here I could use Nginx to set up HTTPS, but once I installed it, it wiped out my whole site.\n\nNow it's just a Nginx welcome page:\n\nhttp://reeeeee.tk/\n\n-------------------------\n\nDid Nginx completely override my site or is it still there somewhere? With configuration of Nginx can I get my site back? Or do I have to restart from the beginning and get a new domain and set up dns records etc.","score":1,"comments":[{"body":"Why not just check if its there, you have access to the server so just check what is and isnt running. \n\nI suspect nginx is just using the port that whatever you were using to serve the website is using so figure out how to get the two to work together.","score":1,"comments":[]}]},{"title":"Does running a monolith in kubernetes make sence?","not_safe_for_work":false,"locked":false,"body":"I know it can be done. But should it be done?","score":1,"comments":[{"body":"Depends.\n\nBased on my stetson harrison guestimate about 80% of orgs who use kubernetes shouldn't really use it and the complexity outweights the benefits i'd maybe say no, but maybe you have a use case where it makes sense.","score":2,"comments":[]},{"body":"Yes. You can take advantage of autoscaling, rolling deployments, etc. And as you add other services, microservices, server less functions(Knative), you’ve already gone though the steps of having a k8s cluster running, so you set for future growth.","score":2,"comments":[]}]},{"title":"How do I use Netlify forms?","not_safe_for_work":false,"locked":false,"body":"I did everything in the docs but I keep getting an error when I try to deploy with the form - it tells me that something went wrong with the emails plug-in - I thought I don't need emails to be set up for forms to work?","score":0,"comments":[]},{"title":"I have trouble staying commiting to anything, including learning programming. Any tips on how to fix this?","not_safe_for_work":false,"locked":false,"body":"I came to a realization today and it really bugs me and makes me want to do better. That realization is that ever since after high school I've had trouble staying committed to ANYTHING.\n\nAfter high school I went to college and I spent four years there and I have nothing to show for it. I also had a scholarship to said college too. I never ended up getting anything done because I kept bouncing around majors.\n\nI've even had problems holding down jobs because of my issues with commiting to jobs, tasks, etc.\n\nThe common denominator that these things have is that I always hit some kind of a wall and just kind of give up. I just don't know how else to put it.\n\nSo obviously if you've read this far then perhaps you know where I'm going with this post. I've decided that I really want to learn programming because I enjoy it but also I think I can get a better job with said skills. Of course I keep on running into similar issues that I've had in the past. I keep on changing languages and I get bored of the projects. Or sometimes I'll want to bite off more than I can chew and then just end up back where I started.\n\nHow do I commit to learning programming more? So far I tried making things that I like and that I feel can be useful to me. Like focus tools and things like that.\n\nWhat I've tried: Udemy courses, YouTube tutorials, books, edX\n\nAny advice is appreciated. Thanks.","score":34,"comments":[{"body":"I used to have a similar problem when I was in college.\n\nDuring that time, while working in the field as an intern, I learned how to to organize software requirements using agile/scrum, and nail strict deadlines.\n\nI've found that applying similar rules to my personal projects and learning, I could focus on a handful of goals and use that kind of development process to help me focus my learning towards specific subjects.\n\nSo I suggest that instead of just following tutorials and hoping for the best, try outlining a simple app you want to build (web/mobile/desktop/etc).\n\n\\- Define the overall goal (\"I want to build a To Do List app\").\n\n\\- Outline some requirements (\"I want this app to let me add/edit/remove topics, sync with a remote database, etc\").\n\n\\- Break those requirements down in to simple do-able tasks (\"Task1: build a REST API that lets me perform CRUD operations on a database; Task 2: build a little proof-of-concept that let's me modify data through my API; Task 3: design the app UI; Task 4: hook stuff together; etc...\").\n\n\\- After you identify all the little pieces that make your app, give your self weekly/bi-weekly deadlines on completing these smaller tasks (\"I want to finish these 3 tasks by end of Friday\"). If you miss your self-given deadlines, take notes about why and what went wrong.\n\nPracticing this kind of self-discipline will trick your brain in to expecting smaller/simpler goals, rather than being overwhelmed by the grand picture. This will not only help you accomplish more things more often (brains love that), but it will force you to do research and figure out specific pieces of a complex problem (\"How do I write a simple REST API?\") (\"How do I make my code talk to this API?\") (\"How do I make the UI look nice?\") - this will snowball your learning.\n\nEmployers **love** it (at least the ones I've interviewed for) if a junior developer can show they already follow some kind of structured development process for their personal projects. It proves that you can be given a task and figure it out (mostly) for yourself.","score":46,"comments":[{"body":"This is an excellent suggestion. It is easy to set goals that are too difficult to achieve.","score":6,"comments":[]}]},{"body":"&gt;\tHow do I commit to learning programming more? \n\nRight when you're about to flit off to the next thing, don't.\n\nThere's no hack or trick to it. Not everything in life has a hack. Sometimes the way you walk the tightrope is one foot in front of the other and try not to fall off to either side. You're in control of all your choices so the trick to making better ones is to just make better ones.","score":13,"comments":[]},{"body":"If you say you’ve had trouble committing to anything/everything in life, is there any possibility that it’s a mental health diagnosis of sorts? I have ADHD &amp; depression, and when it’s gotten really bad, what you’ve described is what i start doing. Just a thought.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"From a book called Atomic Habits:\n- For good habits:\n\nMake it obvious\n\nMake it attractive \n\nMake it easy to do\n\nMake it satisfying \n\n- For bad habits:\n\nMake it invisible \n\nMake it unattractive\n\nMake it hard to do\n\nMake it unsatisfying.","score":3,"comments":[]},{"body":"improve discipline","score":2,"comments":[]},{"body":"I break my tasks into goals, nothing too big, and it helps me finish my projects. Often times I find that I try and surpass them.ince I reach them. When you look at the entire goal, sometimes it seems insurmountable.","score":2,"comments":[]},{"body":"See a therapist to help you with your problems, otherwise you’re going to fall into the same pattern. \n\nSomeone on Reddit may say something that works for you, you follow it for X amount of time, you fall off of the bandwagon. \n\nGo see a therapist 👍","score":2,"comments":[]},{"body":"I can relate with you , I just want you to understand this :\n\n1- You have accepted the problem and looking for solution, you are on the right track.\n2- Giving up is not at all bad, don’t feel bad about it. \n3- You don’t need to show or justify anything from past.Make it a rule of thumb, think about what you can do now to make things better and consistent.\n4- In context with programming, learn by implementing things , IMO it is the best way to keep on learning and expand your thinking around problem solving.\n5-All the resources you had mentioned which didn’t work out for you , I’d the same experience with them. For me it was , I don’t like to spoon feeding when it comes to learning.So, what I did was to reading small articles, official documentation for tech and begin interacting in common online tech group to share and grasp knowledge without losing interest.\n\nNote:\nIn college ,I was also awarded Scholarship and I was from non CS background and never involved in programming but later on learned java did my training for the role of tester learned Selenium and but gets developer role in a python project in job and learned that too.","score":2,"comments":[]},{"body":"Maybe you could do with a mentor","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Python GUI or C# GUI?","not_safe_for_work":false,"locked":false,"body":"I have made a python script that requires a GUI (nice looking one) what do yall recommend using for it?\n\nI could import the python scripts into C# or whatever so please feel free :D","score":18,"comments":[{"body":"I'm learning c# GUIs atm. Made an app using windows forms, which is pretty straightforward, only to find that on a tv or a big monitor it looks like a Picasso and there's no easy fix that I could find.\n\nSo now I'm learning wpf, which looks really nice, but is kind of a lot of work. It's worth it to me because I want to make desktop apps.","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Honestly you could probably learn html and css and create the graphic interface you want in your browser by the time you finish looking through and settling on a GUI option and start developing...","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Is html/css/js an option? Kind of what they were made for.","score":7,"comments":[{"body":"Right, you don’t need to ditch the python or C# backend. Most platforms support web views and there are many ways to get data in and out of them. Hell, even the Apple Store and Mac OS settings uses web views. Spotify, Slack, vs code, the visual parts of most browsers even.","score":4,"comments":[]},{"body":"Yeah I'm open to any options tbh, if use html and hold it online would that allow the process down? Or would it be the same as run directly from the desktop?","score":3,"comments":[{"body":"You don’t have to do it online or even through a browser. Discord’s desktop app for example is built with HTML/CSS/JS using the electron framework.","score":4,"comments":[{"body":"Awesome, Thank you \\^ \\_ \\^","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"Tkinter would be my recommendation if you want a desktop GUI quickly. Qt or GTK would work too but more effort. Depending on what exactly you're making, maybe it'd work better as a website? At this point there aren't any great ways to get python running in the browser though, so you'd need a server to run it (Python -&gt; WebAssembly is very WIP). Electron is an option but god do I hate that option.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What do you want to do with it? I think what you're doing with your python script would better dictate whether we use a Python GUI or a C# GUI.  Not all C# GUI toolkits are cross-platform, and maybe that's not a concern for you.  Maybe it's better to put it behind a web application. \n\nWithout more information, it's hard to advise.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I am assuming this is a stand alone application. Therefore I am going to recommend Python. Tkinter is part of the standard library, and there is an additional library that I use called ttkbootstrap that makes it more modern. I use auto-py-to-exe to make the executable, then create an installer and bam....done. Host that installer on releases in git or just hand it out.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I'm struggling with Ruby loops","not_safe_for_work":false,"locked":false,"body":"Here is my code:\n\n    def solution(sequence)\n        count = 0\n        sequence[1..sequence.length].each_with_index do |e, i|\n        #    puts sequence[i]\n            if (sequence[i] &lt;= sequence[i-1])\n                count +=1   \n            end\n        end\n        # puts count\n        if (count &gt; 1)\n            return false\n        else\n            return true\n        end\n    end\n\nIn my loop, I'm trying to say that I want `i` to begin from index 1 and end with (and include ) the index of the last element. \n\nIf my input is `[10, 1, 2, 3, 4, 5, 6, 1]` I want the loop to begin evaluating from 1, and also do a pass for index 7.\n\nThe comparison I'm trying to do is, starting from index 1, if the element in index i is smaller than the element before it, increment the counter. The first pass should be:\n\nsequence\\[i\\] = 1\n\nsequence\\[i-1\\] = 10\n\nAt the moment when I do `puts sequence[i]` , This is what it shows:\n\n    \n    \n    Console Output:\n                    10\n                    1\n                    2\n                    3\n                    4\n                    5\n                    6\n\nThis means the loop is starting from index 0 and ending before it evaluates index 7. Even if I do `sequence[1..sequence.length+1].each_with_index do |e, i|` the console output is the same. I would appreciate guidance on how I can rewrite my loop so it does the comparisons I want.","score":1,"comments":[{"body":"Well, for starters, it sounds like you don't really want to iterate over the values of sequence directly, you just want indexes. In that case, I wouldn't bother with `each_with_index`, just `for i in 1...sequence.length do` will do the trick just fine.\n\nAlso, two things that you'll need to remember:\n\n* An array's \"length\" is one more than the index of the last element. So if length is 10, you actually want to stop counting at 9.\n* In Ruby, \"..\" means a range \"including the last element\" and \"...\" means \"a range excluding the last element.\"\n\nPutting them together, if you want a range that starts at the first elememnt and goes to the last element of a sequence, you might use 0...sequence.length.\n\nOne thing worth warning you about with Ruby programmers, if you haven't noticed already, is that they tend to get into functional programming and code golf a little more heavily than is probably healthy, so there's a good chance when you go looking for example answers for problems like that, you'll probably see some nonsense like `sequence.each_cons(2).map{|a, b| a &lt; b }.all?`, which is fun and all, but it's really hard to read when you're learning, so don't worry if you run into that sort of mess and feel dumb.","score":2,"comments":[{"body":"you're right. I mostly run into 'code golf' when I read other people's solutions in Ruby. but thanks! your advice really helped","score":1,"comments":[]}]}]},{"title":"Please recommended any good course on Blockchain development","not_safe_for_work":false,"locked":false,"body":"I'm studying JavaScript right now because I have an interest in blockchain development. Anyone who has taken courses in blockchain development can help me out because I previously searched this question but am now totally confused.","score":0,"comments":[{"body":"On udemy look up Solidity courses","score":1,"comments":[]}]},{"title":"command line arguments in relation to a void function","not_safe_for_work":false,"locked":false,"body":"Hello,\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI need some quick help, the purpose of the code bellow is to open any txt files I give it and have it read the file, find my number and report it. \n\nI need to use command line arguments as I don't know the file names(its for school), the code below compiles  and it runs however it disregards the **fopen()**\n\nfor example if I type **./test sampleone.txt sample two. txt,** the code is executed, but it seems to skip over the **fopen()** all together, it goes right to **failed to open file**. The threading is also working fine, since it prints twice. \n\nMy professor said the command arguments need to be used in the **main()** function however I don't know how to do that and have them referenced in the **void \\*readfile** function without erroring out or simply not working, any ideas? he said it was simple, but I'm not getting it. \n\n    #include &lt;stdio.h&gt;\n    #include &lt;stdlib.h&gt;\n    #include &lt;pthread.h&gt;\n    #include &lt;unistd.h&gt;\n    #include &lt;string.h&gt;\n    #include &lt;sys/sysinfo.h&gt;\n    \n    \n    void *readfile ();\n    \n    int i;\n    int number_of_threads;\n    \n    int main ()\n    {\n    \tprintf(\"This system has %d processors configured and \"\"%d processors available.\\n\", get_nprocs_conf(), get_nprocs());\n    \tnumber_of_threads = get_nprocs();\n    \t\n    \tpthread_t *thread;\n    \tthread = malloc(number_of_threads * sizeof(pthread_t));\n    \tfor (i=0; i &lt; number_of_threads; i++)\n    \tpthread_create (&amp;thread[i], NULL, readfile, NULL);\n    \tfor (i=0; i &lt; number_of_threads; i++)\n    \tpthread_join (thread[i], NULL);\n    \t\n    \treturn 0;\n    \t\n    }\n    \n    \n    void *readfile (int argc, char *argv[] )\n    {\n    \n    \tint g;\n    \tFILE *fp;\n    \n    \n    \tfor ( g = 1; g &lt; argc; g++ ); \n    \n    \tfp = fopen(argv[g], \"r\");\n    \n    \tif (fp==NULL){\n    \t\tprintf(\"Failed to open a file\\n\");}\n    \telse {\n    \t\tconst char n[1] = \",\";\n    \t\tchar *token;\n    \t\tchar line [1024];\n    \t\twhile (fgets(line, 1024, fp)!=NULL){\n    \t\ttoken = strtok(line, \",\");\n    \t\t\tif (strcmp(token, \"13\")){\n    \t\t\t\tprintf(\"13 was found\\n\");}\n    \t\t\telse {\n    \t\t\t\tprintf(\"13 was not found in the selection\\n\");\n    \t\t\t\t}\n    \t\t\t}\n    \t\tfclose(fp);\n    \t\t}\n    \treturn 0;\n        }","score":0,"comments":[{"body":"[deleted]","score":1,"comments":[{"body":"Ah see I’m very new to this, I have a sql background but not programming, how would I pass main() arguments to my readfile?\n\nI tried changing the null, but then I run into even more errors, you’re referring to the thread aspect?","score":1,"comments":[{"body":"Sorry, I didn't see a reply or I wouldn't have deleted.  I did not notice any of the pthread stuff before, my reply was not relevant to your post.","score":1,"comments":[{"body":"Do you have any advice in passing the main() arguments to the readfile function I’ve never passed outside a function, and I’m getting errors when I do that.","score":1,"comments":[{"body":"There's a decent tutorial here: https://w3.cs.jmu.edu/kirkpams/OpenCSF/Books/csf/html/ThreadArgs.html\n\n`pthread_create`'s thread function has a specific signature that can only take a single parameter, which is the last parameter to the pthread_create function.  Right now you are passing in `NULL`.\n\nYou have to change your `readfile()` function to take a single parameter.  If you want to pass all the command line arguments on to your thread function, the canonical way to do this is to put argc and argv into a struct and pass that struct to `pthread_create`.\n\nYou do still have to change your main as I originally indicated, to `main(int argc, char *argv[])`\n\nETA: Simple answer from stackoverflow here: https://stackoverflow.com/questions/54876579/passing-argc-and-argv-to-a-thread-in-c","score":1,"comments":[]}]}]}]}]}]},{"title":"\"Corporate\" bootcamps","not_safe_for_work":false,"locked":false,"body":"Does anyone have recommendations for bootcamps that partner with companies to put their employees through the program? We're looking to help employees looking to transition to engineering.  \n\n\nI'm looking for something approximately 3 months, oriented towards beginners towards full stack web development.","score":0,"comments":[{"body":"My (insurance) company partners with Galvanize and has seen pretty good response","score":2,"comments":[]}]},{"title":"Best place to learn python that isn’t a video","not_safe_for_work":false,"locked":false,"body":"As the title suggests, I want to know what resources you’d recommend to learn python if you don’t want to use videos? Any recommendations?","score":1,"comments":[{"body":"Books from your local library.","score":2,"comments":[{"body":"I live in rural Ireland, public libraries here don’t even have algebra books, let alone cs books","score":1,"comments":[{"body":"Plenty of free online text tutorials available, check the FAQ.","score":1,"comments":[]}]}]},{"body":"Google \"How to Automate the Boring Stuff with Python\". It's a free ebook.","score":2,"comments":[]},{"body":"https://programming-22.mooc.fi/","score":1,"comments":[]},{"body":"I used solo learn to learn basics","score":1,"comments":[]},{"body":"They have the whole \"learning\" section \nhttps://www.python.org/about/gettingstarted/","score":1,"comments":[]}]},{"title":"Random (Shuffle) Touch .mp3 Code (C++) doesn't work correctly with Bare Conductive Touch Board","not_safe_for_work":false,"locked":false,"body":"Hello,  \nso for a project I am trying to create a dialog between two figures (3D printed), that every time someone touches the figure it plays a different dialog. For a while I have been searching for a method that can play at random,  let's say, 4 tracks every time the electrode are being touched. This [*Code from Github*](https://github.com/BareConductive/random-touch-mp3)  was the only decent Code I found. It does work, however, out of 4  tracks in thew folder it only plays 2 and the others are mute. I've been  looking for solutions, testing and so on but nothing worked. Does  anybody know how to fix this issue?\n\nNote; I'm using Arduino IDE version 1.8.19 (C++), has higher are not compatible with the [*Bare Conductive Touch Board*](https://www.bareconductive.com/collections/all/products/touch-board)\n\nThank you","score":0,"comments":[]},{"title":"Is \"Hello World\" a good start for begginers?","not_safe_for_work":false,"locked":false,"body":"I got to level 10, and now I am really excited with creating something from \"nothing\" at level 11. That seems really amusing.","score":0,"comments":[{"body":"What are you referring to? \"Hello World\" is an extremely broad, common term. Is this a course?","score":3,"comments":[{"body":"Yes, I am talking about the little course hello world you can easily find on google, not about the phrase.","score":1,"comments":[]}]},{"body":"If you think \"Hello World\" is amusing at level 10, counting spaces too, wait till you get to level 14 at \"Stack Overflow\"","score":1,"comments":[]},{"body":"The theory behind teaching Hello World is that it is one of the simplest projects to code that does something. It is possible to code something even simpler, but it won't do anything at all. The problem with that is you can't be sure if you did it correctly if it's not supposed to do anything. Mistakes in coding don't always generate error messages. They sometimes just don't produce any output.  Starting with Hello World lets you practice working with the simplest possible code that gives you feedback to let you know that you did it right.","score":1,"comments":[]}]},{"title":"DSA in Python","not_safe_for_work":false,"locked":false,"body":" Suggest some good DSA Python playlists, online courses, etc.","score":1,"comments":[{"body":"Tim Roughgarden's Algorithms MOOC isn't a bad place to start, though I haven't checked it out recently.\n\nIt's language-agnostic. You can solve the problems with Python if you want.","score":1,"comments":[]},{"body":"Best online text I know of: \n\n[https://runestone.academy/ns/books/published/pythonds/index.html](https://runestone.academy/ns/books/published/pythonds/index.html)","score":1,"comments":[]}]},{"title":"What does the \"-vv\" flag do in the command \"git branch -vv\"?","not_safe_for_work":false,"locked":false,"body":"I've learned that a single-character flag that is preceded by one dash is called a shorthand. There is usually a corresponding multi-character longhand (which usually begins with the same letter) preceded by double dash. Also, multiple shorthand flags can be joined together so `-xyz` is equivalent to `-x -y -z`.\n\nSo can I understand `-vv` as `-v -v` ? If, let's say, `-v` is short for `--verbose`, why the need for repeating the arguments?\n\nBy the way, as I'm extremely unfamiliar to Linux and command line interface, I've been looking for materials on these things. Sadly, there doesn't seem to be a comprehensive, updated and definitive guide to using Linux, bash, CLI, etc. But there should be some conventions for command line programming right? Can someone share some beginner-friendly resources? Thanks.","score":0,"comments":[{"body":"It appears to be an alias for the same thing:\n\n&gt;**-v -vv --verbose** When in list mode, show sha1 and commit subject line for each head, along with relationship to upstream branch (if any). If given twice, print the path of the linked worktree (if any) and the name of the upstream branch, as well (see also git remote show &lt;remote&gt;). Note that the current worktree’s HEAD will not have its path printed (it will always be your current directory).\n\nhttps://git-scm.com/docs/git-branch","score":2,"comments":[]},{"body":"Usually more `v` means more verbosity.  If `-v` is verbose `-vv` is extra-verbose.  Some other commands also do this, I think `tar` comes to mind.  But the only thing to do is to read the docs to know for sure.","score":1,"comments":[]},{"body":"As others pointed out, `-vv` does the same thing as `-v` according to the docs.\n\nThis doesn't quite seem to match the usual command line options convention (https://nullprogram.com/blog/2020/08/01/), and one might wonder why a `-vv` flag was added if it's literally redundant with `-v`. But here, we see that no program (including git) is required to abide by these conventions/guidelines.\n\nIt is true that some other programs have adopted this additional convention where every `v` adds additional verbosity (https://stackoverflow.com/questions/24402473/what-is-meaning-of-vvv-option-in-curl-request).","score":1,"comments":[]}]},{"title":"How to print a row of an sqlite3 database in tkinter based on user input","not_safe_for_work":false,"locked":false,"body":"Hello everyone,\nI have an sqlite3 database called Techcheck, it has 3 components called Id, service and price. The id is also the primary key. The treeview also has the same 3 headings. What I want is to print the values of the primary key inserted by the user in an entrybox into the treeview. I have tried to code it myself using fetchone but it was not sucessfull and tried looking it up online but I can't find an answer. Can someone help me?\nThanks in advance...","score":1,"comments":[{"body":"Getting good at programming is getting good at breaking down problems. What you've asked here is many different problems all mashed together. You aren't going to find a direct answer because that would be like asking \"how do I build a house that has bricks?\" There's no real point in answering that question because you probably don't want an exhaustive answer to that.\n\nBreak the problem down.\n\n\"How to print\": you can probably find the answer to this question by googling \"[language] print text\"\n\n\"From a sqlite3 database\": you can probably find useful information by googling \"how to query sqlite3 database [language]\"\n\nYou can probably find how to do stuff with the results of your query at the same links from the previous search, but if not, you can probably Google yourself up some more relevant stuff.\n\nIf you have a specific question, feel free to ask it, but with a question this vague, we don't know what you're struggling with or what you need help with.","score":1,"comments":[{"body":"Sorry if the question is vague, I can't word it better haha\n\nI already tried to break down the problem, and I still can't find a solution. \n\nWhat I would like is that the in the entry widget gets inserted the primary key, and in the press of the button next to it, it displays the values of that primary key to be displayed on the Treeview. \n\nWhat I have found pretty much everywhere is only how to display all of the database records on the treeview.","score":1,"comments":[{"body":"This is still a very high level and vague question. Which part of that are you struggling with?","score":1,"comments":[{"body":"I'm struggling in creating the function to insert the values of the primary key in the database (in this case given by the user input) in the treeview. For example if the user were to type and press the button \"add to treeview\" with 101 in the entry box, in the treeview i would like to insert the values of 101 in the treeview. ID 101, service \"Diagnóstico\" and price 0.00","score":1,"comments":[{"body":"Okay, which part of that is giving you trouble? You just rattled off like 5 different things. Take them one at a time","score":1,"comments":[{"body":"Ok maybe I'm wording it badly, sorry.\nI'm struggling with fetching the primary key, and inserting the values in the treeview.","score":1,"comments":[{"body":"Okay great, now you've narrowed it down to two things. Have you tried googling those two things?","score":1,"comments":[{"body":"Yes sir, I have. All that shows up is how to use fetchall to print all of the database. Maybe I'm searching with the wrong words?","score":1,"comments":[{"body":"Not a man\n\nWhat do you mean by \"fetch the primary key\"? Do you mean fetch a particular record given its key? Or \"fetch all records and show their keys\"?","score":2,"comments":[{"body":"Yeah No sir is an expression in my country haha\n\nFetch a particular record given its key so I can print it's values in my Treeview","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]}]}]}]}]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Help with arrays, lists etc in Java","not_safe_for_work":false,"locked":false,"body":"I have a great book for learning Java, Dietel How to Program which is great except the Arrays chapter. There is a huge jump in the level of difficulty in the exercises at the end of the chapter. I also use it with the help of Udemy.\n\nCan anyone recommend a good book, resource, website for arrays? With a natural progression in difficulty. I've went through a third of the book and I've had no issues so far except this chapter. It jumps into coding for chess games with arrays for moving the Knight around the board touching each square. \n\nI don't have a clue, thank you if you can help!","score":3,"comments":[{"body":"Go through the MOOC [Java Programming](https://java-programming.mooc.fi) from the University of Helsinki.\n\nYet, you should *specify your actual problems* with these data structures. Just saying \"the book is not good and jumps in difficulty\" doesn't mean anything. \n\nThis lack of context shows in the replies you are getting. People here are trying to explain arrays to you since you haven't specified your actual problems. \"is a bit crazy\" is another meaningless statement.\n\nDemonstrate your *real* problems, explain what you do and don't understand and you will get help.\n\nSo far, people have gone great lengths to help you, while you only gave snarky replies instead of elaborating.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Type 'Java array' in to google and press for example w3school or whatever other result that comes up. See if you get it in these simpler examples.","score":6,"comments":[]},{"body":"[https://neetcode.io/](https://neetcode.io/)\n\nIt's a curated list of java puzzles. For arrays they have 9 puzzles and they've ordered them in levels of complexity.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You're not going to find a book only on Arrays. You could try to get another intro to Java book that has a chapter on Arrays if you need something explained differently. \n\nBut being that you're struggling with a simple concept, I'm pretty sure that if you actually asked your specific question instead of being rude to people trying to help you out, you'd already be in a good place to move on with your education. But it's up to you I guess","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Arrays are a foundational data structure and not overly complicated so I don’t think such a book exists that will be what you’re looking for. If the chapter you’re working through seems confusing or to be making a big jump, that usually indicates that something that came before hand seemed like you understood it but you maybe need a bit more practice or understanding before forging ahead again. \n\nMy advice would be to stick with what you have and just slow down or back up a little. There will be many times on your programming learning journey where it feels like you hit a wall and need a new reference when actually you just need to keep at it for a bit. There will be periods of rapid and easy learning followed by periods of being stuck and stumped. That’s all part of the learning process and honestly it also is representative of what daily work flows can be like. On the job you’re not going to know enough for every task you’re assigned and you’ll have to develop the ability to push through and figure stuff out in less than ideal circumstances. So this arrays chapter is the perfect time to start developing that ability to learn through doing and through googling to fill in the knowledge gaps. \n\nSome of the best ways to get “unstuck” are to Google for examples that are similar to what you are stuck on. Look at how others have implemented solutions and then paste those into your IDE and break it in as many ways as you can to see what happens. That’s how you learn what each part of their code is actually doing and will thus help you better understand the function and purpose of each implementation. Then you apply that understanding to your own solution. \n\nGood luck!","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I would reccomend doing CodeWars problems with the tags arrays","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"An array is quite a simple data structure - just a bunch of object standing in line. There must have been some kind of misunderstanding on your part that caused you to perceive it as a jump in difficulty. Make sure you find that misunderstanding.","score":3,"comments":[{"body":"I know what it is, I find the other chapters I have done fine but that chapter is a bit crazy to me","score":1,"comments":[{"body":"\"A bit crazy\" is very vague. If you don't focus on specifics you can't solve your problem.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"It is not really clear what your problem with the book is. Textbooks usually require some real work to be done between reading the chapter and solving the exercises and most of the time someone came to me when I was a tutor years ago and said \"the exercises are too difficult\", they actually did not understand the chapter because they didn't do any work beyond just reading superficially.\n\n&gt;It jumps into coding for chess games with arrays for moving the Knight around the board touching each square.\n\nThat was our go-to example for arrays too back when I started together with the 8 queen problem. Shouldn't be that difficult","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I want to create a calculator","not_safe_for_work":false,"locked":false,"body":"\nCalculator \n\nPrice ÷ Packs + \n(Options choice) 40%, 60% =\n\nCan someone help with creating this code","score":0,"comments":[{"body":"You would need to tell us what OS this runs under and what language you are trying to write in. On linux I did mine in bash and bc.","score":2,"comments":[]}]},{"title":"Mid-level remote devs, what’s your workload like?","not_safe_for_work":false,"locked":false,"body":"I’m okay with the workload that my current company is providing, but the management seems very misdirected and I’m not comfortable with our new pay structure.\n\nI want to switch companies to get a raise, and hopefully find a company that still cares about fostering growth as well. (I don’t want to be a frontend developer forever.) \n\nI just worry that the workload of a new company might outpace me, and leave me drowning with a burnt bridge behind me. I’ve never really job-hopped by choice in this space.  \n\nWhat’s the workload like for you? Do my concerns sound familiar, or are these anxieties mostly unfounded?","score":1,"comments":[{"body":"Your last question is impossible to answer.\n\nHow do you want I describe my workload?","score":1,"comments":[]},{"body":"I don't think there's a one-size-fits-all answer here. Workload differs more by company than by level of expertise. So a mid-level dev in company A might work 30 hours a week in company A, but a similar dev in company B works 60.","score":1,"comments":[]}]},{"title":"Can someone explain this to me?","not_safe_for_work":false,"locked":false,"body":" Hi,\n\nI followed a course for react and he used this syntax:\n\n`selectedProfessor: Professor | undefined = undefined;`\n\nCan someone explain what's going on here? I know that the variable ***selectedProfessor*** is gonna be a type of ***Professor***. But I don't understand the part from ***|*** to end. What does  | mean and why should we initialize it as ***undefined***, why can't we just leave only `selectedProfessor: Professor`","score":0,"comments":[{"body":"It means that selectedProfessor can either be a Professor or undefined. Then it sets the value to undefined. I'm assuming a bit here, but lets say that you open whatever app this is and haven't selected a professor yet. At that point selectedProfessor is undefined.","score":2,"comments":[{"body":"Thank you for the explanation, it makes sense now.","score":1,"comments":[]}]},{"body":"It means `selectedProfessor` can either be of type `Professor` or `undefined`. And then it's initialized to `undefined` explicitly.\n\n&gt; why can't we just leave only selectedProfessor: Professor\n\nBecause there might not be a `selectedProfessor`. \n\nIf you don't tell the compiler that `selectedProfessor` can possibly be `undefined`, it'll complain if you try to use `selectedProfessor` before assigning to it.","score":2,"comments":[{"body":"Thanks for this such well explained comment, I understand it now.","score":2,"comments":[{"body":"No problem!","score":1,"comments":[]}]}]}]},{"title":"Why am I getting a syntax error for this comparison operator (Ruby)?","not_safe_for_work":false,"locked":false,"body":"this is my code:\n\n    def solution(sequence)\n        count = 0\n        sequence.each_with_index do |e, i|\n            if (sequence[i+1] &lt;= sequence[i])\n              count +=1\n            end\n        end\n        puts count\n        if (count &gt; 1)\n            return false\n        else\n            return true\n        end\n    end\n\nI'm getting this error when I run `solution([1, 3, 2, 1])`:\n\n     bundle exec ruby main.rb\n    Traceback (most recent call last):\n        4: from main.rb:16:in `&lt;main&gt;'\n        3: from main.rb:3:in `solution'\n        2: from main.rb:3:in `each_with_index'\n        1: from main.rb:3:in `each'\n    main.rb:4:in `block in solution': undefined method `&lt;=' for nil:NilClass (NoMethodError)\n    exit status 1\n\nwhat's wrong with me doing `sequence[i+1] &lt;= sequence[I]` ? I don't know what else I can do to make this error go away","score":0,"comments":[{"body":"It's not a syntax error, it's a runtime error.\n\nThe problem is `sequence[i+1]` is returning `nil`\nOperators in Ruby are defined as methods, and the Nil class doesn't define that method so it fails.\n\nMy ruby is a bit rusty, but it looks like you're iterating over sequence and comparing each value to the next value in the sequence, but when you get to the last value, you're trying to get the value after that (e.g. the 11th value in a 10 value sequence) which is nil which then causes this error.","score":2,"comments":[{"body":"thanks! I refactored to this:\n\n    def solution(sequence)\n    count = 0\n    sequence[1..sequence.length].each_with_index do |e, i|\n        if (sequence[i] &lt;= sequence[i-1])\n        count +=1\n        end\n    end\n    puts count\n    if (count &gt; 1)\n        return false\n    else\n        return true\n    end\nend","score":2,"comments":[]}]},{"body":"&gt; undefined method `&lt;=' for nil:NilClass \n\nDo you understand what that error is telling you?","score":1,"comments":[{"body":"I mean obviously op is asking for assistance understanding it","score":1,"comments":[{"body":"The point is to lead OP to the important part of the error and get them to read and understand it.","score":1,"comments":[]}]}]}]},{"title":"Middleware or Native Code","not_safe_for_work":false,"locked":false,"body":"Would it be easier to make middleware for a Apple devices or make an app to run on Apple devices?\n\nEither way the program will be utilizing the actual hardware to its full potential.","score":1,"comments":[{"body":"I guess that depends on the concrete context, but if you want the best hardware utilisation, you're probably best off using native.","score":2,"comments":[]}]},{"title":"Java help: loop not looping","not_safe_for_work":false,"locked":false,"body":"I'm pretty sure I've already found this before, but I have no memory of how I fixed it\n\nThe code is supposed to calculate an average, then ask if i want to calculate another, but the loop doesn't loop when i tell it to\n\n&amp;#x200B;\n\nThis is the code:\n\n    import java.util.Scanner;  // Needed for the Scanner class\n    \n    public class CCAWhile\n    {\n      public static void main(String[] args)\n      {\n          // Create a Scanner object to read input.\n          Scanner keyboard = new Scanner(System.in);\n          \n          String name, repeat;\n          double first, second, third, fourth, average;\n          \n          repeat = \"\";\n          \n          do\n          {\n             System.out.println(\"Input the student's name\");\n             name = keyboard.nextLine();\n             \n             System.out.println(\"What was \"+name+\"'s grade on the first assigment\");\n             first = keyboard.nextDouble();\n             \n             System.out.println(\"What was \"+name+\"'s grade on the second assigment\");\n             second = keyboard.nextDouble();\n             \n             System.out.println(\"What was \"+name+\"'s grade on the third assigment\");\n             third = keyboard.nextDouble();\n             \n             System.out.println(\"What was \"+name+\"'s grade on the final assigment\");\n             fourth = keyboard.nextDouble();\n             \n             keyboard.nextLine();\n             \n             average = (first+second+third+fourth)/4;\n             \n             System.out.println(name+\"'s average in the course is \"+average);\n             System.out.println(\"would you like avaluate another student? input y for yes and n for no\");\n             repeat = keyboard.nextLine();\n                      \n          } while(repeat == \"y\");       \n      }\n    }\n\nThis is what it outputs\n\n    \n     ----jGRASP exec: java CCAWhile\n    Input the student's name\n    Dida\n    What was Dida's grade on the first assigment\n    93\n    What was Dida's grade on the second assigment\n    87\n    What was Dida's grade on the third assigment\n    91\n    What was Dida's grade on the final assigment\n    95\n    Dida's average in the course is 91.5\n    would you like avaluate another student? input y for yes and n for no\n    y\n    \n     ----jGRASP: operation complete.","score":0,"comments":[{"body":"**FAQ** -&gt; [**Java FAQ**](http://www.reddit.com/r/learnprogramming/wiki/faq_java) -&gt; [**My string comparison doesn't work.**](https://www.reddit.com/r/learnprogramming/wiki/faq_java#wiki_my_string_comparison_doesn.27t_work.)\n\n`String` is not a *primitive* data type in Java (like `int`, `char`, `double`, etc.). This is indicated by the capital first letter (classes in Java use PascalCase). Hence, comparison with `==` compares *references* - or *object identity*, not *content identity*.\n\nIn order to properly compare `String` values, use `.equals` or `.equalsIgnoreCase`.\n\nFor sure, this is mentioned somewhere in your course/textbook.","score":7,"comments":[]},{"body":"use the .equals(\"y\")\n\ninstead of == \"y\"\n\n?","score":3,"comments":[{"body":"Probably this, when comparing strings, since it is technically an object (I think) u need and equals, but string class has one implemented","score":1,"comments":[]}]},{"body":"It's because == has weird behavior when comparing objects. It works by comparing the values of the variables, which for primitives is what you expect. But for object types (edit: like Strings), the variable's value is a memory address to the object. \n\nThat means, when you do  repeat == \"y\", it is actually comparing the locations those strings are kept at, not the strings themselves. (edit: Java will often try to save memory by using preexisting Strings where it can, so sometimes == will appear to work, but it is not guaranteed)\n\nFor objects, you would use the .equals(...)  method (so repeat.equals(\"y\"))","score":1,"comments":[]},{"body":"Should do a while loop instead of a do-while when using comparison case with a terminating sentinel value. This should be while it is NOT equal to sentinel value. It's important to know how a loop is going to run before we begin running it, that way when we read the executed code we aren't having to look back up to read/understand it.\n\nSo  \nwhile(!variable.equalstoignorecase(sentinel)){\n\n}","score":0,"comments":[]}]},{"title":"Just a question.","not_safe_for_work":false,"locked":false,"body":"how do people make animations in kali linux of the tools?","score":0,"comments":[{"body":"https://www.wikihow.com/images/thumb/7/70/Come-up-With-a-Good-Title-Step-4-Version-5.jpg/aid1179318-v4-728px-Come-up-With-a-Good-Title-Step-4-Version-5.jpg\n\nhttps://www.autogeekonline.net/forum/tips-techniques-and-how-to-articles-for-interacting-on-discussion-forums/20306-how-write-good-title-your-thread.html\n\nhttps://www.toytowngermany.com/wiki/Forum_topic_titles","score":3,"comments":[]}]},{"title":"What is binary package, where do they often get used, what are some examples, how should we think of them? How do they differ from \"packages\"?","not_safe_for_work":false,"locked":false,"body":"I ran into this:\n\n&gt; That's why we have a step three where we going to package our app in docker. You can create a container that includes the Node.js binaries and your Node.js project. Rather than creating a zip, a jar or tgz package, you package a binary that includes all binaries and dependencies. You're going to package the libraries the Node.js binary and all the libraries and binaries of the operating system itself.\n\nI ran into this in google search:\n\n&gt; A binary file is one that does not contain text. It is used to store data in the form of bytes, which are typically interpreted as something other than textual characters. These files usually contain instructions in their headers to determine how to read the data stored in them.\n\nIt does seem straight forward.  So I can think of it the node.js binary as a file where the code/program is already built or compiled, and ready for immediate use by the the hardware?\n\nAs for the package versus binary, I saw this:\n\n&gt; Source package include a tarball of the application's source code, and instructions on building it. When you install the package, it builds and compiles everything on-site, then installs. Binary packages have everything already built, and installing the package just takes everything out of it.\n\nSo it looks like a package takes more work and it is not ready to use, but needs to be compiled, and then installs.  Binary is on the other had already compiled and ready to use.\n\nI don't know that I'll be able to consistently regurgitate this all, without some regular review and usage, so if anyone notes any mistakes in my understanding or thinks of it in even simpler terms, definitely welcome some thoughts and understanding.","score":1,"comments":[{"body":"No you pretty much have it. \n\n\\&gt; So I can think of it the node.js binary as a file where the code/program  \n is already built or compiled, and ready for immediate use by the the   \nhardware?\n\n&gt;So I can think of it the node.js binary as a file where the code/program  \n is already built or compiled, and ready for immediate use by the the   \nhardware?\n\nYes.\n\n&gt;So it looks like a package takes more work and it is not ready to use,   \nbut needs to be compiled, and then installs.  Binary is on the other had  \n already compiled and ready to use.\n\nYes.\n\nOne thing to think about is that computers are electrical circuits at the heart of it, and they're limited to operating on 1's and 0's. A binary is just this, a long file of 1's and 0's arranged in such a way that your cpu can use it. CPU's are also built in many different ways so they need their 1's and 0's arranged in slightly different ways. Binaries are often hardware dependent because of this.\n\nHumans don't do well with 1's and 0's so we write our code in a human readable format and we've made special software to translate it to the binary that machines understand (compilers).","score":2,"comments":[{"body":"&gt; CPU's are also built in many different ways so they need their 1's and 0's arranged in slightly different ways. Binaries are often hardware dependent because of this.\n\nah ha, so that's why you might have a binary available for download on a mac, another for windows, another for linux, etc. \n\nthank you!","score":1,"comments":[{"body":"Not exactly. Linux, Mac, and Windows are actually operating systems, not hardware. Operating systems are pieces of software that directly interact with hardware to provide functionality to higher level software. Its a layer of software between the hardware and application software like a video game for example. \n\nA better example is if you go to download a windows installer, you need to select between a 32bit and 64 version depending on your underlying hardware.","score":1,"comments":[{"body":"&gt;  Its a layer of software between the hardware and application software like a video game for example.\n\nlike \"middleware\", or is that customarily a term reserved for non-OS software?\n\ndid we mean to say that the same cpu chip could be installed on a windows or a mac or linux machine, at least hypothetically. So it's not necessarily OS but specifically the chip?\n\n&gt; you need to select between a 32bit and 64 version depending on your underlying hardware\n\nThis is another area that's a knowledge gap for me that I need to fill","score":1,"comments":[{"body":"I wouldn't call the OS middleware. Middleware is a bit of a vague term used for a few different things, but for the most part its software that adds additional functionality *on top of*  the OS. The point of it is so that your application code can call the middleware which does some complex functionality using the OS for you.\n\n&gt;So it's not necessarily OS but specifically the chip?\n\nYes, but the chip is not the only consideration when compiling or writing code. The OS and rest of the hardware also play a part.\n\nDon't worry about not knowing everything. It takes a long time to learn even the basics.","score":1,"comments":[]}]}]}]}]}]},{"title":"Why do I get a key error when I add in the plotting?","not_safe_for_work":false,"locked":false,"body":"I am trying to convert a CSV file to SQL then plot the data in a bar graph for the \"place\\_name\":\n\n \n\n    import sqlite3\n    import pandas as pd  \n    conn = sqlite3.connect(\"datacamp_python.db\") \n    data = pd.read_csv(\"coffee.csv\")  \n    data.to_sql('coffee', conn, if_exists='replace')  \n    data_sql_1 = pd.read_sql(\"\"\"select place_name from coffee\"\"\", conn)  data_sql_1.plot(y=\"place_name\",kind=\"bar\")\n\nWithout last line (instead printing data\\_sql\\_1) it successfully displays, but when I add in the plotting, it returns an error:\n\n \n\n    KeyError                                  Traceback (most recent call last) Input In [33], in &lt;cell line: 19&gt;()       \n        8 data.to_sql(       \n        9 'coffee',         \n        10                         conn,      \n        11                         if_exists='replace' \n        12 )      \n        14 data_sql_1 = pd.read_sql(\"\"\"      \n        15                         select place_name from coffee      \n        16                         \"\"\",\n        17 conn) \n    ---&gt; 19 data_sql_1.plot(y=\"place_name\",kind=\"bar\")  \n    \n    File /usr/local/lib/python3.8/dist-packages/pandas/plotting/_core.py:958, in PlotAccessor.__call__(self, *args, **kwargs)     955             pass           \n        957 # don't overwrite \n    --&gt; 958 data = data[y].copy()     \n        960 if isinstance(data, ABCSeries):     \n        961     label_name = label_kw or y  \n    \n    File /usr/local/lib/python3.8/dist-packages/pandas/core/frame.py:3505, in DataFrame.__getitem__(self, key)    \n        3503 if self.columns.nlevels &gt; 1:    \n        3504 return self._getitem_multilevel(key) \n     -&gt; 3505 indexer = self.columns.get_loc(key)    \n        3506 if is_integer(indexer):    \n        3507     indexer = [indexer]  \n    \n    File /usr/local/lib/python3.8/dist-packages/pandas/core/indexes/base.py:3623, in Index.get_loc(self, key, method, tolerance)    \n        3621 return self._engine.get_loc(casted_key)    3622 except KeyError as err: \n     -&gt; 3623     raise KeyError(key) from err    3624 except TypeError:    \n        3625 # If we have a listlike key, _check_indexing_error will raise 3626 #                        InvalidIndexError. Otherwise we fall through and re-raise 3627 #  the TypeError. \n        3628 self._check_indexing_error(key)  \n    \n    KeyError: 'place_name'","score":1,"comments":[{"body":"One error you may encounter when using pandas is: KeyError: 'column\\_name' This error occurs when you attempt to access some column in a pandas DataFrame that does not exist.\n\nTypically this error occurs when you simply misspell a column names or include an accidental space before or after the column name.\n\nCan you share the header of the CSV file?","score":1,"comments":[{"body":"like the file itself or please define what you mean by header of the csv file? still new to this sorry.","score":1,"comments":[]},{"body":"NVm this actually allowed me to figure this out. I completely forgot about using caps in that, I did not realize I needed to for that as you dont need to in the sql query.","score":1,"comments":[]}]}]},{"title":"Wanted a change of fields, so picked up programming out of sheer interest.","not_safe_for_work":false,"locked":false,"body":"Currently enrolled in codecademy's course that gives you a basic rundown of how coding and programming works. Not giving myself a deadline to complete the course and neither am I taking it lightly either.\nAny advice for a newbie like on the do's and dont's of this journey? \nAnd are there any other courses I should look at after (paid or free)?","score":0,"comments":[{"body":"Did you check the faq?","score":3,"comments":[]}]},{"title":"How do I get the char at a given index in a .txt file in C++?","not_safe_for_work":false,"locked":false,"body":"Like how you'd get the char at a given index in a string using string\\[x\\], but for .txt files","score":1,"comments":[{"body":"A text file is not exactly an array.  You probably have to do more work (some languages might let you read the file as a string).  Example is to read each line and count the characters in each line.  For example, suppose the first line has 14 characters and you want to get to the 15 character.  Then, you'd have to read the second line and one character in.  And this would just be to read one character, not to treat the entire file as an array.\n\nThis is one of those ideas where you think \"there must be a way to treat a text file like an array\", and it's probably language dependent if there is something built in.  \n\nI think you can also use things like fseek to locate characters as well.  This is more of a C++ thing, so look into that?\n\nIt isn't an array notation, but a function call.\n\nYou are essentially asking\n\n* I want to get a char at a certain position\n* And I want to use array notation\n\nThe second part is the harder part.  It may not exist natively (you could write a class and overload the index operator and stuff like that, but it isn't straightforward, but not difficult either).","score":2,"comments":[{"body":"Thanks!","score":1,"comments":[]}]},{"body":"You'd need to open the file, then you could read it char by char upto the one you want using a for loop and something like getchar(), or seek to the byte position with fseek, provided you can assume the file has it or handle appropriately. But it might be better for a small file to simply read it all into a buffer and then index into it. Remember newlines are also either 1 or 2 chars, so you'll have to account for those in your indexing.\n\nIt's been a long time since I used C++ streams so I'm picturing C-style fopen, fread, fseek etc. here. There may be a better/cleaner way using streams e.g. istream::seekg takes a streampos.","score":1,"comments":[]},{"body":"Just read the file in to an array of strings, where each index is a line in the file, then just get the chat from the string.","score":1,"comments":[]},{"body":"If you only need the xth character and nothing else, the fastest way would be to fseek and then read that character.\n\nIf you are going to eventually read the whole file and it's not too large to fit into memory, the simplest way would be to read the whole thing into memory and then access it in memory (like an array).\n\nIf the file is really large, then you might need something more complex, like reading part of the file at a time.\n\nFinally, if you're willing to write platform-specific code, then on Linux and Unix systems (including macOS) you can use mmap to map the file's contents into an array in memory without actually reading it first. When you access an element of that memory region, it generates a page fault that reads the corresponding page from disk. That's actually how functions like fread are implemented behind the scenes.\n\nYou can do something similar for Windows but the details are different.","score":1,"comments":[]}]},{"title":"I'm currently stuck on a question for an application to a bootcamps. Please help.","not_safe_for_work":false,"locked":false,"body":"I'm currently working through an application for a bootcamp. They give a super basic barebones introductory explanation of python and then give you tasks to complete. \n\nThis is the question I am stuck on:\n\n\"Write a program that always asks the user to enter a number. When the user enters the negative number -1, the program should stop requesting the user to enter a number. The program must then calculate the average of the numbers entered excluding the -1.\"\n\nWhat I am stuck on is how do I store the new numbers entered in a new variable in the while loop until someone enters - 1 to then calculate the average, when creating new variables and storing that data has not been covered at all in the introduction. Can someone help me make sense of this? I really want to get accepted as it's a free government backed course to help people change their careers. I have completed all the other tasks no problem, its just the wording of this question has really confused me. \n\nThank you so much in advance!","score":1,"comments":[{"body":"&gt; What I am stuck on is how do I store the new numbers entered in a new variable\n\nOutside of your while-loop, you'll want to create a `list`. Then, inside the while-loop, append to the `list`.\n\nIn Python, creating a list might look like ...\n\n    my_list = []","score":3,"comments":[{"body":"Inside the while loop, you should add each number that someone typed to the list","score":1,"comments":[{"body":"At the end of the loop (when the condition of -1 is satisfied) you can do the calculation and return the result","score":1,"comments":[]}]},{"body":"Thank you! Your reply really pointed me in the right direction and got me there in the end.","score":1,"comments":[]}]},{"body":"Using a list would be a great way to solve this problem.\n\nIf you haven’t learned lists yet, remember that to work out an average you need two pieces of information. The total of numbers entered and then the amount of inputs the user has entered (excluding -1). \n\nYou should be able to keep track of these two pieces of information very easily inside your while loop and then calculate the average after the while loop has finished.","score":2,"comments":[]}]},{"title":"When POSTING / PUTTING a new User to a REST API, should the API return a 200 with the User information? Or should it return ONLY the 200 (without response body) because it is sensitive data?","not_safe_for_work":false,"locked":false,"body":"What is the standard?","score":1,"comments":[{"body":"Philosophically I would say return the minimum amount of information required for the client to proceed.  If your URL creates a new user and returns nothing or perhaps just a unique ID for the user, and you see or hear of a common pattern where that user is immediately retrieved, then you could create a new endpoint to create the user and return the created record, to use when appropriate.","score":2,"comments":[]},{"body":"All depends on your use cases. Generally the client/UI will probably need some amount of information associated with the user (name, email...) so the quickest/least demanding way to handle that is creating the user and returning a modified user object with only relevant information, should you need it immediately. \n\nBut a more conventional approach (which also fits most use cases) is the one u/alzee76 suggested: having a create user endpoint and a separate get user endpoint (which handles filtering against password and other such sensitive info).","score":2,"comments":[]}]},{"title":"How to plan or map out a react app?","not_safe_for_work":false,"locked":false,"body":"I know a bit about how to make a react project work, but I’m getting stuck on how to plan or map out what to do first. Is starting at the app.JS file and building a rough outline of the JSX / html components a good place to start? In my head I can then see what the UI looks like, where the buttons should be and then I can drill down into each div and spin it off into a component from there. Or is it better to find the bottom, work on a feature and then build up to the top?","score":1,"comments":[{"body":"draw in photoshop, or with pencil and paper.","score":1,"comments":[]}]},{"title":"What some distinguishing use cases for Pub-Sub vs. Message Queue types of design/system patterns?","not_safe_for_work":false,"locked":false,"body":"These two approaches (Pub-Sub vs. Message Queue) seem so similar I'm trying a use case for one that can't be fulfilled by the other.","score":0,"comments":[{"body":"Depending on the queue it may not be able to deliver the same message to multiple consumers.\n\nI would say if you have a situation where multiple consumers or subscribers need to know about something, use pub sub.","score":2,"comments":[{"body":"Thanks, this makes sense\n\n* 1-to-1 =&gt; message queue\n* 1-to-N =&gt; many subscribers (Pub-Sub)","score":1,"comments":[]}]}]},{"title":"Learn programming and matrix reasoning/working memory","not_safe_for_work":false,"locked":false,"body":"I know that this is a silly question, but what are the mental skills that you need in order to be a good programmer?\n\nI have taken the WAIS [https://en.wikipedia.org/wiki/Wechsler\\_Adult\\_Intelligence\\_Scale](https://en.wikipedia.org/wiki/Wechsler_Adult_Intelligence_Scale) and while my working memory and verbal IQ is in the top 5%, my matrix reasoning is much lower, just average.\n\nFor whom is involved both in programming and cognitive test, are working memory and matrix reasoning a good predictor of future programming skills in your opinion?","score":1,"comments":[{"body":"Forget about iq and other useless stuff.\n\nTo learn programming you need to read docs and write software.","score":3,"comments":[]},{"body":"&gt; are working memory and matrix reasoning a good predictor of future programming skills in your opinion?\n\nNo, they aren't. Working memory is to a degree.\n\nSure, memory plays a large role, but not in the sense you might think it does. You only need to memorize *syntax* and this will, through repeated usage and practice, happen automatically. The syntax will transfer into *muscle memory*.\n\nWhat really is important is *analytical skill*. You need to be able to dissect a problem into individual parts and then create step by step solutions to these individual parts.\n\nMatrix reasoning is just basically the ability to \"fill in blanks\" - this has very little to do with programming.\n\nIn fact, apart from \"Working Memory\" and \"Processing Speed\" most points are barely relevant to programming.\n\n*Logical thinking*, *Abstract thinking*, *Algorithmic thinking* are far more important skills.\n\nCan you solve textual logical puzzles in newspapers? Can you pick a task (e.g. \"walking\", \"brushing your teeth\", \"brewing coffee\") into discrete, atomic steps? Can you put them in sequence?\n\n----\n\nThe only way to figure out if you are able to become a programmer is to try. You should absolutely try it and figure out if your even like it. If you don't like it, there is no reason to pursue it.","score":1,"comments":[{"body":"Thanks!","score":1,"comments":[]}]},{"body":"IMO you shouldn't be worrying about this type of thing. There is no \"programmer gene\" that means you'll be a good programmer or not. People who are good at programming work at it. Programming is also such a diverse field. We need people with diverse skillsets and viewpoints to all contribute.\n\nI have a problem with these tests in general being used to then make predictions about your life, career, or personality. (that's not what they're for) They're psychological tools meant to be used by researchers or in a clinical setting, but instead people use them like astrology.","score":1,"comments":[]}]},{"title":"How can I improve my learning experience?","not_safe_for_work":false,"locked":false,"body":"I'm in the process of learning JavaScript through a paid course. The hardest part for me is the problem solving, when im givin a problem to solve I struggle in even finding where and how I should start off, the 2nd issue is my memory. I don't have bad memory like I can remember vague details of certain things so what tools can I use to improve my experience. Also on an un-related noted, I want to learn another programming language after im finished with JavaScript, I like making things for games i.e mods and that's one of the main reasons for why I started to learn JavaScript, I was thinking of learning c++ but lots of games use C# and im pretty sure c++ to c# compliers don't exist unlike TS to JS","score":5,"comments":[{"body":"Start with a website like codewars. They have programming challenges levels 8-1. \n\nWhen it comes to building websites on your own you should definitely complete some projects with the help of a course. See how the front end connects to the backend, how a typical project is structured and what are the best practices etc","score":4,"comments":[{"body":"I'll check it out, is it free or does it cost money?","score":2,"comments":[{"body":"Free","score":2,"comments":[]},{"body":"Check out The Odin Project.","score":1,"comments":[]}]},{"body":"Thank you for the Codewars tip. I've been searching for coding challenges and I did some challenges in edabit.com but after completing few challenges, I would've have  to subscribe in there, which is quite expensive.\n\nI find videos good way to learn things and challenges to see how good I understand those learned things.","score":1,"comments":[]}]},{"body":"Problem solving starts by solving the problem without code. There is no reason to open up an editor to write code, if you don't know exactly what you want to do.\n\nTo get better at problem solving is to practise verbalizing or and writing down the problem you have (not the problem they give you, but the problems YOU need to solve in order to reach the goal).\n\nAlso, you are very vague. Care to show concrete examples of problems you weren't ableto solve with a rough idea on how you approached the problem?","score":2,"comments":[]},{"body":"C# should be a much more comfortable experience for you. Also, it's a very balanced language from which you can always jump to something more rough like C++.","score":1,"comments":[]},{"body":"I’d advise either sticking with Javascript until you’ve made some bits with it, or switching language now to the one you actually want to learn and sticking with that. Don’t make my mistake of learning a little bit about a lot of languages and calling it progress.\n\nThe memory problem is a double edged sword, sure you’ll forget things that helped in the past but you’ll also expose yourself to so much more research to make up for it. Practice should hopefully help some of it stick too.\n\nProblem solving can definitely be elusive if it’s not something you’ve practiced. For me it’s just about breaking the problem down into recognisable steps and solving them one at a time, to the point where anytime I start anything new I’m more likely to be making flow charts on draw.io than coding.\n\nHope at least some of that helps!","score":1,"comments":[]},{"body":"Lot of these can be googled.\n\nGoogle-fu is useful skill.\n\nYou'll have to write stuff on your own that can't find in google.","score":1,"comments":[]}]},{"title":"Would it be bad practice to use Function&lt;&gt; to constructor inject methods in spring configuration files?","not_safe_for_work":false,"locked":false,"body":"I've been trying to find out if this would be considered good or bad practice. If it is situational can you give a good example of when you'd use Function&lt;&gt; to inject a method?","score":1,"comments":[{"body":"You'd have to give an example of what you mean to see if there's a better way to accomplish whatever it is you're trying to do.  But overall it's your code, do what you like.","score":2,"comments":[]},{"body":"Why do you care if it's good or bad?  Why not just do it and get it to work?","score":0,"comments":[]}]},{"title":"Error message when running npm start for my React app in my VS Code terminal.","not_safe_for_work":false,"locked":false,"body":"Im worried I have done something terrible. I opened a react app in VS code that has been working fine for days. When I typed npm start into the terminal i got the error message below. I got the same message trying to start a different react app as well. I have seen some people suggest uninstalling Node, but what will that do to my projects? Some people have mentioned deleting the Node Modules and Json packages, that did not work. Any suggestions are very much appreciated.\n\n&amp;#x200B;\n\nnpm ERR! code ENOENT\n\nnpm ERR! syscall spawn C:\\\\Program Files\\\\Git\\\\bin\\\\bash.exe\n\nnpm ERR! path /Users/dksl/repos/sundiver-solutions-site\n\nnpm ERR! errno -2\n\nnpm ERR! enoent spawn C:\\\\Program Files\\\\Git\\\\bin\\\\bash.exe ENOENT\n\nnpm ERR! enoent This is related to npm not being able to find a file.\n\nnpm ERR! enoent \n\nnpm ERR! A complete log of this run can be found in:\n\nnpm ERR!     /Users/dksl/.npm/\\_logs/2022-11-22T03\\_23\\_38\\_264Z-debug-0.log","score":2,"comments":[{"body":"You cant delete the package json file that is needed, you can delete the node modules folder but then you need to pull the dependencies again by doing npm install then you can run the other npm commands.\n\nAre you sure you are in the  correct folder when typing the commands? You must be in the folder with packages.json file.\n\nAlso troubleshoot, can you init a new project and run it? If you can npm is likely fine, if not sure uninstall and reinstall as long as you dont manually delete your code uninstalljng npm is fine, completely getting rid of npm can be tricky you might want to google that.","score":2,"comments":[{"body":"Thanks for the help! I deleted node modules and ran npm install. After that, the node modules folder showed up but when i clicked on it I got this message \"Unable to resolve nonexistent file '/Users/DKLS/repos/syracuse-childrens-zone/node\\_modules'\" I am certain I am in the right folder when typing commands.","score":1,"comments":[]}]},{"body":"&gt; Im worried I have done something terrible.\n\nWhat did you change between when it worked and when it didn't?\n\n&gt; enoent spawn C:\\Program Files\\Git\\bin\\bash.exe ENOENT\n\nThat means npm couldn't find the bash.exe file.  It's looking for git bash, did you uninstall anything?","score":2,"comments":[{"body":"I was trying to install materials-ui to use their icons. It was not working and I was getting messages in my terminal about severe vulnerabilities. I followed the instructions in the terminal (I don’t remember what they were), I think they had something to do with audit fix. Then I started getting the error messages above when trying to run npm start.","score":1,"comments":[]}]},{"body":"Tbh, I dont have any idea about the error but it looks like you accidentally deleted something/some file that nodejs needs. My suggestion\n\n1. Google the error. Just copy paste the error. You wont believe how helpful this is. I solve most of stuff like this.\n\n2. Reinstall nodejs. And no, it is not going to fuck up your project. Just make sure not to delete any files from your project while doing this.","score":1,"comments":[]}]},{"title":"Can hakers cause buffer overflow without user input","not_safe_for_work":false,"locked":false,"body":"I want to learn to make my applications more secure and so far I know that in c and c++ are functions such as getc and scanf and so on which when reading string can overflow the buffer,so user input must be controlled.However,I wondered can malicious users cause buffer overflow if there is no input of data into app.","score":1,"comments":[{"body":"Depends what you mean by \"no input of data\". \n\nIf there is literally no way for a user to interact with your app then triggering a buffer overflow, or any other kind of attack, is going to be tough. \n\nBut \"input of data\" can be things other than a user writing text that you store in a buffer. There could be a buffer somewhere internal that users never write to directly, but that could be overflowed by manipulating your app into some invalid state using other means. Maybe if the right series of interactions take place, your code makes an API call and writes the returned data into a buffer, but you failed to account for the fact that this API call actually produces results of potentially unbounded size (or maybe there's a bug in the API you were unaware of, or maybe the user has hijacked the servers returning your API calls). Suddenly you're dealing with a buffer overflow despite never accepting even sanitized user input.","score":4,"comments":[]}]},{"title":"Working more than one year as junior developer but still struggle","not_safe_for_work":false,"locked":false,"body":"Junior software developer work more than one year as a developer still struggle\n\nI been working with current company remotely for 1 and 3 months (3 months working as part time when I was still in the probation period).  The company is really small and only have 3 developers ( including me). I feel like did learn anything after working one year.\n\nThe company has legacy and really messy code. Most of the code without documents and comments.  By the way, the company used jqeury and php. The technique is very old.\n\nFirst few months , I’been assigned very easy tasks but spend many days to complete task. I was really struggled to do the task for first few months because this was my first job ever after finished uni. I got both bachelor and master degree for computer science…\n\nMy senior is nice and always answer my questions, when did code review, he will sent screenshots to me and tell me how to write better code. However, the code is really messy and without documents I have to spend hours and hours to understand code. After few months, I can do simple tasks, work in different projects, and fix bugs independently.  But still need to ask questions because can’t read other senior’s code (without any documents). \n\nNow I still have to spend a lot time to do task, even sometimes I used my own free time to do the tasks. I’m really stressed because I feel extremely slow and stressed.\n\nThe system does not support to write unit testing or other test (due to the legacy and buggy code). I came up the idea before, and told my seniors - better to write unit test. What they said - unfortunately we can’t write any tests because existing system won’t allow us to write any tests…..\n\nSo every time after finishing a task, I have to test manually by clicking buttons, add data etc.  I made so many mistakes because I did not test properly. My seniors can always find bug in my code. They said it’s very challenging for them because they need to spend extra time to find bug.\n\nYesterday, I accidentally restored a table for a production database, my senior spend extra 3 hours to recover the database.. I’m still feeling stressed and fucked up….  Today there is another bug that spent few days still can’t solve the issues. I ask another senior, he also doesn’t know how solve it. The one of senior who know how to solve the bug is really busy with a new project…\n\nI work remotely so I only meet my colleagues one time in person… every day I feel isolated… I felt like sometimes lack of the communication due to working remotely…  I’m not sure if I’m too dumb to be a developer. Now I’m really stressed and don’t know what to do. Should I leave this company and find a better opportunity? \n\n\nSorry forgive my English, because English is not my first language.","score":0,"comments":[{"body":"That sounds like not a great place to  be learning as a new dev so don't place all the blame on your shoulders. A good shop should be having weekly progress and development meetings between devs and their supervisors. You should be having regular 1 on 1's with your manager to discuss how you're progressing, any problems you're facing, and to talk about how you can be better supported. So don't think that this is a regular development environment. (unfortunately though its not all that uncommon either.)\n\nAlso unfortunate that we sometimes can't change our circumstance. We can just do our best within it. Even if the seniors don't see it in scope to add unit testing, maybe you can come up with a set of manual tests on your own that you can complete before you push a feature you've worked on. It can be as simple as a list of things that you confirm work before you push a code change. \n\nLastly, I just want to say you shouldn't be taking failures at the workplace as personal failures on your part. You're not getting the support you need, and at the end of the day, you know you're doing your best. You shouldn't feel like you're a bad person if they don't have the system to let you thrive, or if their code base isn't properly protected from bad code pushes.","score":1,"comments":[{"body":"U are right. Thanks! I don’t have weekly meetings, nobody will talk to me and ask me - what Can I be improved….   Not 1 on 1 session… basically just feel isolated.","score":1,"comments":[]}]}]}]}