{"name":"lifeprotips","description":"Tips that improve your life in one way or another.","subscribers":21499951,"posts":[{"title":"21 million subscribers looking for the real tip in the comments!","not_safe_for_work":false,"locked":false,"body":"From the bottom of the mod team's hearts, here at LPT, we thank you!","score":558,"comments":[{"body":"Hoorayy!! Here’s something I figured out about a month ago. (In maps) Double-tap and slide your finger up/down to zoom in/out. Also, where you double-tap on the screen is where you’ll zoom in/out from!","score":165,"comments":[{"body":"That's new! It works! Thanks","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Ugh, this is not an LPT.  /s\n\n&amp;#x200B;\n\nAll the best to you and the rest of the mods. +1 to mod u/killHACKS for friendliness.","score":58,"comments":[{"body":"Thanks :)","score":24,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Here's my best tip:\n\n\"If I never find someone again, at least I'll have myself as a best friend .\"","score":41,"comments":[{"body":"Happy Cake Day 🍰","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Thanks for taking care of this place mods!","score":27,"comments":[]},{"body":"wow 21 millions is a lot, congratz. it's a nice sub","score":12,"comments":[]},{"body":"It's not what happens to you,\n\nBut how you react to the situation that counts !","score":10,"comments":[]},{"body":"Yeyy","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: if you're going to be lazy about cyber security and use the same password everywhere, at least use a different one for your email. If they get access to your email they have access to everything else but not necessarily the other way around.","not_safe_for_work":false,"locked":false,"body":"","score":10259,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Fine:\n\nChanges email password to \"Password2!\"","score":1022,"comments":[{"body":"That's still **far** more secure (assuming you aren't *literally* using \"Password\" as the base), because as soon as one site has a breach, a million hackers are going to start going down that list of known passwords at every *other* major site on the internet.\n\nYes, a dedicated attempt to crack your specific account would try all the trivial variants - at a minimum all single-character additions and substitutions since that's linear with the character set - But since most sites will lock the account after a few tries, they're not going to casually do that against a full recently leaked list.","score":261,"comments":[{"body":"&gt;But since most sites will lock the account after a few tries\n\nI doubt it. It would be an excellent DoS vector. I could do \"a few tries\" on Donald Trump's twitter account to lock him out.\n\nWhat they'd do instead would be thresholding applied to that particular IP.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I'm not lazy my brain is low on RAM","score":162,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I have a password I use on all the general sites that I don't care all that much about. If it's an important site with confidential info then I use a unique password.","score":25,"comments":[]},{"body":"Just don't be lazy, by being lazy. It is called a password manager. You probably have one built in to your browser, that should be perfectly good. If you don't like Google or don't want all your passwords stored with your email, it would of course be better to use a separate password manager like Bitwarden.\n\nBut the main fix for email (and any website for that matter) is to use 2FA (a security code) with an phone app, or buying a physical security key (FIDO U2F)\n\nApple for example has 2FA on by default, even if that uses SMS as a backup, it is much more secure than a password and \"security\" questions.","score":432,"comments":[{"body":"My password is so old that it uses a character that's no longer supported. That's probably the most secure since any password cracker is going to be tuned for current password rules. Sometimes laziness pays off over time","score":1,"comments":[{"body":"You have to reveal the character now\n\nCan't leave us hanging like that","score":1,"comments":[{"body":"Riker","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Invest in a good scarf if your winters are harsh. They make such an impact on comfort while outside.","not_safe_for_work":false,"locked":false,"body":"I was one of those people that never thought a scarf was worth the bother. After all, a coat and hat is enough right? Nope. I got a nice wool scarf and it's heavenly. It's like a warm towel around your neck while outside in sub-freezing temps, or even below 40F. \n\nI feel like I could easily stay out for hours now, whereas before it was always a race to the car or some other warm place. I almost feel vulnerable without one now. It's so nice.","score":941,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I'm a perfectly average, non fashion minded mid 30s American male. \n\nI learned this like 2 years ago and absolutely love it. People sometimes give me a look when I walk into work with a scarf on. But man it's so worth it.","score":1,"comments":[{"body":"&gt;I'm a perfectly average, non fashion minded mid 30s American male. \n&gt;\n&gt;I learned this like 2 years ago and absolutely love it. People sometimes give me a look when I walk into work with a scarf on. But man it's so worth it.\n\nHello, brother.\n\nMaaaaan they are a game changer!!","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Be comfortable homie. Who cares what kind of looks others give you.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I have a cashmere one. Only fancy thing I own. Makes for a tolerable walk to the warm insides at work.","score":1,"comments":[]},{"body":"I needed something to do during lockdown so I asked people for leftover knitting yarn. I started knitting warm woolly winter scarves for homeless people. I’ve also done requests for friends and family. Takes me approximately two to three days to complete a 4’ scarf. They’re not perfect but I don’t think that matters. Knitted with 💕 love.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It seems like it should be so obvious, but a good pair of gloves and a scarf are a real winter game changer.  Also keeping one's feet dry as best as possible. I like having a spare pair of socks and even shoes hanging around my office so I can swap into something dry. \n\nAlso also, investing in animal fiber for winter wear. Where I live isn't too cold so I can get away with synthetic fabrics, but animal fiber is the best.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A neck gaiter is also an option","score":1,"comments":[{"body":"This right here. Last winter, my job handed out company branded fleece neck gaiters to everyone. It was a game changer.","score":1,"comments":[]},{"body":"Gaiters are warmer, don't get in the way or fall down like a scarf does when you bring them up on your face.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: To heat yourself during the winter, have a hot water bottle on your legs while sitting down doing your work, it will conduct through the rest of your body and will heat you almost the same as a heater would do at a small fraction of the cost. Energy prices are far too much, be safe this winter","not_safe_for_work":false,"locked":false,"body":"","score":1286,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Be very careful doing this. The number of burns seen in the emergency room from hot water used in this manner is awful. Anyone with any decreased sensitivity is particularly susceptible to these thermal burns.\n\nDress warmer, use a space heater, use an electric lap blanket or full size even but be very wary of burns from hot water bottles. It's not just the temperature, it's also duration.","score":258,"comments":[{"body":"An alternative I love is a rice sock. Fill a (clean) tube sock/crew sock with dry rice grains, tie a knot at the top, and microwave on a plate for 45 seconds to 2 minutes, depending on size of rice sock and power of microwave. Stays warm forever and can be used like a neck pillow if you wanted. \n\nDisclaimer: do not eat the rice from the rice sock","score":1,"comments":[{"body":"Don't eat sock rice, alright - noted.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Get a heated blanket, they cost practically nothing and double for sitting and laying down in bed","score":34,"comments":[]},{"body":"A cat on the lap works equally well.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Heat is generated in the torso. While working in a cold Operating Room, the nurses taught me to wrap a warmed-up blanket around my torso. The heat is spread to the rest of the body through pumping blood.  Works like a charm","score":51,"comments":[{"body":"I feel the opposite. If my feet are cold, my whole body is cold. I could go out and get my car started with shorts and a t shirt if I was wearing warm socks and not feel the effects of the cold for a good while. However, the moment my feet are cold my entire body feels like it's freezing.","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Might burn your pp if the water leaks.","score":13,"comments":[]},{"body":"A lap blanket does wonders too.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: If you’re sexually assaulted, call a hospital to find the nearest ER that does sexual assault exams/evidence collection","not_safe_for_work":false,"locked":false,"body":"You should still go to an ER even if you don’t want to report to police to make sure you’re okay, but here’s more tips if you do want to report. Thanks to user att3e3a for adding that exams can be done (and evidence collected) up to 72 hours after the assault, and even if you’ve eaten/showered/etc, evidence can still be collected. Also, STI/pregnancy prevention may still be available after 72 hours. \n\n—If the assault involved your mouth, don’t eat or drink anything. \nDon’t shower or use the restroom if possible (if you have to pee, drip dry a bit and then put your underwear back on). \n—If there’s a chance you were able to scratch your attacker, don’t wash your hands (DNA may be under your nails). \n—Don’t change clothes if possible (if you do, bring the original clothes you were assaulted in to the ER- per comments, in a paper bag or pillow case to preserve evidence, not a plastic bag). Clothing may be taken as evidence with your consent, you may not get it back. \n—If you’re on your period, bring any pads/tampons from during/after the assault to the ER. \n\n\nThis is all stuff I’ve learned working with SANEs (Sexual Assault Nurse Examiners) and survivors that I wish was common knowledge.\n\nEdit: Thank you for the awards!! Also thank you to everyone sharing more advice! As a disclaimer, I work in Texas so some (all?) if this may differ based on state/country. Hopefully at least some of it translates to where you are or you now know to look into your area’s options/resources. Most(?) areas have sexual assault advocacy groups/centers that can help survivors with many assault-related things, so it may be a good idea to be familiar with them in case you or someone you know needs help in the future. \n\nMore Texas specific info: the SA exam (with or without evidence collection - swabs/photos/etc) is covered by the state, but STI/pregnancy prevention is run through health insurance and may not be completely covered. Survivors can apply for Crime Victims Compensation to get reimbursed for the rest ONLY IF they report the assault to law enforcement. If you are a minor and present to the ED for SA, it is considered a mandatory report for the hospital, BUT you do not have to consent to evidence collection and you do NOT have to participate in the investigation. If you want to have evidence collected, but aren’t sure you want to report, they will collect it and store it and you have up to 5 years to choose to report. Once reported, cases can take years, or sometimes decades, to be heard in court. Not all reported sexual assaults are go to court.","score":12353,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Hugely important - if you want to change your clothes, put them into a clean PAPER bag (DO NOT USE A PLASTIC BAG) or wrap them in clean newspaper, as plastic will degrade evidence.","score":2035,"comments":[{"body":"As a forensic scientist, I thank you for this comment! \n\nIf you don't have a paper bag, you can also use a cardboard box. We really don't care in what shape of packaging your clothes are, as long as it's breathable material.\nIf you only have plastic, cut holes in it and/or keep it open.","score":962,"comments":[{"body":"So all the NCIS type series where they put all the evidence in those zip lock plastic bags are a damn lie?!","score":191,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I would suggest calling via RAINN because they will connect you to a survivor advocate who will then locate the nearest place to get an exam with a SANE team while also providing some immediate emotional triage. Sometimes the advocate can accompany you to the hospital so you don’t have to be alone.","score":125,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Also, in a lot of major cities there may be advocate groups who are on call 24/7...so if you're at the hospital and not sure who to call, ask for a social worker. The social worker may arrive with someone who is trained specifically to help sexual assault survivors.","score":448,"comments":[{"body":"ER Nurse here - at a lot of hospitals as soon as you check in for a SA, we call an advocate. People are scared and confused, and don’t know what they want. We always call one in and if you don’t want them, we can send them away. Most everyone ends up wanting to have them there, even if they didn’t know it initially.","score":148,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Also get tested for STDs/HIV/treated for unwanted pregnancy.","score":747,"comments":[{"body":"Ask for prophylaxis against the above if you are interested in it.","score":235,"comments":[]},{"body":"Most STDs won't show up in a test right away. If its a blood test they pulled from you anyways. \n\nMaybe they can check fluids/semen from the attacker but if that's not an option you'll have to wait 3 months to know for sure.","score":121,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: If your pet is nearing the end of its life, look into at-home euphenasia","not_safe_for_work":false,"locked":false,"body":"Your pet can spend their last moments sitting on your lap in their favorite chair instead of at the vet where they might experience fear or anxiety. You can really focus on being with them and making them feel comfortable and loved as you say goodbye.","score":197,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"A visiting vet is so much less stressful for them than a crate, a car ride, and a different place, unless they like travel and strangers. Even if they don’t, if it has to be at a vet, that stress is better than letting them suffer on and on for days.\n\nAdding to this: \n\nA week too early is better than a day too late. If you don’t like this and don’t know what I mean, count it as a blessing. It’s pretty horrific how much suffering can be perfectly natural. When people say it’s the most compassionate choice, it’s for good reason.\n\nWhen your pets can’t/don’t eat, walk, sleep, &amp; potty…or 2-3 of those…it’s getting close or might be their time. Animals may stop eating and drinking when they’re ready. \n\nNot being able to walk anymore (when they could before) signals a lot of changes inside the body, none of them good, most of them irreversible. It’s extremely common for that to go along with the dying process. An injury, you can try to treat. But when it’s because everything is shutting down, there’s not much even an unlimited budget could do. \n\nInability to sleep can be because of pain. If you aren’t sure it’s time, know it’s at least time to visit the vet about pain meds when they can’t sleep. \n\nIf you love them, be there during. Of course it’s hard for you. Be there anyway. They’ll be looking around for you. You were their world. It’s only a few seconds. I don’t think I’ve ever seen a euthanasia take a whole minute. Sometimes it’s instant. They gave you a lifetime - give them that.","score":1,"comments":[{"body":"Everything you said here is difficult, and  everything is the right thing to do.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This is a great idea, but I could not afford it. I had to put my cat Guido down a few months ago. It was over $500 for in-home euthanasia. I paid $140 at the vet. I loved on him as they were putting him to sleep.","score":1,"comments":[{"body":"Wow. My in home euthanasia was less than 10% more expensive.","score":1,"comments":[{"body":"I Googled all around my area. I would have loved to have it done in-home.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"We did this for my boy. We invited all of his favorite people and had a steak dinner, I held him while  the shot was administered, he let out a sigh and passed away peacefully with all of his best friends and family around. I miss him","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My dog *loves* car rides and loves going to the vet. They're so nice to him, give him treats. Truly wonderful people. When the time comes, he'll never know it. Zero anxiety.","score":1,"comments":[]},{"body":"You were probably going for euthanasia, although euphenasia has a nicer ring to it -- not quite as death-y sounding. Not sure if euphenasia is a real word. Maybe that act of using euphemisms? No, nevermind.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"We were hoping to do this for our girl when she passed but she was going downhill quickly and when we called the get they stated it takes a few weeks to arrange.  Just figured people should be aware sometimes this isn't possible in a more urgent situation.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: If you hate doing chores, start listening to podcasts","not_safe_for_work":false,"locked":false,"body":"Once you find some podcasts you like, you’ll start looking forward to cleaning your house or doing laundry because you’ll have something to do while you listen.","score":10984,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Or audiobooks! Same idea. They are amazing and they've changed my life.","score":859,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Check your local public library out too. Many of them subscribe to services such as Libby that offer audiobooks you can listen to on your phone or other device: https://www.overdrive.com/apps/libby","score":332,"comments":[{"body":"I’ve been using Libby for like 4 years now. Highly recommend","score":58,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"If you can get a JOB that let's you listen whole you work. *magic*","score":724,"comments":[{"body":"Literally took a part time cleaning job just so I can listen to podcast uninterrupted. Extra money is a nice bonus 😊","score":201,"comments":[]},{"body":"I can do it sometimes. If I’m designing, yes. If I’m writing, no.","score":153,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I found the opposite for me. I'd get too into the podcast and would stop my chores to sit down and listen without distraction haha","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I can’t listen AND focus on task at hand… :(","score":102,"comments":[{"body":"same. i end up having to rewind a lot which just takes up time i should be using on the task at hand","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT Request: Is there anything that can give comfort to someone with tinnitus?","not_safe_for_work":false,"locked":false,"body":"I am aware that there is no \"cure\" for tinnitus. The best doctors that we've been to have blatantly said there's nothing to be done (and still took the money). But is there anything that anyone has heard of maybe experienced themselves that can (even temporarily) give relief to someone with tinnitus? \n\nIts going to be hours since my sister is just holding her hand to her ear and lying down.","score":170,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"White noise works for me, rain sounds work the best.","score":202,"comments":[{"body":"To add another data point, what works best for me are crickets.  If you have an android phone or google home you can just tell it: \"play night sounds\".  When I started, I would keep increasing the volume until I couldn't hear the ringing anymore.  Then slowly reduce as I was able to.  Now I have it on the lowest setting all night and it works great.","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Although perhaps there is no 'cure', I'm unaware that there is any temporary relief. I've learned to deal with it, and I've actually learned that if the tinnitus cannot be heard over the sound of running water in the sink, then it's not considered serious. \n\nYou may be interested to know of an experimental treatment I've read about, where audiologists work with you and isolate or determine the actual frequency that the patient is hearing. They in turn find the  'hair', for lack of better terms, that is damaged and can't regrow, which is the source of the tinnitus. Eventually the root of that hair is destroyed, causing the hair to stop trying to grow back, eliminating the source of the problem. Pretty cool!","score":136,"comments":[{"body":"Where can I read on that?","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Fascinating. I wonder how they match something only the patient can bear?","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"My husband has permanent tinnitus. He tends to listen to podcasts/ music etc most of the time, but he has got used to it.\n\nI've had it now and again from viral infections. I found white or brown noise useful at night. There's an app called Beltone Tinnitus Calmer that has lots of options to play continuously, you can build your own soundscapes or use the existing options like fire and rain, day at the beach etc.\n\n Focusing on your tinnitus in silence is not a good idea, if it's really bothering her, there are usually specialist clinics and support groups available that help people adapt.","score":36,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I have fans going constantly. I sleep with rain sounds and crickets also, really helps. \n\nTo be honest though, you will habituate to the sound.....it really sucks, but you get used to it..","score":18,"comments":[]},{"body":"I’m 43 and have had tinnitus since I was 16, quite chronic since my mid-20s. It caused me a huge amount of stress until my late 20s. I lived music and had to give that up to protect my hearing. \n\nThe pivot point for me was acceptance. There is no physical pain associated with it. It cannot do you any actual harm. There may come a point later in life where associated hearing loss creates obstacles to communicating, but there are options to prepare for that. \n\nI tried a lot of different therapies etc but they only added to the stress. Accepting the condition and learning to put my focus elsewhere was a fundamental turning point in curing myself of the suffering caused by the condition. \n\nI keep an eye out for advances in treatment, I carefully consider how badly I want to see a live musical act because I know I’ll cop some damage and get a flare up in volume for days after. But it is literally all in my head - and therefore within my control.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Heres my tips after having tinnitus for 10 years: \n\n1) surround yourself with white, pink, brown noises (rain, fan, etc). You can also use a speaker or your phone. (iPhone has this built in). The trick is to have it slightly below your tinnitus “level”. This is called masking. Eventually - if lucky your brain will start tuning out the tinnitus a bit. \n\n2) it’s common to get a fight or flight response when getting Tinnitus. This can actually make your tinnitus “louder”, as you start to focus on it. It’s important to know that it’s not your ears, it’s your brain making the sound. \n\n3) protect your hearing from further damage. Always wear hearing protection at concerts, clubs or other loud places. Use noise cancelling headphones  so you can keep your volume at a safe level. \n\n4) get enough sleep, eat as healthy as you can, and try not to stress too much. This can affect your Tinnitus. \n\n5) this is the hardest part and it will take time, but accept that you have it. It’s part of your life now and when you eventually accept it, you will stop listening for it. \n\nNote: Tinnitus is very individual, people have it worse than others. I still hear it from time to time, but has slowly gotten better. \n\nHope this helps - a bit.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: This is the time of year to stock up on lube or other adult items since the excuse of \"Christmas secrets\" works for all packages.","not_safe_for_work":false,"locked":false,"body":"","score":30,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Just ordered a third 55 gallon drum of lube for this very reason.","score":1,"comments":[]},{"body":"Just getting my dad this Atomic Prostate Blaster 5000 for Christmas…","score":1,"comments":[]},{"body":"Time to stuff some stockings","score":1,"comments":[]},{"body":"Specifically, I mean if you have nosy family members or children who usually want to know what's in any package that arrives.","score":1,"comments":[]},{"body":"Secrets of Christmas, you say? And bulk lube? My my. Do tell. Admittedlly very unfamiliar with this technique but quite willing to learn.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Do you think anyone really cares?","score":1,"comments":[]},{"body":"Do you think those workers care... no. No they don't get a rabbit and a double ended dildo at 8 am on a Tuesday.","score":1,"comments":[]},{"body":"You live a strange life, OP.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT - Secure your engagement ring when proposing outside.","not_safe_for_work":false,"locked":false,"body":"Use a small string or even a prop when proposing outside, especially close to water, on sand or any type of ledge. So many videos circulating online where the ring never even makes it onto the hand.","score":33,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Great idea, much better safe than sorry!  I can't imagine an unluckier start to an engagement than losing the ring.","score":1,"comments":[]},{"body":"Then make a “no strings attached” joke","score":1,"comments":[]},{"body":"It is best to propose with an NFT of the ring.","score":1,"comments":[]},{"body":"Lpt: Don't be an idiot","score":1,"comments":[{"body":"Of course but accidents do happen especially when people are nervous or excited.","score":1,"comments":[{"body":"That's fair. I know I was a pile of nerves when I proposed on the beach of lake michigan in the middle of winter lol but I didn't drop the ring because that would have certainly ruined the moment.","score":1,"comments":[]},{"body":"LPT: many of those videos circulating online are fake/staged.￼","score":1,"comments":[]}]}]},{"body":"LPT - Dont spend what you can't afford on an engagement ring.","score":1,"comments":[]},{"body":"u/well_actuallE\n\n&gt;when proposing outside.\n\nWho porpoises inside?\n\n&gt;especially close to water\n\nWho porpoises away from water?","score":1,"comments":[]}]},{"title":"LPT: Put a fresh case and new screen protector on your phone once a year and it'll feel like you got a sleek new phone for a fraction of the cost.","not_safe_for_work":false,"locked":false,"body":"Just did mine and realized I've developed the habit of replacing them for my birthday for the past few years and it's such a good feeling afterward. Plus phones are notoriously dirty so then you get the added bonus of saying goodbye to all those supergerms that were created from using sanitizing wipes on your phone for the past year. (:","score":59,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"This is a little like suggesting that people should change their socks. Don't they do these things anyway? When your screen protector becomes a bit scratched, or your case becomes worn, you replace it. Doesn't need to be on a set schedule.","score":1,"comments":[{"body":"What the OP is suggesting is closer to buying new clothing to refresh your wardrobe and style rather than because it's strictly needed due to wear and tear.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Unfortunately, there is an entire industry that lives off of people who buy an entirely new phone every year.\n\nSo more like buying new socks every time they are dirty","score":1,"comments":[]}]},{"body":"Better yet, don't put a screen protector on your phone at all. Most phones out nowadays have gorilla glass. I've had my phone for 4 years and no scratches. I have even left my phone on my car and drove out in the street where it fell face done. No scratches. No screen protector.","score":1,"comments":[{"body":"My Kyocera is a beast. No case no screen protector and it's taken one hell of a Beating so far  and  still looks damn  good to me an no scratches on the screen.","score":1,"comments":[]}]},{"body":"Screen protectors are trash aren't they? I've never needed one and I don't know what they're even for","score":1,"comments":[]},{"body":"r/lifeprotip or r/mentalgymnastics","score":1,"comments":[]},{"body":"If only this wasn't a copypasta repost.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Do not ever trust retail salesmen and actively verify information they provide","not_safe_for_work":false,"locked":false,"body":"Wife and I went to Ashley’s furniture to check out some dining room tables as our family had outgrown our current table.  The salesman was HOUNDING my every footstep and when we eventually found a table that we really liked (and was within our predefined budget) we asked about pricing, delivery and options. His first figure was grossly overvalued, as the MSRP was right there on the table and addition is rather simple. He went on to try and charge me a $450 fee for delivery l that was a week out and a mere 5 % off list. \n\nAs he was giving me a sob story about his financial shortcomings (whilst wearing a Rolex) I googled the table and found that on Ashley’s own website the table was available for next day delivery, at 15% off, an additional $100 for Black Friday and delivery was, of course, free. \n\nDifference between this sleaze bag’s price and what I paid was almost 40%. That is insane. \n\nTo his defense, sometimes online prices and promotions are different. But delivery fees and timing usually are not and rarely is the sales price.\n\nLong story short, before making a major purchase:\n1. Know your budget\n2. Research every word out of your salesmen’s mouth\n3. Always check online.\n\nEdit: a bunch of former sales reps are taking offense to this post and making excuses as to why I should have accepted predatory sales behavior and how I just don’t understand the ‘sales industry’. Ignoring all the things that are wrong with this sentiment and focusing purely on the subject at hand, I am merely advising people that they are likely better off researching information than believing a person who is paid to lie to you (according to their own accounts and experiences).","score":901,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"My company actually sold Ashley furniture. It was an electronic store.\n\nYou really do NOT want to know the margins on their furniture.\n\nThe mark up is INSANE on their furniture.\n\nEven with that discount, you overpaid lol","score":278,"comments":[{"body":"Agreed, Ashleys is one od the worst I've been to for that kind of thing.","score":76,"comments":[{"body":"If you flip their furniture upside down it all makes sense lol low quality lol","score":42,"comments":[{"body":"What are you saying? Are ¼\" plywood and MDF not actually good materials for a couch frame?\n\nNext you'll be telling us that joints should be attached by more than glue.","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"$110 sectional off the truck.  $3400 tag put on and thrown onto the showroom floor.  Yep.\n\nAny furniture is marked up beyond sanity though, not just Ashley.  \n\nAshley is also cardboard.  Thick cardboard.  Next time the salesperson says \"all wood construction\", ask them to flip it over and show you.  Even the arm rests are 3 inch thick cardboard.  Not particle board.  Not compressed board.  Actual cardboard.\n\nSource; I was the warehouse manager in a store and one of my routine jobs was destroying returned furniture and/or furniture which simply wouldnt sell and had already spent weeks in the discount section.","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"4. Have enough respect for yourself to not shop at Trashley Furniture.","score":49,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I've had a friend and also a brother in car sales. They've helped me out big time in the past, and also have casually told me about selling cars far above sticker.","score":42,"comments":[]},{"body":"LPT Part 2: Don’t shop at Ashley, ever. We had such a bad experience with them. Pulling teeth would’ve been far more pleasant.","score":29,"comments":[]},{"body":"Walking into an Ashley or Rooms-to-Go or wherever is like jumping into a shark tank. The salesmen don't give you a moment's peace. I just want to look at furniture on my own and find an associate when I need one, but I end up having to dodge their attention like a Pokemon trainer walking through Viridian Forest. Such an off-putting experience.\n\nIKEA furniture sucks but at least they leave you alone.","score":93,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: A promotion delayed is a promotion denied","not_safe_for_work":false,"locked":false,"body":"Originally an MLK quote about justice, but I think it applies here as well. If you are good at a position in your company and especially if you are an outperformer in your department, many companies will know they need you but avoid moving you or giving your a promotion because you are indispensable to your current position. They will string you along for years (yes, years) with vague promises of future promotions, but they will delay it indefinitely often using excuses like other people quitting or not having someone to replace you. You should take this as a \"no.\"  \n\n\nThis is not to say that you should immediately quit, a sure paycheck is a valuable asset and you should stay with your company for as long as you need them until you have something concrete in place, but start submitting resumes other places and take interviews. A lot of times you will even get an offer, submit a two weeks notice at your current place, and your current company may give you a counteroffer with an actual promotion because you have given them an ultimatum and they want to keep you, after which you may reconsider. But either way, if they don't say yes, they said no, and you should never take them at their word for vague promises of future promotions/raises.","score":2207,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Worst case scenario, being told that you were submitted for promotion, but it was denied. But you should be happy and proud that you were submitted. \n\nLPT is: When a company does not give you raises and promotions in line with the work you've done for them, make a plan and get out asap.","score":346,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Basically had this happen to me. Promised a raise for a couple years in a row and was denied. My super basically told me if it were him he'd find a new job. Spent a month searching and got a new job at 2x the pay. Was scary but definitely paid off","score":288,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I find a counteroffer is typically more offensive.  If i was so valuable to you and you could pay me more or give me a promotiom, why didnt you?  You just took me for granted because I was ok with it?","score":240,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Economic rule: you don’t get paid based on how hard you work.  You get paid based on how hard it is to replace you.","score":129,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That's why any recruiter or hiring manager that judges me for switching jobs every two years can literally go f*** themselves.","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I was making $14.50 an hour doing an incredibly high skill job that required years of experience. When techs in the field couldn't figure out what to do, they'd call us. Over the course of two years I was loaded with responsibilities that were not in my job description. Talking with vendors, handling the closing of entire customer accounts, and was even one of three people in the entire company with knowledge base admin rights.\n\nAfter two years I asked for a raise. They told me, \"We're looking to get you where you need to be in November.\" That was 8 months away. Not even a hint of what this promotion would look like and they were willing to let me sit and wait on it for almost a year. I put in my two weeks a few days later.","score":105,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It can be easy to forget that this is the driving force of wages going up. Most (not all) people only get significant raises when moving companies.","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"One of the wisest things I've come across is:\n\nA \"no\" can take many forms, so when you ask, and they won't give you an answer, that's all the answer you need. No answer = a \"no\" answer.\n\nSoft \"no's\" are so commonplace a deferral of responsibility we just get used to hearing them &amp; grabbing the sliver of hope that is a possible \"maybe\".","score":25,"comments":[]},{"body":"This is exactly why I'm \"acting my wage\" at my workplace. I've been filling a role for three years that \"doesn't officially exist\", got a raise for it for less than a year before they leveled my pay back out to be even with people that don't go the extra mile.\n\nIf it wasn't for us only working 40 hours, with no mandatory overtime, I would have left by now. But every other place near me that could use my skills wants 60+ hours a week, and I'm not killing myself for corporate greed. I'll milk my job as long as I can.","score":22,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: With winter here, clean the inside of your windshield. You’ll be surprised how many of those annoying streaks are on the inside.","not_safe_for_work":false,"locked":false,"body":"","score":3115,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Does anyone have a foolproof tip on how to do this? Literally every time I clean mine it still has streaks/fog and I’ve read all of the tips online.","score":581,"comments":[{"body":"I’ve found that buying a new car is the only way to get the inside of a windshield clean","score":382,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Buy some aerosol glass cleaner NOT the liquid spray type stuff. Source: I use it on commercial windows all day. Any microfiber cloth, paper towel, or newspaper will work just fine. It's all in the spray","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"See my comment. If there's anything you do, make sure you use a separate microfiber to dry with otherwise you're just reapplying the dirt you picked up. Leaving it to air dry even slightly is mostly what causes fogging/streaking.","score":180,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"And I highly recommend getting a windshield glass cleaning reach tool. You'll be able to go over the whole inside without straining and really get that glass deep cleaned. I like to go over once with glass cleaner and a second time with a dry cloth.","score":78,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"LPT: Always use a separate microfiber towel to dry with, and *dry it good*. Leaving any wetness to air dry will cause streaks.\n\nOnly use Windex in a pinch, otherwise Stoner's Invisible Glass is good and costs a few bucks.\n\nSincerely, a detailing hobbyist","score":234,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You mean the streaks I only notice when people are driving towards me and blinding me?  Those streaks?😂","score":145,"comments":[{"body":"The astigmatism simulator? I thought that was a feature of all cars 😂","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Clean the inside of your windshield in a different direction than the outside, that way you know where the streaks are that you missed. I wipe left/right on the outside and up/down on the inside.","score":50,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Are you a California resident, quitting Twitter and deleting your account? You have the right to request that Twitter delete all personal data retained about you and your account.","not_safe_for_work":false,"locked":false,"body":"There’s a handy form for this here that will auto-draft the required email for you: https://yourdigitalrights.org/d/twitter.com\n\nMore detail on Twitter’s obligations under the California Consumer Privacy Act (CCPA) here: https://oag.ca.gov/privacy/ccpa#:~:text=Businesses%20do%20not%20have%20to,your%20request%20through%20that%20account.","score":55138,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"[removed]","score":3092,"comments":[{"body":"&gt;europe\n\nEU, EEA and still UK. UK has vowed to ditch the GDPR (https://egr.global/intel/news/uk-government-to-ditch-gdpr-in-favour-of-post-brexit-system-in-potential-headache-for-industry/)\n\nSo not Albania, Ukraine, and about 10 more countries in Europe.","score":790,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You can request, but nobody is in the office to follow through with your request","score":3137,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Is there a similar form for Facebook?","score":481,"comments":[{"body":"[removed]","score":263,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You can request it, all right.","score":785,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Side thing happened to me today. I was trying to delete my account on an app and it wouldn’t let me.  I then changed all my information to an old California address I had and SUDDENLY at the bottom of my account information was a “delete my account” option.\n\nCompanies won’t do the right thing unless they are made to do the right thing.","score":472,"comments":[{"body":"Yeah. Aside from CCPA, California has strict laws around subscription messaging. Place I work for needs specific \" Cancel my Subscription\" copy for CA folks, because the normal button does the same thing but has a slightly more misleading name. For CA it has to say cancel or delete and has to be the top of the flow - so you can't click that and the offer the user 30$ credit to stay or something.","score":101,"comments":[{"body":"Yes, on /r/boston this is well known as the only way to cancel your Boston Globe newspaper subscription without having to wait on hold for over an hour and listen to multiple \"offers\". Just change your address to a random fast food franchise in CA","score":54,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Look at trade skills as a start before going to university.","not_safe_for_work":false,"locked":false,"body":"Trade skills are growing in demand right now and expected to exceed job growth year over year in many skillsets with many paying up into the 6 figures.\n\nWhen looking at education many people say to start at a community college to save money and the advice should go even further and say do an applied associates degree at a community college in whatever you want to learn. This will give valuable experience, hands on skillset, improve confidence and understanding, and make the rest of your education more rewarding. Plus if you struggle in university or decide that it is not for you, you have a fall back plan that can pay extremely well and have learned skills along the way that you will use for the rest of your life when if you do your associates in mechanical drafting, landscape architecture, automotive, cabinet making, etc.","score":66,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Not a tip for everyone. If you want to be a tradesperspn, learn a trade. If you want to be a white collar worker, go to college. Suggesting everyone does both is a LOT. They are two very different paths, chose the one best for you. Training for one won't help you train for the other, just choose one.","score":49,"comments":[{"body":"Couldn’t disagree more strongly. \n\nTime as a field guy before becoming a back office guy is a HUGE leg up. \n\nProject management is a great example. If you’ve ever actually ran a commercial Construction project, or even worked as a laborer on one under a halfway competent Super you are MILES ahead of someone without time in the field. \n\nGreat suggestion, OP. But for everyone, but no advice ever is. \n\nThis is the Path I took and I’ve gotten every job I’ve ever applied to. My hands on experience won out over degrees and certs every single time.","score":4,"comments":[{"body":"It doesn't hurt to have both.","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Apprentice to be an electrician! Pays very well, inside work mostly. The work was hard enough to keep my dad very fit, he worked until he was 68 because he wanted to. And raised 5 kids with his debts paid out before he was 40. He could have switched to lighter work but he liked what he was doing, by then a master electrician.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Lpt: don't care about your back or body? Want to have aches and pains when your 40? Go to school for manual labor jobs. They pay almost as well as university educated job!\n\nOr if your able to go to university, go! \n\nI have a friend who takes home as much as I do as a captenter and I'm an engineer. He also works longer hours and his back is constantly hurting. His dad who has been a carptener his whole life has more back issues than I can count on both hands. Money isn't everything!! The quality of life your job brings is also substantially important.","score":16,"comments":[{"body":"You know how many office workers have back issues from sitting extended periods? It’s a lot, and it hits at about the same age. Ditto to the overtime, except usually without more pay as you are likely salaried rather than hourly. \n\nI’m in IT but spend a good chunk of my leisure time hanging with people in trades and such. We’re all about equally old and busted up. There are some sweet spots though on both sides. \n\nLike crane operator is a sweet ass deal money wise, damage wise it’s similar to office worker plus the risk of crane collapse, but with more posting in a bottle. Manufacturing engineer is a good combo of physical work and avoiding the more high risk tasks. The real main difference I’ve noticed between office work and trades is how bad your hands get beat up. That and the risk of accident. \n\nAlso don’t do stupid shit if you work in trades. Most of the guys I know with problems stems from doing stupid, unnecessary shit before they wised up and got more serious about the long haul and not messing up their bodies any more.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I was telling someone this the other day. If there's anything I could change about my career path, it would be to pick one that is more standardized. Meaning, the same work and skills no matter which company you work for.\n\nI work in tech as a Technical Account Manager, and I pretty much learn a new job anytime I change companies. I have to learn the software, and how they manage customers, as well as how to find the data I need, and much more. I wish that I had picked something that I don't have to relearn at every company.","score":2,"comments":[]},{"body":"I hope whoever reads this takes my opinion and at least considers trades. \n\n\nI cannot agree more with OP. I’ve got so many friends in both fields. The friends that work in plumbing or electrical make a substantially better living than those with a 4 year degree. \n\nEvery trade is in need right now. If you love cooking, consider a chef or baker apprenticeship. Same for anything really.\n\nEdit* I forgot to mention that I am a small business owner and see the need for tradesmen on a daily basis.","score":4,"comments":[{"body":"I want to see tradesmen making 100k+ at the age of 22 like many people out of college are getting","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: If you tend to forget your daily vitamins, try taking them before bed and putting lip balm on immediately after.","not_safe_for_work":false,"locked":false,"body":"While you’re laying in bed trying to fall asleep, you may notice you have terribly dry lips all of a sudden and remember that if you didn’t put on your lip balm, you forgot your vitamins. \n\nWarning: you might just say fuck it and fall asleep anyway.","score":5,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]}]},{"title":"LPT: Always have a note taker with you when you go to the ER. It is supremely important you have a witness and you keep track of absolutely everything that happens while you are there no matter how innocuous something seems.","not_safe_for_work":false,"locked":false,"body":"To avoid getting too deep into things I’ll keep it short. Everyone knows the US healthcare system is “weird” to put it lightly. This isn’t to shit on hospitals, they’re important. This is just to give people a bit of an edge. \n\n\nHaving worked with clinical risk managers let me tell you some of the top rated hospitals for care have the most cases of medical malpractice. They just have very unique and creative -sometimes obsolete ways- to fuck lawsuits over.\n\nEdit: it has been brought to my attention that not everyone has someone that will be with them in the ER. This LPT will not help you. All I can say is you have to take on that role if it is possible for you to do so.","score":5,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Absolutely everything?","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Like…a person?\n\nMate, I don’t have people like that.\nI barely have people.\nI am *pathetic.*","score":1,"comments":[{"body":"Man, that fucking sucks. And no you’re not pathetic. It happens. \n\nI don’t have many friends anymore. I work a solitary job so we’ve all drifted apart. Life is what it is. You got this shit. Stay cool.","score":1,"comments":[{"body":"\n\nEdit: since posting this I have gotten very drunk so if something comes off as rude blame drunk me not sober me.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"This is a great tip! It's not the OPs fault everyone commenting is being a jerk. Take it for what it is as it applies to you. Don't take it out on OP if you don't have someone who would go to the ER with you.","score":1,"comments":[{"body":"You’re cool. I need more of you. Thank you.","score":1,"comments":[{"body":"Haha! Much appreciated. Keep being you and sharing important info!","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Yes, coz we always get to “plan” trips to the ER","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yeah I'll just call my best buddy and wake him and his wife and kids up so he can drive 20 miles to the hospital at 3am to sit there with a spiral notebook he got at CVS on the way and sit with me for six hours in the waiting room and write down everything that happens and then call his job saying he won't be coming in that day and then be thrown out of the examination room because he isn't immediate family plus he's in the way.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: If you're struggling to force yourself to do a tedious task, try concentrating on the first step of this task. I.e. insted of thinking \"I have to vacuum the house\" think \"I will go to the closet and pick up the vacuum\" and then your \"autopilot\" will kick in.","not_safe_for_work":false,"locked":false,"body":"","score":3762,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"My Roomba's name is Roswell. There is the moment when you are sitting on the couch and Roomba turns itself on and goes out and starts working. You appreciate it because it works hard for you, and it deserves some kind of recognition so I drink a beer for it!","score":183,"comments":[{"body":"Did you name it Roswell because it kinda looks like a flying saucer?","score":21,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Sadly this never works for me because I will take out the vacuum, lean it against the cupboard and dust my hands off, job done - that's all I agreed to. And then I will trip over the vacuum every time I walk by ad infinitum.","score":117,"comments":[{"body":"Yeah i feel like this makes the task more daunting. Vacuum the living room is one thing. Get the Vacuum out, plug it in, pick up the shit that cant be vacuumed, move tables to access everything... you get the point.","score":20,"comments":[{"body":"If someone can move all the stuff for me then vacuuming would be the easiest thing, could be done in less than 5 mins.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"ADHD in a nutshell. thats what my mind goes to immediately is all of the small steps. not just vacuum the living room, but the whole process laid out in individual steps. add on top of that a lack of time awareness, and each step automatically seems like it will take 5 minutes. so just one room takes an hour to vacuum, at least in my head, so i have to plan for an hour. but wait, i also have to take into account relaxation time after and mental warm up time before that. so now one room takes a 2 hour block of planning","score":11,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"I sometimes set a timer for eight minutes. I found it that’s ideal because it’s not too long, but I can usually get a lot of things done in eight minutes.","score":37,"comments":[{"body":"Yeah, I just left a similar tip! “I have to vacuum” is a really overwhelming thing to think when you’re not feeling productive. “I’m only going to vacuum for eight minutes, then it’s back to the couch” is a much nicer thing to think.","score":13,"comments":[{"body":"For me, it’s the dishes. If I promise I’ll only do them for eight minutes, I’ll start and finish.","score":11,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Search for escheatment+your state you may have unclaimed property/funds in your name.","not_safe_for_work":false,"locked":false,"body":" For instance my grandmother bought stock in her company and had a  custodial account for me. Well the dividends weren't reinvested and  instead were mailed in checks which were filed when I was younger and  forgot about when I was older. The unclaimed funds went into escheatment  which means they were transferred to a feduciary under the care of the  state.","score":10,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"This is actually pretty solid advice. Each state has their own website or process for claiming this. In the last decade I lived in 5 different states and somehow every one I checked I got $200+ bucks from random stuff like utility companies overcharging then sending the extra money to...the city and not me.","score":1,"comments":[]},{"body":"An actual Life Pro Tip??? Say it ain't so!!!","score":1,"comments":[]},{"body":"This is legit. I used to work for a probate lawyer. One of the steps we had to take with each estate was checking in with abandoned property for the states they lived in. Spend your money while you're alive.\n\nWhen I searched myself I found a check from an old job that they swore didn't exist.","score":1,"comments":[]},{"body":"You can also search missingmoney.com and avoid searching individual state websites.","score":1,"comments":[]}]},{"title":"LPT: When someone gives you a compliment, accept it. Don't belittle yourself by saying \"oh I don't know about that\" or \"I'm not sure about that\" or \"yeah right\".","not_safe_for_work":false,"locked":false,"body":"","score":4675,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"If you simply refuse to believe the basis of the compliment is valid, just say:\n\nOh, you're very kind to say that!\n\nIt's thankful, and allows you to exit the interaction without actually agreeing with them. If you must ...","score":915,"comments":[{"body":"I started using this response about a year ago as compliments always made me uncomfortable/saying just “thank you” also felt uncomfortable as in “yes I agree!” So I started saying “oh thank you, that’s really kind of you to say” and move on.","score":196,"comments":[]},{"body":"Also doesn't entrap you into feeling as though you have to return a forced compliment of them, because you've just pointed out their kindness.","score":63,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"What is an appropriate response? Whenever I just say thank you, I feel sort of big headed so I try to follow up with a compliment to them","score":213,"comments":[{"body":"Of course you feel big headed. Someone just said something nice about you. There is nothing wrong with that.","score":137,"comments":[]},{"body":"You‘re supposed to feel big headed that‘s what a compliment is for","score":55,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It depends on the culture and personalitues, besides its not like its a make it and lose it situation","score":41,"comments":[]},{"body":"In some cultures, deflection of compliments is expected, and simply accepting them makes one seem a bit full of themselves.","score":160,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“Here’s a dime. Call my mother.”\n\n- A response from back in the days of the pay phone.","score":88,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: If you lost your phone sign into your google account and google \"Find my phone\" and the website will pop up that turns your phone volume on to max volume and ring it for five minutes. You can also look at its location on the map and sign out of your phone and lock it if it was stolen.","not_safe_for_work":false,"locked":false,"body":"","score":17,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Additional LPT: If you have an Amazon Echo you can get a skill to call your phone when you ask. For someone who loses their phone daily, this is a gift from the digital gods.","score":3,"comments":[]}]},{"title":"LPT: Put grapes in the freezer for a delicious frozen (and healthy!) treat.","not_safe_for_work":false,"locked":false,"body":"I like using cotton candy grapes.","score":81,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Or buy frozen fruit. They're flash frozen (as opposed to slow freezing in a domestic freezer).\n\nFlash freezing = smaller ice crystals = less rupture within the cellular structure of the fruit = better texture.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I use frozen grapes for healthy munchy food. Great for cottonmouth and hunger.","score":5,"comments":[]},{"body":"I can feel my teeth hurting while they scrape along the ice like nails on a chalkboard","score":13,"comments":[{"body":"Nah they go kind of ice mushy. Almost like frozen yoghurt texture, but a bit harder. I'm not explaining this very well, but the point is they don't go hard like ice.","score":17,"comments":[]}]},{"body":"Vittoria grapes work really well for this as well. I always have a punnet in the freezer for snacking.\n\nI recommended them to anyone looking a sweet treat but who can easily demolish an entire punnet of fresh grapes in 15 minutes like me.","score":3,"comments":[]},{"body":"I do the same with raspberries, you can suck them like a sweet","score":2,"comments":[]},{"body":"Freeze them using dry ice for carbonated frozen grapes","score":1,"comments":[]},{"body":"Except for winter months, we usually have frozen grapes on hand. They are awesome as a hot -weather treat. Is true they're loaded with sugar... But, assuming you eat only a normal amount, they're still better than junk food.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: when someone important to you tells you their birthday, write it down","not_safe_for_work":false,"locked":false,"body":"It’s about the little things. \n\nAnd remembering someone’s birthday is a little thing that will mean a lot to them! So when someone tells you their bday, write it down in your calendar app and set a yearly reminder so you can be prepared. ☺️\n\nP.s writing things down in general when someone tells you stuff about them like their address, what they like, or their job title will most likely come in handy to you so take a quick sec to jot it down in their contact info on your phone or in a notes app!","score":231,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"The biggest lie I've ever told myself is....\"You dont have to write that down\".","score":4,"comments":[]},{"body":"If I don't write it down, I'll forget it. But if I write it down, I'll forget where I wrote it. And also forget what I wrote.\n\nThe thing to do is to create an event on Google calendar, or whatever calendar you use, that recurs annually and has the person's name and (if you know it) year of birth.","score":18,"comments":[{"body":"[deleted]","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This goes for weddings and such as well. Get a wedding invitation? Put it on your calendar as an annual event, with reminders and make note of the year.","score":3,"comments":[]},{"body":"Same to all this, brother.","score":2,"comments":[]}]},{"body":"I store it in their contact card on my phone. I even have contact cards for people with no phone number just to store their birthday.\n\nThis automatically syncs to my calendar, and is visible on my computers as well.","score":3,"comments":[]},{"body":"I just put it into Google calendar and set it up to remind me every year","score":2,"comments":[{"body":"Pro tip: set a reminder for a week before so you have time to get a gift/card","score":3,"comments":[]}]},{"body":"Not an issue for me as I don't do birthdays.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: replace “if” with “that” when you apologize. It’s an easy adjustment that shows you take responsibility. Ex: I’m sorry that I hurt you, vs. I’m sorry if I hurt you","not_safe_for_work":false,"locked":false,"body":"","score":114,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"And the thing is, internalize this. It isn't just about the words you say, it's not a matter of grammar. People can usually tell if an apology is sincere or not. Even if you \"say\" it the perfect way, if what you mean is a passive-aggressive non-apology, people will generally realize that.\n\nIf the underlying problem is that you just can't bring yourself to apologize, that you just don't really believe you did anything wrong, then why are you going through the motions. You should instead just honestly say, I don't care, I don't accept any responsibility, I did nothing wrong.\n\nStop being a child. Before you say the apology out loud, have an internal conversation and realize and accept that you made a mistake. That's more important to the apology than the grammar of it.\n\nBefore you say \"I'm sorry that I hurt you,\" say to yourself, \"I accept that I hurt this person.\" Before you say, \"It won't happen again,\" think to yourself, what am I going to change about myself so I stop doing it, what do I accept is negative behavior on my part that I need to improve.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Just remove “if” and leave it like that. “I’m sorry I hurt you”","score":19,"comments":[{"body":"Removing if is the same as using that\n\nThe point was that if can sound like it is questioning or inferring","score":4,"comments":[]}]},{"body":"They are two different statements with different meanings.","score":10,"comments":[{"body":"I'm sorry you felt hurt","score":3,"comments":[{"body":"Im sorry u a puss","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Also, never make an apology using the word \"but.\"  Use of the word \"But\" in an apology makes it conditional which should always be avoided when making a true apology","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"If\" the shoe fits, wear it! \"That\" would imply it does fit. The recipient should have the option. \n\nEx. I'm sorry if/that you are so emotionally weak, that everything gets you butthurt. (🙃😉😉😂).\n\nSometimes it's just best not to imply but give the recipient the option to figure it out. 🙃🙃","score":2,"comments":[]},{"body":"Insults can only be taken, otherwise they are toothless.\n\nInsults can also be taken when no insult was meant.\n\nIf someone is insulted by something you did even though you had good intentions, the PROPER thing to say would be:\n\n\"I am sorry you have hurt feelings.\"","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Call The \"Questions/Comments\" Number To Receive Free Stuff","not_safe_for_work":false,"locked":false,"body":"LPT: Call the \"Questions/Comments\" phone number that is found on many consumer products and tell them how much you love their product and often the company will send you free stuff! I've received merchandise, free product, and boatloads of great coupons doing this!","score":7,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"&gt; I've received merchandise, free product, and boatloads of great coupons doing this!\n\nLet's read about it.","score":3,"comments":[{"body":"Just did","score":1,"comments":[]}]}]},{"title":"LPT: Don't try and change people's travel plans once they tell you what they are.","not_safe_for_work":false,"locked":false,"body":"With the holiday seasons on the way just wanted to say this. In my family I'm sort of an outlier where I was born in one part of the country yet most of my family lives in another. Almost without fail anytime I tell family, or even friends sometimes, my travel itinerary they'll start throwing around that I should stay longer or come in earlier etc. It's beyond infuriating. I don't think they do it maliciously but my family basically never visits me so they have no clue how hard it can be to setup flights and arrangements for trips etc. Especially during the holidays. \n\nAlso once I get places they love to say \"oh you took Southwest, you can just change your flight for free!\" or something to that degree. Not thinking about that I either have my dog in boarding or someone is watching them or a million other reasons why I scheduled the trip as I did. \n\nAgain I don't think in most cases people are trying to be mean with these questions or ideas but traveling can be very stressful so just be thankful you have people visiting and enjoy the time they've set aside for you. Happy travels and holidays to all!","score":6,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"LPT:  Stand up for yourself and don't let others interfere with how you conduct your life.\n\nFTFY","score":1,"comments":[{"body":"That might be the core but it's more of a tip for people not to even ask. It's rude.","score":1,"comments":[{"body":"Anybody could ask anything they want.  You don't even need to entertain their suggestion let alone comply with it.","score":1,"comments":[]}]}]},{"body":"I hear you.  My family is the same way.  We always travel there, have never had a Christmas or Thanksgiving in our own home, and they still wanna argue that their side of the family is getting 5 minutes less time than my wife's side. It's been 30 years.  My kids are grown.  I wanna stay home. But will never get to. I don't wanna board my dog and drive 6 hours to eat dry turkey and clean someone else's kitchen.","score":1,"comments":[{"body":"Yeah family can be tough!","score":1,"comments":[]}]},{"body":"Time for you to develop alternate holiday plans every other year.  Let them go to the trouble and expense to see you rather than just showing up on their doorstep.","score":1,"comments":[]},{"body":"They're your family and they want to spend more time with you. Have you tried explaining to them why you planned the dates the way you have? If not, your anger isn't really justified. Since I've been an adult, I've spent more holidays away from family than with them. Every time I tell my grandma I'll be home sometime after Christmas, she asks if I can be there on Christmas. All I do is let her know I can take time off work until after Christmas and she drops it. I don't get mad at her for wanting me to be home when everyone else is","score":1,"comments":[{"body":"Yes of course, this has been going on for almost 40 years.\n\nI'm also not angry at anyone just a tip that pestering people about their travel plans can cause stress that isn't needed. People that don't travel don't always seem to see that.\n\nAlso not everyone has the same budgets as others. Traveling is expensive.","score":1,"comments":[]}]}]},{"title":"LPT : If you ever want to fall asleep, try listening to story narrations with a calm voice and from personal experience, I find listening to scary story narrations on YouTube helps me get a good afternoon nap or to fall asleep in general so I hope this helps","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Works for me as well. Bill Curtis American Justice puts me out in minutes.","score":4,"comments":[]},{"body":"Ya listen to horror stories before sleeping so you dream about it and have a more hard time sleeping after","score":3,"comments":[]},{"body":"I do this. I listen to Master Key Society on YT.","score":2,"comments":[]},{"body":"Fire of Learning works for me.","score":2,"comments":[]},{"body":"For everyone who grew up with Reading Rainbow or just enjoy short stories, I highly suggest checking out Lavar Burton Reads. I listen to it on long car rides and and when going to sleep and it’s great.","score":2,"comments":[]},{"body":"Could you give me some channel suggestions?","score":2,"comments":[{"body":"There are many actually but my favorites are (you can search it on YouTube)\n\nMr Nightmare\n\nMr Creeps\n\nDr Creepen\n\nChilling Scares\n\nLet's Read\n\neven I also narrate stories on my YouTube channel but the channel above have been doing it way better and way longer than me so check the above channels out","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Boring Books for Bedtime is the GOAT","score":3,"comments":[{"body":"Especially the old Sears catalogue episodes!","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Don't tell people the thing they're trying to do is \"easy\"","not_safe_for_work":false,"locked":false,"body":"When you tell someone the thing they're trying to do is easy, their only two options are:\n\n1) To successfully do the thing, but not be proud because it was easy anyway\n\nor \n\n2) To not succeed at the thing that was supposed to be easy, and feel like garbage \n\nInstead try something like \"I think you can do it / You got this etc.\" because then you're cheering them on (and showing faith and support) instead of taking away their ability to have a positive experience. \n\nConversely, talking about something being difficult is great because you're setting the person up for:\n\n1) Success over something that was difficult\n\n2) Feeling okay with the lack of success because they knew the task was tough going in","score":275,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"This is a great tip. My manager at work loves to say \"too easy\" after describing a task he wants you to do. Like, yeah the way you are explaining it sounds easy but each part of the task has multiple parts he isn't considering. Not to mention the overall workload.","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That's easy for the OP to say.","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"As a teacher of high school students, I’m trying to work “easy” out of my vocabulary when describing an assignment. I might use “simple” or “straightforward” and point out a single step that might cause some concern, but my main point is to not overthink the process. Students sometimes freeze up if they don’t seen a clear and immediate path from start to finish. I coach them on breaking down the steps and trusting their instincts. (I teach seniors, and after 11+ years in school, they know how to writes sentences and put a paragraph together.)","score":10,"comments":[]},{"body":"100%.  Large source of my anxiety is telling myself \"This is supposed to be easy\" and just feeling bad I couldnt do it.\n\nOn a lighter note, its also easy to forget what its like to be a beginner at something so a task thats easy for you NOW might not be that easy to someone new.  Alot of video games have this issue with experienced players","score":8,"comments":[]},{"body":"Don't diminish what people are telling you they've done or are going to do. You don't know what other battles they are also facing on other fronts. What's easy downhill slide for you, is an uphill battle for anyone coming at it from the other side.","score":20,"comments":[]},{"body":"Similarly, never say that something is “obvious”.","score":14,"comments":[{"body":"I had too many professors when I was a graduate level mathematics student calling things obvious to the class.  Motherfucker if that was obvious you would be unemployed.   Nothing in a math class should be obvious unless it is prerequisite material.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Never thought about this, great advice ☺️","score":8,"comments":[]},{"body":"I like to say something along the line, “the trick to it is to…”","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Tell people what you like and need. They have no other way of knowing how to get you a gift.","not_safe_for_work":false,"locked":false,"body":"\"For no one can fill, those of your needs, that you won't let show.\" -Lean On Me, Bill Withers.\n\nIt might seem obvious but, we don't always let others know what colors and styles we like. Maybe it's humility but, for the upcoming holidays, it is essential to let others know.\n\nIt can be small but, just because something is purple, I will love it more. If you hand me anything that's purple, you've won me over.\n\nTell people you love your favorite colors, what kind of clothes, interest, devices, etc... you're into. Show them. If you continue to do this, it will make shopping for you much easier and help you find similarities to bond over.","score":13,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I've asked my mom several times for gift ideas and she says don't worry about getting her anything. But, of course, that's not going to happen so then I stress out having no clue what she wants.","score":1,"comments":[]},{"body":"If someone doesn’t know me well enough to know what to get me, then I would hope they don’t bother getting me anything.","score":1,"comments":[]}]},{"title":"LPT Your expired Covid tests might not really be expired.","not_safe_for_work":false,"locked":false,"body":"The FDA was unsure how long tests would last so they erred on the side of caution.  Now that they've had more time to evaluate, they changed the expiration dates of a lot of the iHealth tests (the ones we were able to order free through the post office.)\n\nIn my case, the ones I had that say they expired in August are actually good till Feb of 2023.  \n\nHere's a list of new expiration dates by lot number\n\nhttps://www.fda.gov/media/158007/download","score":14,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Here is the page to look up **all** FDA approved extensions to expiration date, not just iHealth\n\nhttps://www.fda.gov/medical-devices/coronavirus-covid-19-and-medical-devices/home-otc-covid-19-diagnostic-tests","score":4,"comments":[{"body":"Thanks! Good find.  \n\nAnd unfortunately  I can share that they do still work -","score":0,"comments":[]}]},{"body":"😢\nWish we’d known that a few months ago when we tossed ours for being outdated.","score":1,"comments":[]},{"body":"Hey, like 40% of the tests were never good to begin with, so the odds are probably still with you.","score":1,"comments":[{"body":"Source?","score":1,"comments":[]}]},{"body":"Who buys covid tests? What is the point?","score":-8,"comments":[{"body":"Apparently this is difficult for you to understand, but the point of a test that detects covid is the detection of covid.","score":6,"comments":[]},{"body":"So that you can judge if your sniffle or scratchy throat is the beginning of something far worse or if it's alergies. So that you can avoid people or seek treatment if you have covid.","score":2,"comments":[{"body":"When you get flu symptoms you are supposed to go to the doctor and they carry appropriate tests and propose treatment. You are not supposed to buy some tests of questionable quality online and decide that stuff yourself.\n\nAnd when you \"get sniffle or scratchy throat\" you stay home, period.","score":1,"comments":[]}]}]}]},{"title":"LPT: Just because someone disagrees with you doesn't mean they hate you. Even after hearing each other out, you can still agree to disagree.","not_safe_for_work":false,"locked":false,"body":"","score":292,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"First time on social media?","score":46,"comments":[]},{"body":"How is this even a real post?","score":9,"comments":[]},{"body":"It depends what they're disagreeing with you about.","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Good thing to remember. Sometimes things said will be the result of human nature. If you can identify the fact that people turn reactive when they feel they’re being attacked, it’s much easier to look at the argument like an outsider.\n\nOf course, there’s certain things I can’t compromise on since it’s more in the realm of human rights.","score":6,"comments":[]},{"body":"Definitely depends on *what* they’re disagreeing about.\n\n\nAgree to disagree only goes so far.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nazis, white supremacists, and other rights infringement is nothing to disagree about. There's just absolute moral right and wrong for some issues.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If you're talking politics than I assume you haven't had people try and take your human rights away from you on the basis of how you were born.","score":12,"comments":[]},{"body":"My neighbor and i had the most civilized disagreement i have ever had in my life. He was an antivaxer and im not. He explained his reasoning, and i told him my wife and kids and i had all our boosters with no complications and it was the right choice for us, i felt. It left me in awe.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Ah. It's u. My Nemesis.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT Request- What to do when your ear feels watery?","not_safe_for_work":false,"locked":false,"body":"Any tips?\n\nGot out of the shower an hour I go and one of my ears feels watery especially when I touch or move it too. \n\nThanks!","score":1,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Like water in it? \n\nRubbing alcohol.","score":1,"comments":[]}]},{"title":"LPT: Stop complaining and start thinking of solutions.","not_safe_for_work":false,"locked":false,"body":"If you have a problem, it likely won't go away just because you tell people about it. Think about your problem, what's causing it, and think about ways you can change the situation. Even if you can't completely solve the problem, you can at least make it more manageable.","score":1,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]}]},{"title":"LPT: Carry a small bottle of spray foam insulation with you instead of pepper spray","not_safe_for_work":false,"locked":false,"body":"They’ll never open their eyes again.","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]}]},{"title":"LPT: Your day begins the night before.","not_safe_for_work":false,"locked":false,"body":"If you’re planning on implementing a new schedule/routine, or even preparing for an important event, be sure to start with the night before. Prioritizing the night’s rest as your jumping off point of will give you the proper perspective to be well-equipped for what comes the following day.","score":41,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]}]},{"title":"LPT: For a streak-free inner windshield, spray some diluted dawn dish soap and use a squeegee for a crystal clear windshield.","not_safe_for_work":false,"locked":false,"body":"...way less time and effort than using newspaper of microfiber towels.\n\nPut a towel down on the dashboard to catch the drops from the squeegee and wipe the excess around the frame","score":3,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"\"For a clean windshield, clean the windshield.\"\n\nThanks","score":3,"comments":[{"body":"If that's your take away from the LPT...\n\nYou're welcome! :)","score":1,"comments":[]}]},{"body":"I spray straight vinegar on the windshield and wipe with a clean terrycloth towel. After it's dried, I vigorously buff the windshield with a clean, dry terrycloth towel. Terrycloth is just abrasive enough to physically remove dirt. The vinegar cleans very well and removes any hard water deposits. The buffing removes any streaks/smears. Both inside and outside.","score":1,"comments":[]}]},{"title":"LPT: If you do good, for good, then you'll be good. Doing the right things for the right reasons can allow your story to trend in an upward direction. Develop your compass, test it, then follow it.","not_safe_for_work":false,"locked":false,"body":"Edit: Yes, Sociopaths exist. Yes, evil corporations sometimes win. Yes, bad people think they're also right. That's game theory and ultimately will happen in life. Alot of \"what ifs\" and \"yeah buts\" in the comments. I get it, but this advice has helped me and I've seen it help many others (young and old). Generally speaking people will be inclined to spend more time with you, invest in you, develop relationships if you do right by them and you're genuine in intent. You should also do right by yourself and give yourself a seat at the table, it's your life after all. Almost all of the statements mentioned in the comments could also be true. Its almost like a billion ideas can exist simultaneously and not be any less valid than their counterparts. What would your suggestion be for success then?...\"Do the wrong thing for the wrong reason.\" Much better.","score":28,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"The problem is that mostly every one thinks they're doing the right/good thing. So your advice is kinda specious at best.","score":8,"comments":[]},{"body":"This conveys literally zero information.","score":14,"comments":[]},{"body":"Wow. The haters came out quickly!","score":1,"comments":[{"body":"Out of the woodworks. \"Well actually...(insert negative outcome example here)\" /shrug","score":1,"comments":[]}]},{"body":"??? Is that why the cruelest and most ruthless people rule the world? Do you know that if an employee fucking dies at work and the buisness continues running as normal, not even giving direct witnesses a day off, the stocks for that company go up because the shareholders can see that the company values profit over human life? \n\nIs that why the precious metals in all the electronics you use were mined by slaves but the American and European companies who buy the metals don't give a fuck at all because they get them cheap? \n\nNestle. \n\nChevron formerly Texaco. \n\nNo man. Fuck no. If you want to succeed you better be ready willing and happy to sell your mother to devil for coupons and a sandwich.","score":3,"comments":[{"body":"Is it a panini?","score":1,"comments":[]},{"body":"Have you employed doing the wrong thing for the wrong reason? How well has it served you if so?","score":1,"comments":[{"body":"No. \n\nEvery time I speak I want the truth to come out.\n\nMy soul is not worth any amount of money. \n\nThat's why I carry heavy things and fix dirty broken shit for a living. Because I can't do math and I hate computers and I will be damned to hell by God if I lie for a living.","score":1,"comments":[]}]}]}]},{"title":"LPT: Put up the artificial tree while it's still in the bag","not_safe_for_work":false,"locked":false,"body":"If you've been storing your artificial tree in several bags, put up the bottom section first, then only pull the end of the center pole of the next section out of the bag, pick up the whole bag and put it on the bottom section.\n\nIt's a lot easier than trying to juggle all those flopping branches. If it's pre-lit, you'll do less damage to the wiring.","score":1,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"One wouldn't put the top section first, would they?  That would be a short tree or a grossly disfigured one.","score":1,"comments":[]}]},{"title":"LPT: Time to start the turkey thaw process","not_safe_for_work":false,"locked":false,"body":" If you have a frozen turkey for thanksgiving, now is the time to plan  the refrigerator thaw.  At 1 day per 4-5lbs your 20lb ones should be  going from freezer to fridge today.  Make sure to put in near the  bottom, double bag it, and put it in a container that will catch all the  juice so you don't ruin your fridge.","score":9672,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Had to do the water dunking technique when my wife wanted turkey last minute. Bought a 20lbs frozen turkey 2 days before thanksgiving. Had to spent most of the night and day putting it in cold water and changing out the water every 30 minutes. Turkey turn out great though.","score":933,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I saw this and immediately thought no one thaws a turkey a month out from Christmas. Then realised you guys eat turkey for Thanksgiving and that’s right around the corner!","score":2542,"comments":[{"body":"As a Canadian I too was thinking it's a bit early to thaw your Christmas turkey.","score":224,"comments":[{"body":"...at 1 day per 4-5lbs your 175lb ones should be  going from freezer to fridge today.","score":186,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"How to defrost turkey safely, and by poundage: https://www.usda.gov/media/blog/2016/11/18/how-safely-thaw-turkey#:~:text=The%20USDA%20recommends%20thawing%20your,about%20four%20days%20to%20thaw.","score":221,"comments":[{"body":"How does this website try to recommend a “Cold Water Thaw” and then not give you the temperatures related to the Danger Zone so you know what a “safe temperature” is?\n\nKeep the water temp below 40*F or 4*C (Danger Zone is 40-140*F or 4-60*C)","score":110,"comments":[{"body":"It also says not to thaw it in your dish washer (with or without water)","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"So from that link I learned:\n\n1. The USDA recommends putting foil in a microwave.\n\n2. I shouldn't thaw my turkey on the back porch, garage, paper bag, garage bag, or dishwasher.","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You're a literal fucking lifesaver my guy","score":182,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: get a cheap window vacuum to quickly eliminate window condensation and reduce the chance of winter mould growing.","not_safe_for_work":false,"locked":false,"body":"When it gets cold outside the inside of old windows often gets coated in condensation which can increase the risk of mould growing.  A quick 2 mins with something like the Karcher window vac (or similar) in the morning/evening/both depending on how humid your home is will get rid of the vast majority of that moisture. Cheaper and quicker than running a dehumidifier all day.","score":3,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"The presence of condensate indicates an exchange of warm air for cooler air.\n\nYou have a leak. Fix that problem and you won't need to suck your windows.","score":4,"comments":[]},{"body":"Or, hear me out, just use a towel.\n\nWhy is there some useless gadget for everything?","score":15,"comments":[{"body":"I was going to say the same. When towels start wearing thin, just cut them down to all purpose house rags. *That* saves money.","score":4,"comments":[]},{"body":"To be fair though, if you use a towel you then have to dry the towel and if you don’t have outside space that just releases the water back into the air in your home.","score":-2,"comments":[{"body":"Sounds like something Big Window Vac would say. I'm on to you!","score":7,"comments":[]},{"body":"&gt; releases the water back into the air in your home.\n\nDo you ever, like, *open your windows*?","score":6,"comments":[]},{"body":"Houserags just go into the laundry to be reused.","score":2,"comments":[]},{"body":"Or, just, you know, wring it into the sink.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Could be useful, especially the cordless variety in an RV. I'd never heard of one until now and it'd be a dream tool in an RV.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: if you are in the process of losing weight and you want to add some exercise, bike is a good alternative to walking and running.","not_safe_for_work":false,"locked":false,"body":"1. Bike takes impact load from your knees and hip joints. Being running while being overweight can be very bad for your joints, don't swap one health problem for another\n\n2. Bike helps you if you have flat feet. As someone who has been overweight since early teens i have developed flat feet. I get serious calluses, the soles of my shoes get holes very quickly and sometimes my feet just hurt from too much walking. The bike takes these problems away, as your feet just rest on the pedals and don't do any walking.\n\n3. Bike will cool you down in the hot weather with incoming air stream. You probably sweat a lot and don't take heat too well, you're gonna need it. Just remember that bike cools you down in cold weather too and prepare accordingly.\n\n4. With bike you can go much farther than with your feet. You can visit more interesting places, plan different routes and make your training more enjoyable.\n\n5. Biking is enjoyable in general. The feeling of going consistently fast, feeling in control, shifting gears etc. At the end of a trip i often feel worked out and exhausted (i.e. having burned a lot of calories) but during the trip I'm so preoccupied I don't notice that I'm getting tired, which is the best.","score":19,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Agreed. When the weather is bad I ride an exercise bike. I watch a video on my phone as I pedal and the time passes easy.","score":3,"comments":[]},{"body":"If you have a bad back swimming is great.","score":3,"comments":[{"body":"Oh well, I wish I could swim to work every day :).\n\nBest thing about bike is that you can use it for commuting. Better health AND saved money (and sometimes even time, if you live somewhere with cars clogging streets)","score":0,"comments":[{"body":"They are great but after blowing out a disc at 33 I couldn't ride anymore.","score":2,"comments":[]},{"body":"while you apparently are a huge bike fan, the upper reply still stands. While biking is good cardio and for the leg muscles, swimming helps with many more muscle groups. And especially for people with bad backs, swimming is great.","score":2,"comments":[{"body":"Yes, swimming is great as activity itself, but it requires a lot of planning and effort around the activity. I mean, you can't just get out and swim when you feel like it, unless you are living in some warm paradise near the lake.\n\nBest exercise to be healthier is something that you can do easily, all the time and without special planning. In my case, 1 hour of swimming equals around 2 hours of time spent (commute to the pool, changing, shower etc.), and unfortunately sometimes there are too many people in the pool to actually enjoy it. I love going swimming in the summer, when I can just go to a lake and swim leisurely.","score":1,"comments":[]}]}]}]},{"body":"P.S. buy a foldable handlebar, it's great","score":2,"comments":[]},{"body":"Yes, I never got on with the gym or running but a long cycle was fine. I like how it gets mixed up too, OK so you have a hard uphill but you can just sit there and let gravity do the work at other times. You can plan bigger loops, it is also a valid commuting option to get exercise in for \"free\".","score":2,"comments":[]}]},{"title":"LPT: If lack of motivation is keeping you from getting something done? Try this...","not_safe_for_work":false,"locked":false,"body":"Instead of being defeated mentally by the idea of having to do that unfun task around the house, try focusing on the good thing(s) it will produce.\n\n**EXAMPLE:** *cleaning up that corner of the garage is a damn hassle... but finally having my hobby area all set up is gonna be AWESOME!*\n\nFind the positive and focus on that.","score":25,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Atomic habits: make it rewarding","score":5,"comments":[{"body":"Wish that I internalized all these ideas tbh. I read the book before, but I completely forgot to put it into practice.","score":1,"comments":[]}]},{"body":"I mean, sure, if I do that thing it will be awesome in the future. But if I procrastinate now it will be awesome now.","score":1,"comments":[]}]},{"title":"LPT Request: What motivates you in life?","not_safe_for_work":false,"locked":false,"body":"To me, life is boring.","score":6,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Curiosity. I treat life like a videogame. It may not be the most interesting one and has lots of dumb phases, but it can be fun to discover new things, abuse the mechanics and you are constantly challenged by massive amounts of new DLCs.","score":9,"comments":[]},{"body":"Nothing. I just get busy everyday and can't spend much time thinking about motivation and life in general.","score":6,"comments":[]},{"body":"The uncertainty of trying new things and the challenges it throws at me","score":2,"comments":[]},{"body":"&gt;To me, life is boring.\n\nOpen yourself to new experiences. Try out new things. Idk, ever been skydiving? Ever been to poetry reading? Ever been dancing? Tried martial arts? Learning a new language? Had fun with Arduino?\n\nThere is so so much you can do and experience in life no matter your status. *Your* life may be boring, but *the life* is anything but.\n\nWho wants finds a way, who doesn't, finds an excuse.","score":2,"comments":[]},{"body":"One main thing that keeps me going is learning / challenge. Learning new hobbies, skills, even video games - any kind of skill mastery is where my motivation and satisfaction comes from.\n\nBesides that, helping people. Life sucks and I can make it easier for others. That makes me happier, so these 2 things are my main focuses","score":2,"comments":[]},{"body":"Happiness but also integrity &amp; taking care of my kids!\nI make goals for myself. The gym is my home away from home.\nThe old saying go's \"Attach your happiness to a goal, not a person or thing\"","score":2,"comments":[]},{"body":"My motivation seems to be that I want to make my mark upon this world. To not be easily forgotten. To be unique. Not just with family, but in books as well. Personally, I've been mentioned in one book, had another dedicated to me (will not disclose, do not ask), am writing my own book based on my favourite songs, and am also working on a Guinness world record. I want to be someone that my kids and family can easily research.","score":1,"comments":[]},{"body":"To create an easier life for my children than I lived as a child in poverty","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT - If you have a hard time getting the week started, treat yourself with a favourite snack every Monday morning.","not_safe_for_work":false,"locked":false,"body":"Mondays can be hard to look forward to, and you might have trouble getting the motivation for it. Maybe you have a tough day of work ahead, or an exam you'd rather not take.\n\nHere's my tip: give yourself something to look forward to in that Monday, and replenish your serotonin with your favourite food. Head into a café near your worksite, or keep a couple of your favourite sweets in your pantry, ready to take and eat on a Monday morning.\n\nWorst case scenario, you just ate something you like - and chances are you might be feeling a little better, or maybe even motivated to get some work done.","score":3,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I got fat by eating to make myself feel better","score":4,"comments":[]},{"body":"I used to get my favorite pizza on a Monday. Really does help with the mood! Why save good things for a Friday/Saturday - you're already happy then!\n\nAs an additional LPT, do something fun on a Thursday, too. The week'll fly by.....","score":3,"comments":[]},{"body":"isn’t that just coffee everyday…?","score":1,"comments":[{"body":"Without the addiction factor, and maybe less expensive. And well, some people out there don't drink coffee - I know I don't.","score":1,"comments":[]}]},{"body":"\"Head into a bar near your worksite...\"\n\nYeah, that will work out well.","score":1,"comments":[{"body":"Sorry, language barrier. A \"bar\" is more easily associated with a coffee shop where I'm from.","score":1,"comments":[]}]}]},{"title":"[LPT Request] How do I stay awake at work","not_safe_for_work":false,"locked":false,"body":"Everyday at around 10-11am I become extremely tired for some reason. Ive been getting good sleep and been eating enough food, what can I do? I sleep at 9pm and wake up 4-5am, go to the gym and start work at 8.","score":12,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"If your workout is intense, you could be crashing from adrenaline and stuff. You could try working out after work.","score":23,"comments":[{"body":"This was my solution to the problem. When I had an office job I'd hit the gym immediately after work, then go home and have dinner. Normally I'd crash by around 10pm at the latest.","score":6,"comments":[]}]},{"body":"What about going to the gym after work and  getting some more sleep in the morning?","score":12,"comments":[]},{"body":"Sounds like low blood sugar. Most people normally get it around that time of day.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"sounds like you need a snack. morning workouts work great but they're depleting. you *will* notice that some hours later. eat nuts or jerky unless you want to be the psycho with chicken thighs in their pocket. 🙏","score":8,"comments":[]},{"body":"Peanut butter is the answer to everything. Unless one is allergic to peanuts.","score":6,"comments":[]},{"body":"I am hypoglycemic. It affects me earlier in the day and I have learned that drinking milk or eating a cup of yogurt helps tremendously. If you are feeling shakiness and a bit disoriented as well as drowsy I'd recommend you get your blood sugar levels checked. I had to monitor my glucose levels for 90 days and that's how I found out.\n\nI also recommend those Sargento cheese and nut snack packs. Steer clear of sugary foods though. That's a recipe for disaster.\n\nGood luck!","score":3,"comments":[]},{"body":"Would chewing gum help keep me awake? Or should I bring in some little bars?","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Try reducing carbohydrates for a couple weeks. Insulin resistance can make your body dump a lot of insulin in response to sugars, and the high insulin levels can make you sleepy.\n\nProtein breaks down a lot slower so it doesn't provoke the same response.  Think eggs for breakfast instead of cereal.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: take photos of oven turned off, hair straightener not plugged in, etc before leaving for trip to calm anxiety","not_safe_for_work":false,"locked":false,"body":"Used to always leave and fear that I forgot to turn the oven off or the heat down or lock the back door and would worry about it on the plane so I started taking photos of things locked, shut off, etc. to not worry!","score":43,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Started doing that a few weeks ago with the iron - super helpful. I was always wondering if the apartment (not mine) was fine xD","score":4,"comments":[]},{"body":"With that level of anxiety you'll need to take a thousand photos.","score":8,"comments":[]},{"body":"Lol.\nI do know the feeling.\n\nIf it's a big trip I have a checklist of things I want to take, and a list of things to check right before I leave.","score":3,"comments":[]},{"body":"Just don’t forget to take any of the pictures or you’ll be screwed.","score":3,"comments":[]},{"body":"I think this could be a short term solution, the next step would be challenging the anxious thoughts and working towards self reassurance.\n\nI get the horrors and convince myself I’ve left the oven on and unlocked the front door. It’s exhausting 🙃💕","score":2,"comments":[]},{"body":"nice, now I can leave my oven, hair straightener, etc turned on when I leave for a trip and not get anxious!","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I mean I won’t lie I can definitely have obsessive tendencies but just figured I’d share this if anyone else struggles with it, too.","score":3,"comments":[]},{"body":"[removed]","score":-3,"comments":[{"body":"This is a really unkind and ableist thing to say. \n\nMy previous gf had severe anxiety and would literally mess up our entire journey by worrying about the devices, gas and locks. We finally created a sort of ‘leaving ritual’ in which we walked through the house methodically, shutting/locking everything while we took pictures of it all. Took all about 5 minutes, maybe 10. \n\nSaved us both a headache. She would flip through the photos maybe once on the trip, and after a while even that wasn’t needed anymore. Worked like a charm.","score":0,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: If you make a risky, unnecessary decision, and stuff goes horribly wrong, you will be the only one left to pick up the pieces. Don’t let people push you into risky decisions, unless they will have the same consequences as you will.","not_safe_for_work":false,"locked":false,"body":"","score":52,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"But what if they call you a chicken?","score":4,"comments":[]},{"body":"Or do it the Big Oil way:\n\n1. Make risky investment\n2. Write it off your taxes\n3. Potentially reap profit\n4. investment goes belly up\n5. Sell investment to throw away LLC #217\n6. TALLC goes belly up instead","score":3,"comments":[]}]},{"title":"LPT What advise is important for people in their 20s. What are tips on learning to save money and building knowledge and understanding on life.","not_safe_for_work":false,"locked":false,"body":"\nI'm 26 now but I feel like getting a job even though I have social anxiety and lack of confidence. I just can't be homebody all my life. I need to get out of my comfort zone to understand the real world. I just wanted some advice like lately everything is so expensive whether it's gas or grocery or rent. People are struggling to make ends meet. Some people will not take advantage of sales going on. Some people are living life paycheck to paycheck.\nEveryone seems to be mentally emotionally tensed and fatigued by the stress. It's like I don't know how to even get started \n\nI just want to build good habits and become smart mature and understanding of life. What advice would you have for me? What are some things I should I know?","score":8,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Not all jobs require human interaction.\n\nIf you’re currently not working and have no existing CV, start by not trying to get a job.  Instead, start by looking for the type of thing you think you’d like to do; using existing job ads can help with that.\n\nThen, start applying for every job out there, at your pace.  Go to any interviews you get not thinking you may or my not get the job, but to learn how interviews work.  Talk to the interviewers, be honest with them about your experience and your situation, and ask them to give you some honest feedback about their impressions of you when they ask if you have questions at the end.\n\nThe next bit is important: that feedback isn’t about you, it’s about how they see you in that context.  Use it to see how you can improve and also to see what sort of people are in management positions.  Don’t agree to work for someone who stresses you out in the interview; it won’t get any better afterwards.\n\nAfter the interviews, be honest about whether you would actually consider the position.  “I don’t think this would be a good fit for me, I’m looking for something more like X” is perfectly fine to tell them.  Then who knows?  If you find an interviewer that you mesh well with but the open position isn’t what you actually want, tell them what you do want, and they’ll think of you if such a position opens up.\n\nI’ve even been on interviews where I researched the org and the department beforehand, and went in telling them why I was interested in the department and what I thought I could bring to the team… they then scrapped the open position and wrote up a new one based on what I had suggested, mapping the requirements to my CV.  So I ended up being the perfect candidate for the job.\n\nInterestingly, I didn’t end up taking that job because I got an offer from a different company where I had a much better social fit and they had better work/life balance.  I kept in touch though, and let the hiring manager know why I took a different offer.\n\nTL;DR: use job searches as no-strings learning opportunities, not a make or break “get yourself hired at all cost”.  You get to experience social situations where you’ll likely never see the person again so it doesn’t matter if you crash and burn: it’s a consequence-free social interaction to use as social practice.","score":3,"comments":[]},{"body":"Invest early, no matter how small the amounts. \n\nAlso know what you truly value, and keep the people that shares the same value.","score":3,"comments":[]},{"body":"Save a set amount every month, start with a few bucks if you need to, and slowly increase. Invest, again even a few bucks. Track your spending, record all your purchases for a few months and avoid wasteful things. \nLife's a hard balance, enjoy the moment but plan for a long future. Have fun now but not so much to jeopardize your future self. Don't drink and drive, uber is cheap.","score":3,"comments":[]},{"body":"Gamify saving money. Once I saw the number increasing slowly but surely, i became addicted and started setting personal milestones such as reach $x,000.00 etc. it’s so satisfying putting in those final deposits to reach your milestone.","score":3,"comments":[]},{"body":"Save $20 per week. Buy a piece of silver. Open a brokerage account. Tiny bits of money now can turn to millions by retirement age.","score":5,"comments":[]},{"body":"i am 22yr old and have the same problem like you, friend","score":2,"comments":[]},{"body":"Set up an automatic deduction from your monthly accounts.  At first, you want to build an emergency account (serious illness, unemployment, etc). Move some to retirement account and balance to big purchase (car, house, etc).  Move a small percentage consistently into interest producing accounts and leave it alone.\n\nLearn to recognize the difference between a need and a want. You need a phone, you want the $1200 phone. Is it worth the cost?\n\nLearn the total cost of an item. Got a friend to paint my house for half the price of professional painter. Guy was a general handyman and painted on/off for years. Friend took twice as long, did half the job and quit. We barely speak. The discount paint job cost me a friend, 6 months and 150% more than it should.  Good shoes cost more up front but last longer than cheap shoes. Look at more than upfront cost.\n\nLearn how to do it yourself. Can you cook dinner every night for 2 weeks and not repeat the menu? Can you do simple plumbing like unclogging a sink? Learn simple home repair.","score":2,"comments":[]},{"body":"I wasted tens of thousands of dollars on playing traditional golf before I found Disc Golf so if you don't already play it, I highly recommend you try it. It's cheaper because the vast majority of courses are free, it's great exercise, easier to learn while still being very challenging and most importantly it's extremely fun.\n\nAnother thing I like about it is it's a great way to meet new people that for most part are pretty chill and who are also open to new players. A lot of courses even weekly tournaments that open to everyone. Disc Golf is worth starting as young as possible because it will definitely bring you a lifetime of enjoyment.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT - When making espresso based drinks; first lightly rinse your entire coffee mug, shake off excess water and microwave the cup for 30s - 1m. Your drink will stay warm much longer than running hot water over the mug, and you'll save water.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Boil the kettle, fill the mug with boiling water, and let it sit a couple of minutes. \n\nUnless you’re American and a kettle is foreign to you.\n\nETA: you obviously tip out the boiling water before you make your drink.","score":1,"comments":[{"body":"For the espresso drinks that require additional hot water you could do that. But several, including the popular cappuccino, macchiato, latte and others don't. Also the way I specified only takes seconds not minutes and warms the cup significantly better.","score":1,"comments":[{"body":"I forgot to add that you tip out the water before making your coffee. I regularly make my lattes this way.","score":1,"comments":[{"body":"It's just a tip. You should consider trying it sometime before writing it off. Imo it gets the mug significantly warmer with way less effort, water, time and electricity.","score":1,"comments":[]}]}]}]},{"body":"Why not just microwave it with the water in it since you’re using it anyway?","score":1,"comments":[{"body":"There's a few espresso based drinks that require additional hot water but most do not.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"And uses electricity instead. Depending on where you are, not necessarily cheaper or better.","score":1,"comments":[{"body":"Depending on your house while waiting for the faucet to put out hot water you've already wasted a good deal of water. Also 30s to 1m of electricity is not that much. In this day and age I think wasting water has a greater impact. Also it just doesn't work as well at warming the mug.","score":1,"comments":[]}]}]},{"title":"LPT When choosing a Porta Potty to use, pick Your last choice for a cleaner experience.","not_safe_for_work":false,"locked":false,"body":"As you walk up to a row of Porta Potties, chances are your first choice is the same as most people. Walk a few more steps and use the one that did not catch your eye for a less frequented toilet.","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"When at a venue with several porta potties with lines of people waiting to use….\nChoose the line with less females, for a shorter wait time!","score":2,"comments":[]},{"body":"By that logic, that'd be the most used one as well because people would have the same mindset \n\nEither way, all porta potties are dirty","score":2,"comments":[{"body":"You’re missing the point. I hope blue poo touches your poop shoot.","score":0,"comments":[{"body":"Wouldn't catch me expelling my insides or outsides at a porta potty","score":1,"comments":[{"body":"Wouldn’t catch you outside the inside of your house for the need to use a Porta potty either","score":-1,"comments":[]}]}]}]}]},{"title":"LPT: Think of life as an Hour Glass.","not_safe_for_work":false,"locked":false,"body":"You are gap in the middle ,\nThe grain passing through is an experience,\nYou can only experience one grain at a time,\nAnd once it's gone it's gone,\n\nEach grain is unknown until it passes and once it passes through it is a memory.\nCapture as much of what flows through before it it's stored because once it flows through the experience is gone.\n\nDon't Anticipate the Future, \nExperience the present, \nLeave the past as it will never flow back through and will always be able to be look at from a distance.\n\nEdit 1: Thankyou for the 1 award, please don't give anymore, an up vote is all that's required, if it's given you another perspective that's all I'm happy for :)","score":142,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"You want us to think of life as an hour glass but not anticipate the future? Even though we are now visualising our mortality relentlessly dripping away? Fuck that.","score":39,"comments":[{"body":"To be fair, this guy didn't invent death with his concept. Just trying to say that you should experience life in the moment. \n\nKeeping in mind how much sand you have left on the future side and enjoying the view of the dunes that become the past","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I like to think of life as life","score":5,"comments":[]},{"body":"“Like Sand in the Hourglass, So Are the Days of Our Lives”","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Jesus Christ, man. I'm trying to eat a pop tart over here before I gotta go to work.","score":4,"comments":[]},{"body":"How is this a LPT?\n\nThis belongs on r/im14andthisisdeep","score":9,"comments":[]},{"body":"You are an hourglass that's been yeeted off a tall building. Do whatever you want. The end result is the same. Enjoy whatever you want.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"We’re all just dust in the wind, dude","score":3,"comments":[]},{"body":"Life's like a train speeding to the edge of a cliff and everybody's Playing Uno and eating sunflower seeds","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT Rquest-How can I reduce trash?","not_safe_for_work":false,"locked":false,"body":"For starters, my English isn't good. I've been trying to learn, so please be understanding. Anf if you could correct the parts that don't make sense, that would help me out.\n\nRecently, I recognized I made so much trash every day. I'm going to try to cut down on trash from now on. I'm trying not to use as much plastic as I can. I carry my shopping bag to not use plastic bags. And I hardly use wet tissue.\nWhat can I do to more reduce trash?","score":4,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Think about the final outcome of any product when you are purchasing it. Eventually, you have to dispose of it and its packaging.  There is not always a good choice, but at least be aware.\n\nIf we all start demanding better packaging from manufacturers that's where we will make the biggest impact. For example: what if we all refuse to buy soda or beer with those plastic connectors holding a package of 8 bottles together. Buy cans in cardboard boxes and recycle the cans, if you choose to buy those products. \n\nI wish everyone was asking the questions like you. Also your english is pretty good.","score":7,"comments":[{"body":"I didn't think of packaging. I'll pay more attention to packaging when I buy something.","score":5,"comments":[]}]},{"body":"Buy reusable containers with lids? Repurpose containers and jars from grocery shopping.","score":4,"comments":[]},{"body":"I don't know what food you buy currently. But it's best to buy fresh foods that are unpackaged or less packaged. Instead of ready meals or frozen foods.\n\nThough there might be a place for frozen food too. E.g. certain vegetables that you know you won't consume quickly enough and they will go bad in your fridge (we definitely don't want food waste.)\nBut in those cases you can also consider if you could buy these foods fresh, cut them up and freeze them yourself. ( Put them in a reusable bag or container).\n\nEdit: Just wanted to add. Know that many fruits and veggies have peels that are perfectly edible. You don't need to throw it away. E.g. Carrots, potatoes, courgette, cucumber, apples, pears, kiwis. Some pumpkins have skin that isn't too thick and softens when cooked/baked. It's a lot less work if you don't need to peel them. Apart from bananas, onions &amp; garlic, I think there are very few fruits or vegetables that I peel nowadays. (Though make sure to wash them well.)","score":5,"comments":[{"body":"Your last part makes me reflect. I never thought about peels were able to be trash. Come to think of it, it wasn't difficult to eat peels of fruits. I'll try to get used to eat all of them.","score":4,"comments":[{"body":"It depends on what you do with it.\n\nWhen I lived at my parents place, they had a big garden with a compost bin. We threw peels in there and after many months/years it became like a ground fertilizer.\n\nUnfortunately now I live in a tiny apartment with no garden, not even a balcony and all my fruit and veggie scraps end up in the regular trash. I've noticed that a huge part of my trash was fruit and veg waste, so now I do my best to use as much as possible.\n\nEven things like the leaves on a cauliflower or the stems of cauliflower and broccoli. I used to throw them away without thinking. But they're actually perfectly edible.","score":1,"comments":[]}]}]},{"body":"Try to think about your purchases rather than buying on impulse. Is this thing actually going to be useful to you, and where are you going to keep it so that it is accessible and useable? Items often end up getting thrown out because they were an impulse buy that was interesting but not actually useful, or because they went into the bottom of a drawer and then never used for years. Not making those purchases in the first place would mean you throw out fewer things.\n\nIn the kitchen, put a pen and a piece of paper next to your bin. Every time you throw something in the bin, make a note of what it was. After a week, go through your list, and see what patterns you notice. If you are throwing away a lot of food that has gone bad, then maybe you need to change your habits about purchasing or storage, or maybe you just need to be more disciplined about using things in a timely fashion. If you are throwing out a lot of juice cartons or crisp packets or suchlike, then maybe you could be eating and drinking things that don't come in single-use wrappings or containers, maybe making a sandwich or a glass of water or a cup of tea would be less wasteful.\n\nHow much are you recycling as opposed to throwing in the bin? If you habitually take the paper spam that comes through your letter box and put it in the bin instead of putting it to the paper recycling, then that is an easy change to make. Similarly, if you throw away glass bottles or jars instead of giving them a rinse and putting them to glass recycling, that is another easy change. \n\nIf you can be more prepared and more organised in general, then you will need to buy (and then throw out) fewer things that tend to need to be bought when you find yourself disorganised or unprepared. You mention carrying reusable bags instead of plastic bags, that's great! Other things might involve carrying a reusable water bottle in your backpack when you go out, instead of buying something to drink and throwing away the bottle. or having plastic tubs in your kitchen for storing things in the fridge or freezer rather than single use plastic bags. Plastic isn't necessarily bad, especially if you can reuse it many times and it does a good job of making your life better without being discarded afterwards.","score":3,"comments":[{"body":"Thank you for your sincere comments. I had thought very simply about protection of the environment. I learned that not only I didn't throw things away, but also I had to not buy some things on impulse. Your comments make me think about my habbit.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"title":"LPT: If you're on Android and are sick of only being able to find apps that are paid or have tons of annoying ads, you can install an alternative app stores from the APK, such as ones that only allow free and open-source apps.","not_safe_for_work":false,"locked":false,"body":"I won't say which one I use specifically because of the rule against product recommendations, but I'll say adding an open-source app store has made it much easier to find apps that are actually useful instead of so overburdened with ads that I can't do anything.","score":28,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I've been on Android since it started and never once have paid for an app. There's no reason to. \n\nAnd if you're getting a lot of ads on some app, delete it and find a different one. There's lots out there.","score":5,"comments":[]},{"body":"Are APK apps more likely to allow download to an SD card, for those still on that system? I'm sick of apps which don't allow movement to external storage.","score":4,"comments":[{"body":"The Play Store installs apps with an APK file. The thing is Android allows you to install APK files manually if you want. The app is still the same. Installing an app from the Play Store and installing the same app from an APK file changes nothing, the app is the exact same, and won't change it from being unmovable to the sd card or not.","score":3,"comments":[]}]},{"body":"What?\n\n&amp;#x200B;\n\nI have only used Android for what, 20 years?  I have one app I paid for, and more than 100 that are free.","score":3,"comments":[]},{"body":"Also, download Google Opinion Rewards. Provide the most positive answers for bigger cash outs. It's like a dollar at a time, but you can buy apps with it.","score":3,"comments":[]},{"body":"Ask yourself why those apps are not in the official Google Play store. Hint: it's not because Google doesn't allow ad-free or open source apps, but more likely because the apps you find on these alternative stores can't be bothered to adhere to privacy requirements or can't pass Google's malware checks.","score":2,"comments":[{"body":"They charge a small fee for a lifetime membership to publish in the play store, but I don't think that's the main issue.  It's more that free apps are hard to find under for-profit apps that are optimized to be found with professionally-developed descriptions and advertising.  For example games.  There are games for Android that don't have ads and are totally free and developed by hobbyists - they're just very hard to find on the play store.  So an open-source only store helps if that's what you're looking for.","score":2,"comments":[]},{"body":"Or they are open-source and made by one/many devs that don't want to pay Google to publish an app that will give them exactly 0€/$/¥/£ in return.\n\nPublishing an app on the Play store is not free.\n\nOr they want to be available on Android systems without Google services and so without the Play store. Yes, those systems exists (the FireStick for exemple).\n\nThere is many reasons...","score":4,"comments":[{"body":"Publishing an app in the store is free. If you have in app purchases, Google requires you to use their payments system, and takes a cut. But there has never been a charge just to publish the app.\n\nThere are reasons to *also* publish in those other stores, but very few legitimate reasons to not publish on Google at all.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT request: ideas for anywhere free or cheap to safely store your vehicle.","not_safe_for_work":false,"locked":false,"body":"Like say under $50/month, these vehicle storage places want like 200. I'm near Phoenix \n\nI'm trying to be gone several months, probably 3 or 4","score":1,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Casino Parking garage!\n\nI know someone who leaves his motorcycle at Mohegan Sun all winter covered in a corner of the garage.","score":3,"comments":[{"body":"Is this by arrangement, or is he just hoping not to get towed?","score":4,"comments":[]}]},{"body":"200 seems pretty reasonable to me. Enclosed storage, is it climate controlled? That’s also most likely covering insurance and security. \n$50 bucks a month seems like it would get you a bare parking spot.","score":2,"comments":[{"body":"Yeah some of them are controlled, the only app I know about is neighbor and they have both.","score":1,"comments":[]}]},{"body":"You’re not going to find anything suitable, reliable, and insured for that price.\n\nMay as well just park it outside a friends house.\n\n$200 seems very reasonable for vehicle storage.","score":1,"comments":[]},{"body":"Have you looked at those long term parking sites by the airport?","score":1,"comments":[{"body":"Oh yeah I forgot about that, looks like the lowest off-site economy long term is 7/day so say 210, for that I'll get an enclosed but solid idea","score":2,"comments":[]}]},{"body":"How is car parking a life pro tip?","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I live in PHX and have an RV space available on  my property,  Message me - very reasonable","score":1,"comments":[]}]},{"title":"LPT : Skip the description of most all products and go to the ingredient list. You will learn more and cut out all the corporate speak","not_safe_for_work":false,"locked":false,"body":"","score":77,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Even the ingredient list is deceptive. For example, ingredients are listed in the order of greatest content first. Jam companies will use 3-4 different sweeteners so that they can list fruit as the first ingredient. Consumers think it will contain less sugar than fruit, but it has 3-4 times more sugar than fruit.","score":26,"comments":[{"body":"You can tell the sugar content from the nutritional information","score":14,"comments":[{"body":"Fruit also contains sugar though.","score":3,"comments":[{"body":"True, but sometimes products will have an \"added sugar\" line that tells you how much sugar is sweeteners specifically.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"Check out toothpaste You will be amazed! 90% of toothpaste brands have exactly the same ingredients! Sometimes even different \"types\" of same brand are exactly the same.","score":5,"comments":[]},{"body":"Mug root beer contains calcium disodium EDTA.\n\nI'm sure you will enjoy your learning.","score":3,"comments":[{"body":"I did enjoy my learning!  I learned it is is used to preserve food, only 5% of it gets absorbed in you body when ingested (but works better if injected) and it traps heavy metals so it is used to cure heavy metal poisoning","score":7,"comments":[]}]},{"body":"Absolutely! Even canned vegetables. For example there is often a lot more water in cheap brands of canned corn. You can tell by comparing calories. Also sugar content in things like seasoned canned tomato’s. Italian style, Mexican style etc. might have added sugar.","score":2,"comments":[]},{"body":"For mechanical and electronic conponents, there are datasheets. If a law is formed such that every item should have a \"datasheet\", it would be nice. A qrcode leading to the text file. A government hosted site which monitors entries and edits.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: You shouldn’t block people over arguments/disagreements unless they won’t leave you alone. You lose nothing by simply parting ways with people and keeping them unblocked, but you eventually hurt yourself by closing off to outside perspectives, which is a slippery slope to an echo-chamber.","not_safe_for_work":false,"locked":false,"body":"##To add: You also hurt others by closing THEM off to outside perspectives.\n\nIn other words: Disagreement doesn’t necessarily mean correctness (especially when the argument is over an opinion or perspective), and there’s usually some valuable information to learn even if the argument itself doesn’t change anyone’s perspective (information about why someone thinks the way they do, or how you can word your explanations in the future to people you might actually know).\n\nIf I’d blocked everyone I got into a disagreement with, there’d have been a lot of totally valid perspectives and points left on the cutting room floor instead of being expressed via the argument or a second encounter with them.\n\nAnd of course there are also a lot of arguments I’ve had where I’m still certain I’m right, but blocking the person would do nothing for either of us.","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I don't negotiate with Nazis.","score":1,"comments":[]},{"body":"Vast majority of arguments are worthless when it comes to educational value","score":1,"comments":[{"body":"Whether there’s any useful information in an argument that gets absorbed or not, a block still doesn’t change anything unless the person just keeps badgering.\n\nAll a block does is ever-so-slightly close off both parties to other perspectives, which I’d argue is a net-negative. (Someone in the wrong definitely needs as many other perspectives as possible, and even a person who knows they’re objectively in the right can gain value in understanding where other people are going wrong in their thinking, and that can hone their own understanding of the facts and their ability to explain them to people they actually care about. Also, a debate can help OTHER people who are reading the conversation to understand what’s wrong or right.)\n\nI mean… right now we’re arguing (arguing doesn’t mean aggression necessarily), and I’d hope someone wouldn’t block another for an argument like this at least","score":1,"comments":[]}]},{"body":"Sounds like someone got blocked","score":1,"comments":[{"body":"Of course I’ve been blocked in my lifetime; I’m sure you have been too, maybe without even knowing it.\n\nIt doesn’t mean blocking over a disagreement is useful or good in most cases","score":1,"comments":[]}]}]},{"title":"LPT Request- How to fix horrendously smelling shoes?","not_safe_for_work":false,"locked":false,"body":"To start off- I'm totally down to throw these shoes out, but they do a decent job for me while I work a seasonal gig with UPS until end of December- January. \n\nSo I'm wondering if there's any way to unsmell these shoes. I even just put them through the laundry machine before and they still smell bad. \n\nThanks!","score":20,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"-Good soak in water and white vinegar for about 24 hours\n\n-take them apart (as much as you can) and Let everything dry outside in direct sunlight \n\n-after wars make sure you use some kind of moisture control component in your shoes that will help prevent  bacterial growth \n\n-start using tea tree on your feet, it’s an antimicrobial that helps keep stink from forming","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Lysol after use. I worked at an ice rink and this is all we did to keep the skates smelling decent","score":7,"comments":[]},{"body":"Try freezing them for 24 hours. Kills the bacteria that causes smells.","score":13,"comments":[]},{"body":"After deodorizing your shoes with whichever of these suggestions work, try stuffing fresh newspaper into your shoes after wearing them each day. It works for my rock climbing shoes.","score":3,"comments":[]},{"body":"I have had great success with charcoal bags (search \"charcoal bags shoes\" on amazon), you charge them up in sunlight and then stick them in your shoes, at least overnight. I use them on my high heels which can get pretty smelly from 8+ hrs a day of wear with bare feet and I have been very happy with the results.","score":3,"comments":[]},{"body":"Walmart/shoppers has a foot powder it works wonders. Brings all Smelly shoes back to life.","score":3,"comments":[]},{"body":"In the future I recommend 2 pairs of shoes and alternate.   It costs more up front but you will last 2x as long as they won't smell. \n\n\nFor now.  I put a tablespoon of borax in the shoes and shake them around.  The next couple times I wear them I will get borax in my socks, but it helps kill the bacteria.","score":3,"comments":[]},{"body":"Also, consider working on the *source* of the smell.\n\nYour diet, your feet.","score":6,"comments":[{"body":"Change socks daily.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: An electric heating pad will help dinner rolls rise in a cold kitchen.","not_safe_for_work":false,"locked":false,"body":"With Thanksgiving approaching in the US this week, ovens, stoves, and other warm spaces for dinner rolls to rise will likely be otherwise occupied. A heating pad or electric blanket will help ensure rolls rise on time for dinner.","score":7,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"That’s actually a very helpful tip. Thank you!","score":2,"comments":[]},{"body":"I do it a little bit differently...\n\nI cover the raw dinner roll dough in a towel, then I place a litter of kittens on top.  Between the warmth of the kittens bodies and their built-in kneading instincts/action I uniformly get excellent results!\n\nCheers!","score":1,"comments":[]}]},{"title":"LPT: Track your online returns to completion!","not_safe_for_work":false,"locked":false,"body":"I’ve been meaning to post this for awhile and guess what it just happened to me again. When you return something to an online retailer, make sure you are saving a copy of the tracking number, receipt of you dropping it off and even a picture or video of what you returned when it was fully packaged. This is critical even when the business provides their own return label! \n\nI’ve had several returns which the retailers even acknowledged as received, but never actually processed the return the completion to give me my money back. It’s happened with small businesses and giant ones. The most recent for me is Dell who failed to credit my monitor return.  I’m now in the process of them giving me my refund, but thank goodness I have documentation!","score":6,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]}]},{"title":"LPT: If you are in a car or truck and pass/change lanes in front of a motorcycle you need to know that despite what most people are taught, motorcycles brake far slower than cars, and also follow different laws than regular cars in most states in the US.","not_safe_for_work":false,"locked":false,"body":"Motorcycles have an insanely small amount of tire that actually touches the road at any time. And under braking a motorcycle is basically balanced on its front tire with almost zero traction from the back. Lots of physics involved but if you brake check a motorcycle, there is a very good chance you end up killing someone. On top of that, when someone is braking hard at high speed on a motorcycle they are having to do way more than what people who have never been on a motorcycle really understand. \n\nEven on a bike that has ABS like mine does, the rear of the bike lifts under heavy braking and you not only have to control the front of your bike where you use basically all of your upper body strength, but you are also having to balance and use an insane amount of core muscles and your thighs to balance out the rear of the bike since under heavy braking its trying to escape from under your ass the whole time. That's not including, clutch control, engine braking which ruins the motorcycle, shifting, and throttle control so my bike doesn't die and lock up and send me flying. Lots of shit. \n\nThis isn't even the most important part though. Lots of states have motorcycle safety and training classes. These teach a rider what they can and can't fo on the road. Know your state laws but MOTORCYCLES HAVE DIFFRENT LAWS THAN CARS. A lot of people get absolutely pissed when motorcycles pass them at super fast speeds, lane split (in California but that needs to be the entire US), go through red lights, swerve around when you are turning in a car amongst a lot of other things.\n\nLet me explain. Some states, including mine, you are allowed on a motorcycle to go far over the speed limit to pass Cars. It's not because we think you are slow usually (it gets taken advantage of), it's because it is dead ass safer for us to not be sandwiched or in blind spots. In my state we can go on red lights if it's safe to do so as well. It is more dangerous to sit at a light and get rear ended than to go through a red. Lane splitting is also safer for the person on the motorcycle for many of the same reasons and it also makes sure the bikes don't either overheat or die in the middle of the road.\n\nNow for the braking. Motorcycle classes, tell us to specifically GO AROUND and not to try and out brake people since we can't do it. In a car you are supposed to be defensive and then brake. We are taught to KEEP SPEED AND GTFO THE WAY since we can't brake as fast, but because we are way more maneuverable. Braking while doing any maneuver is basically a death sentence at highway speeds and a very large ER bill that includes a lot of surgery at even 30mph. So we don't brake. Sometimes we go faster. And we are not only allowed to to it, but it's incouraged. \n\nSo don't cut off motorcycles if you feel like you where slighted by them for whatever reason and don't freak out when we do shit that looks or seems illegal. Know your states laws but a lot of times people on motorcycles have a very very different set of rules than cars. It's not to piss you off, it's litterally taught because it's safer than doing what cars do.","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Generally speaking, don't ride like a dick and your odds are much higher of not having an issue.","score":1,"comments":[]},{"body":"You’re not forced to drive one. If you do, be prepared for the risks and consequences.","score":4,"comments":[]},{"body":"It's my understanding that in some states a motorcycle can proceed through a red light but only after coming to a complete stop and waiting for the light to change a few times. However the onus is on the motorcycle to make sure it is safe to go or they are at fault in an accident. The thinking is the light sensor might not pick up the motorcycle's presence not that it is dangerous for the motorcycle to be stopped at the light. Same thing for us bicyclists.","score":2,"comments":[{"body":"This is exactly why they do it. And where I live we are allowed to go through stop signs without fully stopping either.","score":1,"comments":[]}]},{"body":"Given the mechanics and braking dissadvantages of motorcycles, You would think that there'd be a lot less people acting like idiots while driving them. I don't mind them on the road and try to give them space, but 90% of motorcycle crashes are because the motorcycle driver was acting like an asshole.","score":2,"comments":[{"body":"This is not remotely true.... like even a little bit. Flip that 90 the other way. Most motorcycle accidents are cars not noticing a bike existing. And If you want to get really fun with it, motorcyclists die from road rage incidents far more than your average driver. Yeah they are on the bike. But that shouldn't mean they should fucking die more just because someone is mad at you for being on 2 wheels.","score":-2,"comments":[{"body":" Like you said \"motorcycle accidents are cars not noticing a bike existing\". It is up to the motorcycle driver to use extra caution when driving up on a vehicle because they are not seen on blind spots as easilly as cars.  Just when you approach a semi truck carrying a load. You make sure he sees you and take extra precautions when making turns and passing. The problem with many riders is that they assume you see them when in fact most drivers only hear the bike approaching and don't see it until after they have zoomed past doing 90MPH. This seems to be a trend with sport bike riders. Seems like people on cruiser bikes are more considerate of other motorists on the road.","score":1,"comments":[]}]}]}]},{"title":"LPT: If you are ever giving your phone to a family member/friend to show them pictures etc, turn your phone on do not disturb. Thus preventing the possibility of them seeing any potentially embarrassing messages.","not_safe_for_work":false,"locked":false,"body":"","score":28,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Do not disturb only turns off the sound / vibration. If your phone is unlocked it still shows them on the banner","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Am i the only one that wants to hear the story behind this lesson learned?","score":8,"comments":[]},{"body":"I had a lady hand me her phone once to try and get something to work for her. Her boyfriend sent her a text as I was going through it. It was something along the lines of ‘I want you to suck my *%#^ later’. I blushed and handed the phone back saying she got a message. She saw the message and promptly left the store.","score":3,"comments":[{"body":"What you didn't know... boyfriend was watching. He was sending that text to YOU.  she was in on it.   MISSED CONNECTION THERE.","score":6,"comments":[]}]},{"body":"Good one. I always do that.","score":1,"comments":[]},{"body":"DND does not always prevent messages from being displayed, it generally turns off notifications. Maybe also stop having pervy conversations or keep the phone in your control.","score":-1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"LPT: Seek out and befriend kind people. That way you will be always surrounded with kindness, and you yourself will learn to be more kind.","not_safe_for_work":false,"locked":false,"body":"","score":2713,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"and never hesitate to distance yourself from unkind people","score":235,"comments":[{"body":"SLPT: be a dick to all of your kind friends so that they are grateful they are kind and not a dick like you","score":22,"comments":[]}]},{"body":"I have been labeled as kind by others my whole life, but I actually have crippling social anxiety. Please do not befriend me. I am so tired.","score":202,"comments":[{"body":"The fun game of “Am I actually a kind, polite individual, or is my social anxiety keeping me from speaking my mind, and allowing myself to be steamrolled in every situation to appease others?”","score":80,"comments":[{"body":"Wait until you question if your kindness and helpfulness is because of altruism vs self-interest/selfishness !","score":22,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Please be a kind person as well. I keep being surrounded by manipulative, narcissistic people who just take and enjoy my kindness and never return it.","score":57,"comments":[{"body":"Came here to say this! Kindness is to be reciprocal - I am dead tired from being kind and building or lifting people up, only to be neglected by those same people in return.\n\nEnough already, be the kind person instead of leeching off existing kind people - we are tired.","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Oh, befriend kind people? Just befriend kind people? Why don't I strap on my kind people helmet and squeeze down into a kind people cannon and fire off into kind people land, where kind people grow on kind peoplees?!”","score":154,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Remember to breathe aswell guys!","score":30,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Check Alibaba and Aliexpress before buying clothes advertised on social media","not_safe_for_work":false,"locked":false,"body":"If it’s a no-name brand advertising things like jackets and hoodies (other clothing and small items sometimes too), there’s a good chance they’re a drop shipper. These bottom feeders are always busy at this time of year. \n\nWhat that means is they’re buying an item from Alibaba/Aliexpress for $20, selling it to you at $100 and claiming its “50% off, this month only”.\n\nPlease don’t fall for their scam. Just buy it yourself, direct from China if you want those items. \n\nDropshipping is a scourge that needs to be stopped. Buying from them only supports it and means you’re needlessly paying $100 for a $20 item. \n\nThey get it shipped direct from China to you when you order so it’s not like they have warehouse and logistics costs, they’re outright scamming you. You can buy it from the exact same supplier they do and for the same price they are. They provide no value for the extra 400% markup they’re adding.","score":19,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"LPT don't buy anything from social media or alibaba","score":9,"comments":[{"body":"Yeah, this isn’t an endorsement for Alibaba. Pretty much everything on there is trash.\n\nStill, I’d rather see people buy that trash at a low price than to fall for the dropshipping scams.","score":2,"comments":[]}]},{"body":"Or...go to a local physical shop and support small businesses for a change;-)","score":3,"comments":[{"body":"IMO this is a nice idea but there is a reason they are failing. Online shopping is the future for things like clothes. There are some exceptions, but I think it’s fairytale thinking to reverse the tide of progress with small businesses going bust for the cheaper and more varied selections we get online.","score":2,"comments":[{"body":"Quality is still important for me.","score":1,"comments":[]}]}]},{"body":"Yes that's what I do. Steel bracelets. Bamboo underwear. Phone covers. Etc etc","score":1,"comments":[]}]},{"title":"LPT: When you get out of the shower, point the shower head at the back wall.","not_safe_for_work":false,"locked":false,"body":"You will never get scalded again, and you prevent unwanted blasts of cold water to the back of your head when turning on the shower.","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I don't get in the shower until the water is a good temperature.\n\nWhy would you get in the shower and then turn the water on?","score":16,"comments":[]},{"body":"Y’all are in the shower when you first turn it on?","score":16,"comments":[{"body":"I am but I always remove the shower head and point it away from me. Once it warms up, which takes a bit because my bathroom is pretty far from the heater, I'll hang it back up","score":1,"comments":[]}]},{"body":"Start shower &gt; remove clothing &gt; get in shower\n\nIt's even easier that way.","score":9,"comments":[]},{"body":"How about temp the water before blindly getting in","score":6,"comments":[]},{"body":"Someone needs to learn how to get into a shower.\n\nThat would be you.","score":7,"comments":[]},{"body":"Start faucet. Test faucet water with toe. Adjust. Then pull divertor to send water to shower head.","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Write, draw, paint, take photographs. Permit yourself to be creative, because it allows you to build another world outside of our own, a world that doesn't carry the stresses of this one. Lose yourself in these pursuits, even if you can't make anything from them, just create.","not_safe_for_work":false,"locked":false,"body":"","score":10190,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"This reminds me of one of my favorite Kurt Vonnegut quotes:\n\n“Practicing an art, no matter how well or badly, is a way to make your soul grow, for heaven's sake. Sing in the shower. Dance to the radio. Tell stories. Write a poem to a friend, even a lousy poem. Do it as well as you possibly can. You will get an enormous reward. You will have created something.”","score":656,"comments":[{"body":"I don't disagree with the sentiment but the whole \"it will be rewarding no matter how good you are at it\" is a bit rich coming from Kurt fucking Vonnegut","score":102,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This is so true. I’ve started creating music. Very amateur, very poorly done music.  No one will ever listen.  But it’s the most rewarding hobby I’ve ever had.","score":81,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'd like to point out that cooking is another way to do this. If you suck ass at visual arts, this is a good way to get that high of creating something!","score":59,"comments":[]},{"body":"I'm 57 years old and have gotten into making art over the last five or six years. You bet your sweet ass I put my art up on the fridge!\n\nBeing creative is a human need. It's a human expression. And it doesn't have to be good it just has to make you happy.","score":39,"comments":[]},{"body":"This. It took me too long to learn this. Being creative is so necessary, and it's okay for creativity to be it's only purpose.\n\nYou don't need to turn every hobby into a side hustle. It's okay to spend time and money self expression, you are worth it to yourself.\n\nAnd it's okay that it doesn't end up in a \"finished\" project/product.","score":81,"comments":[]},{"body":"That's what I started to do when I daydream. \n\nIt's been almost 20 years and in my daydream story, I have a family, my kids are grown up, and I'm retired with my wife.\n\nMaybe I should type out this story.","score":116,"comments":[{"body":"If you think it will be rewarding to type it out, go for it.  You might have a penchant for writing!","score":24,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Trying to make myself artistic sounds stressful.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: When holiday shopping, consider buying an “experience” rather than a traditional gift.","not_safe_for_work":false,"locked":false,"body":"People often remember fun and unique experiences more than a typical gift.","score":22,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I like the concept, but find it hard to do if you don't know that person's schedule.","score":7,"comments":[{"body":"There's lots of gift cards for experiences where they set their own schedule. You basically buy a gift card to a concert venue, cinema, restaurant or theme park then they go when they have time.\n\nAlso, never buy gift cards because the vast majority of gift cards never actually get used.","score":2,"comments":[]}]},{"body":"If the goal is for the gift to be memorable, then yes an experience makes sense, but I think this requires even more knowledge of the person than a regular gift. It would have to be something the person wants to do, but hasn't/isn't already buying for themselves. That's a very small category of activities.\n\nA much easier method is I usually find for most people, they have one or two items that they are always happy to get (consumables or things they wear out frequently), and will happily suggest to you as a gift, but nobody ever buys it for them because it would be too \"boring\" or not memorable enough. I'm talking about things like socks, chocolates, alcohol, or something related to a hobby like fancy glue, paintbrushes, video games, etc.. Too many people are worried about making sure the gift they give is unique and memorable, when the gifts people often appreciate most are the ones they can really use or really enjoy as a regular part of their life. As an example, all my brother ever wanted for Christmas was for people to donate in his name to his favorite charity. I was the only one who actually did it though, and he always appreciated my gift the most.","score":4,"comments":[]},{"body":"\"1 free backrub\" coupons printed out...&lt;dust off hands&gt; ...there done shopping.\n\nThanks for the LPT","score":3,"comments":[{"body":"You joke, but I'd love it.","score":2,"comments":[]}]},{"body":"Cool, but I rather go with gifts, here.","score":2,"comments":[]},{"body":"But remember to make it something accessible and easy to book. I had to take half a day off work to take an experience thst I wasn’t that bothered by before. \n\nI appreciate the thought of the gift but it wasn’t targeted at me, more a thing the giver wanted to do.","score":2,"comments":[]}]},{"title":"LPT: If someone ever advises you to take a giant risk, and they have zero investment in what they’ve advised you to do, think twice before taking their advice. They might be bs’ing you.","not_safe_for_work":false,"locked":false,"body":"","score":813,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Also, if they DO have a sizable investment in whatever, take extra precaution you aren't being drawn into a ponzi scheme.","score":94,"comments":[{"body":"In short, never listen to anyone","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My favourite LPTs are the ones where the top comment is \"Yes and the exact opposite is also true\" and the whole thing cancels itself out.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"also, get a second opinion from a family member or friend","score":18,"comments":[{"body":"[deleted]","score":20,"comments":[{"body":"Easier said than done, especially when you have more money or something others would want.  Others with ulterior motives get drawn to you then.","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"The Navy promoted ad on this post just mocks me at this point.","score":8,"comments":[]},{"body":"What if it's a double dare?","score":7,"comments":[{"body":"Tripple dog","score":7,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT Wear no-show socks under tights/nylons to prevent holes in the toe","not_safe_for_work":false,"locked":false,"body":"Whether you can do this obviously depends on the style/height of shoe or boot you're wearing, but putting socks on under tights can be more comfortable, warmer, and helps prevents holes forming in the toes of the tights by protecting them from your toe nails.","score":13,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I like this idea","score":5,"comments":[]}]},{"title":"LPT: As you’re planning your children’s Christmas gifts, buy them a simple gift that could theoretically be made in the North Pole that’s “from Santa.”","not_safe_for_work":false,"locked":false,"body":"Just sharing our tradition with all of you as many people don’t really think about Santa gifts from this perspective. There are many many families in the world who cannot afford great gifts from Santa like video games or whatever. I can tell you from experience that it really sucks going back to school and hearing all the great things Santa brought all the other kids. I was left wondering why I got a little action figure when somebody else got a brand new Nintendo or something. It didn’t seem fair.\n\nWe’re much better off than when I was kid but we still don’t give our kids their big gifts from Santa. We actually buy them a single toy that could feasibly be made in the North Pole. We do this for two reasons: it’s a bit more “realistic” and it doesn’t make them feel like they were somehow better than the other kids because Santa brought them a really big gift. The kids still have a great Christmas and enjoy the magic of Santa in doing this. Just thought I would share our tradition as it’s not something many people really think about. Merry Christmas everyone!!","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I've always agreed with this idea, and I wish it was standard in American homes. \n\nIt doesn't send a great message to the underprivilaged kids who go to school after Christams and find out \"santa\" got Billy a PS5, but Santa only got him some new socks. Why did Santa get such amazing gifts for the other kids and overlook others?\n\nI think it should be standard that \"santa's\" gift is a simple  &lt;$20 gift for each child. A teddy bear; an action figure; a doll; etc. And all the other extravegant gifts come from the parents.","score":4,"comments":[]},{"body":"Or maybe people could en masse seriously consider stopping the tradition of lying to children about the existence of a nonexistent old, overweight fairy. My ex-SIL didn't bother with this tradition. I really don't understand why people do.","score":-1,"comments":[{"body":"Because it’s fun and it’s absolutely okay to let kids be kids. Let children have some time where they can appreciate and be in awe of Christmas magic. It’s a lot more fun as kids waiting around for Santa to show up, falling asleep and being giddy after waking up, finding the cookies bitten into and gifts magically there. Life is hard enough when you become an adult, let children have a little time when they don’t have to have those worries and have these fun memories. If you don’t want to do the tradition yourself, that’s fine, but the world doesn’t need to stop having fun for your sake.","score":1,"comments":[{"body":"It's _not_ absolutely OK. Experts on childrearing:  \n\nhttps://theconversation.com/we-asked-five-experts-should-i-lie-to-my-children-about-santa-106930","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"This is a great idea! And watch those tags - this is how I found out there was no Santa. I asked my mom why the tag said ‘Made in Taiwan.’ She tried to tell me (she’s an awful liar, btw) that Santa had many workshops around the world to meet demand. I said ‘nuh-uhhhhh’ and she folded like a house of cards","score":1,"comments":[{"body":"Lol! We accidentally left the tag on our elf and our son asked us about it. I thought that was the end of it, but we saved it somehow. Good suggestion on removing the tags","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"100%. All our Santa gifts are PJs, a small toy and a book. Anything big come from Mom and Dad.","score":1,"comments":[]},{"body":"“Here is your ice, straight from the North Pole.”","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT Avoid buyers remorse..","not_safe_for_work":false,"locked":false,"body":"LPT- Avoid buyers remorse… Wait 24-48 hours before making any purchases over a set amount (dependent on your income and resources). Very rarely will you wish you spent that hard earned money sooner.","score":8,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I have a list in my head of larger purchases I want to make for the right price. So if I find that tool or whatever for the right price I can jump on a good deal. Anything else I always sleep on it. Usually I wake up and realize it's a waste of money.","score":2,"comments":[]},{"body":"Yeah, def have quite a few purchases that I regret, which I don't think I would have completed if I waited 24-48 to decide. Especially hard if you're a mix of impulsive and indecisive, depending on the day lol","score":1,"comments":[]},{"body":"I’ve used a process of waiting X number of days per dollar amount of cost that is adjusted as your income level and standard of living changes. $100/day is a good starting point. That’s helped me spend appropriately on splurges and curb impulse purchases.","score":1,"comments":[]}]},{"title":"LPT: Make Brown Butter in the Microwave","not_safe_for_work":false,"locked":false,"body":"So, i just tried it and the process is far easier than the traditional method. Simply place your butter in a microwave safe bowl with a lid (i used a plate and some parchment paper to act as a lid) then microwave on high for 5-7 minutes checking every minute starting at the 4 minute mark. Pull out when brown bits are floating and microwave smells nutty. No constant stirring or splatter on stovetop.","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"There’s nothing hard or complicated about making it on the stovetop. Just gotta keep and eye on it and stir it up a bit. It’s done when it smells delicious.","score":1,"comments":[]}]},{"title":"LPT Request: Homeless","not_safe_for_work":false,"locked":false,"body":"Genuinely curious what collection of LPT's are out there for homelessness. How to survive. How to get help if desired. You name it.","score":9,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Depending on your situation as a last resort you can check yourself in to a 72 hr evaluation in a psych ward. First, “3 hots and a cot”.. Second you’ll be assigned a social worker who will help you navigate the social services in your area. Lastly you may find other LPT’s, hidden psychiatric issues, effects of PTSD. Occasionally you’ll discover that there’s a reason why you might have slipped through the cracks, (so to speak) and if applicable meds and therapy to get on track. \nI’m speaking from personal experience here. A handful of stays in the ward helped me understand how and why I felt so at odds with the world.","score":12,"comments":[]},{"body":"Varies on location but see if you can get your county general relief benefits. In Los Angeles County they are $221 a month. Then find a theme park that has a low cost annual plan, we have two options, Knott's and Magic Mountain. The meal plan and entrance fees are surprisingly low. I mean less than $40 a month. Then you have a safe and clean place to legally be, and two meals taken care of each day. Plus your spirit will definitely thank you versus hanging out with other homeless too often. Read a book, work on yourself, relax. Think about what you need to do to get off the streets. 🍀","score":9,"comments":[]},{"body":"This is very much going to be dependent on location.","score":3,"comments":[]},{"body":"Also, do what you can to be admitted to a hospital in a more affluent neighborhood. It can be disheartening to find yourself alone with truly crazy people. Of which I am one.","score":3,"comments":[]},{"body":"Click where it says r/Lifeprotips then in the search bar type homeless or homelessness","score":4,"comments":[{"body":"The real LPTs are always in the comments after all","score":3,"comments":[]}]},{"body":"Find a cop about a shelter.  Get a monthly bus pass. \nFind a restaurant job. And you have your start.","score":1,"comments":[]}]},{"title":"LPT: When drinking alcohol, have a glass of water between drinks.","not_safe_for_work":false,"locked":false,"body":"This is a great way to stay hydrated (which helps reduce hangovers) and will help you naturally pace yourself. This is especially beneficial at parties or social situations where you might over indulge or drink too much, too fast.","score":519,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"For hangovers, don’t take Tylenol (paracetamol) It’s processed in the liver and the liver is busy with the alcohol. Take advil or something processed in the kidneys for faster relief.","score":123,"comments":[{"body":"Very good advice.  I made that mistake in 2021 and learned not to do that again.","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Very good advice. Fact is that acetaminophen (Tylenol) + alcohol is the most common cause of acute liver failure.","score":14,"comments":[]},{"body":"Don't even take Tylenol when drinking.","score":27,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Vitamin B complex before bed.  Thank me, and yourself, tomorrow.","score":11,"comments":[]},{"body":"I've done that here and there over the years. Can confirm i'm functional the next day bu t you'll spend most the party in the bathroom","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When drinking water, have a glass of alcohol in between drinks.","score":37,"comments":[]},{"body":"Thanks Glen Howerton, you decoded the secret of the most widely accepted general advice everyone has already heard","score":5,"comments":[]},{"body":"Terrible way to party. We tryin ta get fucked up mate.","score":91,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: If your grocery shopping in a busy store, don't push your cart into the already crammed aisles. Instead, leave ur cart near the main aisle and weave yourself through the aisle collecting your items. It makes grocery shopping quicker and also more pleasant.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Leave your cart as an obstruction, and walk off?","score":1,"comments":[{"body":"Main aisle is usually empty. All the traffic is in grocery aisles.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Spoken like someone who has never lost items from their cart.","score":1,"comments":[{"body":"Why would anyone loose items from their cart?  They'd still have to pay for it..... this is one lazy world we live in.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The benefit of doing this is massively outweighed by the potential hassle factor should someone walk off with items or the cart. Thus, this is not a Life Pro Tip, it is a Life Mediocre Tip.","score":1,"comments":[{"body":"I've been grocery shopping for 17 years and not one of my unpaid grocery items has left my cart! Lol","score":1,"comments":[]}]},{"body":"Until someone decides they want a cart and walks off with yours...","score":1,"comments":[{"body":"Rule number 1: never leave your  empty cart unnatended at Costco or bj's.... always throw a few things in it, to let others know it's taken..... or you can always lick the handle, noone will want to take it after that.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Most people who are in a rush already do this. For the most part,  the ones blocking the aisles are  little old ladies and women with kids in their cart (which i dont mind) .....but  if you are a single abled person blocking the aisle, I will ram my cart into yours, and we shall have a standoff for the right of way.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT request: how can i deal with your partner's \"chew sound\" that after the pandemic is literally driving me crazy? I've rage attacks as soon as she starts chewing","not_safe_for_work":false,"locked":false,"body":"Basically during and after the pandemic we started eating together many times at home while before it didn't happen that often cause I used to have lunch at my workplace. \n\nNow something that in the beginning was just a bit disturbing is becoming a pain, I literally have anger/rage attacks as soon as I hear any chewing sounds coming from her and I don't know how to deal with this, I can't just tell her to stop eating or even chew gum when she is next to me. \n\nI don't know if this is something normal but I can swear that I feel like I need to start kicking things or punching my couch to calm down, and i don't want to show anything of this to her cause i feel like she'd think I'm crazy for having these rage attacks for just a chew sound.","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Sounds like Misophonia. I feel your pain.","score":12,"comments":[{"body":"Try beta blockers.\n\nThey stop you from having an adrenal reaction, which is what misophonia triggers.\n\nSo whatever triggers it happens, and that's it.  There's no reaction.","score":3,"comments":[]}]},{"body":"While chewing sounds can be annoying to a lot of people, your reaction is extreme. I would suggest getting some ear plugs made for filtering out noises.","score":4,"comments":[]},{"body":"I have misophonia and feel exactly the same. I suddenly get the urge to literally punt my other half into the stratosphere or smother him. It's amazing how quick the feeling comes on. I recommend some earplugs called 'loops'. Saved our relationship I swear!","score":4,"comments":[]},{"body":"Try having 'noise' in the background, such as a TV, music, sound machine...","score":3,"comments":[]},{"body":"I mean… you could talk with her about possibly closing her mouth when she eats because it’s a pet peeve of yours and you don’t necessarily enjoy listening to it?","score":7,"comments":[]},{"body":"Let it go. My wife is a loud chewer, but if she was gone then the silence would be worse.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That sounds like misophonia. I deal with it too.","score":2,"comments":[]},{"body":"Have a radio or tv playing while eating.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Use Alum Powder for Canker Sores","not_safe_for_work":false,"locked":false,"body":"Alright y’all, have I got the LPT for you! \n\nI suffer from canker sores quite frequently, probably get one every 6 weeks. If you’ve had one, you know - these little bitches are equal parts annoying and painful. You can’t eat. You can’t talk, you can brush your teeth without wincing in pain.\n\nSo I had one last week, about 4-6 days left on this asshole as is typical for me. I read on some random forums to try Alum powder, though theres no research or medical backed studies to prove, apparently this stuff works miracles.\n\nI had nothing to lose, so I bought some from Family Fare for $5.99. McCormicks brand of spices sells in the spice aisle, so I wasn’t that worried about safety, but note that you CANNOT ingest it in large quantities.\n\nAnyway, took a tiny amount on a q-tip, pressed it on (which does hurt momentarily), left it on for one minute, then rinsed my mouth thoroughly. \n\nThat mother fucking canker sore was GONE within 24h!!! I wanted to share this with the world given all the absolutely useless canker sore remedies they sell OTC. Spread the word!!!","score":11,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Def a magic thing when I used to get them. Ended up finding out I was sensitive to an ingredient in toothpaste that I had been using. Was lucky my hygienist brought it up, rarely have them now unless I bite my cheek or something. So you may want to see if you switch to a brand with less ingredients if it helps :)","score":2,"comments":[]},{"body":"Another hot tip to add to this: vitamin B12 has been shown to eliminate canker sores even in people with a normal blood level. This is anecdotal, but we had a real life incident of this. We have a genetic B12 deficiency in our family. I went to Disneyland with my family, most of who are not blood related except my nephew and I. He and I were the only ones who got canker sores while there, for some unknown reason. I took my normal B12 sublingual when I got home, and it cleared up immediately. Light bulb moment. Told my nephews mom about (dad is the blood relative, not mom), she gave him one, and his cleared up immediately as well. There are studies showing quite a strong link with aphthous stomatitis and B12 deficiency. So keep that in mind if you're getting frequent canker sores!","score":1,"comments":[]},{"body":"Try Lysine.\n\n I have had bad ulcers since a kid. Sometimes required courses of prednisone to prevent them closing off my throat. Started taking 1000mg of Lysine a day. 2000mg when ulcers appear. I get the 500mg dose and split dose between breakfast and before I go to bed. Doesn't prevent them... BUT shortens the cycle. Sometimes they never burst all the way open either. DON'T stop taking the Lysine after they disappear! Been an idiot a few times or forgot. Bamm. The ulcers come back just as bad. Also stop using tooth paste with Laural Sulphate. It irritates the ulcers. \n\nFun Fact: Farmers give Lysine to stop ulcers and sores on cows utters from milking!","score":1,"comments":[{"body":"Canker sores and cold sores aren't the same thing.\n\nCold sores are caused by herpes virus. Cow pox sores are caused by a virus. Canker sores have an unknown cause (but not viral).","score":1,"comments":[]}]}]},{"title":"LPT: If you find a lost item at a shopping mall (cell phone, wallet, keys, etc.) don't turn it in to a nearby store, turn it in to property security.","not_safe_for_work":false,"locked":false,"body":"It's a practical thing: people tend to retrace their steps and will call the stores or restaurants they went to after they call security. If you turn it in to a random store, there's a chance that whoever lost the wallet never actually went there. Even assuming that they'll call every single store in the area, giving it to security will save them a lot of time and anxiety.","score":16,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I’d you return it to a random store in a mall, they’d also likely return it to security","score":4,"comments":[{"body":"This is also true. They also can give you the number.","score":1,"comments":[]}]}]},{"title":"LPT: Never rest a lid on a container without screwing it on!","not_safe_for_work":false,"locked":false,"body":"Why yes a gallon of milk did just get spilled by one of my kids because they thought the lid was on, but my other kid had just rested it on top of the jug after having a glass…","score":15,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"This is more of a life for dummies tip.","score":6,"comments":[{"body":"Can't even install a bathroom extractor fan 🤔","score":1,"comments":[]},{"body":"Well, you woukd know!","score":0,"comments":[]}]},{"body":"Great point, I've spilt stuff due to this a few times.","score":2,"comments":[]},{"body":"This is a good tip that reminded me of an unfortunate incident. Whenever I buy groceries, I have to carry them all up to my apartment using stairs since there's no elevator here. I have to make multiple trips going up and down because there's nobody to help me. Since I'd get very tired and almost go out of breath carrying heavy stuff (multiple floors), I'd always prepare a bottle of water to drink. One time, I just put the cap on but didn't lock it in place. I forgot about that fact, and when I was all done carrying stuff, I grabbed the water bottle and threw it to my bed because I usually keep a few bottles of water there to drink while doing stuff on the computer. The lid flew off and my entire bed got splashed lol!","score":2,"comments":[{"body":"See, that crisis would have been avoided if you follow this simple LPT. :)","score":1,"comments":[]}]}]},{"title":"LPT Don't Fall For The Fallacy Of Relative Privation","not_safe_for_work":false,"locked":false,"body":"Many people use this as a way to \"defeat\" valid points.\n\n\"The fallacy of relative privation rejects an argument by stating the existence of a more important problem. The existence of such a worse issue, the fallacy insists, thereby makes the initial argument irrelevant. This fallacy is also known as the appeal to worse problems or “not as bad as”. \"\n\nhttps://academy4sc.org/video/fallacy-of-relative-privation-all-problems-are-relative/","score":6,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Oh yeah? Well that’s not as bad as the Slippery Slope. As soon as that happens people start fighting and then everyone starts not-living. Everyone.","score":8,"comments":[]}]},{"title":"LPT: Swallowing Capsules","not_safe_for_work":false,"locked":false,"body":"When swallowing a capsule, put the capsule and some water in your mouth. Tilt your head forward to look at the floor (chin to chest), and then swallow. \nCapsules float because they have air in them. If you do the normal ‘look up’ when swallowing it, it will be the last thing to go down your throat, and may get stuck. If you ‘look down’ instead, the capsule will be closest to your throat, go down first, followed by the water, and will be much easier to swallow.","score":18,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Chin to chest is also frequently advised for seniors with risk of aspiration","score":6,"comments":[]},{"body":"This seems like a great idea!","score":4,"comments":[]},{"body":"Or you could just use a straw. That's the best method I know of for easily swallowing pills. Just put the pill on your tongue, form a tight seal around the straw, and suck - the pill goes down super-easy in most cases. Also works well when sucking water out of any kind of tube. They key is the suction effect.","score":4,"comments":[{"body":"I’ll have to try that!","score":3,"comments":[]}]},{"body":"Or stick out your tongue &amp; place the pill towards the back of your tongue. When you pull your tongue back in your mouth to take a drink of water, the pill is almost in your throat &amp; easier to swallow.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I’ve never been able to swallow pills so I will try this next time","score":3,"comments":[{"body":"Do note: This is specific to capsules, not regular solid pills.","score":2,"comments":[]}]},{"body":"This works for capsules because they float in water. For solid tablets, which sync, do the opposite. Put the tablets in your mouth. Take a comfortable sip of water. Point your face upward so the water is at the back of your mouth and the tablet sink to your throat. Then swallow. This works with a handful of tablets all at the same time.","score":2,"comments":[]},{"body":"I do it like a pelican: chin to chest then chin up and swallow in a powerful movement and it slides right down your throat.","score":2,"comments":[]}]},{"title":"LPT: immediately following up a request, favor, or instruction with \"please and thank you\" is rude","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Is it? Even if they forgot to say please in the previous message? Maybe they're just trying to be polite","score":7,"comments":[{"body":"I meant to say that it's rude immediately after requesting a favor or instruction. I'll repost this with that included in the title","score":-1,"comments":[]}]},{"body":"Mmmm this is an intonation thing. \n\nIf I'm ordering at a restaurant, and I'm all \"hey, could I have some Ketchup? Please and thank you.\" I don't think that's rude.\n\n\"Vanilla soy chai latte, no cream, 2 pumps of sugar, extra cream. Please and thank you.\" Might be. \n\nIt's all intent and inflection.","score":1,"comments":[{"body":"Idk I always ask \"when you get a moment could you please grab us some ketchup?\" then thank them when they return with the ketchup.\n\nI don't really ever hear it except from jerks, and usually when they're asking for unreasonable things that I am not obligated to do. My ex asking if I'd pick her up a $9 pack of cigarettes on the way to drop our daughter off in the same message that she said she won't be able to meet me halfway (again), a coworker who tries to push her work off on others even though we give her the easier stuff. Stuff like that\n\nIt seems to me like they're trying to end the conversation to remove your ability to refuse or delay the favor, but I might be looking too far into it.","score":1,"comments":[{"body":"Sounds like you associate it with some frustrating shitty things/people. I've always heard it as a \"you are due to the formality of thanks, but I also understand you're busy so we aren't making a big deal about formalities.\"","score":1,"comments":[]}]}]},{"body":"I don't know that It's rude, but it is annoying.","score":2,"comments":[]},{"body":"I get requests signed please/thank you from inconsiderate rude jerks.","score":1,"comments":[]}]},{"title":"LPT: If you have chronic lower back pain, try stretching your hip flexor muscles.","not_safe_for_work":false,"locked":false,"body":"Disclaimer: not a medical professional. \n\nTo do the stretch, just lunge and focus on pressing your hips forward while keeping your back foot on the floor. Don't over exert yourself, and use a wall to maintain your balance.\n\nExcessive sitting can cause the hip flexor muscles to shorten, tilting the pelvis forward and misaligning the lumbar region of the spine causing lower back pain.","score":67,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I had to google what a hip flexor stretch is, so I'll save other people the search\n\nHip flexor stretches [here](https://www.healthline.com/health/fitness-exercise/hip-flexor-exercises) and [here](https://myhealth.alberta.ca/Health/aftercareinformation/pages/conditions.aspx?hwid=bo1616)","score":14,"comments":[{"body":"These are great stretches for *really* stretching it out, but I'd argue that most people will feel the stretch with the basic standing lunge. I personally do the kneeling stretch in the second link. You can elevate the rear foot and stretch the quad at the same time. Great finds, thanks for the links!","score":1,"comments":[]}]},{"body":"As someone who has severe lower back pain and I’ve heard this many times before, this can help in the early stages with minor back pain, but severe back pain has a reason, usually a worn out or herniated disk, causing vertebrae to rub painfully. Go and see a neurologist before it gets worse. You probably need surgery to fix it.","score":14,"comments":[{"body":"YMMV but I have multiple herniated discs with a major L5/S1 issue that led to lack of feeling in a leg and drop foot. Stretches like these along with PT, core training, and posture focus (a big one being opening my hip flexors while sleeping) is what let me avoid risky corrective spinal surgery.","score":5,"comments":[]},{"body":"Agreed, this is not a solution for severe issues, but it's a great first thing to try.","score":4,"comments":[]}]},{"body":"Also, check out this 5 min video. \n\nhttps://youtu.be/C_3phB93rvI. \n\nAnd the book Healing Back Pain by Dr John Sarno. \n\nAnd free Pain Science Workbook by Greg Lehman and some of his stuff In general","score":3,"comments":[]},{"body":"100% OP. Ton of back pain can be helped and cured by keeping supple with regular stetching throughout the day.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: don’t throw out broccoli stems. Instead use them in stir fries. They’re crunchy and absorptive of sauces and spices.","not_safe_for_work":false,"locked":false,"body":"","score":880,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"People throw out broccoli stems?","score":195,"comments":[{"body":"Yeah, I just eat them, wth.","score":88,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I cook with them but sometimes I give my dog a couple small pieces. He loves broccoli.","score":7,"comments":[{"body":"i need u to post ur dog eating broccoli","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"I just peel off the hard outer green part and cook the white inner part with the rest of the broccoli. Otherwise you're just wasting perfectly good food.","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Also, I chop up broccoli and use the stem as well to make broccoli slaw. A nice change from cabbage.","score":9,"comments":[]},{"body":"I genuinely dont enjoy a stir fry UNLESS it has loads of broccoli in it.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cooked properly, they're a great stand in for water chestnuts IMO.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"people dont eat broccoli stems?? TIL","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Before planning to go to a destination, subscribe to the places hashtag on IG. That way you will automatically get to know the best places in the destination to visit, and plan for it","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"This is a great pro tip, Thank You for sharing. 😊","score":2,"comments":[]},{"body":"No I think the last place I want to go is where all the children are taking selfies of themselves and posting it online. No thank you.\n\nAlso, I usually find out where you want to go BEFORE going on vacation, not once you get there…","score":1,"comments":[{"body":"Hot take!\n\nI don’t want to go on vacation where people take pictures.\n\nSpoiler Alert!\n\nPeople have been obsessed with taking pictures on vacation, literally since the invention of reasonably priced/speed cameras.","score":1,"comments":[]}]},{"body":"There will also be zero suprise left for you, making the destination a whole lot less interesting.","score":-1,"comments":[]}]},{"title":"LPT: Set a chore timer right when you get home from work","not_safe_for_work":false,"locked":false,"body":"Nobody's ever in the mood to do household chores like doing the dishes or taking out the trash, but there's no doubt that it's easiest to get them done right when you get home. If you sit down and relax first, it's a real pain in the butt to make yourself get up later. But how can you get yourself yourself to do chores when you just got back from a hard day of work?\n\nWhat I've been doing lately is setting a 10 minute chore timer as soon as I walk through the door. If there's no end point to the work, all I'm thinking about the whole time is how much I have to get done. With that timer running, what I think about instead is that, no matter how hard the work is, I only have to do it for ten minutes. It's shocking how much I can get done in that time if I'm not overwhelmed by the size of my to do list","score":168,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Many years ago I was tasked to create new games for my kids elementary school. So I made up \"BEAT THE CLOCK\".  We made a 'kids bedroom,  complete with a bed to be made, clothes to be folded and put away, toys on the floor to be picked up and put away, etc. The idea was the kid would tell a time monitor they could do all the tasks in under 4 minutes, while doing a good job at all tasks. Every kid did it  within time and felt like a winner and got a prize!","score":27,"comments":[{"body":"Hey kids! Who wants to play CLEAN OUT THE GARAGE?? \nWho thinks they can do it in less than 12 hours??","score":6,"comments":[{"body":"Honestly, if you made it a YouTube or TikTok challenge, it would probably work. \"Our KIDS had to clean the ENTIRE GARAGE in only 12 HOURS?!?!?!\"","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I save my favourite podcasts for when I'm doing chores. It actually makes it an enjoyable experience!","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Time blocking with a general goal is an excellent life pro tip. If you do it consistently, you get a ton of stuff done, and you don't get bogged down with all the mental labor of planning out what you're going to do and how long it's going to take. It works well with lots of things: household chores, organizing files on your laptop, exercise, responding to emails. Excellent tip.","score":7,"comments":[]},{"body":"Mum? How'd you find me on here?\n\nI told you I'll do them after this game!!","score":3,"comments":[]},{"body":"This is a great tip! I keep being reminded lately about the idea that consistency is the most important thing in maintaining a home, as well as many other things (learning, fitness, etc.). \n\nI have experienced it myself, where for about a year I had a great daily and regular schedule going and everything was so easy! Doing 10 minutes every day was not at all hard, and easier to fit in than trying to plan an hour or two of housecleaning.","score":6,"comments":[]},{"body":"Thanks for posting. I'll give this a shot","score":5,"comments":[]},{"body":"Will try when I get home. Aaahhh the tortuuuuure.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: Blow your nose in the shower for a booger free day.","not_safe_for_work":false,"locked":false,"body":"Might sound gross, but especially if you take hot/warm showers in the morning, blow your nose right into your hands then wash the boogies right down the drain. I’ve been doing this for probably 10 years now and it’s rare that I’ll get caught with a bat in the cave during the day.","score":435,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"The best is when you get a handful of boogies and half your face and brain feel lighter.","score":245,"comments":[{"body":"You can just feel your whole sinus cavity empty out. It's both disgusting and extremely satisfying.","score":124,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I would, if my fucking boogers would stop going to the back of my throat 24/7","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Just make sure your boogies go down the drain, they dry like glue.","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":" I was at the every end of my first 24hrs alcohol free when I took a nice hot shower at midnight.  I blew my nose and out came this HUGE blood clot, like the size of my ring finger. I had no sinus issues or even the sniffles before this, and it was July 4th, no allergies.  After that my cravings were like, gone. I donno.  I called it my alcoholic aneurysm, lol.  That's my shower-snot-sober story.","score":84,"comments":[{"body":"What the fuck","score":47,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Will it work at night too?","score":17,"comments":[{"body":"Sadly no. Your boogers are asleep at night and won't come out.","score":95,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Maybe, it’s a snot in the dark","score":23,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT Request - Moving Tips (Cheap rentals, cost/time savers, ect)","not_safe_for_work":false,"locked":false,"body":"LF Moving Tips (Cheap rentals, cost/time savers, ect)\n\nBeen staying with some family past couple years and finally got a good enough job I am able to move out. It's closer to my job and cuts my commute from a hour to less than 15 min. \n\nAfter all the deposits, fees, and other bs I have a couple grand left to pack and move with until the end of the month. Therefore I am looking for any way I can cut costs and save where I can on time or money. \n\nEx: I have previously rented a home Depot truck for an hour and found that if you do so when the rental department is about to close you can keep the vehicle until they open the next day at no extra cost. End up getting a moving van 7:30pm-9am next day for 30$. \n\nAny help appreciated","score":4,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"prepare ALL BOXES and write on them not what is inside, but what room.\n\nKITCHEN\n\nBEDROOM\n\nBASEMENT\n\nKIDS ROOM\n\nno need to write pans, pants, winter clothes.\n\nsa.e.size boxes prepared in the corridor will make wonders. get rental, move one big item (table) and fit small boxes around it when loading. repeat, cupboard, boxes, mattress, boxes.\n\nsaves space, and taking things out is easy as boxes, until big object is \"free\", repeat. all helpers just put the boxes in the rooms.\n\nOh, post it on the doors what is which room.","score":7,"comments":[]},{"body":"UHaul is usually cheaper on Sundays.","score":2,"comments":[]},{"body":"Printing shops will sometimes give you boxes for free. They are very sturdy and uniform in size so they are great for stacking in a uHaul. Down side is they are generally smaller in size. \n\nCheck with grocery stores and libraries to see if you can get boxes from them. \n\nStart saving plastic bags from the grocery store. These make good padding and can later be used as small trash can bags.","score":1,"comments":[]}]},{"title":"LPT: How To Get Started Earning With Surveys?","not_safe_for_work":false,"locked":false,"body":"Doing surveys is a legitimate way to earn money on the side. \nThis is possible because companies can improve their products, services, and marketing strategies using the answers that surveys provide.\n\nFor IPhone and Android, AttaPoll is a great app to get started with online surveys. \n\nPayment can be done with PayPal or Revolut, and are made it instantly with no minimum for cashout. \n\nCheck it out here:\nhttps://attapoll.app/join/guglq","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]}]},{"title":"LPT: If you have trouble with ice balls sticking to your dogs fur, try using a kitchen whisk!","not_safe_for_work":false,"locked":false,"body":"It works so well!! Just rub up and down &amp; the balls come right off painlessly &amp; without removing any hair! And my dog seemed to enjoy it.","score":5,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Or you could just move to Florida. It's a chilly 50 degrees here.","score":1,"comments":[]}]},{"title":"LPT: Enable 2 Factor Authentication for all your important logins","not_safe_for_work":false,"locked":false,"body":"2 Factor Authentications drastically reduce the chance that your account gets compromised and is illegally accessed. Even if a bad actor is somehow able to hack your password, with 2 FA, they can't get in. Usually, the second authentication method is a SMS your mobile number. All major Email providers, Financial institutions, and Social media websites have a option for 2 FA. You just have to enable it. It takes a min and can literally save your Bank Account from being emptied out.","score":44,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"But man, do I hate using 2FA for every godamn who-gives-a-shit web site and app that thinks it's important. Pain in the ass.","score":10,"comments":[]},{"body":"Authentication apps are a better way to do 2FA than SMS.  Sim-swapping is a thing, and not that hard to accomplish.","score":8,"comments":[{"body":"how is it achieved? does someone need physical access to your phone?","score":1,"comments":[{"body":"Don't need access to your phone. https://us.norton.com/blog/mobile/sim-swap-fraud#","score":2,"comments":[]}]}]},{"body":"I recommend using Authy ✌️","score":5,"comments":[]},{"body":"Security is an illusion.\n\n2FA can just be spoofed by sim cloning. The police use sms stinger equipment to catch 2FA sms all the time. If you solely use 2FA for all accounts a gov institutions can easily gain access to all your accounts. Even if you Google Auth, a gov sponsored compliance letter can make google handout your google account and with that your auth key. By using a central password service you just make it easier for a gov authorized hacker to take any and every account you have.","score":0,"comments":[]},{"body":"Sounds great, until they allow someone to recover my account using SMS which is insecure by design","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: If your shower takes a long time to heat up. Turn the hot water on the sink on too.","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"This makes sense! And if anyone's worried that this is wasting water, it's not. There's cold water in the pipes between the shower and the water heater. You've got to get it out of the way before the hot water from the heater can reach you. This just gets it done a little faster.\n\nSecond LPT for people who need everything spelled out: Once the water's hot, turn the sink tap off.","score":11,"comments":[{"body":"I keep a bucket for my dog’s water in the bathroom so I can top it off with the water I’m wasting waiting for the shower to get warm.","score":4,"comments":[{"body":"Water from the hot water side is not for consumption.  Cleaning only.","score":-1,"comments":[{"body":"This isn’t true for most of the developed world","score":1,"comments":[]},{"body":"Ummmmm.......\n\nNever mind","score":0,"comments":[{"body":"Yeah, don't even bother with that one...","score":1,"comments":[]}]}]}]}]},{"body":"I shave before I shower, at the sink. I’ll let it get hot while I put shaving cream on, then plug and fill it a bit and soak my razor so it stays warmer.  After shaving since the sink was hot it takes no time to get the shower hot.  The reason is the sink and shower share the same pipe to the water heater, purge the cold and you’re good to go.","score":1,"comments":[]},{"body":"Yep my husband turns the hot water on the tub first then gets in the shower when he knows the water is hot","score":1,"comments":[]}]},{"title":"LPT Request: How to lock a door when there is no lock mechanism in it?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"There's a category of device called \"travel door lock\" that you can use if you don't trust the lock(like if you're staying in a hotel or AirBnb). They sell they on Amazon, and they should work for what you're looking for.","score":5,"comments":[{"body":"Or, as they are called In my house, fucklocks","score":1,"comments":[]}]},{"body":"Install a lock. Even a simple latch and padlock if needed.","score":1,"comments":[]},{"body":"Card board shim under door,... Make sure you can get it out. \nProper chair","score":1,"comments":[]},{"body":"You can put a latch or bar on it.  What's the actual situation?  Don't want to replace the door knob with one with a lock or are we talking some kind of temporary thing where simply wedging the door closed would be fine?","score":0,"comments":[{"body":"Ah, i forgot to put \"public doors\" in the title 💀 f.e school trip for a few days where your friends like to do a little bit of extremely funny trolling.","score":1,"comments":[]}]}]},{"title":"LPT: Don't just let kids win at games. You can slow it down, you can teach them strategy, but keep it real. Someday, they will beat you fair and square, and it will be a moment they always remember with pride.","not_safe_for_work":false,"locked":false,"body":"","score":42689,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"God, when we had family gatherings, my aunt and uncle would suggest we play board games together. Not a bad idea on the surface, but my little cousin ALWAYS had to win, and he'd blatantly cheat or change the rules in the middle of the game. He never got reprimanded or anything, it was always just \"well, I guess he wins again!\" So infuriating--a total waste of time, and instilling the concept that winning is everything and cheating is ok.","score":5110,"comments":[{"body":"My kid once cheated against me, and I just told him that I would stop moving my pieces the rest of the game so he could win. He quickly found out it was no fun and he doesnt cheat anymore. \n\nIt's natural for kids to cheat, they are supposed to test boundaries, and it's grownups job to set them.","score":1710,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What’s he/she like as an adult? My brother always mollycoddled his son who was a little asshole, and now he’s grown up and guess what, he’s an asshole.","score":862,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Play age appropriate games and they'll have a chance. \nCandyland is anyones game and still teaches you to take turns and follow instructions. \n\nPeaceable Kingdom makes age appropriate cooperative games.","score":2014,"comments":[{"body":"I play Warhammer 40k with my toddler. Idiot loses every time.","score":123,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"When I was 5 my dad started teaching me to play chess. He never let me win. When I was seven I finally beat him and he has refused to ever play chess with me again but encouraged me to join a club and even payed for tutoring. Played in the South African under 18 provincial chess championship when I was 11 so that was nice. Once I became a teenager I decided chess wasn't cool and refused to keep playing. \n\nI really regret that now, one day when I have time I will rejoin a local club.","score":1596,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Crush your children \nSee them driven before you\nAnd hear the lamentation\nOf their action figures","score":672,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My dad never let me win at checkers and ping pong when I played him growing up. Now I never lose to him in either lol","score":231,"comments":[{"body":"The future is now, old man","score":132,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: A second basket for clothes that need special care","not_safe_for_work":false,"locked":false,"body":"If you have clothes that need special care, such as knits or sheer clothes that should be washed in the gentle cycle or hung to dry, then put them in a smaller separate basket. When you or your spouse (or your servant, you lucky few) does the laundry then they get a good reminder at the beginning to note that some clothes need special attention. And the chance to recognize and review the specific clothes that should be handled differently. Some clothes, after all, might not stand out all that much if you aren't looking for them.\n\nOr, alternatively, it lets you do a simple load with only the more rugged clothes.","score":9,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]}]},{"title":"LPT for bubble baths","not_safe_for_work":false,"locked":false,"body":"if  there are too many bubbles that start overflowing the tub, a few drops of bath oil will immediately bring it back under control. Realized this when it happened to me and I thought about how you keep a pot from boiling over- add a couple drops of oil. Tried it and worked like a charm","score":2,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]}]},{"title":"LPT: If you find yourself stuck with indecisiveness over a difficult decision, do something else that is pro-active and productive that you know must be done.","not_safe_for_work":false,"locked":false,"body":"It can reset your perspective, momentarily raise your self-esteem, and take care of one less thing on your to-do list.","score":38,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I go outside and have a cigarette. Think about fishing or at the beach. Come back anew.","score":4,"comments":[]},{"body":"A quote a friend told me once still sticks with me: sometimes the wrong decision is the right decision.  \n\nSometimes, when dealing with something tricky and nuanced, any decision is better than endlessly debating options and wasting time analyzing every possibility.","score":3,"comments":[]},{"body":"I do this for work all the time, in fact I try to avoid turning in projects at the end of the day/night because you'd be amazed what 15 minutes of fresh eyes the following day will catch","score":2,"comments":[]},{"body":"This is easy for a procrastinator lol. It actually ends up creating a bigger problem","score":1,"comments":[]},{"body":"You have chosen Procrastination. Good luck climbing out of that blackhole.","score":1,"comments":[]},{"body":"That's just productive procrastination. There are better strategies, like doing a risk analysis or some variation on a pros/cons, then sleeping on it. Another option is see if there's a way to make the decision smaller - can you do the thing in stages? Can you give provide yourself opportunities to back out?","score":1,"comments":[]}]},{"title":"LPT: move your savings to an online bank, in 1/2 month the interest I've earned would've taken 12.5 years. I still have my old accounts for convenience but moved my emergency fund to a FDIC insured online bank.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I know there's a couple banks out there with better rates, but since I already use AMEX I moved my savings to them earlier this year. Rate was 1.5% when I moved, but is up to 3% currently.","score":4,"comments":[]},{"body":"FDIC insured is critical. Some people have used online banks that are not and have lost thousands of dollars. With no physical branch and no FDIC they are just out the money. This was a big issue with Chime a year or so ago.","score":2,"comments":[]},{"body":"Right now, your savings account should have 3% APY. Don't accept anything less!","score":1,"comments":[]},{"body":"It’s important to have an easily accessible bank *and* an online bank.\n\nIt’s not super easy to put money into an online bank without a physical bank account to transfer from, and of course you want enough in that account to meet minium","score":1,"comments":[]},{"body":"Hmmmm.... I will def look into this. Thanks. This is a good one","score":1,"comments":[]}]},{"title":"LPT Request: What are some ways to find out if a company is good or bad before joining?","not_safe_for_work":false,"locked":false,"body":"I've seen my previous company use services like removify to remove negative comments on Glassdoor.com and Google reviews to put them in a positive image","score":6,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"I think checking the turnover rate may help","score":9,"comments":[{"body":"Yes, this reflects a toxic work environment. Last place I worked (in the Accounting Dept) my boss had a catered company Christmas luncheon for us. There were new people in the department, so she had everyone go around the table and introduce and say something about themselves. EVERYONE (about 12 employees) mentioned that they had been there for less than two years, with the exception of one person. That should have been our clue to get the hell out of dodge, but no one picked up on it. We've all moved on now, but she is still with the company. To this day, I don't understand why they haven't fired her. I'm guessing she has something on the company.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Go to the bathroom. If the toilet paper is the cheapest, roughest, thinnest available, they're not concerned about employee comfort.","score":26,"comments":[{"body":"Lol.  So, work nowhere.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"18years of job experience here. Many many jobs, service industry to construction. My best advice is the manager/supervisor is honest from the beginning, you're alright. The moment you see them back out on their word, run. \nI currently work at a steel distribution company. Turn over rate is ridiculous but only because it's a dangerous job. But it's the best job I've ever had because safety is number one. They make sure you take your breaks and the team works together. I'm happy.","score":7,"comments":[]},{"body":"Ask them how they measure your performance and how promotions are handled. They could just bs but if you time the question out of left field you might catch them stumbling. Another good one is leave/work ratio.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Glassdoor.com is ok, but companies do pay to get bad reviews removed or good ones added.\n\nIf you get an interview…\n\nAsk why the position is vacant or why the previous person left the job. \n\nAsk them directly about their DEI initiatives (diversity, equity, and inclusion). A decent company will be able to name at least a few things that they’re doing or have done to have a balanced workforce. A bad company will just have a generic response saying that it’s a priority and one of the things they like to focus on.\n\nBe wary of job postings for what appear to be established companies that talk about building processes from the ground up or pioneering the creation of teams. Established companies should already have those things in place and you would slide in as a cog in the wheel. Companies with turmoil have to constantly rebuild them because something went wrong or everyone left.\n\nAsk anybody who you interview with how long they’ve been with the company and how long the people on their team have been with the company. If everybody has a short time frame that’s a sign that people don’t last very long and it’s probably for a good reason.","score":16,"comments":[]},{"body":"How do you check the turn over rate?","score":4,"comments":[]},{"body":"Check out the employee cars in the parking lot. If they're all older cares, maybe the company doesn't pay that well for them to get newer cares. Also ask employees (if you can) how long they've been there. High turnover equals bad management.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"LPT: store your chap stick upside down in your pocket","not_safe_for_work":false,"locked":false,"body":"LPT: Everyone knows righty-tighty, lefty-loosey. Ever wonder why your chap stick is always sticking out way too far after taking it out of your pocket. Try it upside-down, physics will take over!","score":0,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"More splanation please?","score":2,"comments":[]},{"body":"Cap down? Spindle down? That's not enough of an answer.","score":1,"comments":[]}]},{"title":"LPT Request: How I can increase my oxitocin level without getting myself a girlfriend, friends or a pet?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.","score":1,"comments":[]},{"body":"Hug random strangers.","score":7,"comments":[{"body":"I wish I could do that. I rarely get hugs.","score":2,"comments":[]}]},{"body":"Aerobic exercise. Running or walking.","score":12,"comments":[]},{"body":"Stuffed animals? Body pillow? My kids legit love their animals, might feel odd as an adult but who cares if it helps. \n\nMaybe boost other mood hormones naturally. Exercise, get out into nature(fly fishing has greatly improved my life) learn a new skill or hobby.","score":4,"comments":[]},{"body":"Adopt a kid? More realistically, maybe volunteer in a Big Brother / Big Sister program where you mentor a kid. Probably not ethical to do this just for your own oxytocin level, but if you’ve always been interested in volunteering with kids, this might be the time to act. \n\nI am not sure if this is a true story, but I heard of a veterinarian office getting broken into where they stole oxytocin, thinking it was OxyContin. Apparently it is used with pets giving birth. You probably should not do anything based on this anecdote, though.","score":3,"comments":[]},{"body":"Long hugs, nipple stimulation. Orgasm. Eating food. Administration of exogenous oxytocin.  Or volunteer at an animal shelter to get that doggie high.","score":2,"comments":[{"body":"All at once? Can you please talk to this officer?","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You could go walk dogs at a shelter. Get the oxytocin from snuggling them, some endorphins from the walk. Great!","score":2,"comments":[]},{"body":"It's a hormone that is activated by social interaction and reproduction. \n\nThere's things like cuddle bars that would help but if can't be produced artificially.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]}]}