{"name":"memepiece","description":"The best place to find One Piece memes! We celebrate the comedic and casual side of the One Piece series. Casual or low-effort content, normally removed from /r/OnePiece, is likely welcome here! \n\nCome join our discord server at discord.gg/sjkDW72","subscribers":265232,"posts":[{"title":"SPOILER RULES UPDATE!","not_safe_for_work":false,"locked":false,"body":"After the break month, spoilers suddenly became the hot memes around here, and you guys...hated it.I don't think we've ever seen so many discussion posts talking about a subject like this. So the mod team directly [polled the users](https://www.reddit.com/r/MemePiece/comments/wwmgpr/subreddit_poll_should_spoilers_be_allowed_before/), and in an overwhelming victory, banning of spoilers before scans won.\n\nSo here are our new spoiler rules and policies:\n\n**Events from the manga that have not yet occurred in the anime are considered spoilers and must be marked as such.**\n\n**Posts  about new chapters, or posts that contain spoilers for new chapters may  not be made until after the unofficial release of the chapter(scans)**\n\n**Until the official release(Viz/Shonen Jump), posts about scans must only have the chapter number in the title.**\n\n**Anime spoilers must be marked for 48 hours after an episode premieres, this includes putting the episode number in the title.**\n\nAs you can see, posts about spoilers are no longer allowed, and we've also changed it so any post made about scans can only have the chapter number in the title. So your memes will have to be extra good to stand out on their own! Also, spoilers must be marked this way until the official release. Anime spoiler rules are the same as before, and we will start enforcing them more.\n\nBut for those of you that still want to discuss spoilers here, fret not, we will be making a weekly pinned thread where people can discuss and link spoiler memes all they like. Please look forward to the first one this week when confirmed spoilers drop!\n\nWe hope these changes will make your time here on r/MemePiece even more enjoyable!\n\nUPDATE!: Posts may have titles if they are kept vague enough. Happy memeing.","score":514,"comments":[{"body":"Nice. You’ve handled it well","score":117,"comments":[]},{"body":"Finally, tired of leaks.","score":67,"comments":[]},{"body":"Thank you","score":38,"comments":[]},{"body":"I had to unsubscribe because I got spoiled twice and as a caught up manga reader that is a complete fucking joke. Like wtf is wrong with people I just wanted to enjoy memes, I know they were spoiler tagged but on mobile I just assumed the blur is because of nsfw. NOPE spoiler from a chapter that isn't even scanlated yet smh. \n\nThank you mods for this change I can now safely subscribe again.","score":36,"comments":[{"body":"Welcome back!","score":13,"comments":[]}]},{"body":"Good shit","score":16,"comments":[]},{"body":"Makes sense, with moving to the endgame there are a lot of discussions about stuff that can ruin or spoil big reveals or hype for anime only or people starting OP\n\nGranted if you aren’t caught up then I’d always recommend caution when going to any fandom subreddit especially for the worlds best manga with so many followers.","score":57,"comments":[]},{"body":"Good job, MemePiece mod team! Kudos!","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Thank you so much. Imo this is a rlly good idea.","score":24,"comments":[]},{"body":"Weekdays are back on the menu boys","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"not called God ussop for nothing","not_safe_for_work":false,"locked":false,"body":"","score":1018,"comments":[{"body":"Turns out Ussop's bullshit is actually subconscious future sight, he thinks he's coming up with these lies but they're actually subconsciously planted by his godly observation haki","score":124,"comments":[{"body":"That's go d ussop for ya","score":45,"comments":[]},{"body":"unironically a fairly likely possibility","score":18,"comments":[{"body":"You know... I said it as a joke, but the more I think about it, the more I'm convincing myself it's actually the case xD","score":12,"comments":[{"body":"Wouldn't put it past goda-san","score":4,"comments":[]}]}]}]},{"body":"Laugh Tale is one of those stories.","score":45,"comments":[]},{"body":"Still waiting for that island of goldfish poop to come true","score":20,"comments":[{"body":"Am I missing a joke or..? Cuz' Dorry and Brogy confirmed it does exist.","score":21,"comments":[]},{"body":"It happended already on litle garden","score":13,"comments":[]}]},{"body":"Is this Yassop info from film red? I didn't think we knew much of his abilities","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Luffy is not the only one with the plot armor.","not_safe_for_work":false,"locked":false,"body":"","score":3238,"comments":[{"body":"That's not the starter pack. That's the whole darn kit, lol.","score":638,"comments":[{"body":"pre time skip, now he just lets his crew fight for him","score":128,"comments":[{"body":"I mean we are already at step 3 with Law","score":92,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"BB is a pro gamer that plays quickmatches with unranked randoms","score":303,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Of course he wins off screen. His darknes fruit enhances his power when it fades to black","score":259,"comments":[{"body":"ohhh damn thats his awakening. Mind =blown","score":55,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"That's what worries me if he ever fought shanks oda might off screen that also","score":55,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They’re hiding it for a reason. \n\nAt this point I’m sure its a personality switch after a certain amount of much pain","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"oh no Law","score":97,"comments":[{"body":"Zehahaha torafargar.","score":57,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Free loader","not_safe_for_work":false,"locked":false,"body":"","score":415,"comments":[{"body":"Shanks is basically that one you know who is super fucking smart and impressive but just does dumb shit all day and is nice to everyone.","score":5,"comments":[]},{"body":"Shanks could no dif him so it doesn’t matter","score":1,"comments":[{"body":"I'll no diff your dad in the Mcdonald's parking lot","score":7,"comments":[{"body":"Ill no diff your sister","score":2,"comments":[]}]}]}]},{"title":"Nico robin (100) Nami (98) Boa (110)","not_safe_for_work":true,"locked":false,"body":"","score":384,"comments":[{"body":"Marked as NSFW because it shows some cleavage😳","score":75,"comments":[]},{"body":"Zoro will be turned into a woman with Doc Q DF, it's not a coincidence that Zoro is the only male Strawhat that got official bust measurements","score":43,"comments":[{"body":"this will most definitely happen","score":13,"comments":[]},{"body":"Watch out, Sanji.","score":4,"comments":[{"body":"Sanji would literally be pulling a Pudding if that happens, changing between loving and hating Zoro in a matter of seconds.","score":5,"comments":[]}]}]},{"body":"Boa is 111cm. My goal at the gym is to get a bigger chest than her.","score":18,"comments":[]},{"body":"Source","score":15,"comments":[{"body":"SBS","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Boa is 111","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"bigger than tsunade🥵","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The r/OnePiece moderators said come here this is low quality fan art","not_safe_for_work":false,"locked":false,"body":"","score":2650,"comments":[{"body":"It’s AI.","score":425,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Is this AI work","score":636,"comments":[{"body":"Yep they posted it in the main sub saying it’s ai","score":342,"comments":[{"body":"That makes more sense. Not necessarily low quality just very low effort. If they allow anyone to post their somewhat One Piece-related AI prompts then it’s only a matter of time before it becomes spammed everywhere","score":528,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"imo 2 and 4 dont look like robin *at all*, they look like elizabeth from bioshock. regardless of it all of them are AI (i was going to comment on the cleavage but its One Piece so its fine i forgive you painter bot)","score":91,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"if it’s made by AI that’s why it’s rejected","score":527,"comments":[]},{"body":"You can't spell \"ain't art\" without \"ai art\"","score":56,"comments":[]},{"body":"\"Main subreddit bad\" am I right? \n\nIt's an AI art, if they accepted your post then the sub would be flooded by AI art.","score":314,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"it's AI, they obviously listed it as low effort (which it is)","score":157,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It’s AI art. Of course it wouldn’t be allowed.","score":132,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Aged like milk de gozaru.","not_safe_for_work":false,"locked":false,"body":"","score":102,"comments":[{"body":"Don't know any milk that lasted a decade.","score":26,"comments":[{"body":"When we find the milk that does it’s gonna start a Wisconsin version of the Menorah story","score":3,"comments":[]}]},{"body":"Not if Oda has anything to say about it\n\nAnd unfortunately he did","score":8,"comments":[]},{"body":"This is dramatic irony","score":8,"comments":[]},{"body":"genuinely love this part cause you know oda got a kick out of throwing us for a loop","score":11,"comments":[]},{"body":"I sometimes forget luffy is actually a zoan user. Very weird","score":2,"comments":[]},{"body":"This is a good example of how writing for hype, over substance, is not a good idea.\n\nYou want to give Luffy some god DF so now the series is about awakening the fruit instead of who Luffy is as a person? Boring, played out but fine. Just set it up well.\n\nReducing Who’s Who from an interesting combatant to a walking exposition dump shows how poorly this was set up. First time Who’s Who heard about Luffy (and the other pirates) he called them rats and focused on Yamato. If Luffy ate the gum gum fruit, and in Who’s Who’s mind this was part of why his life was ruined, why doesn’t he give a fuck that Luffy is on Onigashima?\n\nWe also got this Nika hint in the same act as Luffy’s G5 power up, not well set up either. Like halfway through Wano Oda realized this is what he wanted to do.\n\nSo yeah I believe Luffy when he says he’s not a Zoan. You also gotta think now, which other fruits are bullshit imposters but secretly super OP god fruits?\n\nGear 5 should have been the Gomu Gomu awakening, he can still do everything he was doing and everything is cleaner from a writing perspective. Instead he’s about to become Naruto 2.0, for other 1000 chapters it seemed like Luffy’s story was about inherited will but now it looks like it’s just about him eventually mastering his god powers smh.\n\nRant over lol","score":-13,"comments":[{"body":"And several characters point out how weird his ‘rubber’ abilities were. Doflamingo confused he could still stretch and be elastic while using Haki, and Kaido saying Rubber shouldn’t be able to move like Snakeman’s attacks can.","score":7,"comments":[]},{"body":"\n\n&gt;Instead he’s about to become Naruto 2.0, for other 1000 chapters it seemed like Luffy’s story was about inherited will but now it looks like it’s just about him eventually mastering his god powers smh.\n\nNow wait just a fucking minute. The six paths sage LITERALLY handed Naruto the keys to the god powers. Luffy had the \"Gomu\" fruit from the very start. HUGE difference.\n\nWith Luffy we only found out about the fruit's actual name in this arc but he's been growing with it this whole time, nothing about Luffy himself has changed. Naruto got a **whole new** set of powers separate from the nine tails because Kishimoto made Madara too OP. It would be like if Luffy suddenly learned Haki (the entire power system) during his fight vs Kaido on the roof.\n\nI'm ranting about this section because I hated that part of Naruto. Kishimoto upended his own damn theme of the manga and it pissed me off.","score":3,"comments":[]},{"body":"Wayyyy back in Skypeia you see Luffy’s silhouette, looking the exact same as Nika’s in the Who’s Who fight.","score":4,"comments":[]}]}]},{"title":"With Chopper's sense of smell this should've happened by now","not_safe_for_work":false,"locked":false,"body":"","score":89,"comments":[{"body":"Doesn't luffy shower once a week? Choppers nose must be dying 💀","score":11,"comments":[{"body":"Luffy and Zoro do nothing all day but eat/drink and regularly get into fights to the death, they both shower once a week.\n\nRealistically speaking, Chopper should be in cardiac arrest.","score":8,"comments":[]}]},{"body":"You know that dogs smell each other's asses for fun, right? I doubt lack of axe would be an issue","score":2,"comments":[{"body":"classic misconception! Chopper isn't actually a dog, but a raccoon. and when he sniffs dog ass, it's not for fun. it's his responsibility as a medical professional!","score":3,"comments":[{"body":"Has your general practitioner used this technique?","score":1,"comments":[]}]}]},{"body":"They both shower once a week but Zoro apparently just smells like metal somehow","score":2,"comments":[{"body":"Tell me why Zoro seems like he considers Axe a shower","score":2,"comments":[]}]}]},{"title":"Here's some of my favorite chapter cover art","not_safe_for_work":false,"locked":false,"body":"","score":65,"comments":[{"body":"My favorites are the Enel cover story and the Caribou over story","score":1,"comments":[]},{"body":"I definitely don't remember the last two","score":1,"comments":[]}]},{"title":"now we know who's behind the mask","not_safe_for_work":false,"locked":false,"body":"","score":105,"comments":[{"body":"How’d his hair change so fast","score":2,"comments":[{"body":"There's also a wig I suppose","score":2,"comments":[{"body":"I see","score":2,"comments":[]}]}]},{"body":"Hi, thanks for posting. Feel free to come join the discussion over on the [/r/MemePiece Discord server](https://discord.gg/sjkDW72)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MemePiece) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Mugiwaras in a nutshell","not_safe_for_work":false,"locked":false,"body":"","score":499,"comments":[{"body":"I thought Franky would be gigachad","score":16,"comments":[]},{"body":"What's a Mugiwara?","score":15,"comments":[{"body":"The name for straw hat in Japanese","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Dont want to interrupt u bro interaction. But this is weirdly wholesome","score":6,"comments":[{"body":"Ikr","score":3,"comments":[]}]}]},{"body":"That last one was kind of racist, like on a who‘s who level racist.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"u/savevideobot","score":3,"comments":[{"body":"###[View link](https://redditsave.com/info?url=/r/MemePiece/comments/z1krwm/mugiwaras_in_a_nutshell/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&amp;#32;|&amp;#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Feedback for savevideo)&amp;#32;|&amp;#32;[**Donate**](https://ko-fi.com/getvideo) &amp;#32;|&amp;#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Content removal request for savevideobot&amp;message=https://np.reddit.com//r/MemePiece/comments/z1krwm/mugiwaras_in_a_nutshell/)","score":2,"comments":[]}]},{"body":"I want to clap that ass. So yeah. Its Franky 100%","score":4,"comments":[]},{"body":"This is easily one of the most disgusting activities a human can do. Like who the *hell* wants to constantly and quickly shove food down their gullet until their stomach is pushed to it's limit","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Me since I first saw the movie a few days ago","not_safe_for_work":false,"locked":false,"body":"","score":66,"comments":[]},{"title":"Modern state of one piece Powerscaling","not_safe_for_work":false,"locked":false,"body":"Shit got banned on main sub hope it’s allowed here","score":36,"comments":[{"body":"you have no idea how flowcharts work, do you?","score":19,"comments":[{"body":"Idk did it once in highschool and that’s how they told me to do it","score":2,"comments":[]}]},{"body":"No at all ur 100% right","score":3,"comments":[{"body":"This is mostly from what I seen on the main sub YouTube and Twitter the worst places for power scaling","score":3,"comments":[]}]},{"body":"Real.","score":2,"comments":[]}]},{"title":"wow","not_safe_for_work":false,"locked":false,"body":"","score":4146,"comments":[{"body":"Can we get much fryer!","score":408,"comments":[{"body":"Soo friedddd!","score":174,"comments":[{"body":"YO! HO! HO!","score":62,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Since when did kfc start serving sausage? 🥵","score":253,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Dont grab the last \"piece\"","score":321,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Fandom keeps on getting more creative","score":108,"comments":[]},{"body":"There's a hole in the bucket, I can tell by that smile.","score":106,"comments":[{"body":"Gurararararara","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"So the \"Pieces of Eight\" that pirates often talk about was just referring to some Deep Fried Chicken that they enjoy eating.\n\nWho knew?","score":55,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Just imagining the scene with all the food mascots replacing the characters makes it hilarious and makes too much sense at the same time.","score":36,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"It's been a hell of a ride","not_safe_for_work":false,"locked":false,"body":"","score":627,"comments":[{"body":"That's how they hunted in ancient times.","score":78,"comments":[]},{"body":"Soon \"that's how dinosaurs hunted their prey\" will be your favourite sentence","score":61,"comments":[{"body":"My favorite thing from kaidos crew. I was hoping he'd finish it with something.","score":8,"comments":[]}]},{"body":"When Queen started flying around with his Brachiosaurus neck like a helicopter I had to take a quick break to compose myself","score":51,"comments":[{"body":"HELICOPTER HELICOPTER","score":29,"comments":[]},{"body":"And then when he just straight up shot his neck outta his body and turned into a snake I just had to put down my phone to compose myself from what I had just seen","score":13,"comments":[]}]},{"body":"Triceracopter is very real and it can hurt you.","score":19,"comments":[]},{"body":"Yeah why doesn’t anyone talk about the fact the straw hats haven’t been whole for nearly 10 years","score":8,"comments":[]}]},{"title":"He do be a vibe tho","not_safe_for_work":false,"locked":false,"body":"","score":124,"comments":[{"body":"All hail Chadakuri","score":3,"comments":[]},{"body":"I love that white soft white solid he makes","score":3,"comments":[]}]},{"title":"Who can relate?","not_safe_for_work":false,"locked":false,"body":"","score":30,"comments":[{"body":"When I watch anime alone vs When my parents come in","score":2,"comments":[]},{"body":"This is when the science happens","score":1,"comments":[]}]},{"title":"We don't know jack squat.","not_safe_for_work":false,"locked":false,"body":"","score":1406,"comments":[{"body":"Honestly yeah. He is the Commander and Chief but currently his role seems pointless. Fleet admiral are the ones doing the heavy lifting of leading the navy, and the Goresei do the heavy lifting of making the large, important decisions.\n\nWhere is Kongs jurisdiction? Or does he just micromanage the fleet admiral?","score":232,"comments":[{"body":"From my understanding he governs everything except the celestial dragons and gorosei. So warlords marines cipher pols ect","score":139,"comments":[{"body":"According to the wiki yeah\n\nHe is “second only to the gorosei and Im”","score":57,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"To be fair if we’re talking the U.S. it’s not like the president (who is the Commander and Chief) controls most day to day military operations and planning. Though we don’t know if Kong has any other responsibilities, it wouldn’t really make since for him not to be involved if he’s just there for the military.","score":26,"comments":[]}]},{"body":"Kong? We have like, several movies about him.","score":74,"comments":[{"body":"Well shit","score":18,"comments":[]}]},{"body":"What’s even more mysterious is that big creature thing in the Florian Triangle, we still haven’t gotten any explanation as to what it is","score":110,"comments":[{"body":"I reread thriller bark recently and that open end puzzled me.","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"PLEASE I JUST WANT TO KNOW WHAT HE DOES HE HAS APPEARED TWO TIMES AND IN ONE YOU DON’T EVEN SEE HIS FACE","score":17,"comments":[]},{"body":"Pandaman","score":47,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What if Imu-sama is the Legendary Sad Boy ? perfect antagonist for Luffy that won the War during the void century with the power of sorrow","not_safe_for_work":false,"locked":false,"body":"","score":33,"comments":[{"body":"Now, this is the break week content I was expecting in MemePiece, thanks OP.","score":8,"comments":[{"body":"I don't need break week to produce such content, but thanks for the kind words anyway 😁","score":2,"comments":[]}]},{"body":"Sad Lad","score":6,"comments":[{"body":"Next time I might draw a salad","score":2,"comments":[]}]},{"body":"“If Kishimoto wrote One Piece”","score":3,"comments":[]},{"body":"Joy boy -&gt; sad lad","score":2,"comments":[{"body":"On the short list bro 👍","score":2,"comments":[]}]},{"body":"Hi, thanks for posting. Feel free to come join the discussion over on the [/r/MemePiece Discord server](https://discord.gg/sjkDW72)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MemePiece) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Law had a pretty bad time in Dressrosa","not_safe_for_work":false,"locked":false,"body":"","score":965,"comments":[{"body":"He got shot many times, got his armed chopped off, he had to deal with luffys stupidity almost the whole arc, he tryed to 1v1 a flamengo, got handcuffed and carried by luffy like 10 episodes and the list can go on and on","score":103,"comments":[{"body":"All over the course of a day too. Buddy of mine is watching for the first time and that’s been his biggest takeaway lol Law has gotten the shit shoved down his throat so hard and it’s all over the course of a day","score":56,"comments":[{"body":"Im currently on 713 so im in the middle of dressrosa and experiencing everything for the first time and I'm still amazed that the last 60 episodes or more have been in the span of 1 day","score":15,"comments":[]},{"body":"Really like half a day. Doffy is underground before the sun sets. Really Laws part in that arc doesn’t make a ton of sense.","score":5,"comments":[]}]},{"body":"Law is just suffering and pain for life. Even after he was done with Wano, now he have to deal with Blackbread Pirates of all people lol","score":8,"comments":[{"body":"Blackbread pirates","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Law, narrating:\n  \n\"Yep, that's me. And that's my arm over there. You may be wondering how I got myself into this mess, but to answer that I'll have to take you back to yesterday when I made the worst mistake of my life and teamed up with a man in a straw hat...\"","score":40,"comments":[]},{"body":"The worst part is this wasn’t even the worst day he ever had.","score":17,"comments":[]},{"body":"Another would be Monkey D. Luffy's no good very bad day (on Sabaody, and Marineford)","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"from dressrosa to wano...he sure got stronger and fast. He may be like luffy and gets stronger in fights rather than just training.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Tell me you don't understand one piece without saying so.","not_safe_for_work":false,"locked":false,"body":"https://www.cbr.com/one-piece-signs-getting-worse/","score":17,"comments":[{"body":"*The end of One Piece is near*\n\n\"Oh man, it looks like One Piece is running out of steam.\"","score":19,"comments":[]},{"body":"How do you complain about the story ending with many unanswered questions and then complain that &gt;!egghead!&lt; island is answering those questions","score":12,"comments":[]},{"body":"Oh wow. A power in the world can make a character stronger. What a surprise. Next up water is wet fire is hot and knifes are sharp","score":9,"comments":[{"body":"Water is actually not wet; It makes other materials/objects wet. Wetness is the state of a non-liquid when a liquid adheres to, and/or permeates its substance while maintaining chemically distinct structures. So if we say something is wet we mean the liquid is sticking to the object.\n\n&amp;nbsp;\n\nWhat do you call it when a guy throws his laptop into the ocean?\n\nAdele, Rollin’ in the Deep.","score":4,"comments":[{"body":"Da dum tsshhhhh. \n\nBut ok ice is wet than \n\nWhat did your dad say when you fell in the snow while playing hide and seek.\n\nIce see you","score":3,"comments":[]}]}]},{"body":"There are some actual arguments in there. But it's so terribly written like any other cbr article so they just ruin it immediatly.","score":3,"comments":[]},{"body":"As a fan of Oda’s story, even I have to admit most of those are valid criticisms.","score":3,"comments":[{"body":"Most of the points are valid but the arguments and reasons are poor and greatly misunderstand why it's a problem\n\nFor example the first one claiming wano's ending was underwhelming is a valid point that is thrown around a fair bit however they contribute it to Kaido's lack of backstory not the rushed resolution for Yamato, carrot and the scabbards characters. \nNot Aramaki (an admiral who we've been waiting to see since the reverie) getting two chapters of being an villain, a single chapter fight and a defeat that feels like a movie promotion which makes him look like a complete joke \nOr the rushed farewell that only 2 characters who formed a bond with the crew and a character who spoke to Luffy three times got to see neglecting Carrot (who went through whole cake with half the crew), the scabbards (who spent lots of time with the crew preparing for the raid), Hiyori and Otoko and Otama (the first human we met in Wano who played a large part in the alliances victory)\n\nIf I had to guess they opened pirate folk found some criticism and read a single point assuming that was the  main problem with wano and the reason for the criticism","score":10,"comments":[]},{"body":"Agreed there are valid criticisms here but some of the points they make are really absurd and contradictory. It's like someone saying they are rational and then going on to claim the earth is flat.","score":2,"comments":[]}]},{"body":"POV: I can’t handle a different opinion than mine…","score":-4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Insane title","not_safe_for_work":false,"locked":false,"body":"","score":3498,"comments":[{"body":"I mean same lmao","score":197,"comments":[]},{"body":"Chad","score":184,"comments":[]},{"body":"Yamato’s gender is oden for sure","score":421,"comments":[{"body":"Then I'm Oden-sexual","score":162,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Now let's be honest, we're all gay for Yamato. ***You*** included.","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"More like sane title","score":22,"comments":[]},{"body":"Oda has never drawn any OP character naked besides Luffy.\n\nSexual body parts are not canon. Besides Luffys.","score":292,"comments":[{"body":"Also Buggy's are canon","score":135,"comments":[{"body":"Don't forget the whitebeard","score":126,"comments":[{"body":"Why can I hear this comment","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Officially my new favorite ~fanon~ ship ❤️ They are so damn cute together. Have you noticed her headphones kind of resemble his hat?!","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"thanks to that last image every time I think of modern one piece, Luffys going to have a radio station.","score":2,"comments":[{"body":"That or a podcast 😂","score":1,"comments":[]}]}]},{"title":"so now we know","not_safe_for_work":false,"locked":false,"body":"","score":1003,"comments":[{"body":"Who is bottom right","score":39,"comments":[{"body":"Redestro i think his name is. Basically he is like the hulk but with stress. The more stressed he is the stronger he becomes","score":78,"comments":[{"body":"Yeah u got that","score":22,"comments":[]},{"body":"Imagine Usopp with that quirk. The guy would be yonko level.","score":1,"comments":[]}]},{"body":"Oooo he is a character from my hero academia","score":17,"comments":[]}]},{"body":"Daddy Doofenshmirtz😍","score":26,"comments":[{"body":"He really is a great daddy","score":13,"comments":[]}]},{"body":"Re destro is voiced by sanjis voice actor!","score":3,"comments":[]},{"body":"😂😂🥹🥹","score":1,"comments":[]},{"body":"Epic 😆","score":1,"comments":[]}]},{"title":"Facts","not_safe_for_work":false,"locked":false,"body":"","score":309,"comments":[{"body":"The only TRUE god.","score":13,"comments":[]},{"body":"Yeah for sure cause younkou of the seas will recognize him but.. I think luffy and his crew are the only ones who knows him right","score":5,"comments":[]},{"body":"I just want to watch their little people armies fight each other.","score":2,"comments":[]},{"body":"Even nami can beat enel","score":3,"comments":[{"body":"Yep","score":1,"comments":[]}]},{"body":"KNEEL BEFORE ME","score":2,"comments":[]},{"body":"Nah ain't facts it's cap!","score":1,"comments":[]},{"body":"Enel comes back without learning armament haki would be hilarious.. Koby would smack him","score":1,"comments":[]}]},{"title":"I like both!","not_safe_for_work":false,"locked":false,"body":"","score":83,"comments":[{"body":"first one is apparently ai art that the op was trying to pass off as original.","score":27,"comments":[]},{"body":"I swear, imu design prediction gotta be the goofiest thing in this sub","score":10,"comments":[{"body":"Goofy is what definer one piece characters so i can get behind a goofy Imu","score":5,"comments":[]},{"body":"We'll get it right at some point","score":1,"comments":[]}]},{"body":"Both is good art but the second one is Avant Garde. It pushes the raw ideas of one piece to a new place artist can only imagine. The composition, balance and line work is a thing of marvel. Dont even get me started on the narrative underlay and what it means to be Imu. Are we Imu or is it a part of us? Breathtaking stuff.","score":5,"comments":[]},{"body":"i believe in freckled robin supremacy","score":6,"comments":[]},{"body":"Only half the ai art could be remotely seen as Robin lol","score":3,"comments":[{"body":"just close your eyes a little","score":1,"comments":[]}]},{"body":"Hi, thanks for posting. Feel free to come join the discussion over on the [/r/MemePiece Discord server](https://discord.gg/sjkDW72)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MemePiece) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"I’ve seen to much One Piece.","not_safe_for_work":false,"locked":false,"body":"","score":43,"comments":[{"body":"There is no such thing as too much one piece","score":2,"comments":[]}]},{"title":"The only dynamic I’ll accept","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"You know Spandam did that to Robin as well. I think he prefers to do that to real pussy and not just a cat.","score":1,"comments":[]}]},{"title":"How I feel each week reading One Piece","not_safe_for_work":false,"locked":false,"body":"","score":482,"comments":[{"body":"I don’t want to know what the one piece, but let’s answer some questions bruh","score":31,"comments":[{"body":"How about more questions","score":9,"comments":[]}]},{"body":"I gotchu, one word…government","score":16,"comments":[{"body":"Nah, just more pirates","score":2,"comments":[{"body":"govt vs pirates?","score":3,"comments":[]}]}]}]},{"title":"Half of them would squat to dunk.","not_safe_for_work":false,"locked":false,"body":"","score":197,"comments":[{"body":"Pick romance dawn koby","score":28,"comments":[]},{"body":"Gaimon, romance dawn coby, any dwarf, chopper brain point","score":17,"comments":[{"body":"Nah man, Leo would dunk on anyone in the nba","score":13,"comments":[{"body":"Chopper would absolutely own me on the court. In brain point he has those 300iq physical analysis strata.","score":2,"comments":[]}]}]},{"body":"Half of them could sit down and play offense and defense without ever moving their ass","score":9,"comments":[]},{"body":"Remember that time Micheal Jordan used the Gomu gomu no slam dunk at the end of space jam? Classic","score":4,"comments":[]},{"body":"They walk out and it's gaimon","score":3,"comments":[]},{"body":"Just break their thin ass legs nobody has leg mass in this anime","score":2,"comments":[]},{"body":"Bro you could put the court on Laboon’s head and because of how big he is it would still be flat land","score":1,"comments":[]}]},{"title":"Me to my anime only friend during film red","not_safe_for_work":false,"locked":false,"body":"","score":50,"comments":[]},{"title":"so choose what are u then","not_safe_for_work":false,"locked":false,"body":"","score":302,"comments":[{"body":"Can you give link to the meme template","score":3,"comments":[]},{"body":"Strong enough to cause pain, weak enough too feel it. So both","score":3,"comments":[]}]},{"title":"Oda showing his editors what his next character design will look like","not_safe_for_work":false,"locked":false,"body":"","score":56,"comments":[]},{"title":"Based on Ime fan-art","not_safe_for_work":false,"locked":false,"body":"","score":44,"comments":[{"body":"Nathaniel B","score":3,"comments":[]},{"body":"Bootleg usopp","score":3,"comments":[]},{"body":"Imu is Usopps grandpa confirmed?!","score":3,"comments":[]},{"body":"Quan D. Ale","score":3,"comments":[]},{"body":"Quandale Dingle here\n*Rehehehehehehe*","score":3,"comments":[]},{"body":"Hi, thanks for posting. Feel free to come join the discussion over on the [/r/MemePiece Discord server](https://discord.gg/sjkDW72)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MemePiece) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Gotta heat up the game","not_safe_for_work":false,"locked":false,"body":"","score":151,"comments":[{"body":"Bro did fortnite","score":4,"comments":[]},{"body":"ITS THE NEW DOFFY SKIN FROM FART NIGHTS 😱😱😱","score":1,"comments":[]}]},{"title":"lying monsters are a real nuisance","not_safe_for_work":false,"locked":false,"body":"","score":265,"comments":[{"body":"Everybody is gangsta till Usopp sits like L","score":46,"comments":[]},{"body":"both are intelectual geniouses, but usopp is a god","score":28,"comments":[]},{"body":"In the Funimation English dub Usopp is voiced by the same guy that does Krillin and Zoro has the same guy as vegeta and the twin brothers with the magnet powers are both voiced by Mr. Satan\n\nEdit: Sanji has the same English va as Trunks","score":14,"comments":[{"body":"I didn't know that between who are this twin brothers","score":8,"comments":[{"body":"They pop up right after the cp9 arc","score":4,"comments":[{"body":"Still don't know though I'm a manga reader may be they are anime only character like non canon","score":3,"comments":[{"body":"Their names are Campacino and Brindo","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"That’s called Range","score":5,"comments":[]},{"body":"Also Inuyasha","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"And they're both geniuses","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The emptiness","not_safe_for_work":false,"locked":false,"body":"","score":699,"comments":[{"body":"Didn't Brook see Robin's when they disguised as beast pirates?","score":23,"comments":[]},{"body":"Still asking to see underneath them","score":20,"comments":[{"body":"nah, he'd ask if he can borrow some money","score":2,"comments":[]}]},{"body":"Zoro will teach haki to brook while they were on the sunny. CP0 will arrive and fight breaks out. \n\nZoro vs lucci\nBrook vs Kaku\nCarrot will emerge and say that she was hiding all this time and will fight hattori.","score":16,"comments":[{"body":"You misspelled Caribou.","score":12,"comments":[{"body":"Caribou will fight stussy.","score":7,"comments":[{"body":"\\*Kidnap Stussy","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Here’s a idea that may be hard to accept \nThey are wearing light colored leggings","score":10,"comments":[{"body":" BLASPHEMY","score":3,"comments":[]},{"body":"I could see it with Nami, but Robin's just looks way too much like lingerie to me.","score":3,"comments":[]}]}]},{"title":"name a more underrated than this one I'm waiting","not_safe_for_work":false,"locked":false,"body":"","score":127,"comments":[{"body":"Nami: have some treasure \n\nUsopp: I'm gonna be honest\n\nSanji: relax guys it's just side boob","score":30,"comments":[{"body":"Ohhh the irony","score":5,"comments":[]},{"body":"Reminds me that Fake Straw Hat Zoro actually had sideboobs. Maybe he could've defeated Sanji.","score":3,"comments":[]},{"body":"Chopper: No, I'm not gonna heal you \n\nRobin: Who cares about it's history?\n\nFranky: I think I'll wear some pants\n\nBrook: Sorry, but I don't wanna see your panties\n\nSorry but I don't know what Jinbei would say","score":10,"comments":[{"body":"Jinbei : Come here, boy. Let me tell you all about slavery.","score":12,"comments":[]},{"body":"Jinbei: Things like honor, loyalty and integrity and stuff are pretty stupid. I just wanna be a pirate and do really bad shit","score":2,"comments":[]}]}]},{"body":"Sabaody happened in 2009 I AM OLD","score":10,"comments":[{"body":"Yeah ,just how fast the night changes","score":3,"comments":[]}]}]},{"title":"RunPiece Episode 87","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[]},{"title":"[1052+] he was still alive...","not_safe_for_work":false,"locked":false,"body":"","score":275,"comments":[{"body":"Wtf?! I never noticed this.","score":22,"comments":[]},{"body":"Snails are still living creatures. My headcanon is that the cp0 dude died, the snail came out of his pocket, took a photo and sent it to the WG.","score":62,"comments":[{"body":"The snail: YOOOOOOO YOU GUYS GOTTA SEE THIS SHIT","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Beast Pirates killed nobody of note\n\nOrochi’s group killed Ashira (maybe)\n\nCP0 killed Izo (maybe)","score":15,"comments":[]},{"body":"Mf can't kill anyone! Even Oden was shot by the \"Strongest Creature\" - everybody could have done that!","score":67,"comments":[{"body":"That is why his monicker was \"Strongest creature\" and not \"Deadliest Creature\" -","score":34,"comments":[]},{"body":"One Piece antagonists: “I have this incredible power I gained by eating a cursed fruit that makes me an extremely powerful and destructive fighter!”\n\nAlso One Piece antagonists: “I’ll defeat you with the power of friendship and this gun I found!”","score":4,"comments":[]}]},{"body":"This shit is getting to fairy tail tier now, cmon Oda wtf you doing 😐","score":12,"comments":[]},{"body":"Sit down Laido, gotta get a few snaps of a Joyous Boy","score":5,"comments":[]},{"body":"Classic Oda","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Sanji's reaction to who's leaving on the Sunny by the end of the arc.","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[]},{"title":"RunPiece Episode 86","not_safe_for_work":false,"locked":false,"body":"","score":65,"comments":[{"body":"I feel Oda just “loves” the fact that 60% of all the episodes are just people running","score":1,"comments":[]}]},{"title":"Fanart of Vegapunk :3","not_safe_for_work":true,"locked":false,"body":"","score":24,"comments":[{"body":"Best vegapunk.\n\nShe likes to eat. I could give her a sausage...","score":4,"comments":[{"body":"Sanji approves!","score":2,"comments":[{"body":"Brook disagrees","score":2,"comments":[]}]},{"body":"LMAO","score":1,"comments":[]}]}]},{"title":"True One piece fan","not_safe_for_work":false,"locked":false,"body":"","score":126,"comments":[{"body":"The real answer is Zoro","score":13,"comments":[]},{"body":"Based fans say Chopper","score":2,"comments":[{"body":"Can we get much higher","score":1,"comments":[]}]}]},{"title":"Just 2 Yonkos having a meal together","not_safe_for_work":false,"locked":false,"body":"","score":41,"comments":[{"body":"What chapters coverpage was this?","score":3,"comments":[]}]},{"title":"Controversial take: Imu will be the goofiest character in One Piece, yet he will One shot Luffy.","not_safe_for_work":false,"locked":false,"body":"","score":129,"comments":[{"body":"Nah bro Imu is going to be a hot milf","score":30,"comments":[{"body":"Some people still wanna believe that. I might make One for you guys","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Soo, why ice King? Though it would definetly explain why vivi was kidnapped","score":4,"comments":[{"body":"Don't know any ice kings, I'd rather thought of some power power no mi model nuclear bomb","score":2,"comments":[{"body":"https://www.google.com/search?q=ice+king+adventure+time+without+beard&amp;tbm=isch&amp;ved=2ahUKEwjJjOqKwL_7AhXFUXcKHf8pB_4Q2-cCegQIABAC&amp;oq=ice+king+adventure+time+without+beard&amp;gs_lcp=ChJtb2JpbGUtZ3dzLXdpei1pbWcQAzIGCAAQCBAeMgUIABCiBDIFCAAQogQyBQgAEKIEOgQIIxAnOgYIABAHEB46BwgAEIAEEBM6CAgAEAgQHhATUPQGWModYNAkaABwAHgAgAF1iAGrC5IBBDExLjSYAQCgAQHAAQE&amp;sclient=mobile-gws-wiz-img&amp;ei=VY17Y4mOMcWj3QP_05zwDw&amp;bih=780&amp;biw=412&amp;client=ms-android-samsung-ss&amp;prmd=isvn","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Nobody can one shot Luffy at this point in the story.","score":3,"comments":[{"body":"True. The only way to beat him is to make him laugh to the ground","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"The existance of a human fruit model: laugh might hint at the existance of other human fruit models based on human emotions. So maybe, all human emotion fruits power ceiling is limited only by the user's imagination, just like Nika the only difference between them being that secondary power; which in the case of Nika the user gains rubber properties. There could be model a greed model for example. I'm also pretty sure that wanting to se people free is Nika's will influence over Luffy, since the Gorosei said that all Zoans have a will of their own. So if Imu has a fruit that is the antithesis of Nika, that fruit's Will would want the opposite of freedom for the world. It would want to reing supreme.","score":7,"comments":[{"body":"Could be. Some redditor suggested me the Idea of Imu being the Legendary sad Boy, could be an interesting parallel","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I agree","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"luffy pre-timeskip can use haki confirmed","not_safe_for_work":false,"locked":false,"body":"he clearly can use haki unknowingly when he is hungry","score":3014,"comments":[{"body":"The girl who bumped into him had haki that's why smoker apologized and paid for new ice cream","score":415,"comments":[{"body":"He played it smart. That little girl would had fucked him up.","score":270,"comments":[{"body":"She secretly had advanced Conqueror’s and he could sense it though the ice cream","score":67,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The comments are warring over a gag panel hope you're happy","score":167,"comments":[{"body":"And this was suppose to be r/‌MemePiece!","score":49,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Smoker himslef in punk hazzard said that you have to be'willing to turn your body in to that element, otherwhise he wouldnt even be able to go outside his house when there is wind if he was constantly smoke","score":1003,"comments":[{"body":"let's say it's the other way around where logia users have to decide to be tangible. the outcome would still be the same because Smoker's weapon is sea prism stone. Luffy hits the weapon -&gt; the weapon hits smoker -&gt; they hit ace.\n\nedit: i admit to not reading any of the comments below the first one.","score":196,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Thats why you always have to use your observation haki as a logia type","score":176,"comments":[{"body":"Lol Katakuri on the Logia level with his Paramecian ass and his ultra instinct advanced observational haki","score":75,"comments":[]}]},{"body":"I think Crocodile is the one to blame for this confusion. \nLogias are NOT their elements 100% of the time. They must choose to transform. \n\nCrocodile worked differently because He trained his fruit so much that his body turned into sand on its own.\nWe later see similar situations happening with Enel, who had such crazy observation that even without training he could instantly turn his body into lightning, and more recently We saw Katakuri imitating logias through the use of future sight. \n\nIn this case here, Smoker didn't see the attack coming, he didn't have observation, and his body was trained like Crocodile's.","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I KNEW IT","not_safe_for_work":false,"locked":false,"body":"","score":47,"comments":[{"body":"Hi, thanks for posting. Feel free to come join the discussion over on the [/r/MemePiece Discord server](https://discord.gg/sjkDW72)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MemePiece) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"What is this 😂","not_safe_for_work":false,"locked":false,"body":"","score":715,"comments":[{"body":"I mean this might be true...but for the reason that a popular series is going to attract a wider range of people, including trend chasers and people with short attention spans. I doubt it has anything to do with One Piece being a series that makes people want to drop it, as the headline implies.","score":374,"comments":[{"body":"Yeah I can imagine picking it up now. \"This is pretty cool what's the newest chapter at...? Oh lord\"","score":109,"comments":[{"body":"1067","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Well yea. It only stands to reason that a series that's 4 times longer than a typical series has more time to disaude readers.","score":62,"comments":[]},{"body":"“Make them click”\n\n“Make them click”\n\n“Make them click”","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'm not sure what the problem is, they're not wrong. I've seen the memes, I've seen the confessions. Just because me and you continued watching and reading doesn't mean everyone will. Lots and lots of people drop One Piece, more so than other manga simply off the length and girth of it","score":152,"comments":[{"body":"A lot of those people do plan on returning when the manga is finished though so they don't have to wait for the new chapters to come out while reading","score":39,"comments":[]},{"body":"I didn't drop it but I did take breaks\n\nI binge watched everything continuously until Mary died. Took a break.\n\nI then watched till Paramount War I think. I stopped at seeing Luffy as a kid.\n\nThe resumed it and watched till Wano. Stopped at Luffy on the beach.\n\nAnd now resumed it and watched till Episode 1015 when they start fight waiting for episode 1070 to drop so I can watch entire fight.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"It's CBR, and it's garbage.","score":15,"comments":[]},{"body":"Cbr are cringe","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Didn't expect to see celestial dragons in Pokemon Violet (oc)","not_safe_for_work":false,"locked":false,"body":"","score":40,"comments":[{"body":"Finally, a new Top-Tier Pokemon Game!","score":1,"comments":[]}]},{"title":"Call me crazy, but did Oda actually legitimately foreshadow Coby's Marineford scene by saving Helmeppo from being killed in their cover story?","not_safe_for_work":false,"locked":false,"body":"","score":25,"comments":[{"body":"I wouldn’t say it was a foreshadow but rather him enlightening us into Coby’s character. Plus the scene in marineford where Coby is saved by Shanks mirrors Coby being saved by Luffy when Coby talked back to Alvida. Both Luffy and Shanks saved Coby from speaking up and they both told him “good job”.","score":21,"comments":[{"body":"Yes. Help me say it out loud for the others\n\n\"Mirrored scenes aren't foreshadowing\"\n\nFor the most part at least.","score":2,"comments":[]}]},{"body":"All I know is there isn’t nearly enough Axe Hand Morgan in One Piece","score":11,"comments":[{"body":"Unfortunately I don’t think we’ll ever get to see Helmeppo live up to the declaration of capturing his dad","score":5,"comments":[]}]},{"body":"Coby always been about that life.","score":3,"comments":[]},{"body":"Yoooo it's my guy Bogard","score":1,"comments":[]}]},{"title":"There's no way that's a coincidence","not_safe_for_work":false,"locked":false,"body":"","score":1379,"comments":[{"body":"Oda foreskining, he did it again 😱😱😱","score":113,"comments":[{"body":"He fr used katakuri level observation haki","score":30,"comments":[{"body":"No bro it's god ussop level observation haki","score":7,"comments":[]}]}]},{"body":"![gif](giphy|fFyzX8Rrae8s8)","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Now hold on. One of them has no problem with slavery, mass deaths, human rights abuse and does a little history revision to make themselves look better in the public and the other is the World Government","score":94,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Shit now I cant unsee that","score":10,"comments":[]},{"body":"The foreshadow is real","score":7,"comments":[]},{"body":"Foreshadowing++","score":5,"comments":[]},{"body":"Ahh yes! this years Football championship is in Sabaodi 😏","score":6,"comments":[]},{"body":"\"today I feel like a fishman, today I feel like a slave.....\"","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Fr","not_safe_for_work":true,"locked":false,"body":"","score":983,"comments":[{"body":"Is that Robin? The disrespect..","score":174,"comments":[{"body":"She asked for this specifically","score":66,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Damn but what if i want Nami to step on me","score":74,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I knew a guy who skipped 1000 episodes just to watch only wano","score":54,"comments":[{"body":"What did he think?","score":12,"comments":[{"body":"He loves it but refuses to go and watch the first 1000 episodes","score":31,"comments":[{"body":"That makes me really angry NGL","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"WTF? Why the Robin disrespect?","score":95,"comments":[{"body":"exactly robin mi lady is better","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"i want this","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"least horny post in this sub 100%","not_safe_for_work":false,"locked":false,"body":"","score":97,"comments":[{"body":"WHERE'S ZORO?!?!?!?!","score":19,"comments":[{"body":"He doesn't belong here \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHe's on an whole another level","score":14,"comments":[]},{"body":"WHERE'S QUEEN?","score":4,"comments":[{"body":"He's very small in the picture. In order to seem him, you have to zoomu zoomu zoomu.","score":6,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"bout to make usopp a lil brother","score":26,"comments":[]},{"body":"You don’t like Stussy?","score":6,"comments":[{"body":"She's ok , but CP0 are all bums","score":5,"comments":[]}]},{"body":"It would appear you have misplaced Bello Betty, and thus i am left to assume she simply trancends the list.\n\nIts the best list ive seen so far","score":5,"comments":[]},{"body":"I thought this was a Pokémon sub at first and I was like oh dear god","score":6,"comments":[]},{"body":"Doin it with boa but sayin hell nah to sarfunkel, this is shit  one fr.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I think my brain just committed suicide","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"Big Mom: guess I'll die","score":8,"comments":[]},{"body":"Where's Uta in that list? We saw how powerful she was in Film Red","score":5,"comments":[{"body":"Probably only listed canon characters","score":3,"comments":[{"body":"She is canon, but the plot of the film isn't thats what i heard.","score":2,"comments":[]},{"body":"Really? Then how come we saw her in the flashbacks in the next few episodes after 1000?","score":1,"comments":[{"body":"Noncanon movie promotion it happens everytime there's a new movie usually they get there own arc this one was just in the middle of an arc so they did the best they could","score":4,"comments":[{"body":"I guess that makes sense. Thanks for telling me.\n\nSo which movies do you consider as canon?","score":1,"comments":[{"body":"I haven't seen them all only stampede and red which if I'm correct stampede has nothing cannon in it in film red the only cannon thing I think is how the red hairs fight \n\nI have not fact checked any of this","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]}]}]},{"body":"Thats a fake one.","score":1,"comments":[]},{"body":"This list is absolutely wrong I don't  see the three most powerful character\n1) Bugg D Clown\n2) Con D Oriano\n3) GoD Usopp","score":0,"comments":[]}]},{"title":"dreamin'","not_safe_for_work":false,"locked":false,"body":"","score":63,"comments":[{"body":"Don't give it up Luffy!","score":1,"comments":[]},{"body":"More like that’s the one piece anime in general lol","score":-1,"comments":[{"body":"Nah","score":2,"comments":[]}]}]},{"title":"False accusations go brrr","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"Please say it.","score":3,"comments":[{"body":"*sigh*\n\nStarting to ha- https://www.youtube.com/watch?v=dQw4w9WgXcQ","score":-1,"comments":[{"body":"You motherfucker","score":1,"comments":[]}]}]}]},{"title":"are they serious bro","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"Ah yes, Naruto and their good female charcters, Including:\n\nSakura whose life revolves around the men she's with (Sasuke and Naruto), Hinata whose sole purpose is to swoon over MC-kun, Tsunade who is weakest of both the Sannin and the Hokage, Ino who is only there to really be a love rival for Sakura and Tenten being so irrelevant I cant even remember anything she did","score":12,"comments":[{"body":"Tsunade also \"sets unrealistic expectations for girls\" with her boobs that in some panels are bigger than her head. Also, in the very first chapter, Naruto transforms into a naked woman and nearly gives his teacher a seizure. This technique eventually expands into creating the illusion of several naked girls and is literally called \"harem no jutsu\". But yeah, Naruto is wholesome and One Piece is depraved just because a woman wears a bikini on a boat.\n\nBy the way, doesn't Franky set unrealistic expectations for men's bodies?","score":6,"comments":[{"body":"I will NEVER have Franky's breast size, why even live","score":6,"comments":[]}]},{"body":"Tsunade is solid, the rest however...","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"As if your going to be horribly body shamed by the show if you watch past the time skip. Also, in dragon ball you can see goku’s PP.","score":2,"comments":[{"body":"Yo how are they cool with that in Japan? I've never seen them draw other privies in anime, but they do draw PPs and jewelsacks.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"To be fair knowing I'll never be 10 foot and have the body of doflamingo or the pure swagger to rock his glasses hurts me everyday","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I can’t be the only one who is a little bothered by the “more funnier” bit.","score":2,"comments":[]},{"body":"-promotes violence\n\n-suggests 2 other Shonens who have about the same amount of said violence, one of which violence is the sole thing the \"plot\" revolves around","score":2,"comments":[]},{"body":"\\*Tsunade has entered the chat","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Did you know that Usopp joined the CP0?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"That’s Sogeking","score":2,"comments":[]}]},{"title":"Oh my","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"It's ok luffy doesn't care  about gold or man's.hes looking for meat","score":1,"comments":[{"body":"Did I just hear meat?","score":1,"comments":[]}]},{"body":"I saw Gol D Roger in Fortnite","score":1,"comments":[{"body":"I saw him on a bottle of alcohol","score":1,"comments":[]}]}]},{"title":"Why do they change it every week","not_safe_for_work":false,"locked":false,"body":"","score":2281,"comments":[{"body":"Idk, i think i like them changing the sub’s picture from time to time. It’s like a surprise egg. Plus, this IS a meme sub.","score":290,"comments":[{"body":"They are talking about the main sub, but you are still right.","score":122,"comments":[]},{"body":"The meme sub still has the spooktober icon. It's 20th November.","score":82,"comments":[{"body":"We're all too focused on surviving NNN to notice","score":35,"comments":[{"body":"who is this “we” you speak of","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I lost on 16 😔. Maybe better luck next year.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"I believe in yamato pfp cumpilation supremacy","score":54,"comments":[{"body":"You mean compilation right….right?","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I too am a believer of this. 🤝","score":4,"comments":[]}]},{"body":"BrOOke","score":21,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Marco the Phoenix","not_safe_for_work":false,"locked":false,"body":"https://www.reddit.com/r/ATBGE/comments/z1c7v4/not_sure_which_art_category_this_one_fits_in_but/?utm_source=share&amp;utm_medium=web2x&amp;context=3","score":3,"comments":[]},{"title":"Answer honestly: how many of you would be disappointed if Imu-sama's crown was a Fork, and he actually was a ramen ramen no mi user?","not_safe_for_work":false,"locked":false,"body":"","score":17,"comments":[{"body":"I would not be disappointed.","score":7,"comments":[{"body":"Nice 😏","score":2,"comments":[]}]},{"body":"This has convinced me  that you will never run out of ideas for imu designs","score":6,"comments":[{"body":"Glad to read that 😁\nThe only thing that will stop me is Oda revealing its face. Then it won't be fun anymore (kinda like Luffy with laugh tale, interestingly enough)","score":5,"comments":[]}]},{"body":"That would be incredibly disappointing. What Japanese manga writer makes their character eat ramen with a fork? Use chopsticks like a civilized person.","score":4,"comments":[{"body":"He actually uses chopsticks the fork is just a hat","score":3,"comments":[]}]},{"body":"As soon Im is revealed for real,i want a book with all this drawings.","score":3,"comments":[{"body":"Not sure about copyrights, but if I Can make it happen I will","score":2,"comments":[]}]},{"body":"Thanks for the new sleep paralysis demon! Very well drawn though.","score":2,"comments":[{"body":"These kind of horrors are kind of my specialty tbh. I've done FAR worse. \n\nThe one I'm the proudest of (for the moment) [is even more disturbing upside down](https://www.deviantart.com/lartnestpasdemain/art/Disturbing-DoubleFace-Up-885515012)","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Who’s the better duo","not_safe_for_work":false,"locked":false,"body":"","score":26,"comments":[{"body":"Nami and Usopp","score":3,"comments":[{"body":"they are bffs","score":1,"comments":[]},{"body":"GOD DAMMIT!\n\n  \nYOU STOLE MY LINE!!!","score":1,"comments":[]}]},{"body":"Luffy and Zoro are better friends, Zoro and Sanji are better fuckbuddies","score":3,"comments":[]},{"body":" Usopp and Sniperking, they’re literally best friends!","score":1,"comments":[{"body":"Came here expecting a good answer and found the right one.","score":2,"comments":[]}]}]},{"title":"‘Like Finding One Piece’: Researchers Rediscover Joy Boy, a Bird Lost to Science","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[{"body":"#Can we get much higher?\n\nSo the black-naped pheasant pigeon believed extinct was discovered in the Southeast Asian country of Papua New Guinea after 140 years. 140 has the Japanese reading “Joy”. The Wisdom King of Pheasant Peacocks Karoo who is 4’11” and 14 years old appears on the cover of Chapter 140. Exactly 800 years ago the Southeast Asian Kediri Kingdom of Indonesian King Joyoboyo fell in 1222. The emblem of Indonesia is the Garuda bird which is the namesake of the bird and “real man” Karoo [the successor to Joy Boy](https://www.reddit.com/r/OnePiece/comments/y3at3e/how_the_cyrillic_script_solves_the_ancient_mystery/) whose unicorn treasure is the One Piece.","score":4,"comments":[]},{"body":"kid named finger:","score":4,"comments":[{"body":"[Joy Boy has fingers](https://ibb.co/D1LkFYc) 👀","score":1,"comments":[]}]}]},{"title":"Ok, hear me out..","not_safe_for_work":true,"locked":false,"body":"","score":1305,"comments":[{"body":"Marked as NSFW because it shows a man getting *drained* 😏","score":203,"comments":[{"body":"By Oden's BBK (big black katana)","score":80,"comments":[{"body":"his Big Black **CoC K**atana","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Zoro, the blackface DOES NOT help with the racism allegations.","score":483,"comments":[{"body":"It does help him become a more stronger swordsman tho","score":109,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Woah, is that fuckin blackface dude?!","score":86,"comments":[{"body":"nonononono, this isn't blackface, i'm an actual demon","score":37,"comments":[{"body":"*proceeds to violently devour said demon*","score":19,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Frieza approves","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He became the very thing he swore to destroy","score":63,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I love both of these guys but they handle plot twists very differently","not_safe_for_work":false,"locked":false,"body":"","score":487,"comments":[{"body":"I don't care what anyone says, The phrase \"Journey before destination\" perfectly encapsulates the entire IDEA of one piece.","score":101,"comments":[]},{"body":"I did not expect to see a meme comparing two of my favorite series today, especially not a high fantasy novel series and a shounen manga. But considering how absurdly huge they both are compared to the average size of their similar works, it does make a lot of sense.\n\nWho would win in a sword fight: Mihawk or Lan?","score":51,"comments":[{"body":"Comparing your favorite two authors\\*  \n\n\nBrandon Sanderson has written multiple series, not just one.","score":11,"comments":[{"body":"Yeah, the only thing I read by Sanderson were the final books in Robert Jordan's Wheel of Time, so my head went straight there and I didn't even remember he had other books. My apologies.\n\nBut neither Oda nor Jordan nor Sanderson are my favorite authors. They just happen to have written that One Amazing Thing, but my favorite authors are my favorites for the sum of their works (which I can't even judge in Sanderson's case) so despite my completely baseless assumption about WoT I did mean \"series\" and not \"authors\".","score":7,"comments":[]}]}]},{"body":"It's nice to know that I'm not the only one hyperfixated on these exact 2 fictional universes right now!\n\nI really wanna see Mistborn in particular as an anime. I reckon it'd work really well.","score":14,"comments":[]},{"body":"Oda be like: I’m going to create a side character that wears a baby outfit and give him one of the best backstories you’ve ever read","score":13,"comments":[{"body":"Sanderson be like: \"I'm gonna start a book with three prologues.\"","score":3,"comments":[]}]},{"body":"now I wanna see Stormlight Archive as an anime, it would be so cool to see the fight scenes animated","score":7,"comments":[]},{"body":"What joke was that ?","score":4,"comments":[]},{"body":"The one thing they have in common:  “I think I can fit more magic systems into this story if I squeeze.”","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"They deserve the cookies.","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"I will bake miss Ikkaku all the cookies she desires.\n\nScrew you other weirdos","score":1,"comments":[]}]},{"title":"[Chapter 1067] Why THAT man started moving","not_safe_for_work":false,"locked":false,"body":"","score":255,"comments":[{"body":"We have to save Vegapunk from himself! \n\nIts operating on his brain not servers meaning every piece of porn, misinformation, political \"discussion\", one piece theory, conspiracy, roleplay, powerscaleing take and fan fiction are all burned into his memory with no way of him knowing what's real and fake\n\nThe poor man's gonna drive himself insane","score":26,"comments":[]},{"body":"I think he might be connected to the other pacifists and saw what's about to go down at Egghead with his daughter, his last shred of humanity driving him forward.","score":9,"comments":[{"body":"Shit so you are saying he's already online?","score":6,"comments":[{"body":"Yes I think he is online, I'm thinking he had to have made a deal with Vega, otherwise why would he volunteered for this whole cyborg thing unless he was dying?\n\nI think the brain is already online(like local WiFi as Vega explained how his bodies can function like this) but it limits Vega himself and his copies from leaving the island, why he wants Luffy's help to leave as the government was happy knowing where he was, all the time.\n\nMaybe the pacifista have been remotely feeding him data this whole time?","score":4,"comments":[]}]}]},{"body":"He just can't wait to leak all the dirt he witnessed in Marijoa","score":2,"comments":[]},{"body":"Damn Kuma’s head fits this picture","score":2,"comments":[]},{"body":"My theory is that he needed to go to the toilet, which means pacifistas poops, and he needed some privacy but because his cyborg operation he can’t communicate and tell the others his situation or he’s just embarrassed","score":1,"comments":[]},{"body":"VP just wants to open a york OF to get more money for his research","score":1,"comments":[]}]},{"title":"We all make sacrifices for OP","not_safe_for_work":false,"locked":false,"body":"","score":614,"comments":[{"body":"Wasn’t expecting to be personally attacked today but here we are","score":18,"comments":[]},{"body":"Rookie numbers we're at 1041 now","score":10,"comments":[]},{"body":"Ya I’ve watched them all twice","score":4,"comments":[]},{"body":"They don’t know that I’m reading the manga","score":3,"comments":[]},{"body":"Great i have seen 1041 episodes","score":1,"comments":[]}]},{"title":"he wasn't prepared for their energy","not_safe_for_work":false,"locked":false,"body":"","score":1742,"comments":[{"body":"This meme got me thinking that 10 years of manga and Alliance between strawhats and Heart pirates lasted like 2 months 💀","score":95,"comments":[{"body":"I know right? Kinemon has been with the crew &gt;! for about 400 chapters. !&lt;  \n&gt;! That's about 4 times as much as Vivi (roughly 100 chapters). !&lt;","score":54,"comments":[{"body":"He somehow feels like such an OG","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Law:🤦what have I done!!! I fucked up seriously!!","score":30,"comments":[{"body":"This is how pirates fucked up in ancient times!","score":23,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"True","score":12,"comments":[]},{"body":"&gt;!Law 5 minutes after ending the alliance with the Straw Hats and getting overrun by Blackbeard!!&lt;","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Okay but Law actually is closer to finding what the Will of D is and the only other member from the worst generation (not counting Zoro) to know about Road Poliglyph.\n\nLuffy helped defeat Mingo and I heard defeated Kaido which is what Law wanted!\n\nPartnering with the MC of a story really pays off!","score":19,"comments":[{"body":"For sure :) I just thought Law's reaction to Luffy's (and the other Straw Hats') shenanigans during Punk Hazard was really funny.","score":12,"comments":[{"body":"hahaha true!\n\n\"Will you betray us? No. sparkle eyes!\"","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Im face reveal","not_safe_for_work":false,"locked":false,"body":"","score":177,"comments":[{"body":"I'm","score":18,"comments":[]},{"body":"I have a theory that Im is actually a tryhard from GTA online that uses the dunce hat and spams the orbital Cannon on the one piece world.","score":8,"comments":[]},{"body":"I'm D. Shit","score":3,"comments":[]},{"body":"What a quirky character, I can't help but wish Im was real","score":2,"comments":[]},{"body":"Hi, thanks for posting. Feel free to come join the discussion over on the [/r/MemePiece Discord server](https://discord.gg/sjkDW72)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MemePiece) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"Now that Pikachu has been confirmed as a CoC user, how far do you think he goes into the verse?","not_safe_for_work":false,"locked":false,"body":"","score":543,"comments":[{"body":"It's Pikachu, definitely lvl 15 town hall","score":134,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Pikachu's CoC was so strong, that the strongest Charizard of the world fainted right after clashing with it head on. Pikachu totally legendary level.","score":99,"comments":[{"body":"Bro pikachu’s CoC is huge asf, and you can barely walk after taking it","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The same charizard that pretty much one-shoted the Mega Charizard thas was able to go toe-to-toe with Primal Groudon/Kyogre","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Splitting skies with kaido","score":63,"comments":[]},{"body":"First ever haki user","score":45,"comments":[{"body":"Iron tail is armament haki 😱\nDodge is observation haki 🤯\nPokeball cannot contain his Conqueror's haki. That's why Ash never put him in one. 😵","score":35,"comments":[{"body":"One piece is nothing but a master ball????","score":10,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Pikachu clears the verse. He is basically a paramecia Enel with insane speed and his iron tail can clash with any swordsmen. Pikachu can also swim. Pikachu could also just get Luffy wet and hit him with a thunderbolt and it'll be super effective. \n\nThere is also Pikachu's special ability where the lower his health the less damage he takes.","score":30,"comments":[]},{"body":"Pikachu plays clash of clans?!?!?!","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Knock knock joke by Brook 🤣","not_safe_for_work":false,"locked":false,"body":"","score":452,"comments":[{"body":"Yohohoooho Zoro San, Orae wa brook desu yo.","score":22,"comments":[]},{"body":"Where's the actual fucking video of this. This is herecy, bring us the video","score":20,"comments":[]},{"body":"I am mentally insane","score":11,"comments":[{"body":"Me too, let's be insane together ❤️","score":7,"comments":[]}]},{"body":"Imagine taking screenshots of a video and posting it as an image meme 🗿","score":7,"comments":[]},{"body":"Oh God Zoro turned into brook","score":2,"comments":[]},{"body":"I was expecting a bone-based pun.","score":2,"comments":[]},{"body":"if i had an award id give it, i fucking *love* this lmao","score":2,"comments":[]}]},{"title":"Haki question.","not_safe_for_work":false,"locked":false,"body":"Could you infuse armament haki into anything, like literally put it into a shoe or something or is it just weapons.","score":3,"comments":[{"body":"There’s probably a size limit for every skill level but  there’s no physical distinction between item and weapon so yeah you could probably put it in anything","score":3,"comments":[]},{"body":"Maybe you couldn’t infuse it into liquids or gasses but other than that there shouldn’t be a difference between a weapon and some random item.\n\nOther than that I could see sea prism being special but probably not since it hasn’t been mentioned to interact with haki in any special way.","score":3,"comments":[{"body":"I feel like sea prism stone doesn’t need haki for the story because it is already very hard and it is effective against devil fruit users. Haki kind of replaced sea prism stone in the new world so i can only imagine it being used by character that can’t use haki or as a trap to incapacitate a devil fruit user. It probably will still have an effect on the technology though","score":1,"comments":[]}]},{"body":"Doffy infused it into his shoes and awakened strings, so not really sure about limitations","score":1,"comments":[]},{"body":"Luffy infuses it to his slippers so sure","score":1,"comments":[]},{"body":"I don’t think you could put it in projectiles but if you are in contact with it then you could probably infuse armament haki into it","score":0,"comments":[{"body":"I may be wrong but didn't oda show the Kuja using Haki on their arrows? I think it was an instance of armament on a projectile.","score":2,"comments":[{"body":"Maybe, but i was thinking guns. You are probably right though","score":3,"comments":[{"body":"Ben Beckman hokding Kizaru unser gunpoint kinda implies he has haki infused bullets at the end of MF","score":2,"comments":[]}]}]},{"body":"We've literally seen Haki be put into projectiles🤦‍♂️","score":1,"comments":[]}]}]},{"title":"A friend send me a pic of why he started watching OP","not_safe_for_work":false,"locked":false,"body":"","score":321,"comments":[{"body":"That's brilliant","score":30,"comments":[]},{"body":"Your friend is man of culture, I see.","score":22,"comments":[]},{"body":"I started watching after I saw robin with multiple hands on one arm photo and was genuinely confused","score":11,"comments":[]},{"body":"damn that person is easy to convince , i only started watching when i saw goatbeard crush blackbeard's throat with his staff","score":19,"comments":[]},{"body":"I started watching because of Boa Hancock.","score":5,"comments":[]},{"body":"I too watch due to buggy d god","score":12,"comments":[]},{"body":"I started it cause it was uploaded on youtube, bruh","score":3,"comments":[]},{"body":"It's perfect","score":2,"comments":[]},{"body":"That's exactly why I started watching again. Buggy and his big red nose popped up in my mind one day and I became obsessed","score":2,"comments":[]},{"body":"I started watching because my friend told me the entire marineford arc.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"My man did the math","not_safe_for_work":false,"locked":false,"body":"","score":136,"comments":[{"body":"\"0 hours of social life because, let's be honest, we're weebs\" 💀","score":21,"comments":[]},{"body":"Im gonna be honest, im a bit repulsive towards those who consume any sort of entertainment without a break. Entertainment should be a medium people use to release themselves. I’ve watched my friend rot himself watching anime everyday without a stop. I watch anime but still balanced it out with my studies.","score":10,"comments":[{"body":"Yes I do consider you repulsive. Jokes aside, I believe the words you’re looking for are “repulsed by”.","score":5,"comments":[{"body":"Lol. True.","score":3,"comments":[]}]}]},{"body":"I watched 400 op episodes in one month 💀 trying to catch up while going to highschool and doing homework,  I never ever did something like that again, now i hardly watch anime, only weekly episodes and such pretty chill","score":3,"comments":[]},{"body":"I caught upto episode 1000 in 1month💀💀","score":2,"comments":[]},{"body":"Hi, thanks for posting. Feel free to come join the discussion over on the [/r/MemePiece Discord server](https://discord.gg/sjkDW72)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MemePiece) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"what about taking shits","score":1,"comments":[{"body":"you've got a phone, right?","score":3,"comments":[{"body":"Fair","score":2,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"👤","not_safe_for_work":false,"locked":false,"body":"","score":162,"comments":[{"body":"I watched too much hentai with nurses, getting weird assosiations 💀","score":9,"comments":[]}]},{"title":"this is sanji during time skip but he didn't find alfa male in the area","not_safe_for_work":false,"locked":false,"body":"","score":34,"comments":[]},{"title":"Rate my smash or pass.","not_safe_for_work":false,"locked":false,"body":"Rate it quick.","score":9,"comments":[{"body":"Blackbeard is tangible","score":8,"comments":[]},{"body":"Ah the shitpost shitpost no mi at work","score":6,"comments":[]},{"body":"Is this part of your essay for next weeks class ? You werent supposed to paste the “research” here","score":3,"comments":[]},{"body":"based jinbe enjoyer, i approve","score":3,"comments":[]},{"body":"You needed only one thing for my approval and you've done it. Congratulations!","score":2,"comments":[]},{"body":"Not a single one of those characters should be in pass","score":2,"comments":[]},{"body":"[deleted]","score":-4,"comments":[{"body":"Maybe read it, dumbass","score":2,"comments":[]}]},{"body":"You dont need Haki for black beard. The Yami-Yami no mi is the only Logia that doesnt grant intangibility","score":1,"comments":[]}]},{"title":"Luffy forgot...","not_safe_for_work":false,"locked":false,"body":"So Luffy couldn't hurt Kaido with his punches so he learnt Ryuo but that's stupid all he needed was to just wear an Afro and his punches become stronger automatically! smh Luffy forgot what he learnt pre-timeskip.","score":21,"comments":[{"body":"Luffy considered Kaido unworthy of an afro power","score":8,"comments":[]},{"body":"He couldn’t wear the afro because Brook stole it and glued it to his skull, that’s why Luffy took Brook on his crew, to sail the seas to find the legendary glue remover and get his afro back, does no one read the manga","score":3,"comments":[]},{"body":"Damn foxy keep usin his devil fruit powers on the plot.","score":3,"comments":[]}]},{"title":"Can't wait to see this scene get animated, my heart will literally melt","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"It literally says \"sugoi\" (SSGO) on his coat.","score":4,"comments":[{"body":"Idk what that means","score":2,"comments":[{"body":"It means wow in japanese.","score":3,"comments":[{"body":"SSG = Special Science Group. The O is likely just one of the circles that are present all over the outfits in this arc, see Luffy and Franky for examples.","score":4,"comments":[]}]}]}]}]},{"title":"I hope this ages poorly but at this rate I can’t be sure…","not_safe_for_work":false,"locked":false,"body":"Excuse the pixels","score":5216,"comments":[{"body":"Elbaf is a massive Chekhov's gun. It's been an important part of 3 arcs now. There's no way Oda would include it so much if they were not going there","score":967,"comments":[{"body":"Elbaf has been relevant since Dino-island pre-alabasta.","score":542,"comments":[{"body":"We met the pair on little garden, the pair at enies lobby, and the guy at Dressrosa, not to mention the giants in Robin and Big Moms backstories","score":320,"comments":[{"body":"&gt;!Yeah also if you read the manga then there's also the giants who preserved the books from O'Hara in a library!&lt;","score":268,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"It will. Elbaf is for sure happening based on what’s happening in the manga","score":380,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oda ticked us all. Elbaf is Robin’s arc.","score":315,"comments":[{"body":"Nah, it's gonna be Brook's (he's the tallest and it's the home of giants)","score":204,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Can anyone explain the Mjolnir and Elbaf connection?","score":96,"comments":[{"body":"Elbaf has a norse theme and Usopp used a hammer pre time skip","score":186,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"There is no way in hell we aren't going to Elbaf. I don't understand how some people think we aren't. It is 100% necessary for Usopp's character and it is clear that it is an island that Oda has been wanting to draw for a long, long time. We also got even more of a reason we're going there just last chapter &gt;!with the reveal that Saul is still alive and on Elbaf!&lt;. It's as absurd as saying we aren't going to Laugh Tale.","score":86,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Found this at the top when i searched for memes of it. there was nothing else of relation.","not_safe_for_work":false,"locked":false,"body":"","score":25,"comments":[{"body":"Agreed. Music demons … do your worst","score":2,"comments":[]}]},{"title":"The story about how i started watching one piece","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"same. literally not one person i know in real life","score":1,"comments":[{"body":"Who?","score":1,"comments":[]}]}]},{"title":"The forbidden technique","not_safe_for_work":false,"locked":false,"body":"","score":1115,"comments":[{"body":"Even god fears the rocket made of rubber...","score":44,"comments":[{"body":"Do you mean condom?","score":18,"comments":[{"body":"Does Luffy need to wear condoms or can he just use himself as a condom?","score":4,"comments":[]}]}]},{"body":"Zoro can't get lost if he isn't walking on his own two feet","score":28,"comments":[{"body":"*you’d be fucking surprised*","score":20,"comments":[]}]},{"body":"\"Wari Zoro\"","score":5,"comments":[]}]},{"title":"I Would like to use all OP OC for my original series inspired by one piece. let's make it as big as one piece!","not_safe_for_work":false,"locked":false,"body":"All OC will be credited to its creator","score":2,"comments":[{"body":"You can do that if you want and I hope it works out well for you if you end up doing it but you are setting the bar a little too high as one piece is one of the top selling fiction of all time so maybe set your goals a little lower but apart from that I give you my best wishes and good luck","score":1,"comments":[{"body":"I mean big as one piece as in quantity","score":2,"comments":[{"body":"Oh well good quality is extremely attainable as long as you can draw/animate well","score":1,"comments":[{"body":"I'm skilled at writing light novels and I have friends that are willing to adapt it to manga","score":2,"comments":[]}]}]}]},{"body":"It's fine to do fanfiction. But if you really want to be as big, you'll have do just as much work in creating a world and characters that belong to that world, instead of riding on Oda's coattails.\n\nThere's a lot to be learnt from analysing OP, like how mystery, tension, and exposition are handled. Use those as your framework.\n\nRegardless doing so will take a mental illness' amount of passion and obsession. You'd be better off having characters of your own that you care, know everything about, and want to show the world.","score":1,"comments":[{"body":"I meant big as variety And this is original not fan fiction","score":1,"comments":[]}]}]},{"title":"This is actually what it sounds like pronounced quickly","not_safe_for_work":false,"locked":false,"body":"","score":49,"comments":[]},{"title":"Best one piece clip 😂","not_safe_for_work":false,"locked":false,"body":"","score":123,"comments":[{"body":"Goofy","score":4,"comments":[{"body":"I feel like Luffy doesn’t give a f about anything","score":6,"comments":[{"body":"Luffy being goofy*","score":2,"comments":[{"body":"Luffy being a troll","score":2,"comments":[]}]}]}]},{"body":"Damn one piece is awesome","score":2,"comments":[]},{"body":"G8 arc got so many laughs out of me.","score":2,"comments":[]},{"body":"Which arc is this? It feels like g8","score":1,"comments":[]}]},{"title":"This song perfectly depicts Sanji's feeling about Nami","not_safe_for_work":false,"locked":false,"body":"https://m.youtube.com/watch?v=4n1oVO4yY24\n\nThe song is called \"World is mine\" by Kaito\n\nThe blue haired guy (Kaito) is portraying Sanji and the green haired girl (miku) is portraying Nami, and this song is Sanji showing his true feelings about Nami towards her...\n\nDo you guys agree?\n\n[View Poll](https://www.reddit.com/poll/z1f5ba)","score":0,"comments":[{"body":"I'm not getting rick rolled","score":1,"comments":[]}]},{"title":"Fishman Island be like","not_safe_for_work":false,"locked":false,"body":"","score":310,"comments":[{"body":"Every time Hody got hit by Luffy he needed to take more steroids cause he was that weak. He lost to Zoro while fighting him underwater, the one place fishmen are supposed to be superior","score":17,"comments":[{"body":"And oda still managed to stretch it for around 50 chapters.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Evander Hodyfield","score":5,"comments":[]},{"body":"I just finished reading it and its the wort arc to me. The flash back is the only top tier part in it","score":11,"comments":[{"body":"Definitely on the lower tier of arcs yeah","score":14,"comments":[]},{"body":"Oh boy. You'll love punk hazard then.","score":7,"comments":[{"body":"I slightly prefer punk hazard because of the crew interactions and Law.","score":8,"comments":[{"body":"I just hate the running. There's constant running in that arc and it makes me a little mad","score":8,"comments":[]}]},{"body":"nice","score":3,"comments":[]},{"body":"I agree with you, but at least punk hazard has so cool characters and lore. Fishman island just had decent lore.","score":5,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"discussion: why Uuffy has the N word pass? brook maybe?","not_safe_for_work":false,"locked":false,"body":"","score":89,"comments":[{"body":"Go ahead, tell Luffy he can't say meat in Japanese. See how long you'll survive","score":30,"comments":[{"body":"I AM MONKEY D. LUFFY GIVE ME YOUR MEAT!","score":27,"comments":[{"body":"*unzips*","score":20,"comments":[{"body":"Ayo🤨","score":10,"comments":[]}]}]}]},{"body":"Nika","score":14,"comments":[{"body":"Goda levels of foreshadowing","score":11,"comments":[]}]},{"body":"meat","score":9,"comments":[{"body":"Did you just say meat?","score":14,"comments":[{"body":"Good bot","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Usopp gave Luffy the N-Word pass when he told Luffy to wear an afro to fight Foxy.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"“He’s Beginning To Believe..” -Morpheus From The Matrix (1999)","not_safe_for_work":false,"locked":false,"body":"","score":30,"comments":[]},{"title":"When legends meet","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"Hi, thanks for posting. Feel free to come join the discussion over on the [/r/MemePiece Discord server](https://discord.gg/sjkDW72)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MemePiece) if you have any questions or concerns.*","score":1,"comments":[]}]},{"title":"So about Lucci…","not_safe_for_work":false,"locked":false,"body":"So how strong do you think he should be. Because he’s obviously gonna engage with the crew, and realistically there’s no way he hasn’t trained since Enis Lobby. So how tough is our not so friendly cat boy?\n\n[View Poll](https://www.reddit.com/poll/z0yzv3)","score":2,"comments":[{"body":"Robin &amp;/ Franky for thematic reasons. Robin has already had two power hype moments in Egghead (bounty recognition + new move) and spent Enies Lobby needing to be rescued. Now is the perfect time to show off her progress, even if she needs a little help from Franky &amp;/ Vegapunk.","score":2,"comments":[]}]},{"title":"\"Are you ready kids?\"","not_safe_for_work":false,"locked":false,"body":"","score":86,"comments":[{"body":"Is that Laboons sister","score":3,"comments":[]},{"body":"Never seen this pic of Squidward smiling before. That's actually pretty wholesome 😊","score":2,"comments":[{"body":"Me who did this unintentionally and just took the first pic I could find of the main Spongebob characters: \"Yes, that was my intent all along! To be wholesome!\"","score":2,"comments":[]}]},{"body":"Squidward has been diagnosed with DreamWorks face","score":1,"comments":[]}]},{"title":"Christmas Lights with a background catch","not_safe_for_work":false,"locked":false,"body":"","score":44,"comments":[{"body":"When you stay up all night to catch a glimpse of Santa bringing you presents and you hear YO HO HO!","score":3,"comments":[]},{"body":"I didn't know that Chopper's favorite holiday was Christmas","score":2,"comments":[]}]},{"title":"vegapunks plan (1067)","not_safe_for_work":true,"locked":false,"body":"","score":56,"comments":[{"body":"TUMBLING  DOWN ^TUMBLING ^DOWN \n\n^^^TUMBLING ^^^DOWN","score":6,"comments":[]},{"body":"Get in the Robot Luffy","score":4,"comments":[]},{"body":"What am i looking at","score":2,"comments":[{"body":"human instrumentality project where all humans shared one mind or something along those lines","score":6,"comments":[]},{"body":"No clue","score":1,"comments":[]},{"body":"Punk 02 final form","score":1,"comments":[]}]},{"body":"Hi, thanks for posting. Feel free to come join the discussion over on the [/r/MemePiece Discord server](https://discord.gg/sjkDW72)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MemePiece) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"That's a pretty niche reference, that's probably why it's not upvoted that much.","score":1,"comments":[{"body":"i mean, is eva even niche anymore","score":2,"comments":[{"body":"I'd say that the show itself is well-known in pop culture but that only a few people actually watched it and would recognize that image.","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Pokenon Scarlet/Violet's launch was Yonko Level!","not_safe_for_work":false,"locked":false,"body":"","score":713,"comments":[{"body":"If we are talking about technical issues sure but it's still a way better game then sonic 06 NMS at launch and survive","score":74,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"At least Cyberpunk ended up getting a pretty badass anime","score":148,"comments":[{"body":"Rebecca or lucy?","score":24,"comments":[{"body":"Oh, I haven't seen it yet. I plan to if I got the time to buy Cyberpunk 2077 for my PS5 \n\nBut I have heard great things about it","score":18,"comments":[{"body":"You should try to watch it first and you can find every sneak peak from the anime in the game too, good experience\n\nAnd stand by a tissue","score":18,"comments":[{"body":"I'll give a shot, thank you. I may even buy the DLC for the game as well.\n\nBTW, is the tissue for emotional movements, or something else? 😏","score":6,"comments":[{"body":"Have fun\n\n&gt; BTW, is the tissue for emotional movements, or something else? 😏\n\nYes","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Maine","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Well, Pokemon journeys has been pretty good overall. Not Edgerunners levels but pretty nice.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"BTW, I am simply saying that these games had legendarily bad launches, I know that some of these games improved later on.","score":87,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"(Manga) Nami's awesome outfit by ライダー(ORANGE_COUTURE) (source in caption)","not_safe_for_work":false,"locked":false,"body":"","score":29,"comments":[{"body":"Finally a SSG Nami fan art that doesn’t make her pants the smallest they can be before it becomes porn.\n\nVery nice","score":2,"comments":[]}]},{"title":"\"You know what this reminds me of...?\"","not_safe_for_work":false,"locked":false,"body":"","score":139,"comments":[{"body":"Think Hawkins tink! I have been with the main character for ten years and you are just depending on luck.","score":6,"comments":[{"body":"What will you have after Luffy finds the One Piece treasure?!","score":2,"comments":[]},{"body":"Bro, you just made me realize that Dressrosa was 10 years ago.","score":1,"comments":[]}]},{"body":"There's a frame from Whitebeard vs Akainu after the donuting that looks like it too","score":1,"comments":[]}]}]}