{"name":"mildlyinteresting","description":"Aww, cripes. I didn't know I'd have to write a description. How many words is that so far, like a hundred? Soooo, yeah. Mildly interesting stuff. Stuff that interests you. Mildly. It's in the name, ffs.","subscribers":21142035,"posts":[{"title":"My city rolled out a yearly EMS subscription","not_safe_for_work":false,"locked":false,"body":"","score":60126,"comments":[{"body":"Hey, I am an Ambulance PRIME member!","score":3848,"comments":[{"body":"You get to control the radio on your way to the ER!","score":1063,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He's trauma team platinum let's get him outta here now!\n\n*Drives away from the other uninsured*","score":208,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Saw this in my area too, only it was for my county. Reading it was interesting. There's a little line about it being charged to your insurance, but the way it's written makes it sound like you might be eating the full cost of the ride in your insurance anyway.\n\nEDIT: Reread it. Looks like they are just covering the deductible? Meaning if this is legit.. your insurance still eats the bill after the minimum payment, but everything the insurance company expected you to pay in cash is covered by them. Wtf.","score":4456,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"7 minutes or a refund, that's the Trauma Team guarantee.","score":17435,"comments":[{"body":"Only with the platinum package","score":4437,"comments":[{"body":"**\"Step away from the client.\"**\n\n*heavy machineguns are levied against you*","score":781,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Does your town give a discount if you bundle fire and police protection with this?","score":3903,"comments":[{"body":"*whispering* \"Help, someone is breaking into my house.\"\n\n\"No problem, sir. What's your subscriber ID?\"\n\n\"...fuck.\"","score":2596,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Used to be covered by paying city taxes until cities contracted with private companies now we still pay taxes and have to cover an ambulance ride. Our country is greedy AF.","score":6707,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"a Lego space figure from 1980 and one from 2022","not_safe_for_work":false,"locked":false,"body":"","score":49649,"comments":[{"body":"He’s been through a lot, but he’s just as happy to be here as the new guy.","score":1000,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"First dude has seen some shit","score":3404,"comments":[{"body":"Lego Interstellar","score":1275,"comments":[{"body":"*insert \"Cornfield Chase\" by Hans Zimmer epic soundtrack*","score":281,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The one on the left stayed at home, the one on the right traveled at near light speed to return home 40 years later","score":180,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"If it ain't broke don't fix it","score":2976,"comments":[{"body":"I wish more companies/ industries realized this","score":1239,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"These spacemen are twins. One of them has been traveling at the speed of light. The other remained on Earth.","score":175,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"SpAcEsHiP!!!","score":2155,"comments":[{"body":"Charlie, no, it's just a gas leak.  You aren't a spaceman and the kegs need changing.","score":424,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The broth for our Hot Pot is frozen in the shape of teddy bear, Taipei Taiwan.","not_safe_for_work":false,"locked":false,"body":"","score":646,"comments":[{"body":"PERFECTLY frozen. Impressive.","score":46,"comments":[]},{"body":"Go on, kill him.","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Looks like a cold pot to me","score":30,"comments":[{"body":"At least it isn't a pol pot","score":6,"comments":[]}]},{"body":"I'm not sure if I am fascinated or horrified, but I would love to go to that hot pot restaurant next time I am Taiwan.  Where is it?","score":6,"comments":[]},{"body":"When seen in this form, that looks like an uncomfortable amount of broth. You wouldn't eat that like a popsicle, but you'll slurp it all up like it is the last water you'll get in a desert.","score":8,"comments":[]},{"body":"fun hot pot","score":3,"comments":[]},{"body":"r/oddlyterrifying","score":3,"comments":[]},{"body":"How do they manage to do that?","score":1,"comments":[{"body":"A mold, probably.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"My chef's knife arrived in an evidence box.","not_safe_for_work":false,"locked":false,"body":"","score":7117,"comments":[{"body":"You get a call from FBI tomorrow.  \"well this is embarrassing but did you by any chance get a delivery yesterday, some evidence got mixed into the wrong mail\"","score":1674,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cuts out the middle man","score":182,"comments":[{"body":"You’ll never cut out Florida man.","score":28,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"To clarify, it looks nothing like the hunting-style knife on the evidence box. It looks just like your typical chef's knife. I'm not doing any tactical dicing I promise\n\nEDIT: This is the knife for anyone curious: https://imgur.com/a/AZLMjmZ\n\nI just used it to finely slice some apples, hopefully that's the first thing it was used for!!\n\nEDIT 2: re: specific packaging questions. Interestingly, it was in a separate box with kanji labeling, and inside that the blade was wrapped in Japanese newspapers inside a clear plastic sheath - no zip ties involved.","score":579,"comments":[{"body":"The hunting knife is a generic knife picture used to indicate this is a knife evidence box, as in if it’s crushed or dropped too hard there could be issues. The box itself is usually nothing special except the shape lends itself to boxing a knife and there’s mounting holes on the bottom you can feed zip ties through to hold the knife in the center without a bunch of packing material around it.","score":122,"comments":[{"body":"In fact, anyone can get a box like this. It’s a standard Uline box.\n\nhttps://www.uline.com/BL_512/Evidence-Boxes","score":86,"comments":[{"body":"Well shit - I know what I am wrapping all my adult Christmas presents in now","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"I was gonna say, what kind of cheffing are you up to, hannibal?","score":132,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Is this the OJ Simpson brand?","score":178,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This brewery’s single-stall bathrooms aren’t gendered, but instead list the accessibility/ amenities in each","not_safe_for_work":false,"locked":false,"body":"","score":188,"comments":[{"body":"Finally a bathroom for those of us who fart lying down.","score":15,"comments":[]},{"body":"AS IT SHOULD BE. What’s the point of gendering single-room washrooms? It makes no sense. \n\nOne time I was in a building that had two single-room washrooms. One was labeled male and the other female. I desperately needed to go and the male room was taken. So I went into the female room… there was nothing different about it from the male room. Nothing female-specific, anyways.","score":23,"comments":[]},{"body":"Few symbols.. but not a bad idea.","score":3,"comments":[]},{"body":"That's a story, go to toilet, finish up and as you're walking past the urinal you slip over and land on you back in someone's piss. Then end up in a wheel chair.","score":7,"comments":[{"body":"Or it is a list of tasks that you need to do inside in this certain order.","score":4,"comments":[]}]},{"body":"Hey. That makes sense","score":3,"comments":[]},{"body":"It is very common In Japan to list the amenities outside the restroom.","score":2,"comments":[]},{"body":"This is the way [stalled](https://stalled.online), who's likely the largest advocacy group for accessible and inclusive bathrooms, says that you should do it based on all of their research and talking with people representing all kinds of groups for whom bathrooms are often not inclusive or accessible.\n\nThe people putting the whatever signs, or the aliens, or all of the goofy jokes have their heart in the right place but actually might be doing as much harm than good. Because drawing attention to the inclusivity of the restroom is just a roundabout way of othering the people who are used to being excluded -- reminding them that this is a special restroom and that they should be aware that all the other ones aren't for them.\n\nOn the flip side, just saying what facilities are available behind the door is straightforward, practical, and impossible to argue with.\n\nRather than making the room gender-inclusive, you just make it non-gendered.","score":2,"comments":[]},{"body":"Where's the knife?","score":2,"comments":[]}]},{"title":"A Freemason obelisk with unknown writings found at a flea market today","not_safe_for_work":false,"locked":false,"body":"","score":9639,"comments":[{"body":"Best I can figure is that it's a pigpen *and* an alphabetical substitution. Long story short, it's a commemoration of French operations in Africa.\n\n*The long story is that it says nci pqcetdci taeobti in pigpen, which is gibberish in any language. But coupled with the reciprocal decryption alphabet, it says \"Des Operates Africas.\" Without a truly working knowledge of French, the above is just a best guess.","score":6936,"comments":[{"body":"And you realized the cipher and solved it in less than 20 minutes. Fuckin impressive, homie.\n\nEdit- damn, lots of messages saying \"not that impressive,\" \"I could have done that,\" \"it's just a pigpen cipher, really easy.\" I don't see you having actually done it like the previous commenter, and less than 19 minutes after the original post, so shut the fuck up and let people do impressive things and let people compliment then for it without  belittling what they've done.","score":4030,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If anyone else was like me and didn't know what pigpen was (how the symbols above become letters), it's actually really cool and simple! Wikipedia explains is very well here: \n\n[https://en.wikipedia.org/wiki/Pigpen\\_cipher](https://en.wikipedia.org/wiki/Pigpen_cipher)\n\nI want to teach this to my kids :)","score":496,"comments":[{"body":"I learned it as a kid from my mom. 6 year old me thought I was the shit.","score":109,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Solves the cipher, gets something in French. \n\n“God damn it, there’s no way we’ll ever know what it means.”","score":269,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"“Be sure to drink your Ovaltine.”","score":718,"comments":[{"body":"All this for a crummy commercial...","score":98,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Masonic cipher\n\n[https://www.freemason.com/what-is-masonic-cipher/#:\\~:text=The%20Masonic%20Cipher%20is%20a,alphabet%20with%20a%20different%20symbol](https://www.freemason.com/what-is-masonic-cipher/#:~:text=The%20Masonic%20Cipher%20is%20a,alphabet%20with%20a%20different%20symbol).\n\nAlso as stated double coded","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Now you just have to go hold of the Declaration of Independence and you will find the treasure","score":471,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It says \"return the slab\"","score":64,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Restaurant in Vietnam still has 90’s mascot for 7up","not_safe_for_work":false,"locked":false,"body":"","score":631,"comments":[{"body":"HIS NAME IS FIDO DIDO!","score":111,"comments":[{"body":"Such disrespect!","score":17,"comments":[]}]},{"body":"There’s a special place in hell for whoever canceled Fido Dido","score":33,"comments":[]},{"body":"To us, fido is an iconic mascot during our childhood","score":20,"comments":[]},{"body":"I used to have a Fido Dido watch. \nLater on the 7up Spot became the mascot. Even had a pretty cool game on the Genesis.","score":13,"comments":[]},{"body":"That ain't [Cool Spot](https://en.m.wikipedia.org/wiki/Cool_Spot).","score":25,"comments":[{"body":"I remember playing that spot game on either sega or Nintendo back in the day at my buddy’s b-day party. Haven’t thought about that, or spot, in decades.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I think he was around longer than that. I was born in 98 and I remember him.\n\nAfter a quick google he seems to have been around till like 2011.","score":8,"comments":[]},{"body":"I miss the cool red dots as the mascots lol","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Make 7 Up Yours","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"This business I visited still has a Muzak knob in the office area.","not_safe_for_work":false,"locked":false,"body":"","score":133,"comments":[{"body":"For those that don’t know, [Muzak](https://en.wikipedia.org/wiki/Muzak) is an American brand of background music played in retail stores and other public establishments. \n\nIt is also known as “elevator music”.","score":72,"comments":[{"body":"That is interesting - I didn't realise it was a brand, I thought it was the name of the genre","score":30,"comments":[{"body":"It’s both now, because the company popularized and defined that style of background music.\n\nPeople don’t think about this, but infinitely looping a large variety of music for such a long time required specialized and expensive equipment back then. There were specialized tape machines with special long tape designed to be able to switch reels automatically without a noticeable gap in the playback. The company that made the machines and the tapes also commissioned the music. 3M was also in this business.","score":25,"comments":[]},{"body":"10 out of 10 recommend people check out actual Muzak, it's really well done ambient music","score":8,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Do not touch.\n\nWillie","score":19,"comments":[{"body":"Sound advice","score":9,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"It still works, it just plays Vaporwave now.","score":13,"comments":[]},{"body":"Crank it to 11 and yank off the knob.","score":9,"comments":[{"body":"Calm down Satan.","score":5,"comments":[]}]},{"body":"Goes great with the asbestos and lead pipes","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"45 Year Old Solar Powered Calculator.","not_safe_for_work":false,"locked":false,"body":"","score":1406,"comments":[{"body":"nah mate the sl-760c was introduced in 1990, don't lie!","score":121,"comments":[{"body":"They were clearly thinking of the SL-760 which was first made in 1985. The 760c is way better as everyone knows.","score":33,"comments":[{"body":"1985 is still not \"45 years old\"","score":28,"comments":[{"body":"If I had a calculator I would have known that.","score":53,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"I was just thinking that this is way more modern than the calculators that existed in 1977 when I was 11.   The calculator my family owned in 77 was a big clunky thing with only the basic buttons and red LEDs.\n\nFound it. https://www.flickr.com/photos/51764518@N02/41029101670","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"calculator geeks be like no thats 1990s","score":35,"comments":[{"body":"TIL I'm a calculator geek. \n\nAlso I had one of those in the 90s. It's probably still in the top drawer of my childhood desk, which is probably still in my mum's house.","score":4,"comments":[{"body":"Joke's on you, your stuff was donated, and your room is the yoga studio/rumpus room. 😆","score":5,"comments":[{"body":"Jokes on me. My mum has a serious hoarding disorder and never threw anything away ever. I've been trying to get her to donate stuff for decades.","score":4,"comments":[]}]}]}]},{"body":"I still use my Casio calculator from 1986.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The bathroom of this commercial plane has a window.","not_safe_for_work":false,"locked":false,"body":"","score":2196,"comments":[{"body":"If only the toilet was facing the window","score":342,"comments":[{"body":"Reverse-mount the seat and the view is yours!","score":121,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"No one will be peeping in","score":97,"comments":[{"body":"I think there should be a Mr. Bean window shade.","score":31,"comments":[]},{"body":"If anyone is looking in at 36,000 feet, be afraid.","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I can’t decide if I love it or hate it…","score":87,"comments":[{"body":"I flew in a plane that had a bathroom window and I really loved it!  Despite airplane bathrooms being cramped and kinda gross, they are a nice break from being around so many people, it's a moment of privacy.  So getting to step away AND have a lovely view of the clouds was actually really cool.   The window made the bathroom feel more spacious too.","score":105,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Nice, you can crack it open to get some fresh air.","score":80,"comments":[]},{"body":"Never thought I’d see an entire town and toilet in the same picture.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\"I'd like to book the bathroom seat, please.\"","score":18,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Frost on the top of my car this morning","not_safe_for_work":false,"locked":false,"body":"","score":146,"comments":[{"body":"Why do you have shag carpeting on your car?","score":26,"comments":[{"body":"Ah, beat me to it.","score":5,"comments":[]},{"body":"Wanna start a worm farm?","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Something feels wrong here…","score":8,"comments":[]},{"body":"Crimson hell form impel down","score":5,"comments":[{"body":"Go home Buggy, wrong sub","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Painted red with the blood of his enemies","score":4,"comments":[]},{"body":"That's a contender for a Windows wallpaper if I ever saw one.","score":3,"comments":[]},{"body":"Love it","score":1,"comments":[]},{"body":"Hoar frost. The car was below freezing point and then water vapor in the air came into contact with the metal freezing it instantly. Nature is freaking crazy. This happens on all sorts of surfaces. Trees, grass blades, leaves and so on. It’s a truly beautiful thing to see.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Mt. Rainier casting a skylit shadow during sunrise","not_safe_for_work":false,"locked":false,"body":"","score":3882,"comments":[{"body":"Amazingly beautiful!","score":45,"comments":[]},{"body":"So good! That's one of my favorite things to see, I miss living near Mt. Rainier. Probably my best shot:\n\nhttps://live.staticflickr.com/65535/52152548161_2b35555932_o.jpg","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That sky is on fire 😁","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[Here's a video from the other side](https://www.reddit.com/r/blackmagicfuckery/comments/z0bs5o/break_in_the_sunset/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button)","score":5,"comments":[]},{"body":"These kinds of shots are great for confusing flatearthers, who think the sun just moves too far away from them at night for them to see, because they think it's always 3,000 miles above the surface of their flat Earth.\n\nAnd when you show them a photo of the shadow of a mountain on the clouds they just can't deal with it!","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I've gotten the same shot, but [of Baker, and farther away](https://i.imgur.com/kRZFlDf.jpg).","score":4,"comments":[]},{"body":"Is this OC? If not do you know the source OP? Regardless, it’s absolutely gorgeous.","score":9,"comments":[{"body":"Yep it is. My mom took this just outside her house. The whole neighborhood is stunning, and the wildlife is equally beautiful. She lives in a fairytale","score":29,"comments":[{"body":"I suggest r/NatureIsFuckingLit.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Even the little spring looks lit","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Hockey arena with a “front porch” club box","not_safe_for_work":false,"locked":false,"body":"","score":47702,"comments":[{"body":"Santander Arena in Reading, PA if anyone is curious.","score":4475,"comments":[{"body":"Hey that's where my Fake ID was from in college!","score":2631,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Recognized it right away! Saw Bill Burr here recently, and he was so fixated on that thing and made a bunch of jokes about the rich monopoly man being up there","score":119,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Reading Royals?","score":76,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Occasionally a car drives through the rink, all the players shout, \"CAR,\" they move the goals and let the car pass before resuming play.","score":2808,"comments":[{"body":"“Game on!”","score":524,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Did it have rocking chairs?","score":1259,"comments":[{"body":"The back half is just a Cracker Barrel","score":897,"comments":[{"body":"Truly PA","score":151,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This take feels like home to another level","score":615,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Our dinner was brought to us by a robot","not_safe_for_work":false,"locked":false,"body":"","score":491,"comments":[{"body":"It looks defeated","score":130,"comments":[{"body":"Yeah, it’s face just says ‘if this is what being human is like, please rip out my batteries’","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Thats how it’s programmed so it’s similar to the real thing","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Yeah so... I'm not tipping that.","score":75,"comments":[{"body":"The first robot asking me for a tip will get tipped on his side like a cow","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Guarantee you they still will try to get you to tip.","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Those cost about $20-25k each.","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“What is my purpose?”  “You deliver food” “oh my god…”","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They took our jobs!","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"R2feed2","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"A Bic lighter with a graphic of a Bic lighter.","not_safe_for_work":false,"locked":false,"body":"","score":6223,"comments":[{"body":"Yo dawg heard you like bic lighters","score":288,"comments":[{"body":"I do. I have this same lighter. It's golden","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"missed the chance to make it a droste effect","score":94,"comments":[{"body":"I never knew there was a name for that style of recursive image.","score":25,"comments":[]},{"body":"Just Bics all the way down.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Of the \"unlucky\" white Bic","score":161,"comments":[{"body":"Yes, came here for that. That must be the reason they made this.","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Why/how is it unlucky?","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Bicception.","score":16,"comments":[]},{"body":"Ads team: how can you sell more lighters, they practically sell themselves.","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"My shower has a little hole in the glass to turn the water on so you don’t get drenched.","not_safe_for_work":false,"locked":false,"body":"","score":3159,"comments":[{"body":"I was in a public restroom recently and they had a hole just like this in the stall. I couldn't figure out what it was for, but now I know it's so I can reach over and flush the toilet next to me","score":851,"comments":[{"body":"That ain't a toilet handle... 😁","score":223,"comments":[{"body":"It still works, you just need to jiggle it some more.","score":46,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Surely the floor would just get soaked during every shower?","score":770,"comments":[{"body":"That's ok, as long as I don't get wet in my shower.","score":533,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This hole functions as a make shift bidet. Just stand on the toilet and plonk your ass against the hole and voila!","score":81,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That’s not what’s that’s for 👌👈","score":248,"comments":[{"body":"Tall guys only though.","score":97,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Orrrr… it’s a poop hole so you can throw your turd into the toilet when you’re having a shit under the shower.","score":187,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I have a very similar shower, 1900x900 tray but we installed the control dial at the open end of the shower not at the wet end so I don't need to install a glory hole that gets my bathroom wet.","score":54,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The way this snow and icicles formed on this building.","not_safe_for_work":false,"locked":false,"body":"","score":63,"comments":[{"body":"If left alone that can break through windows. Breaking it off is advisable. Even though it's pretty","score":3,"comments":[{"body":"You'd have to be careful how you broke this off. If this isn't owned it would be best to call the landlord or maintenence etc. That could very easily fall inward and if you did it yourself you'd be liable.","score":2,"comments":[]}]},{"body":"Free ice cream","score":1,"comments":[]}]},{"title":"My Bismuth cytstal formed what looks like a skyscraper at sunset","not_safe_for_work":false,"locked":false,"body":"","score":344,"comments":[{"body":"That would make a cool sci-fi book cover.","score":5,"comments":[]},{"body":"Way cool.","score":2,"comments":[]},{"body":"Nearest thing to Heaven.","score":2,"comments":[]},{"body":"Tiny Dune","score":2,"comments":[]},{"body":"At first glance it looks like an arcane key to some magically locked treasure","score":2,"comments":[]},{"body":"I can almost hear Rhapsody in Blue.","score":1,"comments":[]},{"body":"Super cool!","score":1,"comments":[]}]},{"title":"Two Mario and Luigi figures from 1989. One of them lived on my shelf, the other we just discovered in an old toy box in the closet.","not_safe_for_work":false,"locked":false,"body":"","score":37,"comments":[{"body":"I also found it mildly interesting that these aren't actually worth anything, even Luigi in great shape, I'd figure really old Nintendo stuff would hold more value.","score":4,"comments":[]},{"body":"Also interesting that you still have the road rug. 😬","score":3,"comments":[]},{"body":"I can't believe you did Luigi like that. Atleast he looks better after you completely dissed him for years tho.","score":2,"comments":[]},{"body":"I had those same exact toys, only also another one of Luigi jumping on a koopa shell.","score":1,"comments":[{"body":"I had a few more too, including Mario jumping on the Koopa shell, and an old Princess Peach.","score":1,"comments":[]}]},{"body":"They're finally reunited once again!","score":1,"comments":[]}]},{"title":"This bird taking the train","not_safe_for_work":false,"locked":false,"body":"","score":201,"comments":[{"body":"On his way to his meaningless job to pay for a nest he can barely afford","score":16,"comments":[{"body":"A true contributing member of bird society.","score":6,"comments":[]}]},{"body":"Imagine someone checking the CCTV and seeing 🐦","score":4,"comments":[{"body":"Lol, at least the train hostess has proof for her colleagues.","score":3,"comments":[{"body":"True. Would be an amusing change from the usual boring.\n\n\"What are you doing?\"\n\n\"Birdwatching,\"\n\n\"I thought you were checking the CCTV?\"\n\n\"Yes, as I said, I'm bird watching.\"","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This reminds me of the Pigeons that commute on the A Train in NYC from Queens across Jamaica Bay.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He flew the coop then took the train. Is this a NY love story?","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"r/birdstakingthetrain","score":3,"comments":[{"body":"I had no idea that this was even remotely common, thanks","score":2,"comments":[]}]},{"body":"r/birdstakingthetrain","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"These rice grains standing up straight after cooking it","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[{"body":"This happens when you have a bit too much water in the pan.","score":2,"comments":[]},{"body":"They're taking a stand","score":1,"comments":[]},{"body":"All Rice!\n\nCourt is now in session.","score":1,"comments":[]},{"body":"No homo","score":-2,"comments":[]},{"body":"Was this cooked on a high heat?","score":0,"comments":[{"body":"No idea, mom cooked the rice. Never seen this before even though she always cooks it the same way","score":0,"comments":[]}]},{"body":"Both mildly interesting and mildly distressing.","score":0,"comments":[]}]},{"title":"The amount of kit issued to a UK University student in a non deployable reservist force (UOTC)","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"I understand that may be more than Russians get going to Ukraine.","score":8,"comments":[]},{"body":"No webbing, bergen, sleep system or helmet?? \n\nULOTC?","score":2,"comments":[{"body":"ULOTC is the UK’s version of ROTC, a college program that pretty much “intro into Military”","score":6,"comments":[{"body":"No i was asking if it was the ULOTC (University of london OTC) or one of the 'others' \n\nAs there are a few, some universities have their own, some are joined together into a larger group, with the ULOTC being the biggest (at least back in my day *waves stick*)\n\nI might know about them, As I did that then commissioned 😉","score":2,"comments":[{"body":"Oh, makes sense","score":2,"comments":[]}]}]},{"body":"We do get webbing, helmet, issued guns and sleep systems but they are kept on base since they are considered items of interest for terrorist organisations so we only take home the non expensive items","score":2,"comments":[{"body":"*rifle","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"After a quick look, it seems the UOTC is similar to the US ROTC program. You guys still get uniforms cause they want you stick around and actually join the military once you graduate from college. \n\nAlthough that does seem like a lot of stuff and that doesn’t even include any dress uniforms.","score":1,"comments":[]},{"body":"In all fairness, that’s not that much kit really. They throw more than 5 times that at you if your signed up.","score":1,"comments":[]},{"body":"It’s in order to make you feel special.","score":-1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"My dog watches tv with me","not_safe_for_work":false,"locked":false,"body":"","score":90,"comments":[{"body":"My mom's dog use to literally get engrossed by the television and would end up slobbering all over the screen. If any type of sport was on television, it was like the television was getting a slobber wash.","score":2,"comments":[]},{"body":"Vigilantly at that!","score":1,"comments":[]},{"body":"My old cat, sadly now long deceased, used to come running in at the sound of the X-Files theme and would watch the whole episode with me. Good cat.","score":1,"comments":[{"body":"It's good when the animal companion enjoys television with it's owner.","score":1,"comments":[]}]},{"body":"Judging by the look on the dog, they're watching season 4 of Breaking Bad.","score":1,"comments":[]}]},{"title":"This smiley face pickle I found when making a sandwich","not_safe_for_work":false,"locked":false,"body":"","score":384,"comments":[{"body":"That is a lot of pickles","score":48,"comments":[{"body":"Lol, that was my exact thought after I posted this: “people are going to see how many pickles I use for my sandwiches.”\n\nWhat can I say, I love the brine.","score":37,"comments":[{"body":"I like your style.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I Am Pickle Groot","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I, too, enjoy a few pickles on my sandwich.","score":15,"comments":[{"body":"Ha, yeah I might have went a little crazy on the pickles","score":6,"comments":[]}]},{"body":"You want some sandwich with your pickles?","score":15,"comments":[{"body":"🤣 this genuinely made me laugh. Good on you friend. Yeah I sometimes go a little overboard on pickles/peperocini, I love the zest.","score":5,"comments":[]}]},{"body":"I am kraut","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Hey Morty check it out. I turned myself into Pickle Groot! Im Pickle Grooot!","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"A chocolate covered cashew that I mistook for my other earbud.","not_safe_for_work":false,"locked":false,"body":"","score":9909,"comments":[{"body":"You ate your earbud, didn't you?","score":1182,"comments":[{"body":"He can't hear you, there's a cashew in his ear.","score":469,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This is the first time ive ever seen brown earbuds","score":565,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Y’all are nuts! Lol, to answer your questions: I did not put the cashew in my ear, nor did I eat my earbud.\n\nMy headphones fell off of my nightstand. As, I occasionally enjoy a packet of chocolate cashews, there was a rogue one on the floor. When I went to pick up my headphones, I grabbed a headphone and the cashew thinking they were the pair.","score":222,"comments":[{"body":"&gt;I did not put the cashew in my ear, nor did I eat my earbud.\n\nDon't knock it till you try it.","score":57,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"You will need a pear to connect that thing to Bluetooth.","score":58,"comments":[{"body":"Pears aren't compatible, it's Apple only.","score":26,"comments":[]}]},{"body":"My guy...did you eat your ear bud?","score":106,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"First of all \n\nTHE BEANS!!!!!\n\nsecond I really did not like these headphones at all, they don't work for my ears whatsoever and they did not get that loud (for me anyway) not judging you if you enjoy them, just found I'm definitely more of an in ear earphone kinda person instead of sitting in your ear if that makes sense.","score":159,"comments":[{"body":"Keep em away from the One Grit.","score":79,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Very uniform soap bubbles in the sink.","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"I read that as \"Unicorn soap bubbles\" and was disappointed..","score":2,"comments":[{"body":"If you look close one of the bubbles has a horn","score":2,"comments":[]}]},{"body":"I could only see the top of the pic at first and was like I don't even see bubbles... so uniform it looks like some type of rubber netting for sinks.","score":1,"comments":[{"body":"I'm guessing this was caused by some kind of netting, a sieve for example.","score":1,"comments":[{"body":"Yes, a strainer","score":1,"comments":[]}]}]},{"body":"r/negentropy","score":1,"comments":[]},{"body":"45 degree sheer plane","score":1,"comments":[{"body":"What do you mean","score":1,"comments":[]}]}]},{"title":"Pennys have a tiny Lincoln statue inside the Lincoln Memorial","not_safe_for_work":false,"locked":false,"body":"","score":96,"comments":[{"body":"Is this not common knowledge?","score":13,"comments":[]},{"body":"And two penguins on opposite sides walking up to pay homage","score":8,"comments":[{"body":"Penguins? I thought that was Homer Simposon, and his clone.","score":1,"comments":[]}]},{"body":"Would have been weird if it was someone else.","score":3,"comments":[]},{"body":"If I had a penny for every time I’ve seen this…","score":2,"comments":[]},{"body":"Howard the Duck and Piglet?","score":1,"comments":[]},{"body":"It’s how you can tell if you have a counterfeit coin hold it up and check if it’s Lincoln or a different President. Especially if the person presenting it looks sus.","score":1,"comments":[]}]},{"title":"Finally opened up the hole in the wall at work to find this note.","not_safe_for_work":false,"locked":false,"body":"","score":445,"comments":[{"body":"Nice. 8 months old. (Or 3 months if you’re not American)","score":82,"comments":[{"body":"Australian! :)","score":33,"comments":[{"body":"Oh, good morning. How is tomorrow?","score":29,"comments":[{"body":"Tomorrows great! The coffee is yum and the humidity is a bit too much for this time in the morning","score":39,"comments":[{"body":"Oh yeah I hate humidity. It’s like, don’t you know I’m trying to breathe, here?  If I wanted to slowly suffocate to death I’d live in a little cedar box with hot rocks.  Or wear a turtleneck.","score":9,"comments":[{"body":"You’re so right, we are going through wet weather whilst the suns blistering through the day so it’s mold city atm.","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]}]}]},{"body":"Kudos for resisting the natural urge to draw a penis on it","score":25,"comments":[{"body":"I am fighting for my life not to","score":11,"comments":[]}]},{"body":"What did you write on it before you put it back for the next person to find?","score":15,"comments":[{"body":"I wrote the bottom part :) will need to date it I think","score":22,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"My cat has one curly whisker","not_safe_for_work":false,"locked":false,"body":"","score":35,"comments":[{"body":"The cat uses that whisker for picking locks.","score":6,"comments":[]},{"body":"That's actually an alien and the hair is a a micro antennae","score":3,"comments":[]},{"body":"Your cat is Bluetooth compatible.","score":2,"comments":[]}]},{"title":"My local library offers supplies to make protest signs.","not_safe_for_work":false,"locked":false,"body":"","score":137,"comments":[{"body":"That's a well equipped library.","score":20,"comments":[]},{"body":"Drum kit at the library?","score":8,"comments":[{"body":"Libraries are not the bastions of silence they used to be. Lots of activities. I imagine the drum kit is available for check-out, but they could conceivably have a practice space with enough soundproofing to make band practices possible. \"Bring your guitars and keybords, the drum kit is here!\"\n\nI've seen libraries that have novelty-shaped cake pans available for check-out.","score":12,"comments":[{"body":"We have access to recording studios, 3d printers, rent out meeting rooms, study rooms.  Movies, CD's lots of stuff.","score":2,"comments":[]},{"body":"Whats with all the public space flat screen TVs in some libraries with advertisements?","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Who wants to start a library band? 🤘","score":4,"comments":[{"body":"Can we call it Shoosh!?","score":7,"comments":[{"body":"Um... Yes!","score":2,"comments":[]}]}]},{"body":"I feel the the loop pedal is the most interesting thing on that list followed verrrrrrry closely by the drum kit","score":2,"comments":[]},{"body":"Jesus, my library is just where the homeless people hangout","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This big crouton","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"Technically now a bread stick","score":3,"comments":[]},{"body":"Want... give!","score":1,"comments":[]},{"body":"I saw some pieces like this in bread cubes for stuffing, too","score":1,"comments":[]},{"body":"Huh… that is a big crouton","score":1,"comments":[]},{"body":"When the knife you were using gets embedded in the Caeser salad","score":0,"comments":[]}]},{"title":"This bottle of Japanese soy sauce has a liner inside the plastic bottle","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"Wouldn't that make it so that the chemicals from the bottle don't leach into the soy sauce?","score":5,"comments":[{"body":"I would think it would help prevent oxidation as well since the bag shrinks as you use it, unlike a bottle.","score":6,"comments":[]}]},{"body":"That should go to r/mildlyinfuriating","score":8,"comments":[]},{"body":"Ah yes, let's double the amount of pollution","score":7,"comments":[]},{"body":"Thats some bullshit right there","score":5,"comments":[]},{"body":"Shrinkflation, same bottle less sauce.","score":4,"comments":[]},{"body":"Gotcha","score":1,"comments":[]}]},{"title":"This is what sinuses look like.","not_safe_for_work":false,"locked":false,"body":"","score":10941,"comments":[{"body":"Imagine being able to shove a chimney sweeper like tool in there and cleaning every nook and crany out without getting anything damaged.\n\n\nThe bliss. The freedom...","score":794,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I wish mine were that clear.","score":3928,"comments":[{"body":"I currently have a sinus infection, so I feel your pain. Literally.","score":934,"comments":[{"body":"I had my first one ever earlier this year. In a matter of months it turned into me needing my tonsils and adenoids out at the age of 30. I’m currently heading into day 10 of recovery but they say days 7-10 are the worst for adults.","score":252,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"So *these* are the assholes causing all the trouble...","score":1623,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"So all that can fill with snot….","score":781,"comments":[{"body":"….and here on the skull are the four upper snot reservoirs. Just when the subject thinks they have expelled every last drop of mucus, the upper reservoirs open, releasing a torrential downpour into the nasal cavity…","score":699,"comments":[{"body":"","score":0,"comments":[]}]},{"body":":slaps forehead:  these babies can hold so much mucus","score":144,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Why do we have sinuses?","score":240,"comments":[{"body":"The nasal cavity functions to humidify, warm, filter, and act as a conduit for inspired air, as well as protect the respiratory tract through the use of the mucociliary system. The nasal cavity also houses the receptors responsible for olfaction","score":282,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Palau’s visa stamp is a pledge for visitors","not_safe_for_work":false,"locked":false,"body":"","score":74,"comments":[{"body":"The visa pledge for Palau reads:\n\nChildren of Palau,\nI take this pledge,\nas your guest,\nto preserve and protect \nyour beautiful and unique \nisland home. \n\nI vow to tread lightly,\nact kindly and \nexplore mindfully.\n\nI shall not take\nwhat is not given.\n\nI shall not harm \nwhat does not harm me.\n\nThe only footprints \nI shall leave are those \nthat will wash away.","score":12,"comments":[]},{"body":"That should be every country's visa stamp.\n\nJust don't go to foreign countries and commit crimes and then complain locals are all racist and snitches when you get arrested!!","score":4,"comments":[]},{"body":"From which country is that passport? It's really pretty!","score":1,"comments":[{"body":"It’s a USA passport!","score":2,"comments":[]}]},{"body":"I don't remember if it was \"The Sex Lives of Cannibals\" or \"Getting Stoned with the  Savages\" but since reading them, visiting that whole part of the world has been a bucket list item.","score":-3,"comments":[]}]},{"title":"[OC] The mandarin I peeled, had a smaller one inside. Even had its own ‘sections’! Hot wheel for scale.","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"I thought is was supposed to be banana for scale, no?  :)","score":1,"comments":[{"body":"You’re right, but sadly my daughter ate the last one we had! So went for the next general best thing lol","score":2,"comments":[]}]},{"body":"I love the Hot Wheel for scale lol","score":1,"comments":[{"body":"Lol thank you!","score":1,"comments":[]}]}]},{"title":"My Chipotle receipt in Texas has a promotion to sign up for Starbucks rewards in Canada","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"How does something like this happen?","score":2,"comments":[]},{"body":"Collab of dreams ![gif](emote|free_emotes_pack|facepalm)","score":1,"comments":[]}]},{"title":"Today I found a hat with an AM/FM radio in it inside an antique store","not_safe_for_work":false,"locked":false,"body":"","score":40699,"comments":[{"body":"Ah yes Hat.fm","score":906,"comments":[{"body":"We're both in our 30s","score":150,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Perfect for cheating on the boating test","score":678,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nice find! I had one or those in the early '90s, mine was a Raiders hat.","score":1103,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Radiohead","score":2612,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Looks like the H from the [Harrods logo](https://www.google.com/search?q=harrods+logo&amp;rlz=1CDGOYI_enUS802US802&amp;oq=harrods+logo&amp;aqs=chrome..69i57j0i512l5.6240j1j4&amp;hl=en-US&amp;sourceid=chrome-mobile&amp;ie=UTF-8)","score":156,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I remember my grandma buying my brother one of these in the 90’s. She said it was because he liked music and he liked wearing hats. It was very sweet and also, at that time, deeply uncool. Somewhere my mom has a picture of him goofing around wearing that and a lame sweatshirt he got that year","score":126,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oh man that’s sick! how much did you pay for it?","score":739,"comments":[{"body":"A whopping $5 😬","score":775,"comments":[{"body":"How much do you want for it? 🌚","score":303,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This plate broke a piece out of the center yet remained “in one piece”.","not_safe_for_work":false,"locked":false,"body":"","score":47,"comments":[{"body":"THE ONE PIEEEEEEECE","score":7,"comments":[]},{"body":"*the one piece is real*","score":6,"comments":[{"body":"*can we get much higher*","score":2,"comments":[]}]},{"body":"Two pieces…","score":5,"comments":[{"body":"Hence the quotation marks, it’s not truly in one piece but it is still round like a plate should be.","score":-1,"comments":[]}]},{"body":"diet plate, limits calories","score":2,"comments":[]},{"body":"How tf do you even do that?","score":1,"comments":[]},{"body":"Now you need some googly eyes.","score":1,"comments":[]},{"body":"*metaphorically*","score":1,"comments":[]},{"body":"Very inspiring 🥲","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I burned my foot as a child, but the marking only shows up when my feet are cold","not_safe_for_work":false,"locked":false,"body":"","score":311,"comments":[{"body":"I had this with my hands after I had 3rd degree burns. But mine would go purple or blue for the first few years. So strange.","score":10,"comments":[]},{"body":"There's a joke about getting cold feet here someone but... I just don't have the energy to find it.","score":9,"comments":[]},{"body":"Anyone else see the outline of Michigan in one of the burn marks?","score":5,"comments":[]},{"body":"Solid /r/ankleporn here","score":6,"comments":[]},{"body":"It looks like Raynaud's Syndrome.. I have the same sort of thing after frostbite spots.","score":2,"comments":[]},{"body":"Bro's got a built-in thermometer","score":2,"comments":[]},{"body":"The scar, which at first was as clear as red flame, has all but disappeared - a secret now that only cold can tell.","score":1,"comments":[]},{"body":"[deleted]","score":-2,"comments":[{"body":"I too wear slides on my hands from time to time.","score":10,"comments":[]}]},{"body":"Majority of my scars go whiter in cold weather. Not as pronounced as this but the ones on my face from a car wreck are very noticeable. Otherwise you would\nNot really notice them.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Pine tree in my backyard has blue sap.","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"So weird. Cause?","score":2,"comments":[{"body":"Yes I'm curious about this myself","score":1,"comments":[]}]},{"body":"Nah that’s alien blood","score":2,"comments":[]},{"body":"Some trees absorb nickel and zinc (normally toxic to plant life) as a defence against insects.\n\nThis is still considered conjecture as scientists aren't uniformly agreed on the reasoning for the toxic metal uptake.","score":2,"comments":[]},{"body":"Oh, so that is what blueblood means!","score":1,"comments":[]},{"body":"Have you been perhaps watering the tree with lean?","score":1,"comments":[]},{"body":"You sure that’s not bird poop?","score":1,"comments":[]},{"body":"I think the only way you can explain that is that you have one of those lizard people living underneath it in the hollow Earth.","score":1,"comments":[]}]},{"title":"This kitchen roll is missing the cardboard in the middle","not_safe_for_work":false,"locked":false,"body":"","score":166,"comments":[{"body":"So they can do that? So I'm paying for the air in the middle of the tube???","score":36,"comments":[{"body":"Right?! I'd rather pay the same money and get more paper towel in that space. Much less wasteful too!","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Maybe, maybe not. Shop by unit price in any case; doubt they’re just giving away the extra bit in the middle.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"do we need the cardboard???? why don't they make a separate line of towels without it? not everybody fits these rolls in dispensers","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Kitchen roll?","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"a win is a win.","score":3,"comments":[]},{"body":"Oops!  All towels!","score":3,"comments":[]},{"body":"Good. I never use it it’s just a waste","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Finally the softer rolls that have been promised","score":2,"comments":[]},{"body":"More paper for you","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"This Wendy’s sign just says “nope”.","not_safe_for_work":false,"locked":false,"body":"","score":389,"comments":[{"body":"I believe it said OPEN and someone reach up and switched the N","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"can I get uhhhh....","score":22,"comments":[{"body":"This phrase never fails to be funny to me","score":3,"comments":[{"body":"funny, I'll bet 80% of Americans use this when ordering at *any* restaurant, coffee shop, etc\n\nNothing wrong with it I guess... if so many use it.  \n\nBut to really think about the phrase, from the perspective of a non American English speaker, it is sort of silly sounding.","score":6,"comments":[{"body":"With COVID, my workplace holds plenty of ZOOM meetings with a screenful of many, many participants.  These meetings get very boring, very quickly.  To keep awake, I tally up the count of how many 'umms' and 'ahhs' there are.  The workplace is very culturally diverse, very interesting to here the different language accents of the 'umms' and 'ahhs'.  There are times where I cannot stop laughing when its every other word.  Next meeting I will time how long they are...'ummmmmmmmmmmmmm' or ahhhhhhhhhhhhhhhhh'.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"body":"Vancouverites being Vancouverites.","score":8,"comments":[]},{"body":"that's not all it says,\n\nit says \"Wendy's Quality is our recipe.....Nope\"","score":6,"comments":[]},{"body":"hello vancouver","score":2,"comments":[]},{"body":"Hello, Cambie and Broadway.","score":2,"comments":[]},{"body":"Same.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"My work had Gatorade in a can this morning.","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"What about Prince Albert?  Are they both in there?","score":2,"comments":[]}]},{"title":"This special design on a New Zealand police vehicle","not_safe_for_work":false,"locked":false,"body":"","score":20,"comments":[{"body":"Why is everything so much better in NZ?","score":3,"comments":[]},{"body":"Well t's unique.","score":2,"comments":[]},{"body":"Neat!","score":2,"comments":[]},{"body":"Imho it will look more interesting in Maori tribal tatoo style","score":1,"comments":[]},{"body":"Looks like grandma's quiltwork.  :)","score":1,"comments":[]},{"body":"Great. Every time one goes by ill have an epileptic seizure.","score":1,"comments":[]}]},{"title":"This whiteboard in the men's restroom","not_safe_for_work":false,"locked":false,"body":"","score":51,"comments":[{"body":"For feces art","score":10,"comments":[{"body":"They’re kind of asking for it ngl","score":3,"comments":[]}]},{"body":"For piss tac toe","score":5,"comments":[{"body":"The game where nobody wins","score":2,"comments":[]}]},{"body":"If you get a eureka moment while taking a shit, but I see no writing instruments","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It’s to challenge patrons to do trick shots off the whiteboard and into the urinal 😎","score":2,"comments":[]},{"body":"It's for when we need to calculate the angles based on pressure and drink preference.","score":2,"comments":[]},{"body":"GF told me there was a couch in ladies room, sadly no picture.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"its To jot down the brilliant thoughts that come to someone while they’re otherwise occupied.","score":1,"comments":[]},{"body":"not a whiteboard.  this is a reflector to get better cock shots","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Captured a bunch of lightning with my film camera","not_safe_for_work":false,"locked":false,"body":"","score":63,"comments":[{"body":"Nice there is a bit of a face to it…\nKinda like it is looking up towards the right corner :)","score":2,"comments":[{"body":"It's gohan","score":1,"comments":[]}]},{"body":"look out for a tall blonde guy with a hammer","score":1,"comments":[]},{"body":"Epic","score":1,"comments":[]}]},{"title":"A basket I made","not_safe_for_work":false,"locked":false,"body":"","score":310,"comments":[{"body":"Putting the underwater basket weaving degree to good use i see","score":21,"comments":[{"body":"I have never understood why that term meant easy classes. Underwater basket weaving always sounded incredibly difficult to me.","score":8,"comments":[{"body":"Not easy - useless!","score":9,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Nicely done!","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Wow! How long does something like this take? Do you have to soak the strands?","score":3,"comments":[{"body":"I actually made this in a weaving class a week ago. It took about two hours, and I did have to soak all the strands.","score":4,"comments":[{"body":"Did you just learn how? That looks very detailed. Nice work","score":3,"comments":[{"body":"Yeah, my tutors were very good, they have made over three thousand baskets","score":3,"comments":[{"body":"If I did that many I'd be a ^(basket case)","score":4,"comments":[]}]}]}]}]},{"body":"It’s full of my hopes and dreams 😃","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"My kid's potato head looks like Steve Harvey","not_safe_for_work":false,"locked":false,"body":"","score":140,"comments":[{"body":"I think it's more accurate to say Steve Harvey looks like a Mr. Potato Head","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Steve Harvey looks like a potato head","score":5,"comments":[{"body":"I've never noticed until this particular mouth was with the stache.","score":3,"comments":[]}]},{"body":"They all do","score":6,"comments":[]},{"body":"Steve Highinstarchtower","score":3,"comments":[]},{"body":"treacherous ! LMAO","score":4,"comments":[]},{"body":"Don’t all Mr Potato heads look like Steve?","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I now can't unsee it. ![gif](emote|free_emotes_pack|grimacing)","score":3,"comments":[]},{"body":"…waiting for someone to claim that you’re being racist","score":3,"comments":[{"body":"Am I?","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Woke up today to my water that froze with a straw in it. It formed this crazy sphere!","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[]},{"title":"First time seeing a digital plate in CA","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"$20 a month","score":1,"comments":[]},{"body":"That's an expensive car though. I like sports SUV's.","score":1,"comments":[]}]},{"title":"My 2 year old has more hair on his legs than some adults","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"and way cooler shoes!","score":3,"comments":[{"body":"Only pair of shoes he will keep on those stinky feet lol","score":1,"comments":[]}]},{"body":"I'm counted among the \"some adults\" you mention. God gave me many wonderful gifts and traits... Body hair is not counted among them.","score":1,"comments":[{"body":"Having massively hairy body parts is not a trait I list on the things I’m thrilled about.","score":2,"comments":[]}]},{"body":"I have so much hair I could get away with using shampoo to wash my entire body. And I started out like your two year old. He is going to clog so many drains in the future, and if he desires to grow the hair on his head out it's going to only get worse, but he will never be cold!","score":1,"comments":[]}]},{"title":"Saw a random wild rabbit in downtown Los Angeles","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"Judy Hopps is on the case!","score":2,"comments":[]},{"body":"But did you follow it?","score":1,"comments":[]}]},{"title":"The town I live in just put up a 50ft Leg Lamp, permanently.","not_safe_for_work":false,"locked":false,"body":"","score":67777,"comments":[{"body":"The soft glow of electric sex","score":832,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You were always jealous of this lamp!","score":3576,"comments":[{"body":"You used up all the glue on PURPOSE!","score":127,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That is the ugliest lamp I have ever seen in my entire life!\n\nEdit: I can’t believe how many people don’t recognize what this lamp is from and why I said what I said.","score":6484,"comments":[{"body":"Youve always hated that lamp.","score":2697,"comments":[{"body":"You used up all the glue. On **purpose**!","score":1694,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"![gif](giphy|3ohs7Mx78Zt2x2xgbu)","score":430,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"What town ?","score":1520,"comments":[{"body":"Chickasha Oklahoma","score":2747,"comments":[{"body":"Please tell me it lights up.","score":559,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The way this penny stood up after I dropped it","not_safe_for_work":false,"locked":false,"body":"","score":37,"comments":[{"body":"A similar occurrence was the basis for an episode of The Twilight Zone -\n\n\"A Penny for Your Thoughts (1961)\"","score":6,"comments":[{"body":"OP is going to be hearing peoples' thoughts","score":3,"comments":[]},{"body":"That was a fun episode.","score":1,"comments":[]}]},{"body":"I like to go through all the drawers at my job and switch out any cool coins I find. Found a penny from 1910 that way.","score":1,"comments":[]},{"body":"A glitch - don't look it up /s","score":1,"comments":[]},{"body":"And did time stop?","score":1,"comments":[]},{"body":"/r/untrustworthypoptarts","score":1,"comments":[]}]},{"title":"Cool pattern on the hood as the snow melts","not_safe_for_work":false,"locked":false,"body":"","score":50,"comments":[{"body":"Autobot or Decepticon?","score":3,"comments":[]},{"body":"Robots in disguise..","score":4,"comments":[]},{"body":"i was thinking, crop circles 🛸","score":1,"comments":[]},{"body":"Kind of looks like a storm trooper helmet.","score":1,"comments":[]},{"body":"That's the skeleton of the hood for rigidity with the sound dampening material under it.","score":-1,"comments":[{"body":"Sound deadening is insulating in this case. That’s why the outline of the skeleton is melting.","score":2,"comments":[]}]}]},{"title":"this tiny tube of Colgate nickel for reference","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Could really do with a banana for scale…🍌","score":1,"comments":[]},{"body":"TSA approved.","score":1,"comments":[{"body":"Tsa would still stop me for sure","score":1,"comments":[]}]},{"body":"My dad used to get these in the goody bags that Cathay Pacific and Virgin Airlines handed out to passengers.","score":1,"comments":[]}]},{"title":"Scrambled egg looks like a little chicken","not_safe_for_work":false,"locked":false,"body":"","score":127,"comments":[{"body":"We are really pushing the limits of mildness with this one. I respect your boldness.","score":5,"comments":[]},{"body":"It IS a little chicken tbh","score":2,"comments":[{"body":"Stop this vegan propaganda.","score":4,"comments":[{"body":"I'm not vegan, I'm realist.","score":0,"comments":[]}]},{"body":"It's a chicken's period.","score":0,"comments":[]}]},{"body":"Or vomit. Enjoy your meal","score":1,"comments":[]}]},{"title":"I've been collecting VooDew's since 2019, and this years bottle is orange.","not_safe_for_work":false,"locked":false,"body":"","score":28,"comments":[{"body":"One more and his collection will be complete - he must be stopped.","score":6,"comments":[]},{"body":"One man’s trash is another man’s treasure","score":3,"comments":[]},{"body":"Ahhhh yes soooooo interesting","score":1,"comments":[{"body":"It only needs to be mildly interesting.","score":1,"comments":[]}]},{"body":"I feel like last year's flavor was more like cherry Airheads, but this year's more like orange Sweet Tarts. Sadly I don't think I tried 2019 or 2020.","score":1,"comments":[{"body":"I felt like it always tasted like skittles, this year it was way more citrus-y","score":3,"comments":[]},{"body":"I freaking love the tart tangerine this year, what were the other years that you remember?","score":1,"comments":[]}]},{"body":"Do you store urine in these?","score":1,"comments":[{"body":"Only when spying on the house across the street","score":3,"comments":[]},{"body":"If my urine is really clear, sure.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Future hurricanes are already named through 2026","not_safe_for_work":false,"locked":false,"body":"","score":61,"comments":[{"body":"Someone replied: wow still so many to go this year. \nQuestion: what letter do we usually go up to normally?","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Damn it, I don’t get one but the nickname I gave my grandma when I was a toddler does???!!!","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I was a hurricane name this year and didn’t even know","score":3,"comments":[]},{"body":"Imagine losing your house or worse in hurricane Karen","score":9,"comments":[{"body":"2025 is going to want to speak to the manager","score":5,"comments":[]}]},{"body":"I can imagine the 4th hurricane of 2025 will kill hundreds of people with no one realising it was the hurricane","score":1,"comments":[{"body":"I was gonna say Dexter gonna kill a bunch of Floridians.","score":2,"comments":[]}]},{"body":"Still no Scotty...","score":1,"comments":[{"body":"It’s okay. He doesn’t know.","score":5,"comments":[]}]},{"body":"I swear if Big Bertha isn't a category 5 in 2026 we are going to have some problems","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"This student desk inside the staff bathroom facing the toilet.","not_safe_for_work":false,"locked":false,"body":"","score":25,"comments":[{"body":"contract probably specified that they wanted a table n chair inside toilet ,\n\nand contractor put it here..","score":5,"comments":[]},{"body":"For a double detention. One kid takes the toilet, the other takes the chair.","score":2,"comments":[]},{"body":"hate to say this, probably US Army, when they drug test, they have to watch urine leave the body and enter cup. dont ask how i know, supervised many operation goldenflow","score":2,"comments":[{"body":"Nope, this is at an Illinois middle school I was visiting.","score":1,"comments":[]}]},{"body":"Do you see this!? This is how you wipe your ass, take notes","score":1,"comments":[{"body":"💀","score":1,"comments":[]}]},{"body":"thats a great spot!!  how else do you study to be a urologist?   hang it here homey!!","score":1,"comments":[]},{"body":"what kind of weird fetish is that","score":1,"comments":[]},{"body":"y is there a desk in the bathroom ?","score":1,"comments":[]},{"body":"Shitty thing to do to a kid.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"This spill in the parking lot looks almost exactly like Vietnam","not_safe_for_work":false,"locked":false,"body":"","score":25,"comments":[{"body":"Don’t park any American cars there.","score":3,"comments":[]}]},{"title":"The lettering on this bottle of sunscreen has dissolved from its backing, meaning we often end up with a few random white letters on our skin after applying it","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"suntan wordle","score":4,"comments":[]},{"body":"I’ve had that happen with products a few times lol, I like to spell things on my hand with the tiny letters ☺️","score":2,"comments":[]},{"body":"I'm having fun pointing out all the random letters to myself, lmao. XD","score":2,"comments":[]},{"body":"It’d make a nice book cover for some kind of experimental novel","score":2,"comments":[]},{"body":"At least we know the biodegradable claim is correct","score":2,"comments":[]},{"body":"Huh. Now the suggestions to use sunscreen to clean stains off of plastic suddenly seem reasonable. I wonder what’s in the sunscreen that does this!","score":2,"comments":[]},{"body":"Here’s the [front view](https://i.imgur.com/52gCP9P.jpg)","score":1,"comments":[]},{"body":"Nano technology, micro beads?","score":1,"comments":[{"body":"…and microprint!","score":1,"comments":[]}]},{"body":"How have you had one bottle of sun cream so long","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"My cat’s leftovers look like a duck","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[]},{"title":"These 3 bags of the same product in the UK","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[]},{"title":"The way the water has frozen on the shore of this lake from the waves.","not_safe_for_work":false,"locked":false,"body":"","score":34,"comments":[{"body":"[deleted]","score":1,"comments":[{"body":"Abraham Lake","score":1,"comments":[]}]},{"body":"Very cool","score":1,"comments":[]}]},{"title":"If you could smell the Earth, what would it smell like?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"Saltwater.","score":7,"comments":[]},{"body":"Disappointment","score":3,"comments":[]},{"body":"/r/lostredditors","score":2,"comments":[]},{"body":"earthy","score":2,"comments":[]},{"body":"kush","score":2,"comments":[]},{"body":"Fossil Fuels &amp; Despair","score":1,"comments":[]},{"body":"I imagine the smell of the woods after it’s been raining.","score":1,"comments":[]},{"body":"Livestock farts","score":1,"comments":[]},{"body":"Cigs","score":1,"comments":[]},{"body":"piss","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Motorcycle alloy wheel reflected by streetlight","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[]},{"title":"persistence plot made of rust at my gym","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[{"body":"I don't get it, why's it so worn on the side?","score":3,"comments":[{"body":"When people remove or place the pin they'll rub the weights, ever so slightly. Multiply this by whoever uses the equipment over a prolonged period of time and the weight plate cover material will wear away and the sweat will react with the metal and cause it to rust. The more rust, the more rubbing over time applied to the plate","score":2,"comments":[]}]},{"body":"looks like a lot of people do 150 but not 160","score":2,"comments":[]},{"body":"someones not wiping down the weights","score":2,"comments":[]},{"body":"Record this moment. The first time someone used persistence plot and gym in the same sentence.","score":1,"comments":[]}]},{"title":"Toys R us inside of me local Macy’s","not_safe_for_work":false,"locked":false,"body":"","score":72,"comments":[{"body":"I can't unsee the raygun in the foreground of the picture","score":8,"comments":[{"body":"Aimed directly at Geoffrey!","score":2,"comments":[{"body":"You aim is as good as a stormtrooper for sure!","score":2,"comments":[]}]}]},{"body":"Geoffrey looking like a creepy uncle","score":3,"comments":[]},{"body":"Yar.","score":3,"comments":[]},{"body":"This makes me sad. I love Toys R Us so much when I was a kid","score":2,"comments":[]},{"body":"It looks the same as the sad toy section buried at the back of every Kohl's in an abandoned strip mall.","score":2,"comments":[]},{"body":"Talk about down sized.","score":1,"comments":[]},{"body":"Nothing prices on them.","score":1,"comments":[]},{"body":"Like they have been saying for the last 2 years?","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"This honey I bought has a dead bee in it.","not_safe_for_work":false,"locked":false,"body":"","score":11390,"comments":[{"body":"Well you definitey got real honey","score":2865,"comments":[{"body":"That’s what they want you to think","score":933,"comments":[{"body":"+1 the bee's definitely a paid actor","score":523,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It’s alright bees have already walked all over your honey because they’re the ones who made it","score":1588,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Pure honeycomb and unfiltered honey will almost certainly have wings, legs, and other “parts” mixed in with it.  At least you know it’s pure albeit the company/beekeeper who sold you this could have a little better process of prep before sale..","score":3343,"comments":[{"body":"I’m a beekeeper and I considered calling my honey “Bees Knees Honey” for exactly this reason…. Truth in advertising.","score":37,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"If you didn't pay for that, surely that makes it a freebee...(I'll see myself out)","score":967,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Protein","score":407,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It bee like that some times","score":166,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Reanimate it, clone it, program it…no more store bought honey","score":134,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"the seeds in my apple that have sprouted","not_safe_for_work":false,"locked":false,"body":"","score":25,"comments":[{"body":"plant it","score":3,"comments":[]},{"body":"Your post (probably) hasn't broken any rules, but we see these kinds of things a lot. Look at our [most overdone items here](/r/mildlyinteresting/search/?q=flair%3Aoverdone&amp;restrict_sr=1&amp;sort=new)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mildlyinteresting) if you have any questions or concerns.*","score":2,"comments":[]},{"body":"An apple tree is going to burst out of your stomach","score":2,"comments":[]},{"body":"That's disgusting ngl","score":2,"comments":[{"body":"Literally an apple lol","score":3,"comments":[{"body":"Literally looks like worms tho","score":1,"comments":[]}]}]},{"body":"Been sitting around way too long in a warehouse somewhere","score":1,"comments":[]},{"body":"Plant them! Cute lil baby trees (:","score":1,"comments":[]},{"body":"Johnny Appleseed was a tricky one","score":1,"comments":[]}]},{"title":"This decorative door hinge at an Airbnb I stayed in…","not_safe_for_work":false,"locked":false,"body":"","score":194,"comments":[{"body":"Nothing shows how extra past generations were quite like ornate door hinges you basically never see/pay attention to.","score":17,"comments":[{"body":"I really wish that we still had an attention to detail like this, the craftsmanship was so impressive","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Many years ago I worked at an old school factory in downtown Manhattan that made stuff like this.  It was absolutely crazy inside. It still pretty much looked like it did during the Civil War.  All of the machines were driven off a huge leather belt that circulated overhead. \n\nI just checked and was [pleased to see they still operate](https://peguerin.com/165years.php).  They don't bother publishing the prices because you pretty much have to live on Park Ave to afford a door knob from there.","score":3,"comments":[]},{"body":"And how much disrespect present generations have for it by using the wrong screws.","score":10,"comments":[{"body":"I’m rather torn on that. I hate flathead screws with the white hot passion of a thousand burning suns, but with antiques, Philips heads just look horrible.","score":5,"comments":[{"body":"Doesn't matter, they used a mix so they're guaranteed to be wrong.","score":5,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"That’s part of what made me love it! I was in a small town in Kansas mostly built in the 1870s-1890s. The attention to detail on the buildings is so beautiful","score":2,"comments":[]}]},{"body":"“The Hinge…you used it. We came…to repaint the spare room.  We have such paint swatches to show you”","score":3,"comments":[]},{"body":"they charge for that","score":2,"comments":[]},{"body":"I think you can get hinges like these from Lee Valley.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"This old box of staples i found at work","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"Time to build some wall frames.  Maybe some joists.  No worries.  Hey, what's that sound?\n\n_creeeeek..._","score":1,"comments":[]},{"body":"Handy for crucifixions as well perhaps","score":1,"comments":[]},{"body":"They are still common. We have a T-50 stapler in our office and Bunnings [AU] still sells the staples.","score":1,"comments":[{"body":"So the design isnt old?","score":1,"comments":[]}]}]},{"title":"My WFH keyboard I got at the start of the pandemic showing which keys have worn down the most in just 2.5 years","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"how hard ya typing o.O","score":4,"comments":[]},{"body":"You don't use the word \"bitch\" very often","score":2,"comments":[]},{"body":"That’s a lot of WASD for WFH. Care to explain?","score":2,"comments":[]},{"body":"My WFH keyboard is in need of a good cleaning, but is otherwise showing no signs if wear. I use a Corsair K70 Lux with brown switches. It's a heck of a work horse.\n\nEdit: I've actually used the same keyboard at the office for 2-3 years before covid too.","score":1,"comments":[]},{"body":"like the inside of the mummy’s sarcophagus.","score":1,"comments":[]},{"body":"Now we know your search history...","score":1,"comments":[]},{"body":"My coworker has a keyboard like that - devoted hand-sanitizer user which dissolves the letters.","score":1,"comments":[]}]},{"title":"I just got some Nasa shoes","not_safe_for_work":false,"locked":false,"body":"","score":175,"comments":[{"body":"🤔 one could argue that they are... out of this world. 🤭","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Would you mind saying where you bought these? My friend is a space geek and he would love these for Christmas. 🙏","score":3,"comments":[{"body":"Urbanplanet/Stitches/Blue Notes also has NASA gear in currently :)","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"These shoes were faked. \n\n/s","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Found it!  Thanks","score":2,"comments":[]},{"body":"Look cool pal","score":2,"comments":[]},{"body":"Perfect for moon-walking.","score":2,"comments":[]},{"body":"h&amp;m?","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"national aeronautics and drip administration","score":2,"comments":[]},{"body":"Just so no one gets duped: these are not produced by or in collaboration with NASA. Anyone can use the NASA logo for merchandise per their policy.\n\nSame goes for those NASA bombers from fast fashion stores and online retailers touting to be \"The Official NASA Store\".","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Walked by a street sign that had changed its name.","not_safe_for_work":false,"locked":false,"body":"","score":229,"comments":[{"body":"Omg so happy for them! I hope Mr and Mrs St have a long, happy marriage","score":37,"comments":[]},{"body":"I live down a road where the street sign is actually wrong.  Without using the real name, it's something like\n\n\"Joseph's Creek Dr.\" And packages addressed to me will have that on it.  But the sign says\n\n\"Joseph Creek Rd.\" \n\nStrange.  I've talked to people at the post office, and in their system it is literally the first one I mentioned, but here on the ground, in the real world, it's not the same thing lol.  I live in the middle of nowhere though, and it's not exactly a concern for anyone.  Not exactly like you can get most types of deliveries here.","score":14,"comments":[{"body":"Road signs which should and formerly did have an apostrophe have been replaced by ones without to avoid confusing car drivers.\n\n[Manual on Uniform Traffic Control Devices for Streets and Highways](https://mutcd.fhwa.dot.gov)","score":4,"comments":[{"body":"Huh, I didn't know that, interesting.  Thanks.","score":3,"comments":[]}]},{"body":"When I moved into my new house, it was a new build in a part of town that only started seeing development in recent years.\n\nAs a result, everyone from the Post Office to Google thinks my zip code  ends in 5. Even the city originally listed it as a zip code ending in 5. But if you look at the zip code map, and ask the city today, it's actually that same zip code, but ending in 6. But Google et al. never caught on, so whenever I'm on a website filling out my address it tries to autofill to ending in 5.","score":3,"comments":[]}]},{"body":"The Street Formerly Known As Lapland Road","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Hardly seems worth it!","score":7,"comments":[]},{"body":"I live in an old town and it has lots of street signs that say things like \"until 1640 this road was known as slaughterhouse row\" and I think it's super considerate in case a confused time traveler comes by.","score":6,"comments":[]},{"body":"Remember to vote in local elections! Proof that you too can affect real change!","score":3,"comments":[]},{"body":"Apparently terms like street, road, lane, boulevard, etc. are delegated based on the physical characteristics of whatever is being named. I had always assumed it was just random. What I think happened here is they named it incorrectly the first time or had it widened or something else about it changed...","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"reverse scissors","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"Srossics","score":7,"comments":[{"body":"Scissands","score":4,"comments":[]}]},{"body":"You mean broken scissors","score":3,"comments":[{"body":"no","score":0,"comments":[]}]},{"body":"They’re meant to be used to uncut things.","score":2,"comments":[]},{"body":"How is this even mildly interesting?\n\nWho didn't flip the scissors around in their childhood?","score":1,"comments":[]},{"body":"##","score":0,"comments":[]}]},{"title":"The expiration date on this mayo says mayo","not_safe_for_work":false,"locked":false,"body":"","score":78,"comments":[{"body":"Mayo actually how egyptian says month of may","score":3,"comments":[]},{"body":"May 2nd 2023? Does mayonnaise really stay unspoiled that long?","score":3,"comments":[{"body":"when unopened, yes.","score":3,"comments":[]},{"body":"Mayonnaise is mostly oil. Bacteria can't grow in oil (or only extremely slowly, over many years or decades). You don't even actually have to refrigerate mayonnaise either.","score":2,"comments":[]},{"body":"damn expires on my 23rd birthday.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Mayo = May in Spanish","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Sounds legit.","score":1,"comments":[]},{"body":"lmfao","score":1,"comments":[]},{"body":"Inceptionaise","score":1,"comments":[]}]},{"title":"My Ritz crackers have peanut butter when they shouldnt","not_safe_for_work":false,"locked":false,"body":"","score":45,"comments":[{"body":"Email the company, you’ll get lots of free crackers &amp; hopefully there will be a recall or at least an investigation into how the contamination occurred.","score":47,"comments":[{"body":"Is that a real thing I can do? Hmm, I'm gonna do that and update you on what occurs!","score":25,"comments":[{"body":"Yes, please do email the company, they will want to know about this for many reasons.","score":22,"comments":[]},{"body":"yes very much is, as contamination in this case being PB can kill someone \\*like me\\* even a little bit of contam can kill","score":22,"comments":[{"body":"Tbf there would be \"may contain traces of peanut\" or \"produced in a facility that also handles peanut\" near the ingredients. So from my understanding you wouldn't eat this anyway.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Not good if it actually is pb. Especially for someone with extreme allergies","score":19,"comments":[{"body":"Yeah parents get worried about Halloween candy, when it will be the Ritz that kills","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"\"Peanut Butter\"","score":9,"comments":[{"body":"That’s shit from a butt.","score":3,"comments":[]}]},{"body":"Mine had the same thing! It was from the single pack. I didn’t even think to take a pic. I just threw them away and ate the rest without the “peanut butter”","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Higher altitude hotel telling you to watch your alcohol consumption","not_safe_for_work":false,"locked":false,"body":"","score":1682,"comments":[{"body":"Is the alcohol thing just while you’re getting acclimated to the elevation? Or is that like an all the time thing?","score":102,"comments":[{"body":"Once you acclimate it's fine. It's best not to drink for at least 48 hours, and really seriously don't take opioids or benzos during that period because they depresses your respiratory response, and you're going to be heavily relying on breathing extra as you acclimate.","score":107,"comments":[{"body":"Altitude sickness is actually causes by hyperventilation.  Your brain, sensing the reduced oxygen, subtly increases your respiratory rate.  As you do this, your oxygen saturation remains more than adequate - however, you breathe out too much CO2.  This depletes your blood of carbonic acid; your blood becomes basic and your red blood cells cannot release oxygen effectively without an acidic environment.  This is an adaptation to supply oxygen to working tissue, which generates metabolic acids.  \n\nWhen you deplete yourself of acid, your kidneys attempt to pee out the excess base (sodium bicarbonate) left over from the deacidification of carbonic acid in your blood; but it takes days to adapt.  In that time, the high blood pH, not the low oxygen, is what makes you weak during altitude sickness.","score":66,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I flew from sea level to the Denver airport where I was picked up by a friend. Said we should have a couple beers at the airport bar. WASTED.","score":179,"comments":[{"body":"Yeah but it sucks when you have been training up here and go to sea level.","score":32,"comments":[{"body":"\"I've had like thirty beers dude, what's with the air down here?\"","score":23,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Am I the only one who noticed it says FAQ but there's not a single question?","score":17,"comments":[]},{"body":"I worked for a company that had an office in London and one in Denver. \n\nThe one time that the London sales team came out to Denver and drink like they did back home was fucking hilarious. \n\nWe tried to warn them many, many times. But they insisted they knew what they were doing.","score":118,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This is why I love going on vacation since I live at altitude. I feel like superman under the yellow sun when I’m at sea level haha.","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"So, moving there will save me a barrel of money?\n\nSounds like a deal to me.","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"A mini rubix cube keychain that actually rotates.","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"I have one too and be careful it can break very easily","score":4,"comments":[]},{"body":"As opposed to what?","score":3,"comments":[]},{"body":"Now I can have a keychain to remind me that I''m dumb LOL just kidding","score":1,"comments":[]},{"body":"Can you repost with a banana for scale?","score":1,"comments":[]},{"body":"For people asking for scale check my profile.","score":1,"comments":[]}]},{"title":"This Spicy Cheetos stand is a fire extinguisher.","not_safe_for_work":false,"locked":false,"body":"","score":47,"comments":[{"body":"It should really be a bottle of Pepto Bismol....","score":1,"comments":[]},{"body":"![gif](giphy|zqOV6JEAffwt2)","score":0,"comments":[]},{"body":"Bruh I need it","score":0,"comments":[]}]},{"title":"The cookie was upside-down and left a neat imprint in the cream","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[]},{"title":"My shoes look as if they are from different pairs","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"Thems some wide feet boi","score":2,"comments":[]},{"body":"I'm too old to step in this shit","score":1,"comments":[]}]},{"title":"My Bismuth slag looks like an opal","not_safe_for_work":false,"locked":false,"body":"","score":22,"comments":[]},{"title":"This shadow on the wall cast by the setting sun looks kinda like a painting.","not_safe_for_work":false,"locked":false,"body":"","score":166,"comments":[{"body":"Can legit fetch you a few hundred dollars, if you try.","score":3,"comments":[{"body":"It's gone now. It was there for maybe 10 minutes, was lucky to spot it at all.","score":1,"comments":[]}]},{"body":"Next time put painters tape around it and for those 10 min you get some smart wall art.","score":1,"comments":[]}]},{"title":"Decapitated bug on a spiders web in my apartment window.","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"🤘🤘","score":1,"comments":[]},{"body":"Think that spider’s sending you a message","score":1,"comments":[]}]},{"title":"My local Chinese restaurant cut into pillar so they could fit an extra table in the dining room","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"WHY WOULD THEY NOT CUT THE TABLE INSTEAD?","score":14,"comments":[{"body":"Who needs structural support anyway?  Lol","score":5,"comments":[]}]},{"body":"Saw this same pic yesterday","score":6,"comments":[{"body":"&gt; Saw this same pic yesterday  \n  \nSo, it's a re*post*?","score":5,"comments":[]},{"body":"Apparently a lot of Redditors eat at this restaurant.","score":2,"comments":[]}]},{"body":"No biggie…I had iron workers cut 5” x 20” notch out of a steel beam so we could fit in the  60” Dia duct to a spray dryer.","score":2,"comments":[{"body":"A spray dyer for what?","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"But who ever actually eats Chinese food anywhere except at home?","score":-5,"comments":[{"body":"Ever heard of All-You-Can-Eat Buffets?","score":7,"comments":[{"body":"Not since 2019","score":3,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"My jolly rancher bag came with an unrapped jolly rancher bundled in a bunch of wrapped jolly ranchers","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Hey, you know how it is.  Sometimes you gotta be there to cover your friend in a time of need.  Or in this case, when they're naked.  I have been a shield on many occasions.","score":1,"comments":[]}]},{"title":"This fake Lidl Supermarket in a popular British tourist destination in Türkiye","not_safe_for_work":false,"locked":false,"body":"","score":211,"comments":[{"body":"I.idi.","score":36,"comments":[{"body":"I.İdI. actually","score":18,"comments":[{"body":"Cleverly taking advantage of the Turkish alphabet. I love it","score":7,"comments":[]}]}]},{"body":"Pretty sure in 2010 I saw a fake Asda in Turkey too.","score":12,"comments":[]},{"body":"Wow, Fethiye. Literally was here few months ago","score":11,"comments":[{"body":"Somehow the climate was still perfect, sunny and warm, made me wish I brought my swimsuit.","score":3,"comments":[]}]},{"body":"The best one I saw was a Marks &amp; Spencer knock off called Marvin Spangler","score":4,"comments":[]},{"body":"[Whatever the feck it's called](https://youtu.be/Jxl8P1fNT9Y).","score":3,"comments":[]},{"body":"Bulgarian Black Sea cost has ALDO, for all these dyslexic ALDI enjoyers","score":3,"comments":[]},{"body":"GENUINE FAKE","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Trader Joe's being sold at Aldi in Madrid, Spain","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[{"body":"They're both owned by the same family.","score":12,"comments":[{"body":"If only you could get TJ favs in US Aldi","score":3,"comments":[]}]},{"body":"Fruity Snackballs is my drag name.","score":4,"comments":[]},{"body":"Chefs Chocolate Salty Balls are also good.","score":4,"comments":[{"body":"🤤","score":1,"comments":[]}]},{"body":"love the name, Fruity snackballs, to easy","score":1,"comments":[]},{"body":"Ya, Aldi owns tj","score":0,"comments":[{"body":"https://www.tastingtable.com/910536/the-connection-between-trader-joes-and-aldi/","score":1,"comments":[]}]},{"body":"TJ is in many countries around the world.","score":0,"comments":[{"body":"I don't think that's true. A quick internet search said otherwise....","score":1,"comments":[]}]}]},{"title":"Baguette Magique. Penis shaped loaves with googly eyes in Paris.","not_safe_for_work":true,"locked":false,"body":"","score":11,"comments":[{"body":"now go ahead dont be shy use it","score":3,"comments":[]},{"body":"that will keep the inlaws away for the holidays","score":3,"comments":[]},{"body":"I'm from Paris and I do not approve of this.","score":2,"comments":[{"body":"Brings in the wrong sort of tourists?","score":1,"comments":[{"body":"Nah, it's an insult to our beloved baguette! :D","score":1,"comments":[]}]}]},{"body":"Everyone loves a penis.","score":1,"comments":[]},{"body":"Oh la la. The French ladies will be buying up all loaves.","score":1,"comments":[]},{"body":"Nah, it’s an insult to our beloved baguette 8===D","score":0,"comments":[]}]},{"title":"There’s an ice cream cone on this building","not_safe_for_work":false,"locked":false,"body":"","score":82,"comments":[{"body":"Welcome to Cologne","score":8,"comments":[{"body":"Danke. Do you know why it’s there though?","score":5,"comments":[{"body":"Its from some Pop Up Artist, Cleas Oldenburg. I think its just called \"Dropped Cone\". Idk If there ist a real reason to it other then Art","score":8,"comments":[{"body":"Neat. I like a country that invests in art.","score":3,"comments":[{"body":"You should look up more of Oldenburg's work, he did a lot of huge scale regular objects, i think it's pretty fun and whimsical. :)","score":2,"comments":[]}]}]},{"body":"Probably the headquarters or main business office of an ice cream company.","score":0,"comments":[]}]}]},{"body":"What a cold observation","score":3,"comments":[]},{"body":"Looks like an exact copy of one I ate once - an ice cream clone, if you will.","score":1,"comments":[]},{"body":"This time of year it’s an erect Santa cap","score":1,"comments":[]},{"body":"Maybe there’s a building on this cone","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"My Boiled Egg has Extra Layers","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"If you shock them in cold water out of the hot water they become much easier to peel","score":1,"comments":[]},{"body":"Do NOT eat that.","score":1,"comments":[]},{"body":"why is it brown?","score":1,"comments":[]},{"body":"Eggception","score":1,"comments":[]}]},{"title":"The digs in the elbow pads at a local bar.","not_safe_for_work":false,"locked":false,"body":"","score":38,"comments":[{"body":"Birds are playing like shit","score":3,"comments":[{"body":"Right??!?","score":1,"comments":[]}]},{"body":"Good ole Deep Eddy","score":2,"comments":[{"body":"You know it is…\n\n![gif](giphy|3ov9jIDCgAcAbwFf5S)","score":2,"comments":[]}]},{"body":"I would have a beer there","score":2,"comments":[]},{"body":"Not enough windex in that bottle for me to want to lean on that bar. Wtf","score":1,"comments":[{"body":"Huh? It's more than half full","score":3,"comments":[]}]}]},{"title":"This sheet of paper with scrabble scores I used for weeks","not_safe_for_work":false,"locked":false,"body":"","score":35,"comments":[{"body":"This is some serial killer shit","score":5,"comments":[]},{"body":"Wow, it almost looks like the notes a person would use when translating the bible.","score":4,"comments":[]},{"body":"r/TIHI","score":1,"comments":[{"body":":(","score":1,"comments":[]}]},{"body":"How is this used?","score":1,"comments":[{"body":"So, in scrabble, you get a certain amount of points that vary with every turn depending on what word you made, so every game you keep track of everyone’s points each turn, I added them up as I went along on the paper","score":1,"comments":[{"body":"Ok thx","score":1,"comments":[]}]}]},{"body":"Impressive.","score":1,"comments":[]},{"body":"This is actually amazing. 🤘","score":1,"comments":[]},{"body":"It's disorienting to have a game score sheet where you add from left to right. I always add scores in columns, or top to bottom.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"There was a dead bee in my raspberry","not_safe_for_work":false,"locked":false,"body":"","score":32,"comments":[{"body":"Better then a waspberry","score":10,"comments":[]},{"body":"![gif](giphy|YlSat0ayBTMackvQbW)","score":6,"comments":[]},{"body":"They do that sometimes.","score":4,"comments":[]},{"body":"If you eat it your voice will get raspbee.....","score":2,"comments":[]},{"body":"It is not dead, this is an assassination attempt. lol","score":2,"comments":[]},{"body":"Yum","score":1,"comments":[]},{"body":"Free protein","score":1,"comments":[]},{"body":"GG, bee. 🖖","score":1,"comments":[]},{"body":"not so load, everyone will want one","score":1,"comments":[]},{"body":"\"help step bee i'm stuck\"","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"These microwave pizza instructions are pointlessly separate","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Not pointless,  accounting for stupid. \"Well my microwave isn't X watts what am I supposed to do?\" Although why it's only showing 800W and 900W that I'm not sure of","score":2,"comments":[]},{"body":"Idk about that, i do like good formatting instead of melting my eyes trying to read a wall of text.","score":2,"comments":[]},{"body":"And yet my sister didn't know how long to heat up a M&amp;S ready meal because our microwave was in between 2 power ratings...","score":1,"comments":[]}]},{"title":"Reading a book printed in 1972 and there's an ad for cigarettes in the middle of it.","not_safe_for_work":false,"locked":false,"body":"","score":58,"comments":[{"body":"ads in books? what dark dystopia do you live in?","score":6,"comments":[]},{"body":"Kent used to a popular brand.","score":2,"comments":[]},{"body":"On a side note - Wild book, so funny!","score":2,"comments":[{"body":"Yea it's good so far, I'm a big PKD fan. Got lucky and found this at a local use bookstore a few days ago. I've been working thru his bibliography this year, almost done!","score":1,"comments":[]}]},{"body":"Coffee and cigarettes together, eww","score":1,"comments":[]},{"body":"Staring Dennis Leary.","score":1,"comments":[]},{"body":"\"What a good time for all the good things of a Kent\".\n\nWhen you have fuck all to say about a product other than 'Fuck it' but you can't curse.","score":1,"comments":[]},{"body":"The middle of the book is the inside of the front cover?","score":-2,"comments":[{"body":"Look at the page number.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"the alarm clock at my hotel tells time on all sides so both beds and front can see","not_safe_for_work":false,"locked":false,"body":"","score":59,"comments":[{"body":"That’s actually really innovative. Wish more alarm clocks had this","score":4,"comments":[]},{"body":"What a great idea.  I love simple solutions.","score":3,"comments":[]}]}]}