{"name":"nostupidquestions","description":"Ask away!","subscribers":3125065,"posts":[{"title":"U.S. Election Megathread","not_safe_for_work":false,"locked":false,"body":"Tuesday, November 8 is Election Day for the United States. With control of the House and Senate up for grabs, it's likely to be a tumultuous few weeks. In times like this, we tend to get a lot of questions about American politics...but many of them are the same ones, like these:\n\n*What is this election about, anyway? The president's not on the ballot, right?*\n\n*How likely is it that Republicans will gain control of the House? What happens if they do?* \n\n*Why isn't every Senator up for re-election?  Why does Wyoming get as many senators as California?*\n\n*How can they call elections so quickly? Is that proof of electoral fraud?*\n\nAt NoStupidQuestions, we like to have megathreads for questions like these. People who are interested in politics can find them more easily, while people who aren't interested in politics don't have to be reminded of it every day they visit us. \n\nWrite your own questions about the election, the United States government and other political questions here as top-level responses. \n\nAs always, we expect you to follow our rules. Remember, while politics can be important, there are real  people here. Keep your comments civil and try to be kind and patient with each other.","score":76,"comments":[{"body":"why is this election not considered a red wave when republicans regained the house? in 2018 the dems took back the house and that was called a blue wave, whats the difference?","score":1,"comments":[{"body":"Given the slim Democratic majority in the House going into the 2022 election, polls were predicting the Republicans would easily take the House with 230-240+ seats and potentially retake the Senate. Instead the GOP has a very slim majority in the House (3-5 seats) and actually lost seats in the Senate.\n\nSo it was a wave because a wave represents a significant swing in seats. It was something smaller than that.","score":1,"comments":[]},{"body":"In the context of American elections a \"wave\" election is one in which a party wins a significant number of seats it is contesting.\n\nConsider 2018, which was a \"blue wave\" for the Democrats. They gained 41 seats in the House, with a popular vote margin of around 8.6%.\n\nCompare that to 2022, in which Republicans will gain between 6-10 seats in the House. Enough to win the House? Sure. But certainly not a runaway victory for Republicans.","score":1,"comments":[]}]},{"body":"Why do Republicans go on about voter IDs in America when you already need one? It's called your voter registration card.","score":1,"comments":[{"body":"I don't have the slightest idea where my voter registration card would be or, honestly, if I ever got one. No idea if my state sends those out, but if they do they're not needed for anything.\n\nYou obviously need ID to register to vote. \n\nThen, in my state, you go up to your precinct table, say your name and address, they find you in the book, you sign it,  the person hands you a ballot. Voila.","score":2,"comments":[]},{"body":"Because they don’t care about “election security,” they care about making it harder for Democratic-leaning populations to vote.","score":2,"comments":[]},{"body":"In some states, you don't need your voter registration card, you can just walk up and give your name and address. Voter registration cards also usually don't have a picture or similar, some Republicans want everyone to vote with a government-issued picture ID.","score":2,"comments":[]},{"body":"A voter registration card is merely proof that you can vote and is handled well before election day (normally). Voter ID exists to ensure when you show up to actually vote, you are who you say you are.\n\nIn places without Voter ID, you can vote as whoever you want as long as you know their name, address, polling location, don't get recognized, and the person hasn't voted yet.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"What’s something that only exist because of dumb people ?","not_safe_for_work":false,"locked":false,"body":"","score":8262,"comments":[{"body":"Detox shakes. If you have healthy kidneys, you're just paying for expensive piss.","score":288,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The tag on the curling iron that says “for external use only.”","score":876,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Warning label on chainsaw says don't stop chain with hand....hahaha what!?","score":6301,"comments":[{"body":"As a tree worker I can say: happens more often than you think on non professionals","score":1880,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"“Do not take *this medication* if you are allergic to *this same medication*”.","score":7235,"comments":[{"body":"That always confused me as a kid because I would think “how will I know I’m allergic or not unless I take it?”","score":1833,"comments":[{"body":"That *still* confuses me, and I'm an experienced adult!","score":860,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"[deleted]","score":180,"comments":[{"body":"My personal favorite: https://imgur.com/a/kTkHNlL","score":199,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"MLMs\n\nEDIT: I meant multi level marketing","score":2812,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Why are people saying student loan forgiveness is “unconstitutional”?","not_safe_for_work":false,"locked":false,"body":"Genuinely asking. I get that some people don’t believe in “hand-outs” but how is it unconstitutional as they are saying?","score":241,"comments":[{"body":"I think that's shorthand for the President doing it unilaterally via executive order is unconstitutional. Although it's a red herring because the broader argument is about statute, not Constitutionality. \n\nThe power to impair obligation of contracts is something that belongs to Congress exclusively, and not the President. No one argues that. It's very clear and concise. The Biden administration argued Congress had already given the President authority to do that via previously passed statutes. Basically that Congress delegated their authority in this circumstance to the President. Those that sued disagree. The argument centers around whether a vaguely worded statute grants the President the authority to do this. If it doesn't, then the President can't, because it's not otherwise a Constitutional power of the office of the President. No one disagrees on the last part either, just the interpretation of the statute.","score":308,"comments":[{"body":"So is forgiving ppp loans also unconstitutional since that was done by the president?","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What is the statute in question?","score":7,"comments":[{"body":"[20 U.S.C § 1098bb](https://www.law.cornell.edu/uscode/text/20/1098bb#)","score":9,"comments":[{"body":"What is that drunk s called?","score":25,"comments":[{"body":"It means \"section\".","score":15,"comments":[]},{"body":"Simelone iirc","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It means \"Hey §tranger\"","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Suddenly people became constitutional law experts overnight.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"People can say \"unconstitutional\" all they want - the only people who can make that stick are judges. Roe V. Wade decision was \"constitutional\" - until it wasn't.","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Why is the South(U.S.) always stereotyped as being rampant with incest ?","not_safe_for_work":true,"locked":false,"body":"","score":1257,"comments":[{"body":"Every country has rural regions that they mock about having incest. Small communities and all that.","score":1875,"comments":[{"body":"When a town of a few hundred has one good looking ~~broad~~ lady and she happens to be your sister and/or cousin, there's only a handful of options.\n\nEdit: changed terminology","score":745,"comments":[{"body":"Another similar example: There was a VERY small black population in my area growing up (semi-rural Appalachia). One day, someone asked one of the 3 black guys in the high school why they only dated white girls. He laughed and said, \"dude look around. There's 5 black girls and they're all my cousins\".","score":513,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Alabama here. 2 weeks ago at my son's basketball practice I overheard a woman talking about her baby and she said her cousin is the father. Unfortunately we can't escape the stereotype","score":1070,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It's more rural vs urban than south vs north. Rural areas outside the south get the same treatment.","score":362,"comments":[{"body":"Yeah, in Virginia (historically part of the South), these jokes are often aimed at Appalachian mountain folk (aka hillbillies), especially in West Virginia. And WV sided with the North/Union in the war (in fact that's why they exist as a separate state!)","score":123,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"As someone in the south, it's mostly a reference to very small towns. Less than 6000 people, kind of towns. Where everyone doesn't know *everyone*, but the population is small enough, that inadvertent incest can happen without people realizing it if families aren't close. \n\nMy grandfather was from a town, where some old lady had an actual record of who was related to whom, and the teenagers were encouraged to ask her before they dated anyone. This was to avoid any accidental incest situations. The keeper of the record would look at the proposed date candidate and go \"nope that's your first cousin/great nephew/whatever. You can't date them!\" or \"yes, it's fine.\" \n\nMy grandfather had a few stories of teens traumatized by accidentally sleeping with their not-so-distant teen relatives. I imagine a few of those got pregnant, although, at the time, that probably would've been a prime candidate for abortion, even here in the south. But some would've opted to keep them, and abortion is probably off the table in most southern states right now. So...","score":597,"comments":[{"body":"The fact that this old lady going to that much trouble to do that makes me think she made her own mistake in her youth. She's like Batman, making sure it never happens to another horny teen ever again.","score":282,"comments":[{"body":"Maybe the historical reason for \"Match Makers\" in other cultures.   \n\nThis is not fact, something that just crossed my mind with no research involved.","score":99,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I always figured they have more attractive family members than mine.","score":137,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Is it wrong to serve wine at Thanksgiving if some guests are recovering alcoholics?","not_safe_for_work":false,"locked":false,"body":"The title pretty much says it all. I am hosting Thanksgiving this year. Two of the 14 guests are recovering alcoholics. I don’t want to put them in a weird position or take away the enjoyment of the holiday. But I like a glass or 2 of wine with big meals…\n\nUpdate: thanks for all the responses. Many suggested just asking the two guests how the felt… I reached out and got positive responses, saying they were fine if there was alcohol present. I also found out their preferred non-alcoholic beverages and picked some up for the dinner. Thanks everyone.","score":529,"comments":[{"body":"we had a family member who stopped drinking. I would say for the first year or so, for family parties where she was invited, we did not have alcohol around. Now that she is 3 or 4 years sober, we have alcohol and it isn’t a problem. I believe when she was just starting her program to help, she wasn’t supposed to be around it all. Not having alcohol around her is the least we could do to support her. My take on your question is it depends on where they are in their journey. I would just talk to them privately beforehand.","score":748,"comments":[{"body":"Yep. I have recovered alcoholic family members, deep in AA, who are almost insulted when I offer to abstain from alcohol around them because they say that to really recover means that you have the personal strength to win over the addiction, not simply hiding from it. \n\nThat said, I'm 100% sure that some people don't have such strength yet and would appreciate the consideration. I would absolutely ask them and go with what they say.","score":189,"comments":[{"body":"I am sober four years and do not mind if people drink around me..now my tolerance for drunken idiots is much lower than most but I'm working on that. \n\nI very much appreciate it if someone offers to not have booze around or not drink, that doesn't bother me at all. But it can be situational as you mention.","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I think this is the answer. it really depends on the individual people involved. The non drinkers and the drinkers. Have the non drinkers recently given it up? Are there some problematic drinkers that will be drinking? Is uncle Frank a wine snob who will go on and on about the wine or will he just quietly enjoy it?","score":124,"comments":[]},{"body":"I'd just ask them. I've had some that don't care as long as you don't offer it to them, and some that can't be around it even years later.","score":26,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Here's a thought ask them if they are comfortable enough to have it around.\nI know a 10 year sober alcoholic that won't have it around and a 1 year sober that will go to a bar so each person is different, so just ask.","score":183,"comments":[{"body":"Props to the 10 year guy, fighting a hard battle and winning","score":79,"comments":[{"body":"Props to both! I know when I quit, I lost friends. No one wants to hang with the recovering alcoholic, but the guy who just drinks soda at the bar? Yeah, he's cool. \n\nIf he can maintain sobriety while still being in the middle of the societal pressure, I'd say he's winning just as hard.","score":45,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Ask them!","score":200,"comments":[{"body":"Yes, this is ideal. Most people are going to be OK with it but asking or even just informing them allows them to prepare for it, or make other plans if they don't want to be around it.","score":36,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I haven’t eaten in days, where is a good spot to dumpster dive?","not_safe_for_work":false,"locked":false,"body":"I’m living in my car as of recently  and just made as account to ask this question.  I just wonder about dumpster diving because I’m getting pretty desperate.  I’m worried about how nasty it might be to look through a dumpster.  \n\nAnyone have any tips?  Thanks!","score":157,"comments":[{"body":"Hi /u/Jonny_Balls,\n\nWe noticed you are a pretty new Reddit account, so we just wanted to let you know to check out the subreddit rules [here](https://www.reddit.com/r/NoStupidQuestions/wiki/rules) and maybe have a read through our [Frequently Asked Questions](https://www.reddit.com/r/NoStupidQuestions/wiki/index/faq) - they make for fascinating reading!\n\nWe're called No Stupid Questions because we believe nobody needs to be attacked for asking a question, but *that doesn't mean there are no rules!* This sub is meant for users like you to ask genuine questions. Please don't ask jokes or rants disguised as questions - that's not in the spirit of this sub. While you *can* ask almost anything here, please keep illegal and offensive questions elsewhere to give people a good experience here - and if you have a medical question, please ask your doctor, not us. \n\nOtherwise, welcome!   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoStupidQuestions) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Sikh temples, if you live near one. It's part of their faith to feed anyone who needs it, you just have to show up.","score":283,"comments":[{"body":"Also worth mentioning that they don’t do this to proselytize &amp; you’ll not be expected to listen to a sermon or anything. The major cultural thing to note is if they give you some food to your hands, it’s respectful to take it with both hands, not one.","score":149,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Any bakery...Dunkin donuts just after closing hours","score":122,"comments":[{"body":"Dunkin for sure. Got me through some rough times. Good advice to try to make friends, but really i just go and grab the trash. People will make up rumors about them bleaching them or whatever, but I've done this a lot of places and never had that problem. Obviously do a sniff test but... been pretty good so far. I still do it occasionally - no taking food out of people's mouths but I'll grab a few on the way home. Panera is also pretty similar.","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Sorry if I’m not responding to everyone but I am seeing everything.  Thanks all!","score":74,"comments":[]},{"body":"Supermarkets will often throw out a lot of their packaged merchandise. However, they will likely have cameras and the dumpsters might be behind a locked enclosure. \n\nI would try a food bank.","score":51,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I work at a pizzeria with a dude who stays in a shelter in town. We give him whatever left over Za we have at night. If he doesn't work we throw it away but in a box just in case someone is searching and needs it. So I'd recommend a local pizza place that serves slices. Either ask close to closing or check the dumpster. Might get lucky at domino's and such asking if they have any mess ups after dinner rushes.","score":35,"comments":[{"body":"I worked at pizza places, 100% this.\n\nThey're all sick of pizza. Show up just as they're closing, usually they put it aside because it sucks to throw it out. I used to give it to the people who worked at the gas station I stopped at on my way home, they were stoked.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You know I was probably going to make a terrible [joke](https://youtu.be/F8ErlWWTNUA) that probably wouldn’t have gone down well but instead I’ll speak nicely as homelessness is a serious problem.\n\nI wouldn’t recommend dumpster diving at all, you’ll put yourself at crazy risks of illnesses and diseases and cross contamination with needles and chemicals that you don’t want to get into your body. \n\nThere is no shame in going to a homeless shelter and asking for help, maybe there’s a soup kitchen nearby that can give you a warm meal or a donut shop about to close and throw out their stock you can ask them for a donut or two. \n\nThere are lots of options to consider before risking your life dumpster diving. \n\nThe strongest are those who ask for help when they need it.","score":140,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Wtf do you call England, wales, Scotland and North Ireland?","not_safe_for_work":false,"locked":false,"body":"A state? Province? Territories? Countries? Regions?  what do you call them?","score":576,"comments":[{"body":"They actually are countries, which all make up a part of the United Kingdom. The UK is a country that refers to the political union of all four countries within.","score":1354,"comments":[{"body":"So like is UK a country as well?","score":312,"comments":[{"body":"The phrase \"a country of countries\" is sometimes used.\n\nThere's not really a rigid formal definition of what a \"country\" is, to rule out the possibility of a country containing smaller countries. \n\nSo yeah, it's countries all the way down.","score":601,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Pro tip: Find a Scottish person (preferably a drunk one), tell them that Scotland is not a real country, and you'll get all the information you ever wanted to know about the topic.","score":276,"comments":[{"body":"What do I do if he pulls out a claymore?","score":50,"comments":[{"body":"I've only done this in a discord call so I wouldn't know. The last thing he yelled at me before hanging up was \"They may take our lives but they will never take our freedom\". Haven't talked to him since...","score":22,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"They’re called constituent countries. The UK is the sovereign state.","score":39,"comments":[]},{"body":"The United Kindom is an independent sovereign state made up of 4 countries.\n\nCalling the UK a country is fine, so is calling the individuals a country. \n\nWhile we're here, Britain is not a country. Great Britain is simply the largest island of the British Isles and makes up England, Scotland and Wales.","score":436,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They are definitely countries.  England, Wales, and Scotland make up the island Great Britain.  Add in Northern Ireland and you have the larger country, The United Kingdom of Great Britain and Northern Ireland.","score":22,"comments":[]},{"body":"[This video explains all this.](https://youtu.be/rNu8XDBSn10)","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What do people mean when they say U.S. cities need, “less car-centric, walking infrastructure”?","not_safe_for_work":false,"locked":false,"body":"Like….sidewalks aren’t enough? Obviously if you live out in the country then I don’t think it’s the same. I’m specifically talking about cities. \n\n\nOr, “biking infrastructure”, there’s already bike lane so what else can even be added.","score":180,"comments":[{"body":"&gt; Or, “biking infrastructure”, there’s already bike lane so what else can even be added.\n\nOne problem is that having a few bike lanes isn't enough; you need a comprehensive *network* that safely connects the places people want to bike between. A lot of cities have put in a few half-ass efforts of new bike lanes on random, disconnected routes and then people complain that bike lanes are a waste because nobody uses them.\n\nEdit: I'm going to pull out my soapbox for one more comment: If the only people willing to ride bikes in your city are the Lycra-wearing, hardcore cyclists who are traveling at car-like speeds, you do *not* have biking infrastructure.","score":392,"comments":[{"body":"&gt;safely connects\n\nJust to further expand on this, no one really wants to use a narrow bike line right next to cars doing 40-60 mph, like the one that runs right past my apartment complex.\n\nCould I use it? Yes. I have a few times.\n\nDo I feel like I'm about to die every time cars blow past me? Also yes. And if a driver wants to turn into one of the many driveways along this road and doesn't notice me, well, I'm dead.","score":173,"comments":[{"body":"If I’m cycling home from work, there’s a bike lane through one city that lasts for about a block. After that, absolutely nothing for 2/3 of a block. This is followed by a 3 ft wide (no joke) gutter lane that’s made out of an indent in the curb line. About ten to fifteen seconds later, you have to merge back into traffic and ”share the road” with four lanes of traffic.\n\nNo protection, no guidance to make pocket turns safely, and nobody ever gives three feet clearance unless they physically can’t squeeze past you at all. Also had one person in their Tesla pull up right behind me to the left, honk, and speed off laughing with their friends.\n\nSidewalks are too narrow to ride on either (in the rare instance that they exist), in case it’s one of these days where I’m just too tired to deal with cars going 3x my speed.\n\nEdit: pulled up on my left, not right","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Bike lanes in the US for the most part are a joke.\n\nSlapping down Some spray paint and calling it a lane doesn't equal safe biking culture.\n\nIn a place like NYC, the car culture has basically been a free for all for 100 years and without proper lanes unnaccessable by cars, there's gonna be continued infractions, injuries, and deaths....not to mention drivers and cyclists hating eachothers guts.","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It's not just sidewalks.  In fact, it's not really about sidewalks at all (though those are obviously important.)\n\nIt's more about creating an environment where you feel safe walking around without fear of getting run over.  It's about making sure that important shops and services are within reasonable walking distance.  It's where the roads are designed such that pedestrians don't have to cross 6-8 lanes of traffic on the only crosswalk along a half mile stretch to get anywhere.  \n\nI grew up in a suburb (and I like it!) where we did have to drive everywhere, but I now live closer toa city centre where I can walk everywhere, and it's really so much better.","score":173,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"In most places, it is hard to go about your day without using a car. Hard to get to work, hard for kids to get to school, hard to go shopping or run errands. Walking places takes too long to be practical and is often dangerous. Furthermore most public space is dedicated to either moving or storing cars instead of actual uses as destinations. All of these things are because of how cities are laid out, and are not a necessary reality.","score":203,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You haven't been to enough US cities if you think sidewalks even exist throughout the entire US or that bike lanes exist.  \n\nI recommend watching this YouTube playlist, because he talks about everything wrong with US car-dependent suburbia:  \nhttps://www.youtube.com/playlist?list=PLJp5q-R0lZ0_FCUbeVWK6OGLN69ehUTVa  \n\nCar-dependent suburbia costs the city money because close small stores together generate A LOT more revenue for the city while car-dependent suburbia is a net negative for the city.  \n\nEDIT: I'm lumping suburbia together with cities because well, you can have suburban areas with cul-de-sacs within a city. I definitely lived in a suburban area within a city with an urban core farther away.  \n\nSo I'm comparing blocks within a city, like this (and you can see the suburban area with the Taco John's makes less revenue for the city):  \nhttps://youtu.be/VVUeqxXwCA0?t=296","score":195,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The basic idea is that a lot of things in America have been built so that it's difficult to get around on a car. Things are spread out very far, there are places where there aren't enough sidewalks, The cities were designed with the idea that everyone would drive, rather than a world where driving was optional.","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I could write you whole essay but it's easier if you watch few [NotjustBikes](https://www.youtube.com/@NotJustBikes) and [EcoGecko](https://www.youtube.com/@EcoGecko) videos. They explain better than I ever could.  \n\n\nBut the easy litmus test is \"can you imagine living nice life in this place without owning a car?\". \"Could you get everywhere you need sing public transport, bike and your own feet?\"   \n\n\nIf answer is no, then someone fucked up big time. Also painted bike lanes are example of lazy solution that is almost worse than doing nothing. Try riding one and tell me how it feels. They are also very dangerous. [This](https://bicycledutch.files.wordpress.com/2016/04/nijmegen2016-1.jpg) is where it's at.","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Walkable cities are about more than just having sidewalks; it's also about making sure that the places that people go are within walking distance of the places where people live. A city with plenty of sidewalks still isn't \"walkable\" if actually getting anywhere requires a three-hour walk.","score":30,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Is twitter really a shittier place with Elon Musk? Hasn’t it been shitty before already?","not_safe_for_work":false,"locked":false,"body":"","score":554,"comments":[{"body":"It’s always been super shitty, but now it’s different shitty.","score":472,"comments":[{"body":"Advanced Shitty?","score":84,"comments":[{"body":"Hardcore shitty","score":54,"comments":[{"body":"Verified shitty","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Same same, but difffereeent.","score":13,"comments":[]},{"body":"It's like shitty beef versus shitty pork","score":13,"comments":[{"body":"Shitty Wok?","score":20,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"You arent going to get a balanced answer on reddit.","score":487,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I use Twitter to follow J-pop artists and (relatively) niche topics like manga and less popular video games. Honestly I don't feel any difference.\n\nSo I guess the shittiness depends on what kind of topics you follow. The toxicity comes from people first and foremost, after all.","score":172,"comments":[{"body":"Just like reddit, a few weeks ago I went over to the popular tab and I made it about 5 minutes before deciding I'm never doing that again.","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Why do so many non-Americans seem to think all Americans are white?","not_safe_for_work":false,"locked":false,"body":"This is a phenomenon I’ve experienced plenty of times before, from people using “real American” to ask if someone is “white”, or being told that I don’t look US American, and that I have be from Latin America. I’m mixed. I ask, Why?","score":24,"comments":[{"body":"their countries are racially homogenous and they don't understand multi-ethnic societies.","score":67,"comments":[{"body":"It’s very weird, because I’ve come across this from people from multicultural societies too.","score":7,"comments":[]}]},{"body":"Most countries are pretty homogeneous.","score":14,"comments":[]},{"body":"Some parts of the US are far more multicultural than you'll ever see in other parts of the world.\n\nComing from Australia and only having visited ethnically white or asian countries (all Islands) I had subconsciously assumed most countries were ethnically homogenous. Especially as the US media that makes its way down here historically only showed white actors.\n\nEven if I knew there was a wider demographic of people it doesn't quite sink in until you land in LAX and only 30% of the people you see are white.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They don't. They are aware Obama existed. They know rap exists.\n\nAnd US movies &amp; shows represent blacks a lot in media.","score":20,"comments":[{"body":"There is a lot of other people that live in the US besides White and Black people. As an example the city I live in (Texas) is about 50% white, 22% Asian, 15% Hispanic and 8% black.","score":3,"comments":[]}]},{"body":"People think that all Brits, French, Russians are white.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It’s funny that this pops up cause I was thinking of the same question a couple hours ago","score":4,"comments":[]},{"body":"Because everyone on the planet is stupid.  Its just what they are stupid about that separates us.","score":7,"comments":[]},{"body":"Not all Americans are white, however, about 75 percent of Americans are white.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Do people in the US actually ask you to send them the ingredients money when they cook you a meal?","not_safe_for_work":false,"locked":false,"body":"My flabber was gasted when my friend studying there told me someone invited them to their house and said to venmo like $3 for the ingredients of the meal! I would probably get exiled if I even think of doing that","score":716,"comments":[{"body":"If it's a bunch of broke college students trying to put together a good spread I could see it, for sure. Having said that, no we don't usually do that.","score":475,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That is not common behavior at all in the US. I've never heard of that happening.","score":2024,"comments":[{"body":"This can happen for maybe a FriendsGiving, and since the friend is studying, I’ll assume they met other people that are studying and are probably broke. That’s the only legit scenario I can think of.","score":332,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"When I was a broke college student about 50 years ago, it wasn't at all uncommon to ask the other broke students to chip in.","score":397,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"My guess is that they were all students (mostly living on a budget) and those people were most probably cooking food on a sharing basis.\n\nThis particular friend of yours wasn’t told that early on and ended up with a surprise charge","score":398,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No. I’ve never heard of anyone doing that here.","score":325,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No, your friend is student right? At university? Probably the person that invited them is a broke ass college student.","score":456,"comments":[{"body":"My college friends and I used to do nights where one of us would offer to cook for the group. Traditionally the cost of everything was broken down with a damn calculator to determine how much everyone owed, and then the same calculator was used to determine how much everyone was allowed to eat. Yeah, I think that's a bit ridiculous too, but that's how it went.","score":164,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Literally the only time I've ever had this happen was when we were broke college students trying to do a dinner group thing. It didn't last long lol","score":46,"comments":[]},{"body":"Agree that this is a college thing.\n\nAs an adult, I’ve had friends ask me to bring an additional dish or beverages or something, but never cash - unless the dinner being provided was ordered pizza or something.","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Why is it common for many women speak with an upwards inflection at the end of their sentences and is there a term for this?","not_safe_for_work":false,"locked":false,"body":"","score":89,"comments":[{"body":"\"Up speak\"\n\nIn English, going up at the end of a sentence is used to indicate a question. Women who are trying not to sound controlling or confrontational will often phrase their sentences as questions or suggestions in order to soften statements and get buy in and agreement.\n\nI'd say the opposite of it is \"vocal fry\" where women purposely lower their voices to sound more masculine and authoritative","score":144,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"High Rising Terminal, also known as Uptalk. (Though you'll find differing definitions and distinctions, it's generally one of the two.)\n\nThere haven't been many conclusive results of why this is, but a popular theory is that it reflects societal pressure on women to be polite rather than assertive, especially in a business setting.\n\nEdit: it's also more common in Australia, regardless of gender.","score":119,"comments":[{"body":"What’s up talk?","score":62,"comments":[{"body":"Is that like updog?","score":18,"comments":[{"body":"What's updog?","score":13,"comments":[{"body":"Haha gotcha!","score":23,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"It’s also common in Cali and the west coast of the US.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Phatic communication is the process of sending verbal  engagement cues back to the other party. “Mm hmm” being the most obvious. \n\nUptalk is another form of Phatic communication that solicits engagement from the listener. To many it can sound needy or lacking in confidence.\n\n*Do not speak like this in a job interview*","score":11,"comments":[]},{"body":"Uptalk. I never used to do it, and had a flat intonation unless I was asking a question along and didn't use a lot of explicit cushioning or flattery in discussions and was open when I didn't agree (politely!). I was widely perceived as being aggressive or even hostile and difficult to work with. It actually impacted my career (I'm in tech) because my \"male\" speech patterns (I spent my formative years living with my dad and uncles) weren't perceived as neutral because of misogyny.\n\nOver time I started softening my speech patterns, introducing some self-deprecation, and without intending to, uptalk was part of that. Making my statements sound more like questions, and my opinions less certain seemed to make people more comfortable jumping in with their own ideas and questions, and that caused me to be perceived as more collaborative and easier to work with. My career progressed.\n\nIt's a devil's bargain because these more conciliatory speech patterns also mean I'm not taken as seriously or seen as decisive in some situations. But my more natural style of speaking, which many men in my field use, isn't perceived the same way from a woman.\n\nI think the younger generation is starting to adopt softer speech patterns and even uptalk more generally and it might not always be a strongly gendered phenomenon. I think everyone learning how to make each other comfortable enough for good collaboration is a positive thing. But I  hate that confidence and decisiveness is still more likely to be perceived negatively coming from women, since leadership does sometimes require someone to step up and lead, without apology.","score":8,"comments":[]},{"body":"When I was a kid we were discouraged from doing this. The teachers would say, “Are you asking me or telling me?”","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Is it worth complaining if I got food delivered and it smelled like cigarettes?","not_safe_for_work":false,"locked":false,"body":"I ordered off of a food delivery service and my food smelled like cigarettes. Clearly, driver smokes in his car. I have some sympathy because the main reason I order food is because I have to stress eat to not give in to my own vices. But the food reeked. Anything that wasn’t in its own bag might as well have been inedible as I have a very sensitive nose. It was a cheap order, 20 dollars and I had to throw out some fries and the drink only, so the money isn’t really an issue. Idk. I don’t want to be like a “Karen” or whatever. And I’m worried I’m being a bit of a baby because specifically cigarette smell has some personal connotations for me.","score":15,"comments":[{"body":"I feel your frustration. Just last week, my family ordered a pizza using one of those delivery apps, and when the man with our food gets here, we found that he had stapled nude Polaroid pictures of himself to the inside of our pizza box! I'm serious, there must have been like 15-20 of those things in there. It was so inappropriate and awful, completely ruined our meal because while we were eating we just kept picturing his slightly crooked uncircumsized penis shaft. Made the pizza taste horrible","score":6,"comments":[{"body":"Hahahahaha that's amazing! Where are you from, if I may ask? Kinda want to know in which county that could possibly be such a common occurrence.","score":4,"comments":[]},{"body":"You just have to order no sausage next time..","score":4,"comments":[]},{"body":"This happens to me 3-4 times a week and I'll never get used to it","score":2,"comments":[]}]},{"body":"I mean, dude, if it reeks they must have been smoking with the windows down or something. If it makes you kinda grossed out, it's not that bad to complain about it. You don't have to make it a big deal, just make a complaint to the delivery service and leave it to them if they'll do something about it.","score":7,"comments":[]},{"body":"You could complain to the delivery service, I guess. Personally, I wouldn’t. I’ve never used a 3rd party delivery service because I don’t want a stranger who isn’t trained in food handling, isn’t beholden to the health department in any way, and doesn’t work for the restaurant, having any private time with my food. I just don’t trust it. The chain of custody is broken. I just pick it up myself.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I would for sure,  yes.   That's gross.","score":1,"comments":[]},{"body":"You could complain but I think that would be really petty. The driver isn't breaking any rules","score":-11,"comments":[]}]},{"title":"Do Americans really have such a casual attitude towards drink driving?","not_safe_for_work":false,"locked":false,"body":"I've seen in movies and tv many times the characters drive home after drinking, and always thought it was just a movie thing. But husband recently came back from a work trip in the US and said the American colleagues genuinely drove home after having way too many drinks with the view that \"it's only illegal if you get caught\". \nIs this genuinely the attitude in the US towards drink driving?","score":1837,"comments":[{"body":"The problem is that everyone is against drunk driving, but lots of people see themselves as the exception to the rule. I’ve spoken with people who will absolutely rail against drunk drivers, but then unironically tell you that unlike most people they actually drive better once they’ve had a few drinks.","score":2044,"comments":[{"body":"This could not be more on point.\n\nAnd side note, don't people crack you up? \"I'm a better driver when I'm buzzed. I'm funnier after a few shots. I am such a good singer after a few margaritas, everyone says I sound like Alicia Keys.\"\n\nPeople REALLY don't see it. It's just... wow.\n\nBut yeah I like the ones who think they drive better. I wish they'd hunt down a police officer next time they're drinking and driving, see his opinion on their road skills.","score":324,"comments":[{"body":"There are some things that alcohol makes people better at. One of them is foreign language fluency","score":89,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It’s almost like alcohol impairs your judgement when making a decision on whether you’re too drunk to drive!","score":487,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I wouldn’t just put this on the Americans. I’m Canadian and I can promise you we are no better.","score":856,"comments":[{"body":"Yeah, we're definitely guilty.  I've personally hidden keys for a number of people at parties.  With everything so spread out and no easy/cheap way to get back home in all but the biggest cities, people are more likely to try it.  Yeah, we know the responsible thing is to drink at home, get a cab/uber, have a DD, or find a place to crash, but people who are drinking aren't known for their decision making skills, and especially for those first few years when getting drunk legally is new.  We're too car dependent, which causes a problem when we shouldn't be driving.","score":228,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The real problem is the number of people who drink but are convinced they aren't too drunk to drive.\n\nMany people are very against drunk driving.  But then you will catch them getting in the car as they leave a bar.  When asked about it - they usually say things like \"I haven't had too many.  I'm still fine to drive.\"","score":1353,"comments":[{"body":"The real problem I would have to say is most Americans live in places where driving really is the only way to get home. If we had walkable cities and decent mass transit, no one would feel the need to drive home or pay for an expensive Uber","score":1008,"comments":[{"body":"True. My home town has limited taxis and no one does Uber there yet. I think there is only a population of 4,000 people now.","score":73,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I hear it's more common and more lax in rural areas, where public transportation is non-existent, and the damage you'd cause to others in the event of an accident is limited to property. Yes, you might crash and die, but you took that risk yourself. American individualism at work.","score":647,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Since reddit shows fake numbers of up/down votes, whats the point of these numbers even being visible to us?","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"They're not fake, just like how it wasn't \"fake\" that so many videos had 431 views back in the day on YouTube. Reddit likes to make sure you can't just pay a bunch of Russians or Indians to bot your posts. Yes that still does happen, but it makes it harder for spammers to know exactly what they need to do to not get caught.\n\nWithout a safeguard like that, any 13 year old kid who knows a little bit of python could make their own Reddit spam bot.","score":8,"comments":[]},{"body":"Obfuscated and fake are two very different things. It still gives you an idea of how a post is doing without being completely machine manipulatable or from having extremely high highs vs low lows.","score":20,"comments":[]},{"body":" don't let the perfect become the enemy of the good","score":9,"comments":[]},{"body":"It gives some neckbeard that lives in mommy's basement a sense of power.","score":-6,"comments":[]},{"body":"So supermods can manipulate content trends","score":-7,"comments":[]}]},{"title":"How do you correctly spell “wallah”? As in you’re presenting something magic. I believe the correct spelling starts with a “v”","not_safe_for_work":false,"locked":false,"body":"","score":16,"comments":[{"body":"Voila","score":69,"comments":[{"body":"Solved!","score":9,"comments":[{"body":"et voilà!","score":14,"comments":[]}]}]},{"body":"Voila. French for “There it is”","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Voila. It's french","score":6,"comments":[]},{"body":"Technically it should be voilà, but voila is also accepted in English","score":12,"comments":[]},{"body":"Voila","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I say viola instead","score":3,"comments":[{"body":"When a dyslexic magician tries to pull a rabbit out of his hat but gets a stringed instrument instead.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Voilà has no islamic connotation tho lmaooo, feel like it needsto be said 😭","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I’m a teenager today was my first day working in my life, does it get better?","not_safe_for_work":false,"locked":false,"body":"","score":6664,"comments":[{"body":"It is unlikely you'll work the same job at the same place with the same people with the same lack of knowledge for the rest of your life.\n\nThe immediate frustrations, struggles, and general shitiness will fade.  It is largely due to being in an entirely new experience with new people and new stress and new responsibilities.  This will ease as you get familiar with everything.  It may still suck, but it'll be a familiar type of suck.\n\nUse this as your fire to do well in school, the motivation to identify and pursue a career you do want.  There are many different kinds of jobs out there and they are wildly different in many ways.  There are corporate jobs, freelance jobs, office jobs, shop jobs, people jobs, outside jobs, and so much more.\n\nBest advice I ever got was to find the job which has the stress you handle best.  All jobs will have times where they are stressful, but there are many kinds of stress and everyone handles it differently.  Stress isn't inherently bad - some people love the stress of tight deadlines, some people love the stress of broken things needing to be figured out and fixed, some people love the stress from needing to understand and help others handle their stress.\n\nRight now you are just starting out and it is absolutely the deepest end of the cesspool.  If it was a good, fun, clean, relaxing job it wouldn't be staffed by teenagers.  But it is also a temporary thing.\n\nI had a friend in college who started off as a partier, skipping classes and screwing around.  Failed enough classes that they kicked him out for a semester (academic probation).  He spent that semester and the summer working the only job he could find - commercial roofing.  Spreading tar on roofs in the middle of a Virginian summer.\n\nHe was a straight A student from the moment he came back.  Said it was the worst time of his entire life and he was never going to go back to that job.  He limited his parties to Friday nights, he attended his classes, pursued internships, and got a good job after graduating with honors.\n\nIt isn't always possible to take the traditional routes to success.  But no path involves accepting things as they are and becoming complacent.  Good luck, be realistic with your goals, don't let the current problems stop you from working on future solutions.","score":7999,"comments":[{"body":"Bro just poured his heart out in this comment","score":2018,"comments":[{"body":"Advice given by a meaningful and doting affectionate online guy, aka a madao.","score":373,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It's so wholesome. I'm getting pretty tired of reddit being super hateful on everything lately. I wish there are more wholesome comments like this one.","score":612,"comments":[{"body":"Username checks out","score":257,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Curious, whats your first job?","score":547,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yes, but kind of in a morbid way. Time seems to pass way quicker now (I’m 30) than when I was a teenager. At 16 an 8 hour shift felt like an eternity just draining me of any and all will to live. Now 8 hours goes by much much faster, as do the days/weeks/months/years. Even since the beginning of my big kid career the days feel much less daunting. \n\nFeels like I’m accelerating toward the end of it all sometimes, but at least days at work don’t drag on like they used to.","score":74,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It will get as usual as going to school is. Just don't be afraid to always look out for better opportunities.","score":112,"comments":[]},{"body":"Most people's first job is in retail or food service. Both are industries infamous for toxic management making things much harder than they need to be","score":198,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Um... depends. Get a job you like and it will! Get a job you hate and it will only get worse.","score":613,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How come in the US, only firefighters have to frequently pass a physical test to demonstrate they’re in shape but not police officers?","not_safe_for_work":false,"locked":false,"body":"In my unpopular opinion, there should be no fat cops at all. Those who have weight issues due to a medical condition would be the only ones exempt providing they can pass the test.","score":10,"comments":[{"body":"Best guess is because the police union is the largest and most powerful union in the country and they generally move to make things easier on themselves.","score":12,"comments":[{"body":"Not even close to most powerful.   Closer to about 14th or 15th behind teamsters, teachers, steelworkers, service workers and others. \n\nThe IAFF (Firefighters) are just behind the police in size and funding.","score":1,"comments":[{"body":"How are the teachers unions more powerful? Aren’t there specific legal protections that give the police unions more power?","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"You mean the JST (Job Standard test)\n\nAll you have to do is google [\"police physical exam\"](https://www.youtube.com/watch?v=U5QlJpz5skI)","score":3,"comments":[]},{"body":"I think part of it is, ya know how you're not supposed to use the elevators during a fire-- in a tall building?  Well, same goes for firefighters. When they enter a building, they may have to carry HEAVY fire hoses and other gear up the Stairs, to upper floors of the building...depending where the fire is reported.  Regular folks, even young but not tested, could fall out trying that stuff.  I think that's part of why they have to pass physicals.  And there aren't a row of 75 year old buff firefighters either. My guess/hope is that many have good pensions so they can retire from all that wear and tear at a decent age.","score":2,"comments":[]},{"body":"Depends on the police department. Lots of them do have regular physicals.\n\nThe problem is that the hiring pool for police is tiny, so implementing strict physical fitness requirements would further reduce the number of potential officers to the point where police departments won’t be able to hire enough officers.","score":2,"comments":[]},{"body":"Cops can just resort to shooting people. Firefighters have to actually take risks and do hard work. \n\nDisagree? Prove me wrong. The number of executions by cop backs me up.","score":3,"comments":[{"body":"In my opinion, when the Supreme Court ruled police officers are not obligated to save you is one of the stupidest decisions they ever made. Police officers should make every possible effort to save people, that’s what they’re trained to do (I hope). If it’s not possible (i.e. it would get the officer killed), then it’s understandable","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Takes a lot more effort and fitness to put out a fire than it takes to shoot and kill black folks.","score":0,"comments":[]},{"body":"The police in the town that I used to live in had to the qualify PT yearly and twice annually with their firearm.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"As a recovering alcoholic, is there a way to block alcohol ads on social media?","not_safe_for_work":false,"locked":false,"body":"As title states. I know targeted ads are a thing. It doesn’t make me want to go drink, but I’d prefer to not have the stuff shoved in my face.","score":6,"comments":[{"body":"I use an undetectable adblocker. It removes annoying ads, even on YouTube (I was fine with only one commercial, but when YouTube in the late 2010s decided to put 2 commercials made me install adblocker).\n\nIf you decide to have it, be sure to install the \"undetectable\" ones because admiral (an anti-adblocker) will block you from accessing sites if it's able to detect your adblocker.","score":3,"comments":[{"body":"Is that available for iPhone? Is it free? Tried going around in some settings but couldn’t figure anything out.","score":1,"comments":[{"body":"On iPhone there's uYou and similar. Might require Jailbreaking. On PC uBlock Origin.","score":2,"comments":[]}]}]},{"body":"Yes many sites have ways to make sure you don't see certain ads again or have ad preferences, should all be in settings or per ad.","score":2,"comments":[]},{"body":"There's a feature with Google to remove targeted ads, not block particular catagories but make it generic themed ads on anything u use your Google account to log into, google help shows you how","score":1,"comments":[]},{"body":"Let's be real here. Some things you're just going to have to deal with and be ok when you see it or you're around it. I definitely recommend limiting exposure, but honestly you're going to have to tough it up and dig deep to tell yourself you quit and obviously there's a reason. Stay strong.","score":-4,"comments":[{"body":"Knew there was going to be that one asshole who didn’t read that I don’t want to drink just prefer not to shove it in my face, and tell me to toughen up. Fuck you dude.","score":3,"comments":[{"body":"I did read it. Unfortunately to my knowledge there's no way to accomplish this - aside from hanging out with people who are drinking or are shoving it in your face. Sometimes life is tough sorry to come off the wrong way.","score":-1,"comments":[]}]}]}]},{"title":"When you imagine an image in your head are you manipulating chemicals to see it?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"I'm not sure if manipulation of chemicals is involved but I would think your brain is looking for a particular succession of neuron firings to give you the mental image you're looking for but I'm not 100% sure","score":3,"comments":[]},{"body":"In the most basic sense yes, Nearly everything that occurs everywhere is the manipulation of chemicals (barring the few things that are more elementary them chemicals). Waving is all just chemistry, very complex chemistry, but chemistry never the less.","score":1,"comments":[]},{"body":"I personally think the mind is disconnected from the body to a certain extent. However I'm sure the brain does have some reaction (maybe chemical maybe not) to picture an image. I also feel like this depends on what the image may be.","score":0,"comments":[]}]},{"title":"What would happen if Ukraine liberated all captured land, but Russia keeps launching drone / missile attacks? Will Ukraine go on the offense into Russian territory?","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"Ukraine depends extremely heavily on support from the US and EU that almost certainly wouldn't continue if they tried to invade Russia.","score":8,"comments":[]},{"body":"Unless Russia were attempting to take advantage of the attacks to push back into the territories, continuing to bomb them would be pointless.\n\nUkraine would continue to get other countries' support in fending off the missile attacks (such as with anti-missile systems). There wouldn't really be a strategic reason to push into Russia.","score":6,"comments":[]},{"body":"Russia has made it quite clear that Russian territory is protected by their nuclear umbrella.  Russia would love an incursion into Russian territory by the Ukrainians - would give them an excuse to use tactical nukes.\n\nedit - downvoting me doesn't make me wrong","score":8,"comments":[{"body":"Ukraine has already launched limited strikes into Russia without provoking a nuclear response. I imagine at some point they might start launching “tit for tat” reprisals on targets inside Russia if Russia keeps attacking Ukrainian infrastructure. But yeah, Ukraine isn’t going to roll into Moscow with tanks. The Russians won’t let that happen.","score":3,"comments":[]}]},{"body":"No, they would establish defenses against the attacks and entrench","score":2,"comments":[]},{"body":"If Ukraine takes its territory back, Russia's not going to waste its missiles anymore. Missiles are expensive, and they can barely produce them as-is with all the sanctions. If Russia can't keep the territory, they'll want to get rid of the sanctions as quickly as possible.","score":2,"comments":[{"body":"I'm not so sure.  A rational country, yes, but I see Putin even then being a little whiny a-hole and lobbing some missiles into Ukraine anyway to keep being a bully.","score":2,"comments":[]}]},{"body":"No. They’re trying to protect their land, not invade another country.","score":1,"comments":[]},{"body":"If Ukraine went on the offensive the US would stop all supplies, money, and probably most importantly intelligence. They known this and if they ever lost the wests support, even with Russia beat down as they are, I don’t think they would make it.","score":1,"comments":[]}]},{"title":"Why do paper straws get soggy but paper cups don't? Why can't we make the straws out of the same material as the cups?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"The cups do if you leave the drink in it long enough","score":6,"comments":[{"body":"My desk can confirm this.","score":3,"comments":[]},{"body":"Sure, but they last hours. Paper straws, not so much. They get soggy after just 20 minutes.","score":2,"comments":[]}]},{"body":"Paper cups have a waterproof coating, and probably aren’t good for you. I wouldn’t be surprised if it were some sort of PFOS. Same thing that coats your fast food wrappers.","score":1,"comments":[{"body":"Why don't they use thay coating for straws? If it's in the cup, you're already ingesting it anyway right?","score":2,"comments":[]},{"body":"They just use wax on the inside of the cups. Calm down. If I've ever used wax paper it's very similar, just with thicker paper.","score":2,"comments":[]}]}]},{"title":"What does it say about me when I instinctively open an incognito tab when I’m about to order pizza?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"You’re trying to order a spy pie","score":1,"comments":[]},{"body":"You like to operate under the belief that Big Brother isn’t watching you when you’re ordering your extra large pepperoni and pineapple with a 2-liter of cola.","score":1,"comments":[]}]},{"title":"Why do swear words need to be censored on channels like Adult Swim? Isn't it made specifically to air adult shows?","not_safe_for_work":false,"locked":false,"body":"","score":89,"comments":[{"body":"TV channels don’t necessarily *need* to be censored. FCC regulations apply to TV transmitted over the air, but generally don’t restrict cable or satellite TV. However, TV channels are usually beholden to advertisers, who often don’t want their ads to be shown amid excessive profanity or obscenity. Subscription-based channels like HBO rely less on advertising revenue, which is why they can get away with less censorship.\n\nI’ve definitely heard the occasional “shit” or “fuck” on Adult Swim, but it’s always late at night when most viewers are sleeping, with ads targeting young adults.","score":94,"comments":[{"body":"This is the only right answer I’ve seen.","score":13,"comments":[]},{"body":"I've definitely heard a few F bombs on adult swim.\n\nCan anyone else confirm...I k ow I've heard an f bomb on Rick and Morty but when I rewarched it on Hulu/HBO it was all bleeped.  Am I crazy or stupid?","score":4,"comments":[]},{"body":"Do consumers actually care about that stuff? Are there really people whose thought process is \"I can't believe that cartoon character said 'shit' instead of 'shbleept'; I'm never buying Swiffer mops again!\"?","score":2,"comments":[{"body":"Yes people have gotten mad for commercials having mixed couples. A lot of people that watch cable don’t get out much.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"Advertisers may not want to associate with certain content even if its allowed. \n\nAnother reason may be the show chooses to censor it. Loren Bouchard and Brendan Small creators of Home Movies discuss in dvd commentary that they think a censored swear is funnier then saying it","score":10,"comments":[]},{"body":"Like family guy most of all, they’d show people’s heads getting crushed by two swinging logs for a free hat gag but shit or ass is a no no","score":5,"comments":[{"body":"That’s why American Dad moved from Fox to TBS a few years ago. This way they can say all the “shit” and “asshole”s all they want. But, sadly, no f-bombs.","score":2,"comments":[]}]},{"body":"Comedic effect, to keep it interesting, like when you have to fill in those 30 second tirades that are 90% bleep, which is a more fun sentence, \"This red book\" or \"This \\*BLEEP\\* book\"","score":6,"comments":[]},{"body":"I think another aspect not mentioned by fellow commentors is that: censorship is what gives swear words their power. Sure spamming fuck into every sentence can be funny occasionally, but even South Park grew out of that 10 years ago. On the other hand, censorships can highlight the swear words being used and achieve a much greater impact.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What killed comic book culture?","not_safe_for_work":false,"locked":false,"body":"Grew up in the 90's and remember how big this used to be. I guess manga is a new form of this but what killed this? Please don't say the internet","score":8,"comments":[{"body":"Whaaa? The whole damn culture is comic book culture now.","score":10,"comments":[]},{"body":"Price.\n\nBack in the day, a comic was cheap entertainment for kids.  As late as the 1990s you'd still see ads for little kid toys in Spider-Man.  These days, a comic is $5.00 or more.  No little kid is spending that much for a book.","score":6,"comments":[{"body":"even when I was a little kid a comic was 60 or 65.  Or about $2 today.  With the increased costs of printing etc its not that too out of line.  A candy bar was a quarter as was a 16oz bottle of pop.  A plastic 20oz of coke is $2? anywhere so sugar water has increased much more than a comic.\n\nI dont think thats it.\n\nLike I said in my post its because you cant find them.  If a kid goes to 7-11 today for a slurpee he literally cant buy a comic there.  He has to beg a ride downtown the comic shop and mom has to pay $9 to park","score":5,"comments":[]}]},{"body":"Manga isn't really new and actually dates all the way back to the 1800's. I would say different forms of entertainment becoming easily accessible and better over the past few decades made comic books lose their popularity not to mention kids nowadays grow up with smart phones, tablets, etc.","score":3,"comments":[]},{"body":"I dunnno how you measure it but comic book conventions are dime a dozen, what used to be twice a year is now maybe 10.a month if you go to different states. I even saw local libraries doing cosplay events for halloween.","score":3,"comments":[]},{"body":"Kids have way may things to entertain themselves with. I was born in 2000, as a young kid my hobbies involved playing with friends, watching cartoons and playing video games. By the time I was even able to read, both DC and Marvel already had a catalog of cartoon shows. By the time I was 8, Iron Man came out and kick-started the MCU. \n\nNowadays, not only do kids have more options to spend their free time, but they have many ways to consume comic book content without ever opening up a comic book.","score":3,"comments":[]},{"body":"Nothing killed it.  It took over.","score":2,"comments":[]},{"body":"the content. it just went through a dinosaur age of the same stuff recycled with no innovation. then a whole bored fanbase flocked to manga and anime because it was more exciting, innovative original and new to their eyes","score":2,"comments":[]},{"body":"The biggest thing is how they were distributed.  My grandparents owned a convenience store and they stocked comic books.  They were purchased by the same newsstand service that brought magazines unit the late 80's or early 90'?  Comic Books could only be purchased through Diamond and didn't take back unsold copies ets.  It was a headache and they immediately stopped selling comic books.\n\nSame with nearly every grocery store and newsstand.  Comic books went from being a product you could buy nearly anywhere to a specialty product you could buy from a comic book store. \n\nAnd that was that","score":1,"comments":[]},{"body":"Some comic book authors","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"If Adam and Eve weren't supposed to discover the shame of being naked, why isn't nudism part of Christianity?","not_safe_for_work":false,"locked":false,"body":"This isn't meant to be a \"got you!\" or anything: I'm genuinely curious.  \n\nSo Adam and Eve were naked and were told not to eat fruit from the Tree of Knowledge.  Satan came as a snake and tempted Eve until she ate an apple, and Adam soon gave in and took a bite as well.  \n\nAnd it turns out at least part of the forbidden knowledge they gained from the tree was that nudity is a shameful thing, and this is how God found out they disobeyed him--he caught them wearing clothes. \n\nSo wouldn't it make sense for nudism to be part of Christianity?  I guess I'd interpret the ordeal as God having never intended for us to wear clothes, as he tried to keep that knowledge from us.  He punished Adam and Eve for it: why continue the tradition?","score":561,"comments":[{"body":"Some early Christians, [the Adamites,](https://en.m.wikipedia.org/wiki/Adamites) posited the same theory, that nudism was a form of original innocence, and that holy nudism was a pious practice, and would have their services naked. They existed around the 2nd-4th century as a small sect of pre-Council of Nicaean Christianity, before the doctrines of modern Christianity had really been codified as strictly as we see a lot of Christianity nowadays. This belief predated the early schisms in the faith by quite a while, and was seemingly fringe enough that it didn't become a huge talking point at any of the major Christian councils that shaped the faith or it's derivations. It did come back after those formative centuries, but it never really stuck about.\n\nNudity often clashes with aspects of Christianity, things like temperance, modesty and chastity. To be a bit crude, a lot of these aspects are seemingly about not banging unless it's faith sanctioned banging (ie, in wedlock), at which point you're only supposed to bang for reproduction. A lot of the teachings in this realm relate to not drawing attention to yourself, not encouraging such behaviour and in general being as unsexy as possible. There is also a weird assumption that nudity is inherently sexual, which is another underlying message that someone might discuss with their therapist if they were to reject religion, but that's a complicated topic. The main point is that most Christian sects are very much of the mind that nudity is something reserved for you and your spouse, and that undue nudity may spur on things viewed as less virtuous, and due to the many many different teachings that point in that direction, as well as the general lack of nudism as a non-sexual act in the bible suggesting it could be acceptable, most churches have erred on the side of modesty and temperance = virtue.","score":339,"comments":[{"body":"'Faith-sanctioned banging'\n\n=No chuppah, no shtuppah\n\n=No spreadin' before the weddin'","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"TIL that Adamites were a sect of Christians and basically early hippies. They practiced free love, nudity, and rejected marriage and other laws. \nThanks internet citizen","score":119,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The Biblical design for sex is not that it is solely for reproduction. While the Bible does limit its exercise to the stability and sanctity of a marriage relationship, it's something that God created to be enjoyed. It's a gift. The first section of 1 Corinthians chapter 7 is St. Paul talking about how sex is a good thing and it should be exercised for the mutual pleasure of both partners involved.","score":67,"comments":[{"body":"Song of Solomon's pretty smutty too.","score":14,"comments":[{"body":"Song of Solomon is pornography wrapped in the loving embrace of fairly obvious euphemisms and not-very-deep metaphors.","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"&gt;And it turns out at least part of the forbidden knowledge they gained from the tree was that nudity is a shameful thing, and this is how God found out they disobeyed him--he caught them wearing clothes.\n\nIt's not quite like that. Here's my best understanding of the matter. Mind you, I'm just speculating from the text, since we're discussing a story that is heavily loaded with symbolism, and the text itself doesn't explicitly say.\n\nBased on the narrative, Adam and Eve were completely innocent beings before the fall of mankind. The text suggests they were physically mature, but they were completely innocent in the sense that a little child is innocent, unaware of the evils of the world. I don't mean innocent merely in the sense of not having committed any moral transgressions. I mean completely unaware of both evil and the latent possibility of evil.\n\nThe point wasn't that nudity was bad, or that clothing was good. The point was that Adam and Eve were completely innocent, and commanding a completely innocent being  \"thou shall not murder\" raises the problem of defining murder to someone who has no concept of it. Commanding a completely innocent being \"do not steal\" requires defining theft. One comparison that is more relatable is this: imagine you have a little child, and the child asks you \"daddy, what is rape?\" or \"daddy, what is genocide?\" perhaps the child stumbles upon some term for a lewd sexual act, and asks you what it means. Parents instinctively want to preserve the innocence of their children, and for this reason, most parents will try to change the topic and not put these ideas into the minds of their young children. They will eventually find out as they grow up.\n\nAdam and Eve were essentially God's babies, and like any parent, he wanted to preserve their innocence, but he wanted them to also trust and obey him. To preserve the innocence of his babies Adam and Eve—keeping them from the knowledge of evil—God  hid all of the commandments behind a single commandment that basically asked Adam and Eve to trust him to determine right and wrong—do not eat from the tree of the knowledge of good and evil.\n\nHere is another example. [What do you see in this picture?](https://www.reddit.com/r/Damnthatsinteresting/comments/grw92v/love_among_the_dolphins_is_an_optical_illusion/) (Warning: potentially NSFW, depending on how innocent your boss is) Totally innocent little children who look at this only see a bunch of dolphins. When Adam and Eve were totally innocent, it was kind of like that. They looked on each other's nakedness and their own nakedness and knew no shame because the concepts and realization of latent evil in what could be done with their bodies were not even in their mental capacity. When Adam and Eve ate from the tree, they suddenly became aware of the possibility of both good and evil, and all the latent possibility of evil that came from their nudity —think of such sins as adultery, rape, seduction, etc.— came into their awareness, and they felt shame. It's as if a child looking at that illusion I linked suddenly became aware of what the hidden NSFW image in that picture shows. (Sex itself is not included in this, only sexual sin, because sex was ordained by God before the fall of mankind, and he made Eve for Adam to fix the first 'not good' thing, which was that man was alone. Sex may have been a good thing they became aware of, but they became aware of both good and evil, and it is the evil part that defiled their consciences and made them feel shame.) \n\nThat is what the unashamed nudity of Adam and Eve is about. It isn't about nudity itself. It is about the complete innocence of these first two humans before sin entered into the world through their decision to eat from the tree of the knowledge of good and evil rather than simply to trust God, who hid all of right and wrong behind that one command in order to shield them from the knowledge of evil, in order to maintain their innocence.","score":48,"comments":[{"body":"I've been going to church my whole life and this is by far the best explanation I have heard for the symbolism of the tree of knowledge and its impact.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"IIRC, Adam and Eve's actions formed the \"original sin\" that supposedly all humans are born with, and carry with them. How that's been interpreted has changed over time, and across different denominations, but being naked and rejecting clothing wouldn't fix that.","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The idea is that when Adam and Eve were in the garden they were completely sinless and innocent similar to small children. Children don’t care when they’re naked. God wasn’t concerned about the clothes, he was concerned about the loss of innocence.","score":104,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How fast would you have to travel from east to west to keep up with the sun?","not_safe_for_work":false,"locked":false,"body":"In other words, if you were driving toward the sunset in a straight line, how fast would you have to go to keep the Sun in the same spot on the horizon? I hope I'm asking in a way that makes sense.","score":8,"comments":[{"body":"It depends on your latitude.  To work it out, multiply the cosine of your latitude by 1,000mph.  \n\nExample;   If you are at 45 degrees north, the cosine of 45 degrees is 0.707, multiply this by 1,000mph, and it gives 707mph.","score":13,"comments":[{"body":"That’s… a lot slower than I thought.","score":6,"comments":[]},{"body":"Are those nautical miles?","score":3,"comments":[]},{"body":"And I zoned right out at cosine.  Sorry habit from highschool. \n\nTy tho for explaining.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"There's a european tv show on tubi about this. You can do it in a standard jumbo jet but need to be fairly far north or south, so about 700 mph.","score":5,"comments":[]},{"body":"A day is 24 hours long. You'd have to circle the earth in 24 hours. So about 1700 km/h or 1050 mph.","score":5,"comments":[{"body":"At the equator","score":6,"comments":[]}]},{"body":"It depends on where you're standing. \nAt the equator it has to be something like 1700 km an hour.\n\nAnywhere else you'd have to take the circumference of the Earth at the latitude you are at and divided by 24","score":4,"comments":[]},{"body":"**\"We all dream of sailing into the sunset. Of course remember if you're sailing into the sunset and you sail fast enough, the sun never sets! Of course fast enough in that instance would be approximately 850 miles an hour... Which would be a very fast yacht. You lucky lucky person! You've got a sunset to chase, go get it!\"** \\- DJ Loggins, Los Santos Rock Radio, GTA V\n\nSince Los Santos is a parody of LA, Rockstar likely used the coordinates of ∼34° North. cos 34° = 0.829. 0.829 * 1,000mph = 829mph.","score":6,"comments":[]},{"body":"3","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I hear about people buried in student debt, what happened to all those people who had the option to take a loan for college/university, but didn't, and just started working right out of high school? Or people who took out student loans but were able to pay them off without too much struggle?","not_safe_for_work":false,"locked":false,"body":"I know they exist. They have to, where are they?\n\nEDIT: Glad to hear some stories from people who are doing OK financially","score":345,"comments":[{"body":"What do you mean, what happened to them? They're just regular people. I'm one of them, since my student loans are paid off, although my SO still has his. We're just normal people with normal lives and jobs.","score":275,"comments":[{"body":"Yea, I'm really not clear what OP is trying to get at.  Does he mean, Where are their stories?  Well, the story is I paid off the loans, the end.","score":51,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"We’re here and everywhere else. I think you’re underestimating how many people have no student loan debt for either reason.","score":356,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"We are everywhere.","score":21,"comments":[]},{"body":"Bachelor’s and Masters/Teaching license- started teaching at 28 with 5k in credit card debt and 70k in student loans. Barely kept my head above water for two years.  \n\nSpent a summer teaching driver’s Ed to pay off the credit card.  Now that the ball was rolling, I felt motivated.  Took on a flexible part time job and put everything I made there, plus everything I could squeeze out of my budget, onto my student loans.  Advised an after school club, sold skincare, donated plasma, waited tables in the summer and taught summer school, and delivered groceries.  \n\nAlso, I put my loans in forbearance and put all the extra money on the smallest loan until it was gone, and then tackled the next one.  My minimum payment was $600 a month, which wasn’t manageable and even if it was, it was spread out among 19 smaller loans ranging from $800 to 18k, so the interest quickly swallowed it.  But three $300 payments toward that $800 loan, and it was gone and no longer accruing interest.  Eventually, only the 18k loan was left and I was throwing a couple hundred at it every other week.  I paid it off the summer I turned 35.  \n\nI had to live on a strict budget and deny myself a lot of things, but I did it!","score":101,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Learned a few trades and eventually started my own business. Unless you really know what you want to do with the rest of your life, I think colleges praying on young people to take out massive loans is kinda scummy. Especially when your so young and right out of school, don't get me wrong I value higher education for those who want to go that route. But there are plenty of blue collar jobs that need to be filled.","score":321,"comments":[{"body":"That, and quit requiring a college degree for jobs that don't need a college degree.","score":287,"comments":[{"body":"You can partly blame HR managers for that. They can greatly narrow down the number of applicants by simply requiring a degree, making their job easier.","score":101,"comments":[]},{"body":"Literally a majority of office jobs in my experience, none require college level education and just need training on site\n\nSource: worked at multiple banks","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I'm one of those who went to trade school. There was costs involved but nothing like a full 4 year college. \n\nWas paid off within a year. Plenty of well paying job opportunities right after graduation. It's an option more people should look into.","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What should I do if there’s a rat in my house? Will a glue trap cut it and if so how many? Please help","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"I think a kill trap is more humane. Glue traps, ya know, they just stick there until they starve to death or whatever.","score":13,"comments":[{"body":"I haven’t ever encountered a rat before, then should I use that?","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Glue traps are awful.\n\nI have successfully used humane traps and then driven the rats far enough away that I can release them safely.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Don't purchase a glue trap unless you want to hear a rodent screaming in pain.  It's an exceptionally cruel way to kill rodents because it's slow and they suffer","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Reading the comments. I get you don’t want to kill animals. But rats especially in Cities like Chicago and New York (I’m from Chicago) should be killed and not let go. They destroy soo much money of buildings and multiply like crazy","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The best traps are snap traps, these can be reused and instantly kill the rat.  The first thing to do is establish where they frequent.  Droppings are the traditional way of doing this, but a better method is to use an ultraviolet light, sometimes called a black light.  Shine this in a dark room and urine trails will fluoresce.  \n\nLay the traps with bait, but without setting them for a few days.  Traps should be set perpendicular to the wall, with the food away from the wall.  This gives the rats time to get use to them.  Then set the traps, and listen for them to go off.  Removing dead rats should be done wearing gloves, since they can carry a variety of diseases.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Glue traps are cruel, you could try a kill trap or poisoned bait, or just get a cat.","score":3,"comments":[{"body":"Poison is a bad idea. They're likely to crawl behind something, or into a wall, where they die, and stink for a couple of weeks, at least..","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"There are traps that are metal cages with a spring door that if you load with bate will shut on any small rat that goes in the trap. Those cost more but are much more humane. \n\n&amp;#x200B;\n\nYou can release it after catching it and it will be someone else's problem.","score":3,"comments":[{"body":"In which stores are these traps found? And, what food do I place in if I were to get it??","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Is it worth going back to school?","not_safe_for_work":false,"locked":false,"body":"I’m think about going back to school although I already have a bachelors and a career. But my wife is in the science and research field and she has difficulty holding conversations about her work with me because I don’t know anything about chemistry or biology. I know that mitochondria is the powerhouse of the cell but our discussions usually stop there. So I was thinking about enrolling at the local community college for for a Biology class. But I was thinking how it would be if I’m in Lab I’m talking to my classmates and they’re like “so what are you going for?” and then I’m like “oh I’m just here for this one class….”\n\nIs it worth going back?","score":8,"comments":[{"body":"Get your wife to walk you through it.\n\nYou will learn more from her than any class. Also saves you money.\n\nWhile she is talking, write key words down and Google/YouTube them later...\n\nFor your particular reason, it is absolutely not worth going back for one class.\nNormally I would be all for education, but you will be better educated at home","score":12,"comments":[]},{"body":"Seems like overkill.\n\nPlenty of other ways to educate yourself","score":7,"comments":[]},{"body":"[Just watch some YouTube videos instead.](https://youtu.be/QnQe0xW_JY4) There's tons of stuff for biology and chemistry online.","score":4,"comments":[]},{"body":"There's absolutely nothing wrong with taking a course just to learn more about a topic! You can even see if the college would allow you to audit the course since you don't need the credits. \n\nBut also, check out Crash Course Biology if you'd rather learn from home - https://www.youtube.com/watch?v=QnQe0xW_JY4&amp;list=PL3EED4C1D684D3ADF","score":3,"comments":[]},{"body":"Fucking go for it! I was a dropout and went back to school in my mid thirties. It fucking ruled! School is fucking awesome! You, being smart and already having education is going to knock that shit out of the park! School, man! It is fucking awesome!\n\nAlso you get that knowledge and learn what the big words mean and it's just fucking awesome! I am coming up on five decades and I would love to go to more fucking school!\n\nSchool! It's the fucking shit!\n\nApologies for swearing but I really, really like school.","score":3,"comments":[]},{"body":"\"An investment in knowledge pays the best dividends''- Benjamin Franklin\n\nWhy not go for just one class? More education never hurt. I disagree with the others saying \"just have your wife explain it\" or \"just watch youtube\". While you don't need to attend an in person school and online options are available, you shouldn't have your wife explain everything to you as there are sure to be gaps in her knowledge + she probably won't enjoy being quizzed constantly on stuff. As for youtube, you're not looking to get a smattering of random information on the topic,  but a much fuller education on it. \n\nTaking a course give you structure and access to an educator well versed on the topic. Probably a good route to go","score":2,"comments":[]},{"body":"No, just research those topics on the internet","score":3,"comments":[{"body":"Dude, thats not even remotely close to an education in a subject.","score":2,"comments":[{"body":"All he needs to do is understand what his bae is saying, taking a whole ass class for that is overkill","score":2,"comments":[]}]}]},{"body":"You can watch youtube","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Why were scientists like Isaac Newton and Albert Einstein religious?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Isaac Newton is honestly more of a weird special case as he was *extremely* religious. \n\nBut for the most part it's for the same reason as why someone in any profession is religious. They were likely to be raised that way, and they felt it played an important part of their life and that it wasn't incompatible with their work and lifestyle.\n\nA lot of the European early scientists and philosophers were monks and priests - because they were one of the groups most likely to be literate.","score":11,"comments":[{"body":"&gt; A lot of the European early scientists and philosophers were monks and priests - because they were one of the groups most likely to be literate.\n\nIt's kind of a paradox that Christian monks became the custodians of pagan Greco-Roman literature, but they very much kept the tradition alive in an increasingly rural and illiterate Europe.\n\nIn case someone is curious about the history, this type of monasticism has its roots in a 5th century monk called Saint Benedict, just as the (Western) Roman Empire collapses.","score":2,"comments":[{"body":"The general views was that intellect and reason were God's gifts to man, placing us above animals; it wasn't the fault of pagans that they hadn't heard the word about Christ yet. As long as Aristotle's works didn't contradict orthodoxy, they were happy to extol his primacy.  \n\n(this varied but in general, a lot of medieval education worked on a 'primacy' system where one particular author had 'primacy', basically 'the last word' on anything. Aristotle had unquestioned primacy on many topics for many years)","score":2,"comments":[]}]}]},{"body":"Albert Einstein wasn’t religious.\n\nNewton was theistic but I wouldn’t say a traditional Christian for the time. He did live in a time where religion was a large part of society.","score":5,"comments":[]},{"body":"Lots of scientists are religious.  In fact, a lot of notable scientists(one that found the Big Bang Theory) were Catholic Priests.\n\nEDIT:  Words","score":4,"comments":[]},{"body":"A lot of major scientists throughout history were Christian, Jewish, Islamic, etc.\n\n In part, it was about trying to understand the Creator(God) through His creation and finding Him within that.","score":3,"comments":[]},{"body":"Science is about how and religion is about who so no conflict...one demands proof and the other demands belief.","score":3,"comments":[]},{"body":"Albert Einstein wasn't really religious and had lot of non-orthodox views on religion, his exact view were nuanced, as one could expect from a great mind. But that's beside the point. Many scientist feel no conflict between their scientific and religious views. To many, science is a process by which one glorifies god, marveling and studying creation.","score":2,"comments":[]},{"body":"Why wouldn't they be? A ton of scientific discoveries were funded and pushed by different major churches throughout history.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Would it have been unsafe for queen Elizabeth to tandem skydive during the 2012 Olympics opener?","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"Tandem skydiving is always dangerous.  Not VERY dangerous, but more than 99% of the time, it is more dangerous than not tandem skydiving.","score":4,"comments":[]},{"body":"Yes. She was old and fragile.","score":2,"comments":[{"body":"Lots of old and fragile people do tandems.  It's a bucket list thing, one of the most common ones.","score":3,"comments":[{"body":"Yup. But - the Queen? If something went wrong in 2012 with a guy who jumped into Normandy in 1944, people would be sad, but the world wouldn't change. The Queen, though - MAJOR problems. If there is a 0.001% chance of something going wrong, the safest option is not to do it.","score":2,"comments":[]}]}]},{"body":"She didn't tandem. She solo jumped. Didn't you see the [footage](https://www.youtube.com/watch?v=X3NNyZqY1yo)? ;)","score":1,"comments":[]}]},{"title":"What fictional bar would you like to have a drink in?","not_safe_for_work":false,"locked":false,"body":"","score":1697,"comments":[{"body":"Hi /u/UnstableNews,\n\nWe noticed you are a pretty new Reddit account, so we just wanted to let you know to check out the subreddit rules [here](https://www.reddit.com/r/NoStupidQuestions/wiki/rules) and maybe have a read through our [Frequently Asked Questions](https://www.reddit.com/r/NoStupidQuestions/wiki/index/faq) - they make for fascinating reading!\n\nWe're called No Stupid Questions because we believe nobody needs to be attacked for asking a question, but *that doesn't mean there are no rules!* This sub is meant for users like you to ask genuine questions. Please don't ask jokes or rants disguised as questions - that's not in the spirit of this sub. While you *can* ask almost anything here, please keep illegal and offensive questions elsewhere to give people a good experience here - and if you have a medical question, please ask your doctor, not us. \n\nOtherwise, welcome!   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoStupidQuestions) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Puzzles","score":150,"comments":[{"body":"Why’s it called puzzles?","score":70,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The restaurant at the end of the universe.\n\nEdit:\n\nCallahan's Place would also be a rip roarin good time","score":1826,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"VA-11 Hall-A. Cyberpunk always makes for a kind of bummer setting but most of the characters are cool and the drinks look CHOICE.","score":104,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The green dragon from LOTR followed by the prancing pony.","score":1084,"comments":[{"body":"Go to new Zealand and take the hobbiton tour! It comes with a beer at the green dragon 😁","score":115,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Paddy’s Pub","score":1036,"comments":[{"body":"Only one that’ll let you do pcp in the bathroom","score":309,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I have a pocketful of Paddy’s Dollars burning a hole in my pocket.","score":82,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"If a polygon approaches becoming a circle as it gains more and more sides, is there ever a point where it becomes a circle, or do the sides become infinitesimally smaller forever?","not_safe_for_work":false,"locked":false,"body":"","score":254,"comments":[{"body":"You’re describing a Riemann Sum type approach. And it can be very accurate. In fact integrals in calculus were derived using it. Basically when the divisons get small enough, the fact that they are divisons no longer matters. They have approximated the curve so closely that the difference in values calculated using the approximation are identical to those calculated with a circle.\n\nhttps://en.m.wikipedia.org/wiki/Riemann_sum","score":320,"comments":[{"body":"&gt; integrals in calculus were derived using it\n\nI see what you did there.","score":108,"comments":[{"body":"One day I hope to be smart enough to understand math jokes 🥹","score":87,"comments":[{"body":"Derivatives are an integral part of calculus.","score":109,"comments":[{"body":"You....you did it again...","score":35,"comments":[{"body":"At this point I can’t differentiate between what’s a joke and what’s not","score":48,"comments":[{"body":"Yeah people are integrating them into their comments pretty well","score":37,"comments":[{"body":"You can’t keep doing this guys, where’s the limit?","score":24,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It sounds like you're saying that at a certain point, it doesn't even matter how many sides you add because it's close enough to being a real circle? \n\nAlso this might be a stupid question but why is this important enough to have its own name? It sounds very fancy lol","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"You've worded your question VERY carefully.  I'm going to try to answer it in the same manner.\n\n\"Is there ever A POINT where it becomes a circle?\" - No.  To a mathematician, it will always be an n-gon, never a circle.  Because n can approach but never reach infinity.  This is the idea of a \"limit\" in calculus. \n\nBut practically speaking, with any real manufactured object, you'll reach a point where no difference could be measured by any device.  You'll eventually reach a point where there IS no difference because it deviates from a circle by less than the size of an atom.  But mathematicians don't care about the limits of the physical universe.  It's still not a circle.","score":89,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What’s the oldest curse word still in common use in the English language?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Shit. It’s one of the oldest words of any type.","score":2,"comments":[]}]},{"title":"To all the people who want to live till a 100 years; why?","not_safe_for_work":false,"locked":false,"body":"","score":111,"comments":[{"body":"I didn’t meet my wife until 40. We want a lifetime together.","score":319,"comments":[{"body":"Such a beautiful answer. To grow old together.","score":90,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I’m afraid to die","score":108,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My grandpa lived to a few months shy of 100, and always had something to look forward to: my uncle visiting on Thursday, my mum visiting on Tuesday, footy on the weekend (or cricket or tennis in summer). His grandchildren and great-grandchildren visited when they could.\n\nHe would have preferred to be mobile, but he was content with his life.\n\nWhy wouldn't I want that?","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Why not? If you're happy and healthy.","score":94,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"2100 is when the cool cybernetics come out. Gonna get me an extendo-arm.\n\nBut more seriously, if I can maintain good health? Why not? Virtue isn't going to pursue itself, I need to be alive to fulfill it.","score":173,"comments":[{"body":"Who knows what advancements will be coming 50+ years from now.  They might make serious ground in slowing down or slightly reversing aging, or using some sort of implant tech that can greatly improve the living conditions of the elderly.\n\nSo making it long enough might mean that things get a lot better for that age.  And if they can extend age after that, I just might live long enough to be able to do some space travel.  Then I can die happy.\n\nI'd rather live long enough for human contact with aliens, but considering that isn't likely to happen within a couple hundred years, I'll have to make due with hoping for some bad ass trips around Saturn or something.  Maybe some submarine adventure in the oceans of Europa.\n\nI know that likely isn't going to happen within 60 or 70 years, but the hope is that in 60 or 70 years my life can be extended long enough to the point where it *can* happen.","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I'd like to see as much of the technology and innovation that our incredible species is capable of as I can. Plus, if I ever have children/grand children, it'd be cool to be around for as many weddings/graduations/births as possible.","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I wanna be there during the first contact","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I'm terrified of death. Like unusually scared and don't know how to overcome that fear.","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Why do people typically hold a cigarette between the index and middle finger, but will hold a marijuana joint between the index finger and thumb?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"One benefit in places where it's less than legal is that having it between the thumb and index allows you to quickly conceal it in your hand.\n\nOf course that doesn't mask the smell but that's the downside of using stoner logic.","score":3,"comments":[]},{"body":"Just guessing here, but I think it might have to do with tobacco cigarettes are typically filtered, so there is plenty of room to hold the cigarette and there is no need to go to any extra effort.  On a joint, there is no filter and an additional motivation to hold it as close to the tip as possible so as to burn all of the marijuana.  (Thus the use of \"roach clips,\" too.)","score":2,"comments":[]},{"body":"People typically try to smike a joint down as far as possible trying not to waste any. A cig has a filter so you don't have to worry about that.  If you watch someone who rolls their own cigs they often times smoke it similar to those who smoke joints","score":1,"comments":[]},{"body":"Small joints tend to be hard to hold like a cigarette because of the gaps between fingers and the joint itself can get really hot for that sensitive skin from the smoke going through it during long tokes. Larger ones are usually held like cigarettes","score":1,"comments":[]},{"body":"1) A cigarette normally has a filter that avoids tobacco entering into your lungs, whereas a joint (most of time) doesn't, so you use your fingertips to hold it tight enough to avoid marihuana pieces getting inside you (this action is easier to perform between your thumb and index).\n\n2) Also, marihuana is hardest to burn compared to tobacco, so you need a more intense inhalation to provide oxygen for combustion (needing to hold it tighter to perform the same action as in 1)","score":1,"comments":[]},{"body":"This is not a real thing. You've been watching too many movies.\n\nEdit: the only real world application of this is trying to hide the cigarette in low light, but it honestly makes you look wayyy more suspicious.","score":-6,"comments":[{"body":"Nah, people do this in real life, at least that I’ve seen.","score":3,"comments":[{"body":"Then I would say it's just to do what's expected or what's seen as normal through the media that they have seen. Real stoners rarely If ever do this unironically.","score":0,"comments":[]}]}]},{"body":"It's also easier to pass.","score":0,"comments":[]}]},{"title":"Can you eat those large overgrown goldfish?","not_safe_for_work":false,"locked":false,"body":"I saw a picture of a caught goldfish that grew to be like 64 pounds and I was wondering if you could just fry that bad boy up and eat it","score":6,"comments":[{"body":"They're not overgrown, goldfish in nature grow their entire lives.\n\nAs to if they taste any good, no idea.","score":6,"comments":[]},{"body":"Yes, you can. With rare exception (polar bear livers, Japanese puffer fish, and more) most animals are safe to eat. Whether it would taste good is another question..","score":3,"comments":[{"body":"What's wrong with polar bear livers?","score":1,"comments":[{"body":"They are too high in some vitamin or other. It is A or D and I've forgotten which. It's one of those odd facts that you read when you're in high school and forget the exact details when you're 65+.","score":2,"comments":[{"body":"Well that sure is interesting. I figured it may be akin to the pufferfish aka the toxin route but being literally TOO nutritious was not what I expected. Thanks for sharing :)","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"you can eat anything if you believe enough.","score":3,"comments":[{"body":"i believe in this cause very much.","score":3,"comments":[]}]},{"body":"Kinda bony, but I guess you could.","score":3,"comments":[]},{"body":"Goldfish and koi are members of the carp family and are edible. Some species tend to be bony and thus aren’t good for the currently popular methods of cooking fish (broiling, frying).  But carp are commonly used for gefilte fish, a Jewish food made by grinding the fish with vegetables, matzo meal, and seasoning, and then boiling to cook.  By grinding and cooking for a long time, the bones become edible instead of being a nuisance n","score":2,"comments":[]},{"body":"They are members of the carp family, a fish traditionally eaten in Eastern Europe for centuries.  Carp is a traditional Christmas Eve dish.  It can be fried, but baking is more common.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How does an electric baseboard heater with built-in thermostat detects the temperature?","not_safe_for_work":false,"locked":false,"body":"When a baseboard use a thermostat mounted on the wall, I get it. Heater heats the room and once the thermostat detects the set temperature it stops the heater.\n\nWhat about built-in one? Wouldn't they stop almost immediately since they are much closer to the heater?","score":3,"comments":[]},{"title":"Why do anime have such long intros?","not_safe_for_work":false,"locked":false,"body":"Sometimes these things will run for like, a third of the episode's run time. I feel like western media's intros have become shorter and shorter, because people realized no one likes sitting through them. Do the Japanese just really like long anime intros?","score":3,"comments":[{"body":"One major part of this is that the companies producing the anime are partnered with music labels, and that they use the opening sequences to help advertise new artists, to make people want to buy the soundtrack and possibly future work by said artist.\n\nSo not only does it save money by reducing how much new animation needs to be made every week, but it also is a promotional material for the music label that the anime is being sponsored by.","score":3,"comments":[{"body":"Is this why they also change intro and outro every 5 episodes (e.g. Bleach)?","score":1,"comments":[{"body":"Yes.","score":1,"comments":[]}]}]},{"body":"To save on production time. The longer the intro is, the less they have to draw for the show.","score":1,"comments":[]},{"body":"I'm guessing that the directors do this so that the animation team has a good base to work off of in the future. \n\nPlus this is something that will go in every single episode. \n\nNaturally alot of work goes into it. So it's kind of indulgent on the animators part. \n\nWhich is fair.","score":1,"comments":[]},{"body":"So play the absolute banger of an intro song. Duh","score":1,"comments":[]},{"body":"Padding time.\n\nIt's why so many anime have long exposition dumps while the shot pans over a shocked expression or the backs of heads.\n\nIt's why so many animes recap.","score":1,"comments":[]},{"body":"&gt;because people realized no one likes sitting through them\n\nwhat kind of mutant","score":1,"comments":[]},{"body":"I don't want to gain-say any of the other reasons people are rightly or wrongly giving real answers, but rather I want to muse that live-action shows used to have decently long intros too:\n\n[Exibit A: The A Team](https://www.youtube.com/watch?v=_MVonyVSQoM)\n\n[Exibit B: Highlander season 4](https://www.youtube.com/watch?v=ypyvcfnu4Gg)\n\n[Exibit C: Too Many Cooks](https://www.youtube.com/watch?v=QrGrOK8oZG8)","score":0,"comments":[]}]},{"title":"What do I wear pants wise when it gets super cold?","not_safe_for_work":false,"locked":false,"body":"Yeah so I never really figured how how to dress for cold weather the right way. I mean pants wise, anyways. They just don’t seem to sell coats but for your legs. What kind of pants could I wear for cold weather? I’m a girl if this helps.","score":4,"comments":[{"body":"For say -20°C days it's a good idea to wear something under your pants like tights, thermals, really anything so long as it's comfortable","score":6,"comments":[]},{"body":"There are thermal leggings for men and for women.\n\nExample:  \nhttps://www.amazon.com/s?k=thermal+pants&amp;crid=1UZ2A1C15Z7IA&amp;sprefix=thermal+pants%2Caps%2C234&amp;ref=nb\\_sb\\_noss\\_1","score":5,"comments":[]},{"body":"Not sure if a guy or girl, but wearing sheer for girls under pants or long underwear for guys is really warm","score":4,"comments":[]},{"body":"Long Johns under your pants/jeans helps.  They also make fleece lined pants for the cold, Depending on you activities and how cold, ski/snow pants are like jackets for your legs.","score":4,"comments":[{"body":"Fleece or flannel lined pants are definitely the way to go. I don’t like doubling up layers. \n\nAlso the Buffalo check lined pants are cool to roll up the cuffs.","score":4,"comments":[]}]},{"body":"I'd pick up some insulated bibs if you're going to be outside in the cold for a long time. Otherwise, just long underwear under your pants.","score":4,"comments":[]},{"body":"I recommend long johns (long underwear) under your pants for the day to day. Another option is they sell lined pants. Think baggy jeans with a cozy fuzzy liner inside. I forgot to check if you were a he or a she or other so you'll need to figure out the style considerations thereof that are appropriate for you.\n\nIf you're going to be spending all day outside on a colder day (&lt; -10C) and/or going to be getting covered in snow and/or doing outdoor sports, I recommend snow pants. These are usually somewhat specialized to the activity you'll be doing and a bit of an investment so best to think about what you'll need those for. You don't need those for city living.","score":7,"comments":[]},{"body":"Fleece lined pants… aka sherpa lined","score":3,"comments":[]},{"body":"You can wear stockings under your pants.\n\nIf that doesn't appeal, you can go for long john's (long thermal underwear that goes down to your ankle).\n\nThat way, wear whatever pants you want as long as they're not skin tight I suppose.","score":2,"comments":[]},{"body":"long ones","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Blind, deaf, numb. But are there words for lack of smell and taste? If not, is it just that way in English?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"The lack of a sense of smell is called \"anosmia\".\n\nThe lack of a sense of taste is called \"ageusia\".","score":5,"comments":[{"body":"Pretty sure having anosmia means also having ageusia, due to how intricately linked the senses of smell and taste are (it's not necessarily the same in reverse).","score":1,"comments":[{"body":"With anosmia, you can still get sweet, sour, salt, bitter, umami, and heat, as well as texture, but nothing else.  But people with anosmia can often get a reasonable amount of pleasure out of food even without what I would consider \"flavor.\"\n\nIt is interesting, because my wife is a borderline supertaster with a poor sense of smell, and I am a low-taster with a excellent sense of smell.  (I am called a \"nontaster\", but that doesn't mean I don't taste things at all - it means there is a specific bitter chemical which I cannot perceive, and that trait is linked to low taste bud densities.)\n\nShe probably has a hundred times as many taste buds as I do; she relies on me to tell her when she needs to take a shower.","score":1,"comments":[]}]}]},{"body":"Americans lack taste.","score":-2,"comments":[]}]},{"title":"Do I just quit?","not_safe_for_work":false,"locked":false,"body":"Sorry if this is the wrong sub to post this, but all the other subs I’ve tried get no responses :(\n\nHere is a bit of background:\nI’m currently in a doctoral program for nursing, which I dived into right after earning my masters degree. This program’s requirements specifically said that nursing experience is recommended, but not required, before I applied. I signed up for and  attended optional meetings about the program before applying, emailed and spoke to people a part of the program, applied, and got admitted.\n\nAfter the program orientation, the director told me that I need to work for at least one year before I have what are known as “clinical rotations”, or else I would have to wait a year, work, gather the experience, and then begin classes again. This was not written anywhere, not told to anyone, but only said to me because I was an uncommon admission. All after solidifying my enrollment.\n\nI took this route because I wanted to avoid hospital RN nursing with my life (long story, won’t explain here). I am now forced to work as an RN for a year. My unit has been deteriorating my mental health like no other these past several months. I have broken down, called hotlines, and had many sleepless nights before shifts for the past few months. I just can’t keep working like this. I want to finish my doctorate but I don’t want to work as an RN on this unit anymore.\n\nIt seems unfair that these rules were imposed upon me specifically. I may have applied for something else /elsewhere if I had known this beforehand. I just want to quit this job so badly but I don’t know what to do. To say it causes me anxiety is an understatement.","score":3,"comments":[{"body":"How frustrating that you weren't told this upfront when you applied. If the program requires work experience, then that should be clearly stated, and not listed as optional. \n\nI'm curious though, what are you hoping to accomplish with a doctorate in nursing? It sounds like the traditional nursing job in a hospital is not for you, but what about other settings - school nurse, in home health, hospice, nursing home, VA, etc.? Could you work in one of those settings instead of a hospital (either to fulfil your work experience for the doctorate or just as a regular job)?","score":4,"comments":[{"body":"I want to do aesthetic/dermatology nursing, or work in a clinic. I’ve worked in clinic before and enjoy one-on-one patient interaction with more stable patients, along with greater freedom of being a provider (nurse practitioner).\n\nI could, but it has barely been 3 months since starting this job and I’m afraid or the consequences of quitting early. Also, I’ve been looking for aesthetic nursing jobs for appropriate experience but there are no openings. Clinics near me don’t want new grads. It’s all strange considering the nursing shortage, too.","score":1,"comments":[{"body":"I don't know enough about the world of nursing to offer advice, but maybe it's one of those things where you've got to start at the bottom, get your experience, and work your way up. Are you already a nurse practitioner, or would this degree give you that qualification?","score":1,"comments":[{"body":"I want to tell my program director that I shouldn’t be forced into doing this since it wasn’t stated anywhere else, and that it was clearly written on their site that experience was recommended but not required. Or else why accept me with no experience? But I’m afraid of imposing a negative appearance on her.\n\nThe doctorate would make me a NP. Generally it’s a “be hazed for a year at a hospital” before you’re able to get any other nursing job, but with how short the country is on nurses, it’s been much more lenient.","score":1,"comments":[]}]}]}]},{"body":"If possible, take a break in my opinion (check with the program to see if this is possible). Take some time to catch your breath and decide the next best step. Because no matter how much another person knows, only you can decide what's best for you.\n\nSomething to consider: if you wanted the doctorate to teach or do research, I imagine there are plenty of opportunities for that with a Masters. I also don't know the field that well, but nurses work plenty of places other than hospitals.","score":1,"comments":[{"body":"I can’t take a break :(. The school work is of no issue to me. This job is killing me. I want the doctorate to be a nurse practitioner, nothing research related, and I am able to teach with my master’s. I’m currently looking elsewhere for a job, but having worked only about 3 months at my current place, I am worried about the consequences of leaving a job this early on.","score":1,"comments":[]}]},{"body":"This is a bit confusing for me. Why would you need a PhD for aesthetician or clinical work? That seems like overkill. \n\nI’m not surprised that they are requiring real world experience as a working nurse in order to take advanced coursework or conduct research. \n\nThey should have stated this up front. On the other hand, you could have met with the program director beforehand to verify your plan.","score":0,"comments":[{"body":"It’s not a PhD, it’s a DNP. I’m currently a nurse. I need to be a nurse practitioner to be an independent healthcare provider rather than a nurse. I can do a variety of specialties with it, but I personally prefer aesthetics/derm. I’ve done much of the advanced coursework in my masters, they want hands on experience before doing my rotations in the hospital as an NP. Even though I don’t intend on ever working in a hospital setting.\n\nI asked pretty much everyone else beforehand; I had no way of contacting the director directly and I had trusted the application/program information pages, FAQs, the informative and optional admission/application meetings, and advisors of the program. I didn’t think I needed to add another layer of verification by asking the director directly, especially when the line of communication to her was obscured before my admission.","score":1,"comments":[]}]}]},{"title":"Why is there a sense of hesitation before stepping into a cold shower but once you do it, you feel just fine?","not_safe_for_work":false,"locked":false,"body":"Why is there a sense of hesitation before stepping into a cold shower but once you do it, you feel just fine?","score":4,"comments":[{"body":"It doesn’t feel fine once you step in in my opinion. The first seconds are hell, but you get used to it. \n\nFor the hesitation your body, your body doesn’t like the shock nor does it like the sudden change in temperature.","score":4,"comments":[]},{"body":"Why would you step into a cold shower? Wait for the water to warn up first. For things like pools and lake, you hesitate because you know the shift in temperature is unconfutable until your body acclimates.","score":2,"comments":[]},{"body":"Because you're getting ready to step into a cold shower","score":1,"comments":[]},{"body":"cuz its cold lol","score":1,"comments":[]},{"body":"We know many organisms, including humans,  can adjust their morphological, behavioral, physical, and/or biochemical traits to acclimatize to cold, but scientists still don’t really understand how or why it happens. Some swimmers specialize in cold water swimming, like crossing the English Channel. They will swim in icy water several times a week and also make a point of wearing lighter clothing, sleeping with windows open, and otherwise maintaining their comfort in cold.","score":1,"comments":[]}]},{"title":"Does an insurance company have an insurance company in the event of a big payout?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Yes they do it is called reinsurance and is very common.","score":6,"comments":[]},{"body":"Insurance-ception.","score":-1,"comments":[]}]},{"title":"Could farts change the air pressure in the space station?","not_safe_for_work":false,"locked":false,"body":"Okay, so hear me out.\n\nBeans. \n\nIf I eat a can of Bush’s Baked Beans, I’ll excrete roughly the same volume of solids and liquids, but I’ll also make lots of gas.  This is irrelevant on earth, but what about in space?\n\nLet’s put an astronaut on a theoretical all-bean diet.  Let’s station him on an equally theoretical space station that is designed under the assumption that air pressure is stable and doesn’t need careful monitoring - or at least a space station that doesn’t have a way to release any air to the outside if pressure builds.  Could our spaceman unwittingly increase the air pressure in his space station over time via farts?","score":3,"comments":[{"body":"Yeah. Anything that becomes a gas adds pressure. This means that *breathing* adds a bit of gas, at least until saturation where your breath fogs up, but at that point they'd have other issues.\n\nAny liquids that evaporate, any material that decomposes. Gas.","score":1,"comments":[{"body":"Okay, so what you’re saying is that it would build up pressure, right? To what extent? Assuming the space station doesn’t burst open and they don’t suffocate from a lack of breathable air, could they kill themselves by crushing their body under the atmospheric weight of their own flatulence?","score":1,"comments":[]}]},{"body":"No.  All that stuff is already there. Farting isn't adding new air.","score":-2,"comments":[{"body":"Mmm, maybe on an atomic level, but think about baking soda and vinegar. Matter can change states through chemical processes!","score":1,"comments":[]}]}]},{"title":"How do you manage doing anything after work? Like, seriously?","not_safe_for_work":false,"locked":false,"body":"Hello everyone, I hope you are doing well!\n\nPretty much the title.\n\nI work from 8 to 16 on weekdays and after I get home, I feel like I can't do anything. Absolutely zero.\nI have no motivation  to exercise. I'm in the process of learning a new language and it would be ideal if I could spend some time with studying every day not just weekends. I have no strenght left to do housework.\nWhen I finish work, all I can think of is going home, taking a nice, warm shower and get to bed/get in front of the computer and just finally be able to turn my brain off.\nSometimes I can get myself together and be productive at home, but it dies down very quickly.\n\nHave you ever been in this situation? If yes, what was the solution that worked for you? I'd just like to ask for advice, because at this point I just feel worthless.\n\nThanks in advance!!","score":78,"comments":[{"body":"I feel the same. There is a chance that healthier diet, vitamin suplemantation(especially d) and good sleep routine would help. But i haven't try it yet... As for exercise some people recommend doing it in the morning, before work. I know it helps a little, but fuck that. I sleep as long as possible... I also overuse alcohol and weed. I find my days better when sober yesterday. However i prever unsober evenings. Live is shit\n\nEdit: I'd like to thank \"A concerned redditor\" for reaching about me to reddit care resources. It's a good habit to try to help others. I am good, and if i ever feel worse I'll check some doc about it, thank you. Cheers =)\n\nEdit2:Also thanks for the badge symbol to this post. It gave me reddit premium? What does it do? I normally browse reddit on reddit is fun app so i think o don't see some features","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I stopped changing out of work clothes when I got home, only kicking off work-shoes to slip into tennis shoes, let the dogs out then right back outside myself for a neighborhood walk.  If I went in and settled in I was done for.  Then after the walk dig into dinner, dishes, pick stuff up around the house, get as much done before the glorious moment of settling in for comfy clothes, tv and rest.  I’m a morning person but I don’t get up early to do stuff around the house, just small things like taking care of pups and getting ready for the day.  You will find your rhythm but at first you do have to force yourself until it’s routine.","score":8,"comments":[{"body":"Same, as soon as ass hits cushion, all motivation is sucked away","score":2,"comments":[]}]},{"body":"Do the important stuff before the shower, it's really difficult to get stuff done after resting","score":19,"comments":[]},{"body":"Felt exactly the same for a long time.\n\nMy solution was to go to bed REALLY early, and then wake up very early. Now I do the things I want to do before I go to work instead. It's all in my head, i know. But i feel much less stress now. And it's really nice and quiet in the mornings. No phone ringing etc. :)","score":3,"comments":[{"body":"When do you go to bed &amp; wake up?","score":2,"comments":[]}]},{"body":"I'd say it depends on the job. If you're doing construction /building, of course you will be tired after work. But if you have an office job, it can be mentally hard on you.\nMaybe it's just a phase of you feeling exhausted, maybe you just need to adjust to the job? Or is it a sudden lack or drop of energy? Then it could be health-related and might be worth to make a doctor's/therapist's appointment. How are your coworkers treating you? How's your boss behaving towards you? How's your work environment in general? \n\nHere's something I experienced about energy:\nI worked in hospitality and after my shift, I wanted to lock myself in my room and never come out again. Then I changed the field and it was a bit better. Another change led to another improvement. Now I have a job I enjoy, my work has a purpose, which has always been very important to me, and afterwards I still have the energy for other projects. \n\nTherefore I'd say, if the job drains all energy from you - without being health related-, it might be not the right thing for you to do? Work should be something you're at least a little bit passionate about, something that makes you feel good.\nThough I know that's easier said than done! Especially since it is hard to find a profession with an adequate salary in a field you love.\n\nBut don't give up! It might take some time, but if you invest in it, means solving health related issues, mental problems, probably even changing work etc., you will find a profession you like and you will have enough energy afterwards! Wishing you the best and good luck","score":8,"comments":[]},{"body":"Force yourself to not cool down before the adult shit has been done.   \n\n\nI'm the same as you are, I just force myself to not be a slob. Before I take a shower and chill, I clean, wash and so on.   \n\n\nThe trick is: Just fucking do what youre supposed to be doing. There is no secret. Just do the stuff you have to do. It doesnt take \"energy\" as much as you make it out to be. Just fucking start doing your chores before you chill. \n\nAND: If you start doing it every day, the amount of stuff you have to do becomes smaller and smaller.","score":8,"comments":[]},{"body":"8 to 16 as in 0800 to 1600 or 8AM to 4PM in freedom time? /s That's only a third of your day!\n\nIf you mean 8 to 16 hours, 16 hours is rough and no, you're not getting anything done after a shift like that, but you shouldn't work too many of those in succession.\n\nI work 13 hour shifts and I'm really not worth a shit between them for anything but sleep, since I devote a couple hours to getting ready, with travel time and eating, I really don't have time for anything. I don't even get online between shifts.\n\nGotta manage days off.","score":2,"comments":[]},{"body":"Sounds dumb, but I just do it. Right from work to gym, going home first is dangerous. Need groceries? Do it while on my way back. Then cook and after everything is done I have free time. Routine is very important.\n\nI don't have much free time on weekdays, but I'm still feeling super good.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Is 'I'm pooping poop' a valid sentence?","not_safe_for_work":false,"locked":false,"body":"'Pooping' as in the act of excretion of poop. 'Poop' as in the physical poop.","score":3,"comments":[{"body":"Yes. It's a valid sentence, but it's a shitty one. The verb 'pooping' implies the object 'poop' which makes the latter unnecessary. Often writing tries to avoid such redundancy and literary diarrhea. Brevity is the soul of wit.","score":4,"comments":[{"body":"I saw what you did there","score":1,"comments":[]}]},{"body":"It's a grammatically correct sentence. It's not a valid sentence for me at this moment.","score":3,"comments":[]},{"body":"It's correct, if that's what you mean. subject/verb/object","score":3,"comments":[]},{"body":"Some might say it's the only valid sentence.","score":1,"comments":[]},{"body":"I mean, how come you can drink a drink but not food a food?","score":1,"comments":[]},{"body":"Depends what you mean by valid. \n\nSyntactically, it's certainly *more* valid than e.g. \"Poop pooping I'm\" would be. \n\nHowever, Merriam-Webster says that \"poop\" is an intransitive verb, which means it cannot take an object. \n\nOn the other hand, I don't think Merriam-Webster's claim is 100% accurate: people do sometimes say \"I'm pooping blood,\" in which \"poop\" is used as a transitive verb with \"blood\" as the direct object. \n\nSo, I guess I would say that \"I'm pooping poop\" is technically grammatical, but unidiomatic (i.e. something that speakers, by convention, do not say, even if they technically *could*), and semantically weird. I'm not sure it qualifies as semantically anomalous, since it has a clear meaning and is not an oxymoron. I think it's just that you need a very specific pragmatic (i.e. conversational / real-world) context in order for \"I'm pooping poop\" to be felicitous (i.e. pragmatically acceptable). Normally you wouldn't say \"I'm pooping poop,\" because what else would you be pooping? But if you had recently pooped blood, like just blood with no poop, and then the next time you pooped, it was just normal poop with no blood, and someone asked for an update on your poop (\"Are you still pooping blood?\"), then you might respond, \"No, I'm pooping poop.\" \n\n(Never let it be said that I'm not using my linguistics degree...)","score":1,"comments":[]},{"body":"&gt;Im pooping poop.\n\nNo shit.","score":1,"comments":[]}]},{"title":"Everyone talks about low intelligence in adults. But what are some signs of low intelligence in children, from toddlers to teenagers?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Someone once said something very insightful to me about child development. \n\nIt went something like \"you can't tell by looking at an adult that it took them an extra year to learn how to read as a child.\"","score":7,"comments":[{"body":"what a savage ass burn","score":2,"comments":[]}]},{"body":"Not meeting developmental milestones","score":3,"comments":[]},{"body":"Lack of curiosity.","score":4,"comments":[]},{"body":"Intelligence is relative, especially in children.  They develop at different rates and like adults can excel in different areas.  My 9 yr old struggled with reading for the first few years of school and goes back and forth with math, but could school most high school students on earth science and astronomy.  Personally I feel like the best indicator of low intelligence in anyone, not just children, is the lack of discernable progress, or the lack of a desire to continue to improve.  If someone just stops growing, or shows no drive to grow, in my experience that's usually a dead give away that they aren't very bright.","score":2,"comments":[]},{"body":"Everyone talks about this? Huh. I'm not sure I believe that","score":1,"comments":[]},{"body":"I struggle to find a reason to put the label of \"low intelligence\" on a child.","score":1,"comments":[{"body":"To provide academic assistance, improve accessibility, and provide tailored therapeutic support. To help parents know what additional support or alternative techniques would be useful to provide to children. To let the government know to whom to provide benefits when those children become low-IQ adults.","score":1,"comments":[]}]},{"body":"Eating crayons","score":0,"comments":[{"body":"Did they lower the age to join the marines?","score":4,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Muslims and lower back problems?","not_safe_for_work":false,"locked":false,"body":"Does the 5x daily prayer help prevent lower back pain?  Statistically?  \n\nCould that be part of the original intent? \n\nOr is this a truly stupid question?","score":6,"comments":[{"body":"If done right, focused on breathing, focused on where the pain is, and gently stretching then yes. Of course everybody's back injury is different, for some people it would greatly help and for others it could potentially make it worse. But generally speaking slow, gentle, stretches along with focused breathing usually help.","score":6,"comments":[]},{"body":"There has also been similar comparisons with the politically incorrect term \"3rd world squat\" that you see often in other parts of the world where they have less back problems.   \n\nAnd in America/Western countries they do this less, and are less able to do the Deep Squat exercises, and  yes we suffer from a lower back pain epidemic.","score":2,"comments":[]}]},{"title":"How should I complement someone who has lost weight?","not_safe_for_work":false,"locked":false,"body":"For context, I am male. The person is a female colleague. They have started working out and obviously trying very hard to lose weight. They have made passing comments about hoping people would notice, but I don’t want to come off as creepy.","score":7,"comments":[{"body":"Just \"you're looking well!\".","score":12,"comments":[{"body":"Feels a bit more sickness or mood/energy related to me. 🤷‍♂️","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"A casual, passing, \"Hey, you're looking great\" is all you  need. They'll know.","score":11,"comments":[]},{"body":"“Have you lost weight?”","score":5,"comments":[{"body":"Then what? …wow, you look really good?","score":1,"comments":[{"body":"Nah, ask about their workout routine, diet, etc.","score":5,"comments":[]},{"body":"Yes.  People like to be recognized for their accomplishments. Your coworker is making a concerted effort to lose weight, so recognizing that is polite.\n\nDon't go to far, though. \"Wow, you look really good\" is one thing, making passes or flirting is still inappropriate","score":2,"comments":[]}]}]},{"body":"You could wait for them to mention something like \"I'm not eating that because ___,\" and say something like \"You've been working hard, that's really awesome!\"","score":4,"comments":[]},{"body":"If office-wide knowledge that she's trying to lose weight and she's dropped hints at hoping people notice then telling her she's doing a great job with it wouldn't be creepy.","score":2,"comments":[]},{"body":"Something like \"all your work is paying off, good job\" may be ok I don't know. I'm the opposite. Even if I loose weight, I would like people to talk to me about anything but it xD","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Was Dennis Nedry \"totally unappreciated\" in his time?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"Yes but deservedly so.","score":4,"comments":[{"body":"I request elaboration:\n\nWere his skills as valuable as he said? As of that timeframe. Running the park with minimal staff, \"debugging two million lines of code,\" etc\n\nClearly he had his issues, and he made bad choices to put it lightly. \n\nMaybe he would have received the compensation he claimed he deserved if he wasn't such a Newman?","score":1,"comments":[]}]},{"body":"Well Hammond spared no expense so if anything he either took the job with low pay and could’ve asked for more- or he was fairly compensated but got greedy when Ingen recruited him for corporate espionage","score":2,"comments":[{"body":"That's fair but I was/ am hoping to still hear from the tech wizards of the time to gain better context for his arguments, you know?\n\nI'd like to better understand his complaints about his genius within the context of his hardware/ capabilities","score":1,"comments":[]}]}]},{"title":"Why is Portugal so much poorer than the rest of Western Europe?","not_safe_for_work":false,"locked":false,"body":"Portugal, despite being a western European country with no history of USSR/Communist or Ottoman control, is astonishingly underdeveloped compared to the rest of western Europe to the point where it's [become a meme among Europeans that they're actually an Eastern European country](https://old.reddit.com/r/PORTUGALCYKABLYAT/new/).\n\nWhat I've never understood is: what is the actual historic reason behind this? The only explanations I can find for Portugal's relative lack of development is \"corruption\" and \"bad management\", but what led to this culture of mismanagement? I know they had a dictatorship in the 20th century that suppressed education, but so did their neighbors Spain, and Spain is doing significantly better than them now. Was Portugal this poor prior to the dictatorship as well?","score":7,"comments":[{"body":"All the Mediterranean states have awful bureaucracies and shit-tier economic policies","score":1,"comments":[]},{"body":"Yes, the reason is corruption and bad management. And that is, in turn, because of the dictatorship.\n\nIn Spain's case, while there were no personal or political freedoms, the regime made an effort to vitalize the country, especially after WWII when the rest of Europe was returning to democracy and starting to get their economies running again.\n\nIn Portugal, Salazar, the dictator, had a different strategy and kept isolating the country from foreign influences, always putting an effort in keeping the country stagnated and focused on the three tenets - God, nation, family. You might recognize tenets like these from whenever you have a backward regime. Salazar's regime kept the people poor and badly educated. Even though Spain and Portugal left their fascist regimes with only one year in difference, Portugal was in much worse shape.\n\nConsequence of that is that the adults of today, my parents generation, were raised by parents who never knew a regime who valued meritocracy. That meant that, for my parents' generation, whoever had parents in good positions, kept those positions and whoever worked in the fields only had a future of working in the fields. That means that most of the politics of today have their positions because their parents lived good lives during the regime while the rest of the population doesn't really see them someone who's worthy of trust. The percentage of people who don't show up to vote is 50%. Add the percentage of people who value the right to vote, but vote blank, and you have close 60% of people who don't trust the political class or just don't care.\n\nAlso, another factor is the entrance in the European Union. Like I said, Portugal was behind the other countries by a lot. So when we joined the European Union, we went from not having anything to having pretty much everything in a very short period of time. So, my parents' generation, who grew up without anything, now had access to everything which leads to excesses and bad management. Most adults don't know how to manage their own lives.\n\nMy generation is the first who grew in a more stable environment and therefore might change the country for the better. However, the ones in power are taking their sweet time screwing things up more than they already were (unfortunately, this is not happening only in Portugal. Pretty much every other democratic country is going through this. We just start from a worse position).\n\nAll in all, we're not \"astonishingly underdeveloped\" country. We have one of the biggest investments in renewable energy (albeit you'll have to consider our small size), our science institutes and universities are some of the best in the world. All throughout our history we were never able to rule ourselves neither did we let anyone else rule us (looking at you Spain and France), so that's part of the charm I guess 😅. At least, these are my thoughts. I hope I helped a bit","score":1,"comments":[{"body":"Well put and thought out. I'd also like to point out that the Portugese drug model was the worlds first to decriminalize addicts and possession. Frontrunner in realising struggling humans are still humans","score":2,"comments":[{"body":"I knew it was one of the first, but had no idea it had been the first.\nAnd even if we're a traditionally Christian country (Portugal and Spain were founded on the back of the Christian Reconquista), there are several measures that make me proud to be Portuguese like rights for LGTBQ people and for women which even the more religious part of the population agree with. We're still far from ideal, but either on par or ahead of other countries.","score":1,"comments":[]}]}]},{"body":"PIGS\n\nPortugal \n\nItaly \n\nGreece\n\nSpain \n\n\nhttps://en.wikipedia.org/wiki/PIGS_(economics)","score":0,"comments":[]}]},{"title":"I have a question about teeth and how people keep them so white and ‘perfect’","not_safe_for_work":false,"locked":false,"body":"Long story short, I live in a well off area in MA. I’ve noticed that A LOT of people around here have these really white and damn near perfect looking teeth… I’m impressed and a bit jealous.\n\nWhat does it cost to get something like this done? Do I go to the dentist or some other specialist? And what is the procedure called?\n\nI have no idea what this is like, but I REALLY want to know.","score":5,"comments":[{"body":"Dentists do teeth whitening.","score":4,"comments":[{"body":"And teeth straightening/moving/adjusting? Or would I need to go to an orthodontist?","score":1,"comments":[{"body":"just talk to a dentist, theyll tell you","score":3,"comments":[]},{"body":"That is done with braces. Two years of suck for straight teeth.","score":2,"comments":[]}]}]},{"body":"They are cosmetic procedures. \n\nStraightening is done with braces, or now things like invisalign and night-time retainers.    Teeth rarely grow that straight, so people apply some mechanical help.  \n\nI've seen quotes for a set similar to the invisalign system - 10 sets of clear braces that you wear for about a month apiece for about $600 or so.  It can vary a lot depending on how much correction you need/want, and how much \"do it yourself\" you do, and how much professional help you want to help make the initial molds.  \nI'm in Jersey, near NYC so there is some competition here.  The \"best\" orthodontists will cost 3-5 times that easily. \n\nWhitening is similar.  You can buy the DIY kits online or at pharmacies.  But, you need to be very careful.  Our enamel is rarely pure white.  It's normally off-white, and/or a bit yellow.   It's also thin and doesn't grow back. \nAny chemical, any abrasive or other technique used to remove stains and bleach the enamel can also damage and wear some enamel away.    \n If the enamel gets too thin, it gets translucent and looks more yellow - the living dentin below it makes it look even more yellow.  It's also going to be more sensitive then.  \nDentists can use professional techniques, and they can see what they are doing easier.  They can avoid some damage that way.  \nDamage can still happen, and then dentists can apply veneers or caps over the yellow/damaged teeth.  \n\nCosts vary a lot, and insurance isn't going to cover anything cosmetic like this.","score":3,"comments":[{"body":"A lot of people these days have veneers, but after seeing how they are installed to your teeth, I wouldn't want that done, and they are super expensive and delicate.","score":4,"comments":[]}]},{"body":"Yes. Go to the dentist. They are very aware of this popular trend and offer many types of treatments and plans to anyone interested.   Sometimes they may offer payment plans. \n \nEven Crest whitening strips works so well nowadays if you want to get a head start on things.","score":2,"comments":[]}]},{"title":"How do average people in big cities live?","not_safe_for_work":false,"locked":false,"body":"LA and NYC are gigantic and it seems like everyone’s rent is $3,000 but there are still a lot of people there working in gas stations and grocery stores and coffee shops. \n\nDo people live with like 5 other roommates? Do they have long commutes to these jobs? If they live in less-expensive neighborhoods, how have those neighborhoods not been priced out already?","score":6,"comments":[{"body":"there are 2 different classes. the impoverished class have access to section 8 housing, where they're given free or low cost rent.\n\nmost other people do the 5 roommates in their 20s until their job starts paying real money and they and their spouse qualify for a loan on an apartment.","score":4,"comments":[{"body":"A loan for an apartment wtf is the world coming to. \n\nPeople are borrowing money to rent now?","score":1,"comments":[{"body":"no, you're purchasing the right to use the apartment, so you pay a mortgage instead of rent, and the mortgage doesn't go up.\n\nusually you have to pay building fees in addition to the mortgage, and the building fees will gradually go up over time as prices increase, but they're not going to go up several hundreds of dollars every year. it's just the cost of trash, maintenance, and sometimes water and electricity.","score":1,"comments":[]},{"body":"Think they meant like owning a condo","score":1,"comments":[]}]}]},{"body":"There are cheaper places but its all crazy expensive. Theres a dude doing shorts/reels all about it","score":1,"comments":[]},{"body":"I live near London with my gf. Her flat is paid for by the government because we're both on benefits. Even if we had jobs we'd barely be able to afford it otherwise, I don't know what help we'd get from the government if we could work","score":1,"comments":[]},{"body":"They get paid more for their equivalent jobs than in other areas and they live in the shittiest, impoverished parts of the city.","score":1,"comments":[]}]},{"title":"How do I become more social and funny?","not_safe_for_work":false,"locked":false,"body":"I remember, pre-Covid, when I was funny and had a whole group of friends, and I was genuinely happy. But when Covid hit and schools were shut down, I didn't think to stay connected with my friends like my sisters did. Instead, I lost contact with them and just played video games all day. I forgot how to be social and how to talk with people I don't know. I forgot how to make friends. I haven't lost my sense of humor, but I have lost my ability to share that sense of humor with other people. For instance, when my friends make jokes, I can only laugh back at it and I can't add in my own funny remarks. Whenever I'm with other people, my mind blanks and my sense of humor vanishes. When I'm with my sisters or just thinking to myself, my sense of humor blooms and I can get everyone laughing. How do I fix this? How do I become social and funny again?","score":3,"comments":[{"body":"Take your time, start with just one or two people you really trust to be open around. I’m sorry you are struggling with this, but eventually things will get better. Don’t be afraid to ask your parents if you can see a therapist. Therapy isn’t for “crazy”, its to help people develop tools and strategies for living well.","score":1,"comments":[]}]},{"title":"Is it weird for a girl to ask a guy out?","not_safe_for_work":false,"locked":false,"body":"My friend said it is because that’s usually a thing the man does.. and he might feel embarrassed that a girl is doing it. \n\nWhat are yours guys thoughts\n\nEdit: thanks everyone that’s an overwhelming no","score":14,"comments":[{"body":"It is out of the ordinary, basically because of people like your friend,  but it is welcome.","score":25,"comments":[{"body":"Very welcome.","score":6,"comments":[]}]},{"body":"No. In fact, I prefer it. I'd say that more women should start doing it.","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Uncommon, but not weird.  Actually, it's pretty refreshing.","score":9,"comments":[]},{"body":"No, and that's something that should be more normalized.\n\nIf a man took offense to being asked out, it's good to know that up front, since he probably has other strong opinions on gender roles that would get in the way of a healthy relationship.","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No","score":7,"comments":[]},{"body":"It’s fine.","score":6,"comments":[]},{"body":"Only if it was 30+ years ago when it wasn’t the norm…","score":5,"comments":[]},{"body":"&gt;Is it weird for a girl to ask a guy out?\n\nI do not see why it would be","score":4,"comments":[]},{"body":"Its whatever makes you happy, not some weird social rules","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"question on eyes","not_safe_for_work":false,"locked":false,"body":"So I have strained eyes from too much screen. I had heard that cold compresses help alleviates the issue. However , when I try one it kind of makes it worst? Like my eyes suddenly become bloodshot. Am I doing something wrong here? I don't use ice directly and instead wrap it around three layers of tissues.","score":2,"comments":[]},{"title":"Why do people sometimes survive falling off buildings, but die after falling down a set of stairs?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"Gods choice","score":1,"comments":[]}]},{"title":"Why would someone want a vin number?","not_safe_for_work":false,"locked":false,"body":"This morning i was at walgreens. I was at the checkout line when i looked out and saw some guy looking at bottom of my windshield and writing something on a notebook. I went outside and he was gone but i looked at the spot he was looking at and my vin number happened to be there. \n\nNo he was not a cop which would maybe explain it for a parking ticket or something. \n\nHe left nothing on the car, no damage or sign he was ever there. Dash cam got him looking at the vin, writing it down and leaving. Didnt even touch the car, look inside or try to open the doors which mightve explained trying to steal something but no\n\nAs far as i know vin numbers dont have any value like ssn or credit cards right? Simply a sort of serial number. \n\nEdit: i didnt see him look at any other car. If it matters it a 2018 camaro, not terribly expensive but worth a few dollars. I thought it might be a \"look it up now, steal it later\" scam he didnt leave a tracker on it or anything","score":10,"comments":[{"body":"he probably has a similar car with no records and plans to use your VIN to register it","score":14,"comments":[{"body":"Register with who? DMV? idk about other states but whej I registered mine they checked my vin everywhere that it matched (engine bay, windshield, doors, trunk)","score":7,"comments":[]}]},{"body":"Might be the repo man","score":10,"comments":[{"body":"Never took out a loan on it.","score":6,"comments":[{"body":"Yeah but someone who has a car that looks just like yours probably did. VIN would be a good way to make sure it was the right car.","score":11,"comments":[{"body":"I feel like it was a repo man as well looking for a different car.","score":7,"comments":[]}]}]}]},{"body":"Nah. VIN numbers don't have any interesting personal information.\n\nYour license plate is more interesting from that perspective.\n\nSeems super weird.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A couple of reasons. Here is a website with some details. I would answer myself but this is what I would say so 🤷🏻‍♀️.[Vin number safety](https://carbrain.com/blog/is-it-safe-to-give-out-my-vin)","score":6,"comments":[]},{"body":"Could potentially look for parts for a similiar car. Potentially they could use it to figure out who the vehicle is registered to but they could do that with plates if they had access to that information. Could also be used to look up things like blue book value etc. But no, they won't steal your identity with a Vin number.","score":4,"comments":[]},{"body":"Some shadier dealrships have been known to scout parking lots for certain vehicles that have recalls on them. They then turn that vin# into the manufacturer saying they did the recall work to get paid. Usually that recall is a few years old and they figure you won't take it in to be fixed. Then you don't find out until the problem actually happens.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Is there any evidence that reality is any different from our dreams?","not_safe_for_work":false,"locked":false,"body":"We call reality real and our dreams fake but is there any evidence that reality is any different from dreams? If we can feel pain and anxiety in our dreams how do we know that our feeling pain and anxiety in real life is any different?","score":2,"comments":[{"body":"Yes, thermodynamics","score":1,"comments":[{"body":"Can you elaborate?","score":1,"comments":[]}]},{"body":"Yeah, physics.","score":1,"comments":[{"body":"How do we know that physics aren’t just a rule we created in our dream reality scape?","score":1,"comments":[]}]},{"body":"No","score":0,"comments":[]}]},{"title":"Why does Reddit put a limit on the number of redditors you can block?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"What’s the limit?","score":3,"comments":[{"body":"I’m not sure, but I’ve reached it. I try to manage my feed by blocking certain posters that post certain things very frequently. I created another account just to see if I could block with it, and it works fine. I reached out to Reddit support to ask them but I haven’t got a response yet","score":2,"comments":[]}]}]},{"title":"Are detectives in San Francisco still called Inspectors?","not_safe_for_work":false,"locked":false,"body":"I just watched the movie Zodiac and was wondering if this is still a thing.","score":2,"comments":[]},{"title":"My car key is just a turn key, can I go somewhere to get it turned into a button key?","not_safe_for_work":false,"locked":false,"body":"I don't mind spending a bit to get the button, especially if I could turn on the heat from a distance, too","score":2,"comments":[{"body":"To have that installed would likely be more than the car is worth","score":3,"comments":[]},{"body":"I’d recommend against it. Years ago a vendor offered that to our dealership, to say it worked reliably would be generous.","score":1,"comments":[]},{"body":"There are after market kits that do a remote start for most every vehicle. It comes with its own remote and will start the car from a distance.  In the US, the big box stores sell and install them. I bet there are some on Amazon that you can install yourself. It will plug into the ignition circuit up under the dash.","score":1,"comments":[]}]},{"title":"Why are England and Wales separate in the world cup but not States in the US?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"Because the unites states is one country. Wales and England are different countries. Technically.","score":5,"comments":[]},{"body":" I'm on a few hours of sleep here so sorry if this is incorrect or doesn't make sense. But from my understanding it's like this. \n\nEngland and Wales are two different nations within an union, the United Kingdom. The individual states of the US are not seperate nations. A nation, is a tightly-knit group of people which share a common culture. The cultural differences in the US aren't between individuals states but are more regional. England, Wales, Scotland, and Ireland all have their own seperate history, culture, language, etc.","score":2,"comments":[{"body":"And if someone tries to go there and say \"but they're all under England though\", they aren't going to be seen very favorably.\n\nA lot of times we tend to instinctively treat \"nation\" and \"country\" as synonyms, but they really aren't.","score":1,"comments":[]}]},{"body":"England and Wales are two different countries","score":1,"comments":[]},{"body":"The U.S. had a war to prove that states can’t secede. Wales, like Scotland and Northern Ireland, can secede from the U.K. They are countries in a voluntary union.","score":1,"comments":[]},{"body":"The UK developed modern soccer.  International soccer tournaments started as a game between British countries.","score":0,"comments":[]}]},{"title":"Am I the only one who genuinely doesn’t enjoy when company is over?","not_safe_for_work":false,"locked":false,"body":"It’s extremely overwhelming, as well as draining. I always feel like being home is where you’re meant to recharge and when people are over, it’s impossible to do so.","score":16,"comments":[{"body":"That's just being an introvert and you are definitely not the only one","score":15,"comments":[{"body":"Being an introvert does NOT mean you don't like being around people at all.","score":1,"comments":[{"body":"True But being around people and having people at your home is not the same thing necessarily","score":8,"comments":[{"body":"True.  I'm an introvert and I love hosting personally. I much prefer it to going out to a noisy bar or restaurant with people.","score":3,"comments":[]}]},{"body":"That's not what OP asked though. They said having company over is overwhelming and draining. That's basically the definition of being an introvert","score":3,"comments":[{"body":"Introverts are not incapable and unhappy with basic interaction. Yall just have social issues.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"You're an introvert. Welcome to the club. I'd say we should chat sometime, but thats not what us introverts do. Have a nice life tho.","score":4,"comments":[]},{"body":"I love having people over, but preparing for it is pretty hard.","score":2,"comments":[]},{"body":"People can be exhausting, no doubt. Learn your [Myers Briggs](https://www.16personalities.com/free-personality-test) personality type. Answer how you truly are, not how you wish you were, and you'll learn a lot about yourself. We all have our strengths and weaknesses. No matter who you are, there are others like you.","score":1,"comments":[{"body":"Try phrenology and get a horoscope too.","score":5,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Can an undercover cop be accidentally arrested by a regular cop?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"It happens alot actually.","score":5,"comments":[]},{"body":"I remember hearing not too long ago there was a shootout in Detroit and everyone involved was either a cop or an undercover cop","score":5,"comments":[{"body":"There was a big lawsuit/criminal case in St. Louis when a cop who was under cover at a police brutality protest ended up getting badly beaten by other cops.","score":4,"comments":[]},{"body":"Do undercover cops just miss intentionally with their guns and pray they dont get hit by the return fire?","score":1,"comments":[{"body":"I mean, real undercover cops are working on very big cases. Like they aren't looking to bring down a small time dealer they're ultimately looking for traffickers and it can take years to infiltrate gangs and such. Things like murdering a few people are considered collateral damage in order to get a big fish","score":1,"comments":[]}]}]},{"body":"Yes","score":2,"comments":[]},{"body":"Sure, especially if they're from different departments and the undercover guy's trying to keep his cover though most of the time it doesn't get that far when one call will solve the problem.","score":1,"comments":[]},{"body":"I can't make this recommendation without it obviously being a major spoiler, but \"To Live and Die in L.A.\", with a younger version of the guy from CSI.","score":1,"comments":[]}]},{"title":"When you’re interviewing for a job, the interviewer generally asks if you have any questions at the end. What are your favorite to ask?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"Is there anything I said that you'd like me to clarify?","score":5,"comments":[]},{"body":"I always ask them about worker retention and turn over","score":6,"comments":[]},{"body":"Where have you been all of my life?","score":3,"comments":[]},{"body":"\"If you could change one thing about your job or this organization, what would it be and why?\"\n\nOften during interviews, the interviewer will tend to portray their company in a positive light.  This question is basically a polite way of asking the interviewer to name a negative aspect of working there.","score":3,"comments":[]},{"body":"Sir what THE FUCK went in your head when you decided to wear that today?","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What kind of career building opportunities does your company provide? Or, how do you invest in your employees? \n\nI went on two separate interviews and got offers from both. One had a long list of company paid coding courses. The other one expected I learn their language of choice on my own time.","score":2,"comments":[]},{"body":"What is the salary (if it hasn’t been stated yet) and what room for growth is there for me.","score":1,"comments":[]},{"body":"What do you like about working here?","score":1,"comments":[]},{"body":"What are you looking for this hire to bring to the team?","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Dead deer question","not_safe_for_work":false,"locked":false,"body":"I see dead deer on the side of the roads and highways where I live all the time. They’re never *on* the road, though, they’re always right next to the road in the grass. \n\nWhy aren’t they ever on the road? Does the impact of being hit make them fly over to the grass? Are good samaritans getting out of their cars and moving them off the road?","score":3,"comments":[{"body":"Usually highway patrol or the DOT will move them so that they're not obstructing the road; in some states it's even legal to take it home if you hit it from what I've heard","score":5,"comments":[]},{"body":"Running over a dead deer would really mess up your car. People are moving them.","score":4,"comments":[]},{"body":"They usually get hit while darting across the road, not while standing still. \nOnce they are hit, they will stumble the last few steps in the direction they were going anyway. \nPeople aren’t usually hitting deer at a velocity that sends them flying.","score":3,"comments":[{"body":"My 1 experience says otherwise. I smashed that bastard.","score":1,"comments":[]}]},{"body":"If they stay on the road, the carcass doesn’t stay in one piece for long.","score":3,"comments":[{"body":"Truth. They make big slimy red smears.","score":1,"comments":[]}]},{"body":"Some people will move deer carcasses off the road before calling for removal. Dead deer in the road are a safety hazard.","score":3,"comments":[{"body":"So are live ones. ;-)","score":3,"comments":[]}]},{"body":"People just move them.  It not really any different than if there was a tree limb, or mattress in the road people just drag it off to the side so people don't run over the object amd have an accident","score":1,"comments":[]},{"body":"Those deaths weren't instantaneous 😔","score":1,"comments":[]}]},{"title":"why is it dehydrated not underhydrated","not_safe_for_work":false,"locked":false,"body":"Because we aren't trying to dry ourselves out but keep ourselves hydrated?","score":10,"comments":[{"body":"they can be used synonymously in most context","score":2,"comments":[]},{"body":"Hydrated is the natural state.  We lose moisture over time,  thus dehydrated. Underhydrated technically makes sense but it frames it as though hydration was a state we need to reach all the time instead of one we are trying to avoid falling out of.","score":1,"comments":[{"body":"But if we are trying to keep a state of hydration wouldn't it be underhydrated?","score":1,"comments":[{"body":"No, because underhydration is a state in which inadequate water has been added, not a state in which water has been removed.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Dehydrated sounds better","score":1,"comments":[]},{"body":"Because English speakers like to use Latin origins instead of Germanic when creating professional and high class words.","score":1,"comments":[]},{"body":"Under- as a prefix means “not enough,” “below,” or “less important”, while de- as a prefix means “from” or “off”. When something is dehydrated water has been removed from it. DEHYDRATE is therefore the more appropriate construction.\n\nI’ve never heard anyone use “underhydrate” before but given the above it would mean that something hasn’t received enough water to begin with, which does not describe dehydration as accurately.","score":1,"comments":[{"body":"Yeah but we're constantly adding water so.... Underhydrated?","score":1,"comments":[{"body":"In what context are we constantly adding water? I don’t add water to my beef jerky or my raisins, both of which are dehydrated. If you’re referring to a living being then that being has an optimal hydration state and when the being is “underhydrated” it’s because it “dehydrated”.\n\nOr, why are we constantly adding water? Because the thing has dehydrated. It’s not that “underhydrated” isn’t descriptive of the state, it’s that dehydrated is a more accurate description of the state because it includes more information about the state.\n\nAlso not everything that is dehydrated is underhydrated. A raisin (again), for example, is perfectly hydrated despite being dehydrated.","score":1,"comments":[{"body":"But almost all foods have some moisture not all almost all wouldn't that be adding hydration?","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Have there been any countries in history where immigration (not including invading armies) had a negative impact on the country?","not_safe_for_work":false,"locked":false,"body":"","score":1515,"comments":[{"body":"Texas.\nIt was Mexican, it had a population problem, so to settle it they invited American settlers. Americans wouldn't stop migrating there so they closed the borders to keep them out. American immigrants inside and outside Texas got mad and started encroaching anyways which sparked a civil war where they seceeded, kicked out many of the native spanish, and were annexed by the USA. This was a factor that lead to the Mexican-American war.\n\nBritian was settled by Saxons who were invited by the Romano-British for protection after Rome pulled out of England. It started with a single Island and within a generation the mass scale of immigration (The entire Angle tribe, many of the Saxons, and a large number of Jutes) resulted in the Anglo-Saxons taking over the Romano-British territories entirely.\n\nEdit; Mexican-American war, not Spanish-American war","score":2062,"comments":[{"body":"Mexican-American War. The Spanish-American war was about a half century later and was nominally over a boat that the Spanish may or may not have actually blown up but in reality was about the fact that America really wanted control of the strategically placed islands south of Florida that Spain still owned.\n\nAnd also Cuba but that didn’t work out for the US as planned.","score":210,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Wait what, that story about Texas is crazy. Is that legit? Never heard about it in my history classes (w-europe). It blows my mind because the US tries to keep Mexicans out while in reality Texas was actually from Mexico..??","score":402,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"At the end of WWII, many nazis came to south of Brazil, now it's the most racist and homophobic zone of the country","score":998,"comments":[{"body":"Apparently confederates went down there too after the civil war","score":287,"comments":[{"body":"I was going to ask for the sauce, but then realized I could just Google that shiz.\n\nhttps://en.m.wikipedia.org/wiki/Confederados\n\nI was not expecting that.","score":145,"comments":[{"body":"\"Be the sauce you want to see in the world\"","score":48,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Western Samoa has seen an influx of Chinese coming in, buying up land and trying to take over.  If they hadn't elected a new president, it would have put them in debt hell.","score":252,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The Native Inhabitants of the Aztec, Inca, and other North American nations were not able to deal with the European immigrants carrying disease, even those that weren't aggressively trying to harm them.","score":533,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"\"straight\" and into big cock.","not_safe_for_work":true,"locked":false,"body":"My fiance recently starting a sexting service to help with  pay bills and Christmas presents, long story short like 70% of these clients are men who love talking about \"fat cock\" but swear up and down they're straight. Is this just classic repression or is there like some sorta fetish at play?","score":3,"comments":[{"body":"LMFAO. Nah. They ain’t straight.","score":2,"comments":[]},{"body":"It depends on what they're saying doesn't it? If they keep mentioning big cocks to her, it's probably just because they are treating her like a common whore. Asking if she loves to fuck them etc. If they're insisting that they want to see big cock, that might be something different. \n\nEither way, sucks about your eventually-going-to-leave you wife.","score":3,"comments":[]},{"body":"It’s definitely a Thing. There are “straight” men on grindr too. I think it’s partially denial. Partially bisexual erasure. There’s also this misconception that all queer men act and look a specific way, and men who don’t match that think that somehow means they’re not queer.","score":1,"comments":[]},{"body":"Probably a bit of a fetish. After all unless men watch exclusively lesbian porn, they are watching to see a dick in a mouth/pussy/arse. most porn is of the straight variety and there sure aren’t many little cocks in that.","score":1,"comments":[]},{"body":"They forsure aren't straight 🤣","score":0,"comments":[]}]},{"title":"What would happen if a child got separated from their parents and ended up going on the wrong plane?","not_safe_for_work":false,"locked":false,"body":"I'm thinking of Home Alone 2 where Kevin ends up in New York whilst his parents are in Florida. What would happen if it occurred in real life? Would the authorities get involved or would the child be left to their own devices as seen in the film?","score":3,"comments":[{"body":"How would the kid get on a plane without a boarding pass for that flight and a passport?","score":4,"comments":[{"body":"Pre-2001 was a fucking wild era","score":4,"comments":[]}]},{"body":"These days his ticket wouldn’t scan correctly for the plane and no one would just ‘wave him through’ without a look at or scan of the boarding pass.","score":4,"comments":[]},{"body":"Authorities would get involved. The parents might possibly get in trouble","score":3,"comments":[]},{"body":"Things are a lot more secure now. In 1985 two boys from Dublin, aged 10 and 13, both made it to New York, escaping authorities in three countries. They started in Ireland, managed to get a boat to Britain, a train to London and then onto a plane to New York. They made their way through by saying things like their parents were behind them a bit with the tickets. They got let through. Nowadays that would not happen, so your scenario would be difficult to happen. If it did, the authorities would eventually find out and get involved.","score":3,"comments":[]},{"body":"Radios on airplanes are a thing.","score":2,"comments":[]}]},{"title":"Why does this happen?","not_safe_for_work":false,"locked":false,"body":"Why do I get tired after eating? This has never happened before like I can eat a whole ass pizza and I can be still energized but now if I eat some small food I get tired and I can’t find a reason? \n\nEdit 1: I exercise mostly everyday","score":2,"comments":[{"body":"Lmao. Metabolism is a bitch.","score":3,"comments":[]},{"body":"The older you get the more common this will get","score":2,"comments":[{"body":"But I’m just 14:(","score":2,"comments":[{"body":"Definitely ask a doctor about it. Could be a range of things from anxiety and depression to a thyroid issue. I wouldn't be too stressed, but eating a full, healthy diet is important.","score":1,"comments":[]}]}]},{"body":"Sometimes it means you're eating too much. Sometimes you're eating too many carbs.","score":1,"comments":[]}]},{"title":"Do holidays feel kind of empty/dead now?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"That’s an opinion that wildly varies from person to person. I know people who go all out for that shit but I couldn’t care less","score":2,"comments":[{"body":"I used to not care. Like, I'm an orphan so yeah. I did not give a crap about any holiday. Even my bday.  Then I met my husband and now I get excited. He goes all out and it's fun to be around it.","score":2,"comments":[]}]},{"body":"They have for a while now. It's nice to have time off and spend it with people you care about, but the overly-commercial holiday hype in all the shops doesn't do a lot to induce the holiday spirit in my opinion.","score":2,"comments":[]},{"body":"Not to me.\n\nAny idea why you might feel this way?","score":1,"comments":[{"body":"It started w/ Easter (nobody celebrated it) then Halloween (same thing) now Thanksgiving is shaping to be the same.","score":1,"comments":[{"body":"We dont celebrate Thanksgiving where I am, but Halloween (which we also don’t really ‘celebrate’) had decorations up and the shopping centre had their normal ‘Trick or Treat’ and costume events.\n\nChristmas is shaping up to be relatively normal this year for us too","score":1,"comments":[]}]}]},{"body":"No, but it's because my family's had to adapt to changing conditions, and modify or create new traditions that are more meaningful to us.","score":1,"comments":[]},{"body":"They kinda always have been.","score":1,"comments":[]}]},{"title":"What can I give my GF who's got a bad flu?","not_safe_for_work":false,"locked":false,"body":"She caught a bad flu today. I want to help her, to show her I care, but I have no idea what can be useful in this situation. I can only think of soup, but I have no time to cook that sadly.\n\nI already gave her a packet of cough drops, but that was yesterday when she only had a sore throat. Today she is much worse.\n\nI thought about tea, but her father already makes her tea at home. Also, she doesn't have a runny nose anymore so tissues are unnecessary. I just want to find something that could make her happy. Should I just give her candy?","score":2,"comments":[{"body":"Can do candy or about anything she wants, soup is a good idea. Ask her though, she may be good on everything and just knowing you are worried and that want to help may be enough. What she needs most of all is rest though.","score":3,"comments":[]},{"body":"Gatorade\n\nWarm socks\n\nHeated throw blanket","score":3,"comments":[]},{"body":"Naproxen sodium, warm blanket, cold water, time alone (or maybe time together depending on mood).","score":1,"comments":[]},{"body":"If she lives with parents, they’re probably taking care of her.\n\nShe’d probably enjoy a coloring book or cute nail art (decals) kit. Something to pass the time.","score":1,"comments":[]},{"body":"A box of chocolates, a bouquet of flowers, and maybe some congestion relief medicine","score":1,"comments":[]}]},{"title":"Why aren't duck eggs as popular as chicken eggs?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Hi /u/birdslooklikefruits,\n\nWe noticed you are a pretty new Reddit account, so we just wanted to let you know to check out the subreddit rules [here](https://www.reddit.com/r/NoStupidQuestions/wiki/rules) and maybe have a read through our [Frequently Asked Questions](https://www.reddit.com/r/NoStupidQuestions/wiki/index/faq) - they make for fascinating reading!\n\nWe're called No Stupid Questions because we believe nobody needs to be attacked for asking a question, but *that doesn't mean there are no rules!* This sub is meant for users like you to ask genuine questions. Please don't ask jokes or rants disguised as questions - that's not in the spirit of this sub. While you *can* ask almost anything here, please keep illegal and offensive questions elsewhere to give people a good experience here - and if you have a medical question, please ask your doctor, not us. \n\nOtherwise, welcome!   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoStupidQuestions) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"I will say price, very few supermarkets carry them here in UK, it's not common, not many adverts, yet duck eggs are much better.","score":2,"comments":[{"body":"Similar here in the parts of the US I've been to; a sort of vicious circle:\n\nless demand = higher price and less availability = less demand","score":2,"comments":[]}]},{"body":"It must be more expensive to raise ducks","score":2,"comments":[]},{"body":"Few minutes research and the answer is inconclusive. They lay roughly the same, one egg per day. Ducks laying 2 to 3 years where chickens typically only lay 1.5 to 2 years before dropping off production.\n\nI suspect the semiaquatic nature of ducks may make them more expensive to rear, and I'm unsure of the feed to gain ratio which I suspect chickens may be more efficient at.","score":2,"comments":[]},{"body":"Duck eggs have a stronger flavor. \n\nMore popular foods tend to be more mildly flavored. Like American lagers. They're more popular because no one can find them objectionable. There are plenty of beers with tons more flavor, but the extra flavor just segments the market. A lot of people will complain that it's a bit bland... but they'll still drink it.","score":2,"comments":[]},{"body":"They taste funny and are strange colors - for the average consumer","score":1,"comments":[]}]},{"title":"Why do lime/lemon pair well with mint but orange and mint so repulsive?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Mint stops your ability to taste sweetness, so the orange tastes sour.  You expect lemons and limes to be sour,.so it doesn't seem as uncanny.","score":2,"comments":[]}]},{"title":"What to expect from wedding planning?","not_safe_for_work":false,"locked":false,"body":"I 33f and my fiancee 29m have decided to get married in August. I unfortunately know nothing about wedding planning so any tips or help would be appreciated.","score":2,"comments":[{"body":"r/weddingplanning at your service.","score":2,"comments":[]},{"body":"You and your fiancée should have a conversation about what you really want in your wedding.  What would be meaningful to you?  Do you care if you light a unity candle or do a bouquet toss?  Once you’ve nailed down your “must-haves” as a couple you can negotiate everything else.  Don’t feel like you have to cross off everything off of someone else’s recommended checklist, or you will end up stressed out and deeply in debt.","score":2,"comments":[{"body":"We have already talked about going to couples counseling and getting the license before the actual wedding. The ceremony would be at my mother in laws house in her backyard. So we have a few things already talked out, but this is a little more food for thought, thanks.","score":1,"comments":[]}]},{"body":"Most people I know just got a wedding planner.","score":1,"comments":[]},{"body":"If you go through a service, they will try to convince you to get each and every thing, usually the most expensive option, because they are trying to squeeze money out of you. Weddings are usually already expensive so you may not be really thinking about how much you're spending on the \"little things\". Do you have anyone personal you can ask about their own experience?","score":1,"comments":[{"body":"My mother in law will be helping with planning but she was mentioning colors and I'm just confused. I honestly don't know anything about picking colors or why you would need to if that makes sense.","score":1,"comments":[{"body":"Wedding colors are an important first step because that is usually how couples determine the colors for dresses, flowers, invitations, decorations, etc.  You can just do black and white if you want, but it’s just easier if you want everything to match.","score":1,"comments":[]},{"body":"So, for colors, if you have bridesmaids, you will be selecting the color(s) they wear, as well as the dress style.  You'll also be selecting centerpieces for your reception tables, maybe tablecloths, napkins, and so much more.  I would suggest that you look on Pinterest for so many options, then narrow down what you like, based on your budget.  \n\nYou may want to pick up a few bridal magazines and planning books, to get an idea.  \n\nIf you've been to a wedding and reception, thing about the venue, the official, the rings, the clothing, the time of year, the time of day, outside or inside?  Destination wedding or one near your home? How many guests? Each one of those,and so many more, were decisions made by the couple, or whoever paid for the wedding.","score":1,"comments":[]}]}]}]},{"title":"Why does my cupboard creak at night?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"Stairs in my house creak at night. I suspect it is due to house warming up in day and cooling down at night which causes expansion and contraction.","score":2,"comments":[{"body":"Interesting thanks. The floorboards in my old house did that too.","score":1,"comments":[]}]},{"body":"[deleted]","score":2,"comments":[{"body":"Def not mice but thanks.","score":1,"comments":[]}]}]},{"title":"Polar bears are starving. Can one's dying will be to have their body fed to wild polar bears?","not_safe_for_work":false,"locked":false,"body":"I know the risk is \"what if they get a taste for human meat\" but let's face it starving polar bears are already the most dangerous animal to any living human unlucky enough to encounter them.\n\nThe way I see it, if it became a trend to \"donate\" ones body to animals who's food sources we've decimated (just as we can currently opt to donate our organs to medical science),  would that help the species survival at all? There is certainly no shortage of human bodies at any given time.","score":2,"comments":[{"body":"Umm well they aren't extinct so they must be doing something right, probably not necessary. No one is stopping you from feeding yourself to polar bears though?","score":2,"comments":[]},{"body":"Preserving your body long enough and also shipping it thousands of miles to find a polar bear to give it to is probably doing more harm than giving a polar bear a meal.","score":2,"comments":[]},{"body":"this...isnt the dumbest idea Ive ever heard.\n\nbetter than rotting in some box in the ground. the issue is, the amount of fuel used to transport a body or bodies to a polar bear's habitat would probably just cause more damage to the environment and their ecosystem. \n\nbut im in support of this because its funny.","score":1,"comments":[]},{"body":"Impractical. For the effort we could get them some fish. Either way, that won't sustain a population with your plan.","score":1,"comments":[]},{"body":"Polar bears are one of (possibly the only) animal to intentionally stalk, hunt and kill humans. They've already got the taste for human flesh. \n\nAlso, in the same documentary I saw that told the above information, also said they were brown bears that just evolved/adapted to life in the Arctic, nearly genetically identical.  As extreme northern climates warm, brown bears will migrate up that way. Essentially replacing their cousins (closer to siblings maybe?)","score":1,"comments":[]}]},{"title":"Honest Questions do First Nation Americans celebrate Christopher Columbas Day and Thanksgiving, stuff like that? (Stupid Aussie)","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"We did.  Once.","score":4,"comments":[]},{"body":"Many of them will take advantage of having that day off, but most don't find any special meaning in a holiday that can often be a harsh reminder of the past.","score":1,"comments":[]}]},{"title":"What does the Bible say about self-defense?","not_safe_for_work":false,"locked":false,"body":"Like, if someone were to attack you, what kind of responses does the Bible say you can do?","score":4,"comments":[{"body":"Depends in what part. You should either turn the other cheek, or you should take them to court, or you should extract an eye for an eye, or you shouldwait several generations and then wipe out their descendantsn or you should forgive them 70x7 times.\n\nLike many items, it doesn't have one clear answer.","score":7,"comments":[]},{"body":"Doesn’t matter, it’ll probably be misinterpreted anyways","score":6,"comments":[]},{"body":"There are non-violent ways to defend yourself. Paul was a Roman citizen, and would say so in order to defend himself. There are other stories of victims seeking legal justice.\n\nThe admonition “turn the other cheek” doesn’t require absolute pacifism. It’s more about letting personal slights and insults go. It’s a response to a slap, not a sword.\n\nJesus himself drove moneylenders out of the Temple with a “scourge of small cords” — hardly a pacifist act.\n\nJesus did not raise an army to rebel against Rome, and discouraged others from doing so. And he famously admonished Peter when he tried to defend Jesus with a sword. But at the same time he wasn’t afraid of conflict when he thought the cause was just. \n\nIndeed, he was crucified because he created conflict — and I’m not talking about the moneylenders. He was preaching radical ideas.","score":5,"comments":[]},{"body":"None shall hurt others","score":2,"comments":[]},{"body":"I ain’t a killer but don’t push me","score":2,"comments":[]},{"body":"The opposite of Self-defence is stated. Turn the other Cheek.","score":2,"comments":[{"body":"But in the Bible it also supports a eye for an eye. So self defense is probably fine as long as you don’t go beyond what’s necessary.\n\nLev. 24:19–21","score":3,"comments":[{"body":"JC kinda invalidated the old covenant \n\n&gt; Ye have heard that it hath been said, An eye for an eye, and a tooth for a tooth: But I say unto you, That ye resist not evil: but whosoever shall smite thee on thy right cheek, turn to him the other also.","score":7,"comments":[]}]}]}]},{"title":"Can you build muscle by just flexing?","not_safe_for_work":false,"locked":false,"body":"can you build muscle by just flexing really hard, rather than by subjecting it to actual force? (like lifting weights)","score":29,"comments":[{"body":"Check out Charles Atlas and his Dynamic Tension method: https://en.wikipedia.org/wiki/Dynamic_Tension","score":16,"comments":[]},{"body":"Absolutely. My entire life I've flexed my butt muscles to fall asleep at night. I know that sounds weird, some people tap a foot some people do whatever, I flex my butt muscles to rock me to sleep. Anyways, my butt is literal dump truck compared to everybody else in my family, and anybody I know my size. I 100% contribute this to spending 10 to 20 minutes a night flexing my butt muscles before I pass out.\n\n\nEdit: Oh wow! Thanks for the awards lol, I do realize this is a goofy comment, but it is 100% true I promise!","score":52,"comments":[{"body":"Patrick the star sleep ritual","score":26,"comments":[]},{"body":"This is the single weidest comment I've ever read. I wish I could give you a reward, but fuck if I'mma spent money on pointless karma. \n\nYou sir are one weird dude. Flex on and prosper.","score":7,"comments":[]},{"body":"Gonna need proof on this one or it never happened….\n\nScience you know !","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"How many people flexed their butt after this comment?  Raises hand.","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"It's not the most efficient way to do it. It would be like digging a massive hole in the ground using a kitchen fork. What you might achieve through years of flexing, you could do it in a few months at the gym (or wherever else you want to workout) with the right program and diet.","score":11,"comments":[{"body":"Isometrics are a real way to work out my guy, and actually achieve far more then you would initially assume. I got a bum leg, and was able to keep it from deteriorating while having to walk with a cane, using almost only isometrics (massive range of motion issues, so full range workouts weren't an option)","score":5,"comments":[]}]},{"body":"You totally can. I don't know why people are saying no.","score":21,"comments":[{"body":"It's actually a wonderful supplement to lifting. Flexing in between sets increases the time under tension which causes for a large growth stimulus. The reason we see so much growth doing slow and controlled reps while lifting is because of the time under tension and intensity variables (the same things you would experience by flexing).","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Have you really forgiven someone if your still angry at them?","not_safe_for_work":false,"locked":false,"body":"A person has done me wrong, a person very close to me and someone that although I feel this intense anger towards them, I want to move on and continue my time with them. They have apologised and are giving me space, and have acknowledged my anger and hurt. But as much as I want to still be with them and feel as if that’s the right thing to do, I can’t help but still feel resentment and a scar in our relationship that I don’t feel like will go away anytime soon (from my end).\n\nSo my question is, have I actually forgiven them? Do I just need more time? And what should I do if I can’t forgive and forget?\n\nI understand this is a warped and hard to answer question, but even just general answers would be appreciated.","score":2,"comments":[{"body":"Resentment isn't forgiveness. It also might be completely justified. I don't think everything should always be forgiven","score":2,"comments":[{"body":"Do you think I should be honest about the resentment and just continue our relationship as is?","score":1,"comments":[{"body":"That's something only you know","score":1,"comments":[]}]}]},{"body":"You can forgive and not forget. Your feelings are your feelings and valid. Maybe some time apart from this person or very low contact for while will help you sort out your feelings. Forgiveness don't rebuild the trust you have in the person who wronged you. Make them earn your trust back before letting them back into your life.","score":2,"comments":[]}]},{"title":"Shipping an acrylic painting on cardstock overseas","not_safe_for_work":false,"locked":false,"body":"All of the art subs I know seem to be art sharing only, so idk where to actually ask this. \n\nI'm making an acrylic painting on the back of a letter for a friend that I'm sending overseas, so it'll be in shipping for at least a month. It's painted on cardstock and has writing/decor on the other side so I'd rather not fold it. I was just going to put it in a light weight parcel at the post office with bubble wrap to protect the paint, but I'm unsure if that or putting it in a lamented sleeve and a cardboard envelope would be better. Or if something else entirely is more ideal. \n\nIt's relatively thin layers of paint, in some places there's multiple layers but it's very thin overall and minimal texture. I just don't want it to rehydrate and smear or chip from being rolled/folded for the shipping process.","score":2,"comments":[{"body":"I mean if I wanted to ship something and make sure it doesn’t get folded I would either use slot of layers of cardboard to form an envelope or even get like some wood cut larger than the item and use that to prevent it from getting folded.","score":2,"comments":[]}]},{"title":"How do we know aliens didn’t come to earth a long time ago and just leave for some reason?","not_safe_for_work":false,"locked":false,"body":"Now answered","score":22,"comments":[{"body":"Proving a negative is impossible. That's why religion and conspiracy theories exist.","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"We don't.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Well, as others above said, obviously there is no solid tangible proof. \n\nBut interestingly, given the insane vastness of the Universe, and assuming there is at least one highly hyper-advanced civilization in our galaxy, it's perfectly possible and plausible that a visiting alien anthropologist, posing as a genetic human, walks among us right now. \n\nSuch a thing would be technological child's play for a civilization millions of years more advanced than us to pull off. \n\nHeck... That person might even be reading this post of yours! Maybe you've even met them?! \n\nMaybe it's me! 👾 👽 📡","score":31,"comments":[{"body":"Here is the thing about \"hyper advanced civilization.\" we also don't have any way to know where we rank on the hierarchy of that.\n\nWe could be the most advanced life forms in the universe right now. We could be the oldest for all we know. We don't really have a way to know one way or another.\n\nOne of the big unanswered things we have is what galactic conditions are acceptable for life. We've made some headway with this. We know our planetary conditions can generally sustain life, we know there is a goldilocks zone for life relative to a star, that is, a distance away from the star based on that stars apparent level of energy output from a star of a certain size on that planet of a certain size is roughly equivalent to to the energy our star's apparent energy output on our planet such that it could sustain life as we knownit. The planets orbit also can't be too eccentric. Otherwise, it could pass too close or too far away from its parent star. \n\nBut we also don't know what other conditions can result in life or which conditions are best, which conditions lead to faster evolution, what observations can be made in nature under different conditions regarding everything from planetary composition to size of star, variation of conditions in that system etc. And how that affects a civilizations ability to derive knowledge through observation as opposed to theory and calculation. For instance, what if in a certain solar system, their abundant and advanced life evolved in conditions where temperatures for super conductivity could occur at their room temperature. That civilization might advance far more rapidly in knowledge and understanding of certain things..\n\nThere is a very deep rabbit hole to go down regarding these questions of life and civilization in the universe","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"\"Space is big. You just won't believe how vastly, hugely, mind-bogglingly big it is. I mean, you may think it's a long way down the road to the chemist's, but that's just peanuts to space.\" Given that observation from DNA, why come all that way just to say 'meh' is and leave?","score":4,"comments":[{"body":"\"They find some poor, unsuspecting soul, whom nobody's ever going to believe, and then strut up and down in front of them wearing silly antennae on their heads and making 'meep, meep' noises. Ahahahaha!\n\nRather childish really.\"","score":3,"comments":[]}]},{"body":"We don't. And you'll never be able to proof that either, because they could have just left no traces of their visit.\n\nWhat we do know is that all the ancient sites supposedly built by aliens, because they are to complex for humans to build, were in fact perfectly feasable for humans with ancient levels of technology and any alien involvement, while possible was as unneccessary as alien involvment in the creation of a sports stadium today.\n\nDid aliens secretly use anti-gravitanional beams to position the steel to build the Melbourne cricket stadium.\n\nIt's POSSIBLE. It probably was humans in cranes though. Humans put steel beams in place with cranes all the time, I see no reason to believe it was aliens in Melbourne.\n\nAnd for the same reason it probably wasn't aliens in ancient egypt either.","score":15,"comments":[{"body":"So aliens built the Melbourne cricket stadium? I'll make sure to post that on Facebook to get the word out","score":12,"comments":[]}]},{"body":"No don’t know that, but we have no reason to think that’s the case, either.","score":4,"comments":[]},{"body":"If they were here, they didn't leave any evidence of it so it would be hard to prove or disprove that something like that happened.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"If we redistributed the wealth of billionaires to increase wages, how would that fix the people who are in poverty?","not_safe_for_work":false,"locked":false,"body":"Since you can't eat money, money is inherently valueless. If the 4 trillion dollars of wealth that the top 400 people possess were redistributed to everyone else, would that not just cause inflation? I'm not against wealth distribution, I'm just trying to find the answer.","score":16,"comments":[{"body":"Nobody in the USA has $4 trillion liquid.\n\nMost billionaires leverage their options for a low interest yearly loan.\n\nIf they all exercised their options and ate withdrawal fees and penalties every publicly traded company would crash and food/rent/everything would be unaffordable if not flat out unavailable. It would be chaos. Saudi dollar wouldn’t exist, wages would become stagnant or non existent, crime would be a necessary tool of survival. Shit would get real real.","score":11,"comments":[{"body":"&gt;Nobody in the USA has $4 trillion liquid.\n\n[Well... almost nobody.](https://media.cnn.com/api/v1/images/stellar/prod/171102165157-jerome-powell-11-02-2017.jpg?q=w_3183,h_2122,x_0,y_0,c_fill)","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"What people forget is that the US government spends TRILLIONS of dollars EVERY year.  A one time use of all of the money of billionaires (90ish % of which is tied up in stocks and company assets, so turning it into cash would liquidate countless businesses and end countless jobs, but that’s besides the point) would do nothing that the US government can’t already do with the insane amount of wealth they collect from taxes each year.  It’s pointless to talk about redistributing money from billionaires (partially because they don’t have it as cash anyways) when the US government has far far far FAR more money, LIQUID money, that never finds its way back to the tax payers.  I know this isn’t a direct answer to your question, and I’m not some bootlicker who loves billionaires (in fact I think most are shitheads who hate this country and hate it’s people), but I feel like this is an important point to be made.  Tens of billions of dollars are sent to OTHER countries every single year, not to mention all the money that goes towards corrupt officials in this country as well as their pet projects and “foundations”.  The wealth of individuals, and even companies, is nothing in comparison to that of the government.","score":7,"comments":[]},{"body":"We all buy bread. We do not all buy yachts for other people. \n\nBasically some costs would increase a little across the board, but payment of those costs would be spread across the entire population as opposed to whoever is currently working for a billionaire without a fair share of their profits.","score":12,"comments":[]},{"body":"&gt; Since you can't eat money, money is inherently valueless. \n\nYou can use the money to buy food, and then eat the food. \n\n&gt; would that not just cause inflation? \n\nNo, not necessarily. You are just redistributing money, it is not like you are pulling them out of nothing. \n\nIn practice moves like that tends to lead to a bit of inflation, but not anywhere near the level where the beneficiaries don't become better of. Its like your wage doubles, and prices increase by 5%.","score":16,"comments":[{"body":"It can also lead to deflation for some things if your markets become more active and people can start more businesses and compete.\n\nDestroying monopolies &amp; redistributing wealth and power can lead to freer markets and make supply chains healthier.","score":7,"comments":[{"body":"&gt; your markets become more active and people can start more businesses and compete.\n\nThat usually leads to inflation rather than deflation, thankfully.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Redistribute how? Do you mean to liquidate all of their assets and put the money in circulation? That would cause an economic crash because they represent a big chunk of industry.\n\nIf you mean to tax them to oblivion, it will result in much the same outcome, because then they will sell and close their own companies and deposit the money in banks outside of governamental reach.\n\nIf you mean to confiscate their money, they will not have billions. Millions, maybe, which is not a lot for 300 mil people, assuming you talk about US.","score":3,"comments":[]},{"body":"Take the money, use it to buy food, homes, clothes, education, health care, and transportation","score":3,"comments":[{"body":"Yeah, I think people hear \"redistribute\" and think putting money in almost 400 million people's pockets rather than using it to fund essential programs, resources and infrastructure. Thanks for saying this.","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Should you stop using electronics 90 minutes before bedtime even if you have a blue light filter in the glasses?","not_safe_for_work":false,"locked":false,"body":"Does the general rule of not using phones, TVs etc. 90 minutes before bedtime apply even if you have glasses with blue light filters or turn on the phones yellow layer?","score":6,"comments":[{"body":"It’s not just the light that can disturb your sleep, it’s the activity. Listening to music or even watching a relaxing, non-distressing show isn’t as bad as actively scrolling or browsing or watching or reading something dramatic and exciting. \n\nThe blue light is bad for sleep (and for eyes), but anything that engages your brain and excites your emotions just before bedtime is worse for sleep. A baking show or nature documentary that’s relatively free of drama might be fine. There are audiobooks or apps of bedtime stories for adults — relaxing without being childish. Short stories are good because you can finish them and not wonder how they turn out.","score":3,"comments":[]},{"body":"Its about mindset too, not just the actual eyeball light.","score":2,"comments":[]},{"body":"My wife falls asleep reading in bed on her phone.  She reads ebooks on her phone.  And falls asleep holding the phone in her hand.\n\nOnly worry about light from electronics if you have problems falling asleep.  The effect is trivial for most people.","score":2,"comments":[]},{"body":"This is different depending on the person. If you notice you stay up later if you're on your phone, work at putting it down sooner. If you don't have any trouble getting tired while looking at your phone, it's fine.","score":1,"comments":[]},{"body":"That rule is there to improve your quality and quantity of sleep. If you don't struggle with that then ignore that rule and see if your sleep gets worse or stays the same.","score":1,"comments":[]},{"body":"How is your circadian rhythm and ability to sleep otherwise? \n\nIf you're not experiencing issues otherwise, avoiding electronics might be too impractical and not justify the benefit. If you're experiencing issues, what about your other sleep hygiene habits?\n\nOtherwise, it depends on your personal sensitivity to light. The filters and glasses block out a lot, but not all.","score":1,"comments":[]},{"body":"The whole blue light thing is really a scam. It’s more about your brain being active and trying to sleep when it’s still thinking about what you were doing before. If you have trouble falling asleep, yes try to avoid screens for about an hour before bed, or do something that relaxes you and don’t require you to think or otherwise be active.","score":1,"comments":[]},{"body":"Personally, I notice a more significant difference if I get off screens entirely vs if I just use a blue light filter","score":1,"comments":[]}]},{"title":"Nooob to Chime","not_safe_for_work":false,"locked":false,"body":"I just joined chime this week and received my card and activated and set everything else up.  It says that I was eligible for the $20 spotbme and it's now turned on and available , if I still have a balance of $0 because my direct deposit doesn't go into the account till Friday this week, and I went to make a purchase at the gas station for less than $20 will the spot me automatically kick in and cover my purchase (so long as it's under the $20 limit) and even though my current and starting balance is at $0 ?","score":3,"comments":[{"body":"r/chime","score":1,"comments":[{"body":"I posted it there already thanks.","score":1,"comments":[{"body":"sorry.","score":2,"comments":[{"body":"It's all good, no worries. Thanks for the suggestion tho. Didn't mean to come off as harsh or rude , I apologize if I did","score":1,"comments":[]}]}]}]}]},{"title":"In the Central Park Five jogger case, how come none of the detectives who coerced the boys into falsely confessing were arrested?","not_safe_for_work":false,"locked":false,"body":"If a detective coerces someone to make a false confession and they ended up serving time for a crime they didn’t actually commit, will the interrogation officer be arrested?","score":2,"comments":[{"body":"the prosecutors and the officers both work for the government. they're on the same team, if you will.","score":4,"comments":[{"body":"And yet so many police officers complain why we want to remove qualified immunity. If they’re not obligated to save people, then they absolutely deserve no legal protection.","score":2,"comments":[]}]},{"body":"The power of racism and corrupt police unions.","score":3,"comments":[]},{"body":"Nope.","score":2,"comments":[]},{"body":"Feel free to read the op eds those detectives put in newspapers justifying their actions and pointing out all the things the documentaries and Netflix movies leave out, and see if you still want them put in jail. \n\nhttps://www.wsj.com/articles/netflixs-false-story-of-the-central-park-five-11560207823\n\nhttps://www.thedailybeast.com/the-myth-of-the-central-park-five","score":0,"comments":[]}]},{"title":"If there’s so much hiring going on how is the economy functional and unemployment not sky high?","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"I don’t really see your connection between big demand for work and unemployment.","score":2,"comments":[{"body":"If such a large majority of employers are seeking help shouldn’t there be an comparable of displaced people who are unemployed.","score":2,"comments":[{"body":"Not really, i think you are making the mistake here that demand for labour is always at the same rate. In a good economy demand is way higher than in a bad one, it can even exceed the amount of inhabitans of the country","score":3,"comments":[{"body":"But if the demand of labor is so high and there’s no one to occupy the positions, how can there be production?","score":1,"comments":[{"body":"Well let's say you have a business that produces 10 of product X in a bad economy using 2 workers. Now in a good economy that demand rises to 15 so you'll need an extra worker for that. However you are not able to find him. Therefore you cant deliver that last 5 of the product. However, you still got the 2 workers to produce the 10, that didnt change","score":1,"comments":[{"body":"That makes sense. So theoretically there’s an availability shortage because of higher demand across the board?","score":1,"comments":[{"body":" Of course it's always a bit more complicates but that is one of the core reasons","score":1,"comments":[]}]}]},{"body":"Part of the reason the demand is so high is that many people are already employed producing.","score":1,"comments":[]}]}]},{"body":"From what I see from the rich business owners I know comma'am they're the ones not making as much money we're making more and they're making less and that bugs the s*** out of them","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Who owns the copyright to images created through machine learning systems?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"I think the current opinion is no one\n\nTheir was a big case about a elephant painting a painting and peta claimed that the elephant owned the copyright to it since he painted it.\n\nThe court disagreed saying that a non human can’t have the rights to anything they make. So AI art should fall under the same thing.","score":1,"comments":[{"body":"Why shouldn’t it fall under the owner of the computer that made it?","score":1,"comments":[{"body":"Your computer doesn’t make it. \n\nThe AI that is housed by whoever owns the company makes it.\n\nYou just put in the words.","score":1,"comments":[{"body":"&gt; by whoever owns the company\n\nOk, why shouldn’t they have the copyright?","score":1,"comments":[{"body":"In my opinion because they only made the AI, the AI still has to go search the web for images to base the art off of and then generate the art. \n\nIt could be ruled that the company owns it but who knows until the day comes that it is a issue.","score":1,"comments":[{"body":"&gt; the AI still has to go search the web for images…\n\nWell yeah, that’s what they built the AI to do.  It’s a computer program they wrote and it’s only doing what they told it to.  I don’t give the printer credit for my work because—while I made the file—the printer still had to take the ink and carefully spray it on the paper to produce the document.","score":1,"comments":[{"body":"The Printer doesn’t learn and adapt. AI art at the beginning sucked because it was just mashing random shit together. It learned and set base rules so it makes more eye pleasing art.\n\nAI art is old, it goes back all the way to the mid -late 1900’s. It’s only know it’s growing and gaining more interest due to it becoming way better. \n\nAnd also apparently the US copyright office has already made a statement saying that AI made art has no owner.","score":1,"comments":[{"body":"I understand they’ve already made a determination on this… I just don’t agree with it :-).  A program doesn’t become less of a program as it becomes more sophisticated IMO.  The AI didn’t make the art by itself.  It requires prompts.  If you ask it to “make something itself”… someone programmed in what that means, too.  If it’s a program that learns, someone coded in how to learn.  At its core, it isn’t any less an invention a person made to do a thing than the simple printer.\n\nAnyway, have a good evening.  I realize my thoughts on it don’t change the fact of the matter.","score":1,"comments":[]}]}]}]}]}]}]}]},{"body":"In the US, [nobody does](https://www.smithsonianmag.com/smart-news/us-copyright-office-rules-ai-art-cant-be-copyrighted-180979808/). Though it's possible that that would change if have enough creative input in it. If you're just making a computer draw random images, that's very different from if you try to draw one yourself, write a detailed prompt, and use img2img to make it look better.","score":1,"comments":[]},{"body":"In five jurisdictions worldwide - such as the UK - there is statutory law that computer-generated images are protected by copyright, but for the rest of the jurisdictions there has to be a jurisdiction-varying threshold of human involvement met. How much human involvement is not clear yet for any jurisdiction that I am aware of. See [this article](https://www.theverge.com/23444685/generative-ai-copyright-infringement-legal-fair-use-training-data) for an introduction, and [this post of mine](https://www.reddit.com/r/bigsleep/comments/uevfch/article_ai_authorship_by_a_law_professor_2020/) for many AI copyright-related links.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Is it weird to use the dentist gas if you aren’t a kid?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"Hi /u/AntOnASidewalk,\n\nWe noticed you are a pretty new Reddit account, so we just wanted to let you know to check out the subreddit rules [here](https://www.reddit.com/r/NoStupidQuestions/wiki/rules) and maybe have a read through our [Frequently Asked Questions](https://www.reddit.com/r/NoStupidQuestions/wiki/index/faq) - they make for fascinating reading!\n\nWe're called No Stupid Questions because we believe nobody needs to be attacked for asking a question, but *that doesn't mean there are no rules!* This sub is meant for users like you to ask genuine questions. Please don't ask jokes or rants disguised as questions - that's not in the spirit of this sub. While you *can* ask almost anything here, please keep illegal and offensive questions elsewhere to give people a good experience here - and if you have a medical question, please ask your doctor, not us. \n\nOtherwise, welcome!   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoStupidQuestions) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"Lol I need it too. Can’t stand the feeling of the stabby painkillers, I need something to help me through it.\n\n(Pro tip: don’t try to force your kids to “toughen up” by holding them down physically while the dentist stabs them, it makes trauma not chest hair.)","score":6,"comments":[]},{"body":"I opt for those sedative pills.  I don’t even ask now… I said I don’t really like dental procedures just once ten years ago and now they just give me a triazo-something-or-other in the waiting room, and next thing I know I’m being driven home.\n\nIt’s awesome.  Love the dentist now.","score":4,"comments":[{"body":"They stopped giving people triazolam in a lot of areas because in low enough doses it’s really bad for causing false sobriety, so people would leave the office thinking they’re fine and then barely make it home running every stop light through town.","score":1,"comments":[{"body":"Oh yeah, they make me arrange to be picked up by someone.  I don’t feel much false sobriety: it’s dead-obvious I shouldn’t be operating heavy machinery after that :-)","score":2,"comments":[{"body":"Oh well that’s perfect. A family member of mine has worked in many dental offices, and they told me this story of an elderly woman who had come in, been given her dose and then wrapped up her procedure sooner than expected. As she was trying to leave everyone in the office kept insisting she stay for awhile until she was sure the meds had worn off, but she assured them that she knew she was a-okay. She goes to leave and they realize she had filled out her paper work with borderline nonsense, and like 2 mins later she walks back in and lets em know she’s not going anywhere, she said she didn’t realize how off she was till she tried to put her house keys into a car that wasn’t hers.","score":1,"comments":[]}]}]}]},{"body":"Absolutely not. I have anxiety and the only way ii could cope with them sticking thier hands in my mouth and the drill vibrating my entire skull was to be nearly maxed out on nitrous. Dentists are fucking stressful, is Nota big deal if it's the thing you can't cope with","score":2,"comments":[]},{"body":"If it’s an option why not take it? I hate the dentist so anything to make that easier is something I’ll do","score":1,"comments":[]}]},{"title":"Why do tvs no longer wind up with images stained into them for being paused for hours?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"They are not using cathode tubes, they use LCD and other tech.","score":7,"comments":[]},{"body":"Different technology, although my phones still do it.","score":1,"comments":[]},{"body":"If you leave an OLED TV paused for long enough, it will get stained (burned in). Happens a lot to display models that have the same content looping over and over again.","score":1,"comments":[]}]},{"title":"Has anyone ever connected a new GFCI outlet to an old buss fuse box?","not_safe_for_work":false,"locked":false,"body":"I have a black, red and white wire coming from the old box with 2 screw in fuses. I linked the black to the line in the outlet, red to neutral and white to ground, but that's not working. It's possible my fuse box isn't grounded.","score":3,"comments":[{"body":"If you’re in the United States, red is never neutral in any code-compliant installation. Black and red are the two legs of hot, white is neutral, and green or bare wire is ground.","score":1,"comments":[]},{"body":"r/homeimprovment or r/electrician","score":0,"comments":[]}]},{"title":"If, somehow, a 3rd-party team was able to successfully smuggle Britney Griner out of Russia and back into the USA... Would the US have any obligation to return her?","not_safe_for_work":false,"locked":false,"body":"Understanding that this obviously very hypothetical and unrealistic... But let's say some well-connected individual(s) hired a team to do a movie-like secret extraction and get BG out of her Russian prison-- But the US government had nothing to do with it all. Once she's back in the USA \"safe and sound,\" if the Kremlin demanded her return, what would be the realistic legal response and implications?\n\nThe US has publicly stated many times that BG is being wrongfully detained... And while they're in \"negotiations\" for her freedom, it's not looking likely at the time being. So if some billionaire with the connections to do such a thing pulled it off through a series of bribes, espionage, and impeccable planning (and a bunch of luck), what are the odds that the US is able to say \"Ah, tough shit\" to Putin and be willing to deal with the political fallout?\n\nWould the US really entertain sending her back to avoid relations with the Kremlin going even further south?? I'd like to think they wouldn't, but I'm not totally sure.\n\nI understand that there are other citizens locked up overseas under similar sketchy circumstances, but given that BG is a celebrity and her celebrity status is key component to the way Russia is handling her, this specific scenario is with her situation in mind.\n\nThoughts?","score":5,"comments":[{"body":"Nope.\n\nThe US is perfectly happy to tell unfriendly countries to fuck off when it comes to extradition.","score":9,"comments":[]},{"body":"They'd be no more obligated to return her than Russia is to hand over Edward Snowden.","score":3,"comments":[]},{"body":"There's no extradition treaty between russia and us so she would not have to go back, though if she were to travel to a country that has such a treaty with russia she could be picked up. Thats why there are piles of hackers we know about in russia that we can't arrest and recently international courts just convicted several russians for shooting down a commercial jet back in the previous ukraine war but they will never be handed over by russia.","score":2,"comments":[]},{"body":"I'm so sick of hearing about her and this nonsense about her being wrongly detained. She brought drugs into the country. If she did that in the US she would be imprisoned too. I don't think intent has anything to do with it. I didn't mean to kill those people while drunk driving...well guess what you're still going to jail for it. I also think it's just a big fuck you to all the people sitting in jail in the US for cannabis related crimes. Some people are still in jail for those crimes in states that are legal for convictions that occured prior to legalization. Why is she special? Because she's mildly famous?","score":2,"comments":[{"body":"I agree, with the anecdote that I'm glad its moving more people to realize USA is equally guilty and we need to reform our drug laws (end the war on drugs)","score":3,"comments":[]},{"body":"I totally agree I don't know what the fuss is about.  She took drugs that were illegal into a country caught a jail sentence. Happenes to people everyday.     She should just be happy she wasn't in one of those countries like Singapore where if you get caught with  drugs they sentence you to like 20 years of hard labor or even the death penalty","score":2,"comments":[]},{"body":"If she killed people while drunk driving then I don't think people would argue that she's being 'wrongly detained.' Serving almost a decade in a labor camp for some personal weed is egregious to everyone with any kind of common sense. But if you want to hang your hat on \"she did the crime so she's doing the time..\" then that's you.. Most folks  recognize the whole thing as a bullshit political powerplay by Russia.","score":2,"comments":[]}]},{"body":"would make a cool movie","score":1,"comments":[]}]},{"title":"How does my car’s thermometer avoid wind chill?","not_safe_for_work":false,"locked":false,"body":"I like to think my car’s thermometer is accurate but how would it avoid wind chill? If it was outside while I’m driving it would read way lower than the actual temperature and it can’t be in my car because then it would be whatever temperature I set the A/C to.","score":3,"comments":[{"body":"Wind chill is the temperature plus wind equals windchill essentially. Your thermometer is just temperature. Air moving past a thermometer doesn’t make it colder. It only affects humans bc the moving of air decreases our temperature much faster. So if the windchill is -20 it’s like standing in -20 the way you’re losing heat.","score":8,"comments":[{"body":"Damn never realized that. Thank you, now I’ll have some sick trivia for thanksgiving.","score":1,"comments":[{"body":"Bonus trivia: that’s why 70 degree water feels so much colder than 70 degree air — your body loses heat a lot faster in the water, even at the same temp. That’s what your nerves respond to, the transfer of heat into/out of the skin, not the nominal temperature.","score":3,"comments":[{"body":"Oh my god I’ve always wondered this too, thanks bro.","score":2,"comments":[]}]},{"body":"Now… if you put a wet cloth over the thermometer… you can measure the relative humidity as you drive!","score":1,"comments":[]}]}]},{"body":"Wind chill doesn't actually make things colder, it just cools things down to the surrounding temperature faster. If it's 40 F out, with a wind chill of 20F, you'd lose heat as fast if you were in the wind as if you were in still air at 20F. But if you stayed there until you died you'd only cool down to 40 F, not 20.","score":3,"comments":[]}]},{"title":"DoesTheDogDie.com but for child loss?","not_safe_for_work":false,"locked":false,"body":"Is there a website similar to Doesthedogdie.com but for child loss? \nI am not sensitive to \"triggers\" except the death of children, due to recent trauma. And it has happened more than once where I watch a movie, or TV show, and a child dies. It unfortunately sends me into a panic. I am working with professionals to get help for this. But in the mean time, while I work on this, I'd like to watch movies and tv without having to worry about falling into a panic attack.\nPLEASE be kind. My heart is so heavy. I'm so hesitant to ask for any help. Thank you in advance.","score":2,"comments":[{"body":"Does the dog die actually does have a option for child death and abuse! If you search up a movie through that website, you should be able to go through the laundry list of triggers they have.","score":5,"comments":[{"body":"OH MY GOD THEY DO! THANK YOU SO MUCH! You have answered my question!","score":6,"comments":[{"body":"Yeah of course! I’m also kinda triggered to things like that at times, so I like to know everyone I’m going in for.","score":4,"comments":[]}]}]},{"body":"Do you mean like on screen deaths or just any mention of a child dying?","score":2,"comments":[{"body":"I would just like to avoid any implications of a child dying at all.","score":2,"comments":[]}]},{"body":"The parents guide on imdb will usually say when characters die, although it does spoil it.","score":1,"comments":[]}]},{"title":"How much does the dumbell handle weight?","not_safe_for_work":false,"locked":false,"body":"I was doing seated dumbell shoulder press with a dumbell that had 2 10 plates on each side and 1 7.5 plate on each side of the dumbell. Unfortunately I don’t know how much the total weight is since the dumbell dosent say the total weight. However not taking into account the handle weight the dumbell weights 55 pounds. So how much does the handle of a dumbell?(The dumbell has mini plates but is non adjustable.","score":2,"comments":[{"body":"Does your gym have a scale?  Pick it up and go weigh yourself, then set it down and weigh yourself.  Subtract 55 and you’re done.\n\nMy guess is roughly 5.","score":2,"comments":[{"body":"Unfortunately no scale looks like I’ll have to bring in my own scale next time","score":1,"comments":[{"body":"Probably 5.\n\nAlso… really?  I’ve never heard of a gym that doesn’t have a scale.  They’re usually in the changing/locker room if not on the floor.","score":2,"comments":[{"body":"Ok, Thank you","score":1,"comments":[]}]}]}]},{"body":"Do you mean the barbell?  Dumbell’s are the one-handed ones, and generally don’t use plates at the gym.  If you mean barbell (ie, what’s used for bench press), standard is 45 lbs.","score":2,"comments":[{"body":"No i mean dumbells each dumbell has 4 tiny 10 pound plates and 2 tiny 7.5 unfortunately I can’t upload a picture of what it looks like but you just have to trust me.","score":1,"comments":[{"body":"Probably around 5 lbs, but don’t think they’re as standard as barbells","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"I would wager 5 lbs. I seem to remember my home gym ones from the 90s being that size.\nMan I really want a new home gym now","score":2,"comments":[]},{"body":"I just put my dumbell bar on the bathroom scale and it didn't even register lol\n\nWent up to 0.7 kg at first then back down to 0 kg.\n\nIt's showing as 10.4 KG with 10 kg of plates so I'm guessing 0.4 kg?","score":2,"comments":[]}]},{"title":"I'm a victim of fraud, I found the person, what should I do","not_safe_for_work":false,"locked":false,"body":"A husband and wife are scamming people for deposits to rentals in the city of Pittsburgh.  I got hit yesterday for 500 bucks. I quickly learned about the scam and through social media I found another victim, oddly enough an old friend of mine that was taken for 900. I was able to find out where the wife works, however I personally dealt with her husband. He tried a couple times to get me to meet with her but it was too far to travel. My friend was the opposite she dealt with the wife. The idiots gave me copies of her passport and his drivers license which helped me track her down. \n\n&amp;#x200B;\n\n I filed a police report as did my friend but the police dont move very quickly and even if they get them they would have to go through the legal system which would take me years to get my money back, if ever.  She is Canadian and he holds dual citizenship. They could disappear into canada never to be seen again.\n\n&amp;#x200B;\n\nI am super tempted to go confront her at work and say \"get me my money and I wont press charges.\" But if I go alone she could say fuck off and disappear. \n\n&amp;#x200B;\n\nCan the collective brain power of reddit please help me think of some angles I can try?","score":3,"comments":[{"body":"They'll just deny it at work.\n\nIf you have their email, maybe try that in case they admit to something in text \n\nHonestly though, you'll need a lawyer and filling the criminal case. Cops really won't do anything about this, so a lawyer is your best bet, see if any have a free consultation.","score":1,"comments":[]}]}]}