{"name":"nostalgia","description":"Nostalgia is often triggered by something reminding you of a happier time. Whether it's an old commercial or a book from your past, it belongs in /r/nostalgia. Here we can take pleasure in reminiscing about the good ol' days... times we shared with loved ones, both humorous and sad. So grab your Pogs, Surge cans and Thriller cassettes, and we'll see you in /r/nostalgia!","subscribers":1065441,"posts":[{"title":"The Green Ranger Jason David Frank (RIP)","not_safe_for_work":false,"locked":false,"body":"","score":6264,"comments":[{"body":"Apparently when my mom was late in pregnancy there was debate on what my name would be. My mother wanted Thomas to be my name. At one point my parents agreed to let my older brother (3-4 at the time) to choose between a few names. My mom said if he chose Thomas/Tommy he could be named after the green ranger…. My name is Thomas.\n\nRIP Green Ranger","score":689,"comments":[{"body":"I'm a green ranger as well! This is heartbreaking.","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I’m sorry to hear this. I worked for him as a volunteer at a Con one year. He really cared about his fans and would take time to talk to everyone of them. \n\nEven if you didn’t have money for a selfie, he would let you take one with him. He was a good man.","score":407,"comments":[{"body":"Similar experience with him, when I was a kid he came to the Taekwondo studio I attended and led a seminar for us. I'm sure he was being paid to be there, but he treated us all like people (which many adults don't do with children), and he seemed genuinely personally invested in each interaction.","score":90,"comments":[]},{"body":"JDF was constantly, just like Conroy lived as Batman, breathed as being the ranger and kept it going his entire career. He was also a frequent con goer. I was in his line circa 2017 and realized how much his autograph was (it wasn’t that much but I was like 15) so I bounced off the line. Apparently he saw me cause an hr later he found me in the con lobby and came to me concerned wondering what happened. He said we could take a picture (even tho he was in a rush) and he was super kind, so that’s the memory I’ll keep with him along with watching the show.","score":70,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Did this just happen? What terrible news if true.","score":132,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I can’t imagine how rough it was for him emotionally to lose his step daughter and go through a divorce. That’s the kinda hurt you cant always power through","score":162,"comments":[{"body":"Yeah, idk how you ever really get through something like that.","score":50,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Are you fucking kidding me? My green and white ranger is dead? Fuck you 2022! Fuck you!","score":439,"comments":[{"body":"The green/white ranger storyline was so badass!","score":60,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The green volume bars","not_safe_for_work":false,"locked":false,"body":"","score":1529,"comments":[{"body":"That’s a little loud, I can tell","score":72,"comments":[{"body":"My dad is yelling at me to turn it down.","score":24,"comments":[{"body":"Stealthy turns back up","score":6,"comments":[]}]},{"body":"Turn it down a few notches?","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"HIDEO 1","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"At some point this went away and it’s a solid volume bar now.","score":9,"comments":[]},{"body":"I remember having this one Sony TV with these exact bars","score":9,"comments":[]},{"body":"/r/CableTV_Memories","score":7,"comments":[]},{"body":"Ahhhhhhh...yesss","score":6,"comments":[]},{"body":"Sweet memories","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The video game aisle","not_safe_for_work":false,"locked":false,"body":"","score":78,"comments":[{"body":"That's a damn good quality picture for being from so long ago. Was it taken with a Nikon or something?","score":6,"comments":[]},{"body":"I remember the one at Toys-R-Us where you got the paper voucher and took it up to the desk and they would sell you the game there.","score":6,"comments":[]},{"body":"More: https://archive.org/details/trunj9900/","score":3,"comments":[]}]},{"title":"The game CrossFire","not_safe_for_work":false,"locked":false,"body":"","score":62,"comments":[{"body":"This is the ultimate example of a commercial making something seem WAY better than it turned out to be.","score":8,"comments":[{"body":"It was just Hungry Hungry Hippos in reverse.","score":5,"comments":[]}]},{"body":"That marketing department must have gone harder than any before. That commercial had an epic song, the singer was firing on all cylinders, the effects were movie quality, and the gameplay looked like the world was at stake.","score":9,"comments":[]},{"body":"Dont forget its legendary commercial https://youtu.be/rCwn1NTK-50","score":7,"comments":[{"body":"Yep the the 80's version too!  (incorrectly labeled 92')\n\nhttps://www.youtube.com/watch?v=cyg3kn0cfwE","score":5,"comments":[]},{"body":"That song.\n\nCCROSSS FIYYYAYHHHH!!!!!!!!!!!!!","score":3,"comments":[{"body":"Crossfire, Crossfire... [CROSSFIYAAAAAAHHHH!!!](https://www.youtube.com/watch?v=gtkXyXeSVjQ)","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"hey serious question  was this game actually fun? I have a 7 year old and I always wanted this game but never got it. Im wondering do i buy one for christmas for him or was the game actually terrible?","score":3,"comments":[{"body":"It's fun for approximately 30 seconds.","score":3,"comments":[]},{"body":"It's not terrible.  It's basically air hockey but with little guns that shoot BBs to propel the pucks.  You have to stop to reload the guns frequently and the guns get jammed fairly easily.  A frustrating strategy is to shoot slower than your opponent, just playing defensively, then hoard all the BBs and then go on the offense to try to score a goal against your opponent.  It's a good way to make enemies but it sometimes works.","score":1,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Which Hostess Fruit Pie was your favorite? Blueberry for me....until chocolate came out","not_safe_for_work":false,"locked":false,"body":"","score":860,"comments":[{"body":"Lemon. I still eat them!","score":136,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Apple.","score":76,"comments":[]},{"body":"I know it’s not a fruit, but wasn’t there also a custard one?","score":61,"comments":[{"body":"There were at least two pudding pies: chocolate and vanilla. My fave!","score":57,"comments":[{"body":"TMNT vanilla!","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Cherry.  Cherry forever.","score":163,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Lemon. It had the delicious power to subdue supervillains, according to every comic I ever read in the 1980s!","score":31,"comments":[]},{"body":"When we were kids we lived within walking distance of the day old bread store and they had these and all kinds of snack cakes. Cherry was irresistible. Anyone remember when they made Slimer pies during the ghost busters promo?!","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cherry!","score":20,"comments":[]},{"body":"Lemon 😋","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Bring back Altoids Mango Sours!","not_safe_for_work":false,"locked":false,"body":"","score":597,"comments":[{"body":"Lofty Pursuits (pd.net) is making their own version that is supposed to be an exact match. Their YouTube channel is awesome too.\n\nhttps://www.pd.net/products/tangerine-sours-secret-pre-order","score":29,"comments":[{"body":"Want","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I want the Tangerine Sours to come back.  Those were my crack.","score":26,"comments":[{"body":"Second fave","score":3,"comments":[]}]},{"body":"I used to crush these and the tangerine ones while playing original Xbox all the time haha","score":7,"comments":[]},{"body":"Use to keep my weed in those tins! Completely forgot about em’ (makes sense)","score":7,"comments":[]},{"body":"Public: “do it you cowards!”\n\nCEO of Altoids: “we stoped manufacturing them after several people died from eating too many of them!”\n\nPublic:”like….. how many people?” “Cus if it was like 1 or 2 I think it’s worth it.”","score":6,"comments":[{"body":"Wait what","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"My tongue started bleeding just reading this.","score":6,"comments":[]},{"body":"I've genuinely never seen an altoids tin filled with anything other than weed.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"McDonald's burger seats—extremely uncomfortable","not_safe_for_work":false,"locked":false,"body":"","score":87,"comments":[{"body":"Yeah they were pretty uncomfortable but honestly as a kid going to McDonalds this made the experience magical. I didn’t get fast food as much as kids these days do so when I got to go and see things like this it made it such a fun thing.","score":10,"comments":[]},{"body":"They are looking up your skirt","score":2,"comments":[]},{"body":"McDonald's for food, folks, and...ass pain!","score":1,"comments":[]},{"body":"Slip right off.","score":1,"comments":[{"body":"*McDonald's: The restaurant with unlimited floor seating*","score":1,"comments":[]}]}]},{"title":"Any ALF fans out there?","not_safe_for_work":false,"locked":false,"body":"","score":400,"comments":[{"body":"That depends.  Do you have a cat?","score":52,"comments":[{"body":"Amazing user name lolol.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Gordon Shumway eats cats. I can't fully trust an entity/alien/person who eats cats.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"He's back, in pog form!","score":33,"comments":[]},{"body":"I still put this on to go to sleep it’s free on tubi","score":19,"comments":[{"body":"I was just about to ask if there's a place to watch it for free. Much obliged :)","score":9,"comments":[]}]},{"body":"Roger on American Dad ripped off Alf.\nSecret alien living with American family.","score":16,"comments":[]},{"body":"Remember ALF? Well he's back... in pog form!","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yep! we had every episode on dvd! And even some recorded on a vhs tape!😂","score":9,"comments":[]},{"body":"I kill me!","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Winnie the pooh - theme intro song , (another nostalgia)","not_safe_for_work":false,"locked":false,"body":"","score":159,"comments":[{"body":"Oh, bother... Now I got the feels.\n\nNow just need a smackeral of gin.","score":10,"comments":[]},{"body":"Those last few seconds always get me! ❤️","score":6,"comments":[]},{"body":"Childhood mornings.","score":5,"comments":[]},{"body":"Is Pooh still a thing for kids?","score":2,"comments":[{"body":"Yep. Disney still makes stuff with Pooh. \n\nThe character fell into Public Domain last year, but Disney still holds the copyright to the imagery and Pooh content that the company created.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This song will always take me back to summer 1998. I went with my best friend’s family on a road trip to Destin, FL from Dallas, TX. We spent the whole trip in the back seat of his grandfather’s GMC Safari untethered to any part of the vehicle, wearing out a VHS tape of this show because his little sister wouldn’t allow ANYTHING else on.\n\nWe also fumigated tf out that thing due to an overindulgence of scrambled eggs at the hotel’s continental breakfast halfway there. Good times.","score":2,"comments":[]},{"body":"I remember this more cheerfully in my memory. 😭","score":2,"comments":[]},{"body":"Bruh, it's been years, but I still know this is slightly sped up and slightly pitched up","score":2,"comments":[]},{"body":"I'm a morning person and my wife definitely is not. Anytime we have to get up early to catch a flight or something I sing this song. She has never enjoyed it but I know I do.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Breyer's Viennetta Ice Cream (1994)","not_safe_for_work":false,"locked":false,"body":"","score":1823,"comments":[{"body":"I remember seeing the ads for this as a kid and thinking - maybe - if I really made it in life I might someday be able to afford this eight-dollar extravagance.","score":543,"comments":[{"body":"I think Viennetta was like peak class and sophistication for every middle class kid in the 90s","score":120,"comments":[{"body":"Vienetta and Clearly Canadian up in here boyeee\n\nI am the fanciest boy that ever lived 😌","score":45,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"I remember thinking how amazing that looks and probably tasted.  I never tried it.\n\nWas it good?","score":117,"comments":[{"body":"It was actually really good","score":132,"comments":[]},{"body":"It still is! Our traditional Christmas ice cream.","score":47,"comments":[{"body":"Oh my god I can get this now that I'm grown up?!\n  \nCan I put it in the [Fancy Feast](https://youtu.be/YegEm2J73mM) glassware?","score":92,"comments":[{"body":"Haha! After rewatching this, the first thing I thought was \"those are fancy feast glasses\"","score":35,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"It’s still a thing, made by walls in the uk, the mint choc one is the shit. \n\nOh and wait til you see how it’s made\n\nhttps://youtu.be/gZrv81wY8HQ","score":76,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Peak elegance.","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"NES store displays","not_safe_for_work":false,"locked":false,"body":"","score":46,"comments":[]},{"title":"The magic erase pad, always best on first use","not_safe_for_work":false,"locked":false,"body":"","score":33,"comments":[{"body":"The noise when you pulled up the film to erase it was so satisfying. It was like a big electronics peely before that was a thing.","score":3,"comments":[{"body":"Yeah! It doesn't seem like it should make a sound that loud. I still don't know what that black stuff is. Maybe that would explain the sound","score":1,"comments":[]}]}]},{"title":"Pi (1998)","not_safe_for_work":false,"locked":false,"body":"","score":17,"comments":[{"body":"Love this film, studied everything I could about it, used the same budget breakdown from Independent Film Magazine, but I was lucky and shot my first feature on DV and used Final Cut v1, used that camera and made many shorts, very inspiring early filmmakers journey.","score":4,"comments":[]},{"body":"Never stare at the sun.","score":2,"comments":[]}]},{"title":"Sears Wish Book","not_safe_for_work":false,"locked":false,"body":"","score":269,"comments":[{"body":"It would entertain the kids for hours. Of course, then they want to tell you all about it.","score":14,"comments":[]},{"body":"Kids today have no idea what the lead up to Christmas was like. Wishbook, commercials, etc. it was amazing.","score":14,"comments":[]},{"body":"Here have an early Christmas gift https://christmas.musetechnical.com/","score":12,"comments":[{"body":"Thank you kind Internet angel. I’m right back in 1988.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This is where the Christmas excitement starts to get fever hot.","score":10,"comments":[]},{"body":"I remember circling things in this and the service merchandise catalogue for hours","score":8,"comments":[]},{"body":"“Dear Mom: p.56, p.113, p. 144, p. 164. I love you, Me”","score":7,"comments":[]},{"body":"When did they stop making these? I've never seen one in person but have heard a lot about them over my life.","score":5,"comments":[{"body":"I'm wondering the same thing. it's gotta be from the late 90s-2000's since it has \".ca\" on the cover. \nI mean it can't be from earlier than that.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I wish we still had this level of a Christmas book. I just had my kids working on a list and they have to navigate websites.","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Plastic Balloon Birthday Cake Toppers","not_safe_for_work":false,"locked":false,"body":"","score":399,"comments":[{"body":"Am I the only one that chewed the balloons? lol","score":19,"comments":[{"body":"Nope. As far as im concerned thats the only reason they existed","score":7,"comments":[]},{"body":"Birthday kid gets to pull it out and lick the frosting off the bottom.","score":3,"comments":[{"body":"Best memory of these haha","score":1,"comments":[]}]}]},{"body":"What ever happened to stuff like these?  You don't see these, or similar decorations, on cakes anymore?  \n  \nThe closest I've seen lately was those little plastic spider rings they put on cupcakes around Halloween.","score":13,"comments":[]},{"body":"Memories I didn't know I had","score":5,"comments":[]},{"body":"Yes!","score":3,"comments":[]},{"body":"I can still hear these.","score":2,"comments":[]},{"body":"My store still has these! I work in a Zehrs bakery btw","score":1,"comments":[]},{"body":"[removed]","score":-15,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"SNES Target Ad from the early 90s.","not_safe_for_work":false,"locked":false,"body":"","score":72,"comments":[{"body":"I....did not realize they cost that much back then. My mom bought me one unprompted for Christmas one year. She was a single Mom and must have saved up literally all year to buy it for me. I played it and loved it but had no idea....Yall my mom was awesome.","score":19,"comments":[{"body":"Accounting for inflation, $200 in 1990 is the equivalent of $455 in 2022.\n\nI too am surprised at that price, kudos to your mom.","score":4,"comments":[{"body":"Right?! Like..thats also kind of on par with how gaming systems are priced now but still.","score":1,"comments":[]}]},{"body":"I remember getting Turok for my birthday and it costing $70. Even as a kid that seemed really expensive.","score":3,"comments":[]},{"body":"My brother and I (at 8 and 9 years old) spent months selling Nintendo Power posters to kids at school in order to save up money for one of these once they released. We didn't come close but our mom filled the gap and, 30 years later, that first night with the SNES and a couple friends staying the night is still one of my fondest memories.","score":1,"comments":[]}]},{"body":"I love the electronic rolodex appealing to tech savvy of the day.","score":11,"comments":[{"body":"How about the keyboard being laid out in alphabetical order?\n\nI bet the designers originally made it in QWERTY format, but then some old boss said that regular people didn't know or care about typewriter or computer keyboards and wanted something simple and made them change it into this.","score":1,"comments":[]}]},{"body":"I miss old target.","score":3,"comments":[]}]},{"title":"Bump-N-Go Mystery Action Robot (1993)","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[]},{"title":"[Skip-it] what was your high score?","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"about 3 bruises on my left shin and 1 pissed off dad after smashing the taillight of the car","score":4,"comments":[]},{"body":"3 and I nearly died","score":1,"comments":[]},{"body":"My high score was chafed ankles.","score":1,"comments":[]}]},{"title":"Looney Tunes Gameboy game (1992)","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[]},{"title":"Remember being a kid, eating a carrot and just saying “Aaaahh, what’s up doc?”","not_safe_for_work":false,"locked":false,"body":"","score":85,"comments":[{"body":"Hell yeah, exactly as often as I ate a carrot.","score":11,"comments":[]},{"body":"I remember thinking I was actually stronger after eating spinach","score":10,"comments":[{"body":"Haha I ate so much when it was for dinner. And would constantly flex my little bicep.","score":4,"comments":[]}]},{"body":"Core memory unlocked","score":5,"comments":[]},{"body":"Pepperidge Farms remembers.","score":3,"comments":[]},{"body":"What's all this about rabbits; Doc? 🌉","score":2,"comments":[]},{"body":"You put the carrot in your *mouth*?","score":0,"comments":[]},{"body":"I did this while eating cheetos \n\nI still do this while eating cheetos","score":1,"comments":[]},{"body":"Danny?","score":1,"comments":[]},{"body":"This was obligatory carrot banter.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Shake shake shake","not_safe_for_work":false,"locked":false,"body":"","score":114,"comments":[{"body":"These were really good. So we’re the wraps they had. Probably neither was healthy though, but it felt like I was making good decisions","score":21,"comments":[{"body":"Bruh I miss the snack wraps, and the chef was my go to shake salad","score":10,"comments":[]},{"body":"These were literally made of random scraps that where leftover at the end of the night. And they were left in the walk-in for days! When I worked at McDonald's we just sold whichever ones weren't obviously liquefied.","score":1,"comments":[]}]},{"body":"“Toss your own salad!”","score":5,"comments":[]},{"body":"I forgot about this, weird to remember","score":3,"comments":[]},{"body":"Man, imagine buying salad from McDonalds.","score":3,"comments":[{"body":"Imagine being McDonalds and making millions off people buying salad.","score":4,"comments":[{"body":"You may say im a dreamer. But im not the only one.♪","score":2,"comments":[]},{"body":"Yeah, they had the luxury of innovation then.","score":1,"comments":[]}]}]},{"body":"r/WeWantPlates before it was even a thing","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The Wild Thornberrys (1998)","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[{"body":"love this one! brings back memories!","score":2,"comments":[]},{"body":"I had such a crush on Debbie as a kid.","score":2,"comments":[]}]},{"title":"Gameboy accessories","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[]},{"title":"Number munchers","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"My computer class in elementary school was either playing fraction muncher and number muncher and Oregon trail. Lots of learning going on","score":1,"comments":[]}]},{"title":"Timon And Pumbaa Bug Pops","not_safe_for_work":false,"locked":false,"body":"","score":25,"comments":[{"body":"Quiescently Frozen Confection sounds so dubious","score":2,"comments":[]},{"body":"Insect lollipops. Obviously not actually made of insects I assume but still eww.","score":1,"comments":[]},{"body":"Frozen fruit juice with bug-shaped gummy candy inside.  I use to eat these all the time.  They were pretty good.","score":1,"comments":[]},{"body":"I miss those. Had them all the time.","score":1,"comments":[]}]},{"title":"Perhaps the most useless thing we learned in school: Sentence diagrams!","not_safe_for_work":false,"locked":false,"body":"","score":129,"comments":[{"body":"Glad this isn't my nostalgia. This looks terrible.","score":153,"comments":[]},{"body":"i have no recollection of learning this","score":67,"comments":[]},{"body":"I got such a bad grade in 8th grade English because of this.  If absolutely never made any sense to me no matter how many times the teacher tried to explain it. And looking at this, I still don't understand what's happening.","score":31,"comments":[{"body":"Huh? What part of *Sue but brought because had forgotten her. Latin.* is hard to understand?!\n\nI mean it's as simple as *Sue left because felt but mother her brought back she book!*","score":40,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"These were soo annoying, and I definitely have used not this in my life.","score":21,"comments":[]},{"body":"What the fuck is this? What the hell is this supposed to teach. We never had anything like this in Australian education.","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"i briefly remember learning this in 7th grade circa 2001 and being really confused and then the subject never came up again in any future english classes","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I loved diagramming sentences!","score":41,"comments":[{"body":"Learning this technique isn't useless -- it shows what a syntactically _unambiguous_ version of our language would look like. Every sentence we hear, we have to internally infer this syntax tree based on context, which is kind of fascinating. That is supposed to be the takeaway of the lesson, and if you internalize that idea, it will help you write less ambiguously in general.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"More people need these now.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The Simpsons. And Maggie Makes Three\". Homer quits his job at the power plant to work in a bowling alley. When he finds out Marge is pregnant, he reluctantly goes back. Mr. Burns adds a plaque that says \"Don't forget: you're here forever\". He alters it to read: \"Do it for her\". January 22, 1995.","not_safe_for_work":false,"locked":false,"body":"","score":523,"comments":[{"body":"‟If everyone here were like Ned Flanders, we’d have no need for Heaven…we’d already be there.” -Homer","score":65,"comments":[]},{"body":"Lisa the Beauty Queen, when Homer trades his ride on the Duff Blimp so Lisa can enter the beauty  contest because as her dad, Homer thinks she‘s the most beautiful girl in the world.\n\nThe scene when Marge tells Lisa how Homer got the money....onions.","score":41,"comments":[]},{"body":"Made me tear up.","score":20,"comments":[]},{"body":"Back when the Simpsons had heart ❤.","score":53,"comments":[{"body":"that's exactly what is missing.","score":16,"comments":[{"body":"Flanderization, where characters dissolve into their most extreme traits instead of actually being human.\n\nHomer isn't some dumb drunk who hates his kids. Yes he isn't the smartest, yes he spends too much time at the bar, but he adores his family and does so much to protect them. He's a kind human being with a few problems. He does so much to make sure his family lives a good life.","score":25,"comments":[]}]}]},{"body":"That episode added so much depth to Homer's character. Yes, he's an idiot, but that not all he is. Not by a long shot.","score":16,"comments":[]},{"body":"“Why do you mock me, O Lord?!”\n\n“Homer, that’s not God, that’s just a waffle that Bart tossed up there.”\n\n“mmmmm…Sacrilicious.”","score":9,"comments":[]},{"body":"I loved this episode.","score":9,"comments":[]},{"body":"This episode, along with the episode about how Lisa got her Saxaphone were my favourite episodes when I was younger. Seeing Homer really being a dad was great.","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"When I was eight I thought that teachers who wrote on the board under a projected worksheet were geniuses.","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[]},{"title":"Mr. Belvedere","not_safe_for_work":false,"locked":false,"body":"","score":104,"comments":[{"body":"These sitcoms are soft and funny, I miss comedies like this.","score":12,"comments":[]},{"body":" My son was around 6 years old when this show was on, and couldn't say \"Belvedere\", so he called it Mr. Velvet Ears.","score":10,"comments":[]},{"body":"https://melmagazine.com/en-us/story/mr-belvedere-balls-urban-legend","score":5,"comments":[]},{"body":"One time the actor who played Mr Belvedere sat on his balls and they had to stop filming for three days.","score":6,"comments":[{"body":"First thing I thought of","score":4,"comments":[]}]},{"body":"The late great Norm Macdonald and Artie Lang telling some hilarious Bob Uecker story’s on the Howard Stern show [https://youtu.be/PE7l9-f18UM](https://youtu.be/PE7l9-f18UM)","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I guess I didn’t remember Bob Uecker being in this.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I still call annoying neighbours \"Huffnagles\"","score":4,"comments":[]},{"body":"steaks come from china\n\nnever matter before\n\nwhen your trapped in the jenkins\n\nand you cant find the door\n\nno ones there","score":9,"comments":[]},{"body":"Watch how you sit, Big Man !","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Super Mario RPG","not_safe_for_work":false,"locked":false,"body":"","score":22,"comments":[{"body":"I too love me  some Chrono Trigger","score":2,"comments":[]},{"body":"Shockingly good 3D interaction for the SNES in the non-combat portion of the game.","score":1,"comments":[{"body":"Tbf we had good isometric games way before the SNES era, from Q-Bert to Solstice. I would agree that actual polygon-based, \"VFX Chip\" style games, like OG Star Fox, pushed the 3D boundaries for that console though!","score":2,"comments":[]}]},{"body":"Square had the best hit streak in gaming history in the 90s: Mario RPG, FF4, FF5, FF6, FF7, FFT, Chrono Trigger, Chrono Cross, Vargrant Story, Xenogears, Parasite Eve, Secret of Mana, even black sheep like Ehrgeiz... it is unreal.\n\nThe abysmal FF8 was the beginning of the end, before long we had trash like Bouncer coming out and the apocalyptic Spirits Within debacle.They've never been the same since, but we'll always have the 90s, Square.","score":1,"comments":[]},{"body":"Been watching someone play this to completion on YouTube. Forgot how much I enjoyed Mario as a child.","score":1,"comments":[]},{"body":"best rpg game of all time. good music, good story, good world. not long to overstay it’s welcome but short enough keep the charm the whole way through. i gave this game away to my friend like a decade ago and deeply regret it. perfect game to play on the psp / ps vita.","score":1,"comments":[]}]},{"title":"Top Cat, an old cartoon, came out in 1961. It's now 2022, making it 61 years old.","not_safe_for_work":false,"locked":false,"body":"","score":36,"comments":[{"body":"I can still hear the intro music. “TOP CAT! The most effectual…” Damn I’m old.","score":4,"comments":[]},{"body":"This design was part of my childhood and is still with me today as a tattoo!","score":3,"comments":[]},{"body":"Choo Choo was always my favorite. I have a sticker of him on my car.","score":1,"comments":[]}]},{"title":"Rest In Peace Jason David Frank, thank you for being our power ranger. 🕯","not_safe_for_work":false,"locked":false,"body":"","score":385,"comments":[{"body":"No way!! That just happened today. He killed himself. \nRIP man 💚","score":16,"comments":[{"body":"apparently TMZ confirmed it, I think he was having a rough time, he had a divorce some months ago","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I’m so sad about this. I loved Power Rangers growing up, and we introduced my son to it and he was absolutely obsessed with the Green Ranger. We took him to a convention to meet Jason David Frank, and he showed him his Green Ranger action figure and he high fived him and told him it was awesome. It was such a special day for him and I’ll always be grateful JDF was so sweet to him. RIP.","score":10,"comments":[]},{"body":"💚 RIP.","score":9,"comments":[]},{"body":"Was his character name Tommy? Or am i getting mixed up?","score":8,"comments":[{"body":"No you’re correct.\n\nIf you look back at the cast it can get a little confusing.\n\nAustin St John played Jason the red ranger, Jason David Frank played Tommy who was multiple rangers over the years, and there was also Jason Narvy who played the character Skull.","score":5,"comments":[{"body":"Ah thanks man. I was obsessed with Tommy as the white ranger as a kid","score":3,"comments":[]}]}]},{"body":"💚🤍💛","score":7,"comments":[]},{"body":"Love him a childhood hero, when he unsheathed his Dagger you know the bad guy was done for! No one fucks with the Dragonzord!","score":5,"comments":[]},{"body":"We loved you man. Rest in peace","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Yikes! school supplies.","not_safe_for_work":false,"locked":false,"body":"","score":108,"comments":[{"body":"I want this stuff to come back so bad.","score":7,"comments":[]},{"body":"I totally forgot about Yikes! I loved their stuff. It's still pretty cool!","score":5,"comments":[]},{"body":"I LOVED these pencils. They were so soft and didn't hurt my fingers like regular pencils did.","score":4,"comments":[{"body":"I loved them too! Try Wopex pencils. They are similar.","score":1,"comments":[]}]},{"body":"This is all i wanted. Must have been more expensive because my parents refused to buy them.","score":2,"comments":[]},{"body":"Hah! I still, to this day, have the last two or three inches of that foil &amp; black one in the upper left, stashed away inside of a little wooden lockbox. No idea why I've saved it all these years, but I did, and it gives me a little smile every time I happen upon it.","score":1,"comments":[]},{"body":"I can already hear my dad saying they cost too much","score":1,"comments":[]},{"body":"*YIKES*","score":1,"comments":[]}]},{"title":"Ferris Beuller and Cameron Frye","not_safe_for_work":false,"locked":false,"body":"","score":75,"comments":[{"body":"If you don’t have a copy of this movie, If you have the means, I highly recommend picking one up.","score":6,"comments":[]},{"body":"Abe Froman...the sausage king of Chicago","score":1,"comments":[]}]},{"title":"Taz in Escape from Mars - Genesis (1994)","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[]},{"title":"Mega Man 6 - NES (1993)","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[]},{"title":"Glow in the dark stars are useful and everyone should have them.","not_safe_for_work":false,"locked":false,"body":"Short post but if anyone sees this glow in the dark stickers/stars are so useful!\n\nWhen I was a kid I had them just for decos and it was probably my favourite thing I had as a child. I got back into them recently and covered my room, remotes, fan and other charging cable in them and I haven't bumped into one thing since. You can get them on amazon for cheap and you can also get 3D dinosaur ones. So if you bump into stuff in your room, or you can't find things in the dark, consider glow in the dark stars.","score":8,"comments":[]},{"title":"Stuff magazine's \"Toys with inappropriate quotes\" poster included in each issue","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[]},{"title":"Spider-Man 2 Doctor Octopus figure (2004)","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Loved this toy growing up, but I ended up losing all but one of the arms. I believe that was due to me being more fascinated with the actual tentacles than with the human part.","score":2,"comments":[]}]},{"title":"Mighty Morphin’ Power Rangers: The Movie - RIP Jason David Frank","not_safe_for_work":false,"locked":false,"body":"","score":46,"comments":[{"body":"If the bad guys were smart enough they would attack them in those couple of minutes they're morphing up and showing off lol","score":4,"comments":[{"body":"The bad guys: “that’s poor form.”","score":2,"comments":[]}]},{"body":"Rita Repulsa: “Two down, four to go!”","score":1,"comments":[]},{"body":"Definitely had that \"Character as a boss\" vs \"When you unlock them as a playable character\" energy","score":1,"comments":[]}]},{"title":"Trying to catch a glimpse of something on channel 99 in the 90’s","not_safe_for_work":false,"locked":false,"body":"","score":167,"comments":[{"body":"Forgot NSFW tag ;)","score":10,"comments":[]},{"body":"That's definitely a titty!","score":4,"comments":[]},{"body":"I'm 99% sure I see a nipple","score":3,"comments":[]},{"body":"We'd move the dial around in between channels and pickup a channel. We did it all the time and used a matchbook to hold the dial in place.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I see a boob!!","score":4,"comments":[]},{"body":"We’ve got bush.\n\nSecond time I’ve used that line in the past week. Thanks OP! :)","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I remember hearing the “noise” you could hear from the scrambled screen. I would always catch my dad on the channel and he would flip it fast to something else. But sometimes, sometimes, he would fall asleep on the couch with it on in his best “Al Bundy” pose. Love you dad! 😆","score":2,"comments":[]},{"body":"Sometimes the sound would do the trick","score":2,"comments":[]},{"body":"Spice channel porn.","score":3,"comments":[]},{"body":"My dad used to yell out \"boob check!\" and switch to 99.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Sounds about right.","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"I didn’t know anyone that had those channels, ever.","score":1,"comments":[]}]},{"title":"Roseanne. Lecy Goranson and Sarah Chalke as Becky Connor.","not_safe_for_work":false,"locked":false,"body":"","score":39,"comments":[]},{"title":"Insomniac Music Theater and the opening of Bjork's \"Possibly Maybe\"","not_safe_for_work":false,"locked":false,"body":"","score":28,"comments":[{"body":"jeez, I remember this!! brings back memories. thanks for sharing!","score":2,"comments":[]},{"body":"Completely forgot about this! Thank you for the memory unlock!","score":2,"comments":[]},{"body":"\"... Probably Not\"","score":2,"comments":[]}]},{"title":"I still get chills from The Six Million Dollar Man intro","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"Agreed!  Thanks for posting this, it's been a while. \n\n [*eh-eh-eh-eh-eh-eh*](https://www.youtube.com/watch?v=BAoH5E-5PeM)","score":1,"comments":[]}]},{"title":"School Supplies Vending Machines. I remember everyone used to buy these and to get the straws the pens came in to use them for spit balls.","not_safe_for_work":false,"locked":false,"body":"I remember everyone used to buy these and to get the straws the pens came in to use them for spit balls.","score":50,"comments":[{"body":"This little pencil machine was my favorite thing in first grade!","score":4,"comments":[]},{"body":"God the one my elementary school had was so awesome. There was a giant one that would give a notebook for a dollar and two small ones on either side that would give pencils for 25 cents and gel pens for 50 cents. The gel pens were awesome but the pencils sucked and the covers of the notebooks would fall off within like a day, but it was still so sick lmao. Most of the fun was trying to get a big collection. I remember the pencils would change based on the holidays/seasons, there were neon/glitter/metallic gel pens, and the notebooks would have different funny pictures and patterns on the front. I think I still have a few, but now I’m wishing they had these in other places, like bookstores or something. I would waste so much money at them lmao.","score":2,"comments":[{"body":"Exactly! My school didn't have a notebook one that sounds so awesome!","score":3,"comments":[]}]},{"body":"Still remember my middle school having machines like those. We didn't have gel pens though, just regular ones.","score":2,"comments":[]},{"body":"The pencil machine we had was a ripoff. We insert the quarter and it would give us a broken pencil. They would be broken vertically and not horizontally so you couldn’t even salvage non of it. Either way all of us kids would break it by playing a good game called “Pencil Break”.","score":1,"comments":[]},{"body":"I've never seen these but what a profit margin","score":1,"comments":[]}]},{"title":"Escape From Horrorland PC Game 1996","not_safe_for_work":false,"locked":false,"body":"","score":29,"comments":[{"body":"Gameplay for more nostalgia:\nhttps://youtu.be/U9_YZXJ4Hho","score":2,"comments":[]},{"body":"Loved that game","score":1,"comments":[]},{"body":"this was so fun and scary!!","score":1,"comments":[]},{"body":"the board game was absolute fire","score":1,"comments":[]}]},{"title":"The Secret World of Alex Mack (1994-1998)","not_safe_for_work":false,"locked":false,"body":"","score":2499,"comments":[{"body":"If only getting doused by chemicals gave you superpowers in real life.","score":207,"comments":[{"body":"Mr West you have lymphoma","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I was in love with Alex Mack!","score":151,"comments":[{"body":"Same. I loved this show because I had a huge crush on her","score":57,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I told my friends and the government is looking for me but I can't let my parent find out.\n\n\nKid me- oh yea that makes sense","score":300,"comments":[{"body":"/r/CableTV_Memories","score":35,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Back when they did actual live action and not just only sitcom style. I miss those.","score":73,"comments":[]},{"body":"I sent a letter to her in the 90s. Got a signed photo, then wrote back asking if this was really her. Got another signed photo saying yes this is actually me. Haha","score":66,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Holy crap!! I used to love that show! If I bring it up people are either like \"huh?\" or they're like \"OOOOH YEAAAA!\" lol. \n\nI remember writing her and got back a headshot and an autograph. I was obsessed.\n\nThanks for that blast.","score":121,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Pretty good VFX for that time","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"a Lego space figure from 1980 and one from 2022","not_safe_for_work":false,"locked":false,"body":"","score":22,"comments":[{"body":"Repost from hours ago\n\nhttps://www.reddit.com/r/mildlyinteresting/comments/z0epdx/a_lego_space_figure_from_1980_and_one_from_2022/","score":1,"comments":[]}]},{"title":"Advertisement for Kraft Crumbles","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[]},{"title":"Eraser Burns","not_safe_for_work":false,"locked":false,"body":"I had completely forgotten that eraser burns were a thing in grade school until just today. My friend’s 10 year-old son told me this story about how he and his classmates used to see who could eraser burn themselves the longest and eventually the school caught on and put a stop to the game.\n\nEveryone in his class got super upset they couldn’t play their game anymore and they had to have class-wide therapy sessions to address this issue because the teachers were concerned that the children were literally trying to erase themselves, like, from existence. In reality they just thought it was a fun game.\n\nThe best part of this is that my friend’s son understood the darkness that all entailed and thought it was hilarious that the adults took it to such an existential place. He also brought up the fact that they had to go through five boxes of Kleenex because everyone was crying about having their game taken away but half the kids hadn’t learned how to blow their noses on their own yet so they had to teach each other.","score":4,"comments":[{"body":"We called it a 99er. You had to rub your hand 99 times or you were a shitebag or something.","score":2,"comments":[{"body":"That’s a new one to me! What country are you from?","score":2,"comments":[{"body":"Scotland.","score":2,"comments":[{"body":"It’s interesting to see that these weird little games we played as kids were transatlantic.","score":2,"comments":[{"body":"Kids are dumb shits all over the globe.\n\nOne of the big petrol stations over here used to have a loyalty card type thing (early 90s) which was made of a sort of transparent plastic with concentric circles. So it acted like a magnifying glass and what are we going to do as kids? Burn our hands with it. You had to withstand the pain for a minute.","score":3,"comments":[{"body":"Hahaha “kids are dumb shits all over the globe” is my favourite thing I’ve heard in a grip. And so true. I remember giving each other (not cool to say anymore) “Indian burns”, playing Red Rover where we basically attempted to decapitate each other.\n\nThe best one was called “Cops and Robbers” or “The Prison Escape” or something of the sort. Once we got the ability to drive half of us would be on foot and the other in cars, and we would race through the entire neighborhood to a set destination with the kids in cars trying to catch those on foot. There would be fifteen year old kids sprinting across the freeway in pitch black darkness just asking to be hit by a car. Climbing fences into strangers yards to hide, getting lost from the group with no way to contact anyone because we didn’t all have phones yet, etc. And the kids driving were being equally stupid because they’re racing through side streets looking out for people on foot and not paying attention to the road per se. Man we were stupid. I can’t believe most of us are still alive.","score":3,"comments":[{"body":"That's some hardcore play there. Really took a step up with that one.","score":2,"comments":[]},{"body":"Haha those were better days though!","score":2,"comments":[]}]}]}]}]}]}]},{"body":"This hit peak popularity when I was in 4th grade back in the early 90s. The boys made \"Bud\" their king because he could win any eraser burn challenge, his hands and arms were covered in the burn marks.  He still has the scars all up and down his arms, I've seen recent pics of him, now in his 40s. It's kind of sad that some stupid thing he was doing for attention back in the day ended up scarring him for life.","score":2,"comments":[]},{"body":"10 year olds didn’t know how to blow their nose lol wha","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"The Affordable Grow-Up Plan.","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[{"body":"deepest core memory i have","score":2,"comments":[]},{"body":"Maybe throw that word “off” on to line two so people glancing at this don’t get the wrong message. Just my two cents as a designer.","score":1,"comments":[]}]},{"title":"Bruce Almighty (2003). The only reason I know how to spell B-e-a-uuuutiful.","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"Yup still the way I spell it out in my head! Classic film.\nI guess that's the way the cookies crumbles!","score":4,"comments":[]},{"body":"This movie is still hilarious to this day.","score":2,"comments":[]},{"body":"Get fuuuuuuucked this movie was from 2003 😭","score":1,"comments":[]},{"body":"Me too! B E A Uuuuuutiful!","score":1,"comments":[]}]},{"title":"(1996) Win tickets to a live taping of Friends by buying bottles of diet Coke and matching the name under the cap with the character who stole the last one from Monica's fridge in a special police-procedural parody commercial (it was Rachel)","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"RIP KEVIN CONROY","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"One of the dopest things I've ever seen","score":6,"comments":[]},{"body":"Feel so lucky to have grown up watching this show, it’s honestly a masterpiece and has forever shaped my view of Batman and Gotham.","score":5,"comments":[]},{"body":"\"It was a *big* rock...\"","score":1,"comments":[]}]},{"title":"its been so long...(hill climb racing)","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I've been getting some ads for hill climb 2","score":1,"comments":[]}]},{"title":"Power Ranger Jason David Frank Has Died (September 4, 1973 – November 20, 2022) (aged 49)","not_safe_for_work":false,"locked":false,"body":"","score":34,"comments":[{"body":"I had happy memories. Tommy was my favorite it's sad to see he was hurt so much and took the desperate and selfish way out. Suicide hurts everyone. Death is easy, living life is hard.","score":3,"comments":[]},{"body":"What no way","score":2,"comments":[{"body":"Ikr I grew up showing power rangers","score":2,"comments":[]}]}]},{"title":"Old Roblox. (2007-2013)","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"1980's and 1990's baseball card packs at Ben Franklin store.","not_safe_for_work":false,"locked":false,"body":"Went to a local Ben Franklin store and they had tons of packs of late 80's and early 90's baseball cards for 45c to a dollar a pack. Picked up several just for nostalgia purposes. Found a Sammy Sosa rookie card and a Mark McGwire card. Best part was the hologram Detroit Tigers sticker with the old logo. No value to the cards I opened, but pure fun busting open some old school wax packs.","score":35,"comments":[{"body":"I need to see some big league chew","score":3,"comments":[]},{"body":"Grab me a pack will ya","score":2,"comments":[]},{"body":"Still have a Ben Franklin in my town 👌","score":1,"comments":[]}]},{"title":"Flash game called \"Diner City\" back in the golden days of the internet?","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[]},{"title":"Korn - Freak On a Leash [nu-metal] [1998]","not_safe_for_work":false,"locked":false,"body":"","score":32,"comments":[{"body":" From the weird beatboxing to the \"GO!\" has to be the smoothest transsition ever.","score":2,"comments":[]}]},{"title":"The clown from Spawn, Violator (1997)","not_safe_for_work":false,"locked":false,"body":"","score":790,"comments":[{"body":"One of John Leguizamo's best freakin roles.","score":183,"comments":[{"body":"I heard that it killed his knees because he had to squat in that suit. Must have given him great glutes, though.","score":21,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Most underrated role ever. John did an amazing job he never got the credit he deserved.","score":82,"comments":[{"body":"I feel like this describes John's entire career.","score":36,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I'm not the Vindicator or the Victimizer or the Vaporizer or the Vibrator! I'm... The Violator!","score":42,"comments":[{"body":"Early cgi but I remember it being very impressive when he transforms.","score":35,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"This guy was so hilarious. I had the action figure of the demon he turned into when I was a kid","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Best part of the movie! \n\nUh, well, well, every time someone farts, a demon gets his wings.","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Spawny spawny he's our man","score":24,"comments":[]},{"body":"Say what you will about the movie - they nailed Violator.","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Night Flight on USA Network","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"It was such a great way to spend a Friday night - I miss those evenings.","score":4,"comments":[]}]},{"title":"Stick stickly","not_safe_for_work":false,"locked":false,"body":"","score":24,"comments":[{"body":"PO Box 963","score":3,"comments":[]},{"body":"Who else here made their own Stick Stickly's?","score":2,"comments":[]},{"body":"\"You can pick your friend and you can pick a pose,\n\nPick on your little brother, or even pick your nose. \n\nYou can pick a prickly pepper, or pick a pretty rose!\n\nBut only NICK (and Stick) let's YOU pick the shows!\"","score":1,"comments":[]}]},{"title":"Flintstone push pops. Friend got an ice pop at work and these were the first things to come to mind.","not_safe_for_work":false,"locked":false,"body":"","score":45,"comments":[{"body":"Yes! Forgot about these. Miss the 90’s","score":2,"comments":[]},{"body":"I realize these were just sherbert ice cream. But they still tasted better as push pops.","score":2,"comments":[]},{"body":"To answer the inevitable question  -- Nestle still makes Push-Ups, but [without the Flintstones Branding](https://www.icecream.com/us/en/brands/nestle-treats/products/nestle-push-up-pops). \n\nThey also had [more flavors](https://eightiesbabynet.files.wordpress.com/2019/12/8529d3dbf1c15f83518cd9661488ec6a.jpg) and more per pack back then.","score":2,"comments":[]}]},{"title":"TheDollPalace, \"Dollz\"","not_safe_for_work":false,"locked":false,"body":"I miss making the emoz!!","score":17,"comments":[{"body":"The hours I spent on sites like this in the early-mid 2000's, chatting away with friends on MSN Messanger.\n\nTime flies, eh?","score":2,"comments":[{"body":"It really does!! Makes me sad :c","score":1,"comments":[]}]}]},{"title":"The \"Yeah Toast!\" Song by Bob &amp; Tom (1998)","not_safe_for_work":false,"locked":false,"body":"","score":34,"comments":[{"body":"This song is actually by comedian Heywood Banks. He's still performing, mostly in the Central Midwest. Michigan, Indiana, etc. \n\nBob and Tom are still on. I live in Indianapolis where the show is broadcast from. Bob retired, but the rest of the crew are still rolling along.","score":6,"comments":[{"body":"Came here to say exactly that. Heywood Banks is a legend.","score":3,"comments":[]}]},{"body":"I miss them laughing through everything.","score":3,"comments":[]},{"body":"Someone made a video of team fortress's engineer singing this, it is great.","score":2,"comments":[]},{"body":"Oh man I remember this as a kid, back in the early 90's. Well before 1998","score":1,"comments":[]},{"body":"I have not heard this song since the early 2000's, when my friends and I did a silly dance to it for class one day.","score":1,"comments":[]}]},{"title":"SimTower - Maxis (1994)","not_safe_for_work":false,"locked":false,"body":"","score":95,"comments":[{"body":"I'm relatively convinced this is not the 1994 version.","score":50,"comments":[]},{"body":"I don't know what this is, but it ain't the 1994 Sim Tower.","score":36,"comments":[]},{"body":"That's not what this is","score":19,"comments":[]},{"body":"Similar concept but not the same game.","score":11,"comments":[]},{"body":"I was able to relive the nostalgia by playing Tiny Tower for iOS/Android!","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Can you play this anywhere online?","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That looks like Yoot Tower, from '98. Similar game, but not the maxis classic.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Now I know where tiny tower stole the idea","score":2,"comments":[]},{"body":"anybody else get that bug when you got near the highest level, the save file gets corrupt? \n\nIt was also my first attempt at hex editing myself more money.","score":2,"comments":[]},{"body":"Loved Sim tower","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Schwan's 🇨🇦","not_safe_for_work":false,"locked":false,"body":"","score":43,"comments":[{"body":"Root beer float bars 🤤","score":8,"comments":[]},{"body":"They where still the best way to spread gossip.","score":5,"comments":[]},{"body":"I worked for a company that would get food from them.  Those dang bagel dogs were the best.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I see their trucks all the time in my neighborhood. They're still around.","score":6,"comments":[]},{"body":"My mom would make us hide from the Schwan’s man when we’d be home but didn’t need anything. Like turn the lights off and get on the ground, don’t move! Great times.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"That peaches and cream ice cream! Ughhhhhhh so good.","score":2,"comments":[]},{"body":"I was in Afghanistan in 2012. Our DFAC had Schwanns ice cream bars.","score":2,"comments":[]},{"body":"\"**ICE CREAM**\n\nAND\n\n**FINER FOODS**\"","score":2,"comments":[]},{"body":"Still here in MN. See their trucks all the time.","score":2,"comments":[]},{"body":"I'm gonna tell my kids this was Doordash.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Early 00s era Windows Media Player was peak UI design.","not_safe_for_work":false,"locked":false,"body":"","score":10647,"comments":[{"body":" I always enjoyed Winamp","score":651,"comments":[{"body":"Winamp skins were great","score":156,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Winamp 3, that had all the crazy skins, and would slow down your computer so much you couldn't actually play MP3s.... But it looked sooo cool. Then you went back to Winamp 2 so you could listen to your music.","score":61,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It really whips the llamas ass","score":223,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I hated myself so used realplayer.","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"If you downloaded mp3s the file name looked weird. I must have spent hours renaming my entire library so it doesn't look weird.","score":211,"comments":[{"body":"I remember downloading programs specifically to fix file names in batches. Still had to go back and put the right titles in, because they usually would just follow the format of Artist-Album-Track#-_. It did make it faster, but I can’t fathom how much time I must have spent doing that. I recall having something like 20,000 songs at one point. Nothing compared to now, but still a lot.","score":57,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This was a different time. No one will understand. It was the Wild West of modern computing.","score":331,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My WMP played SO much pirated music.","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It used to be so much fun to customize your computer. I loved Windowblinds and Stardock. It feels like smartphones put a big dent in all of that.","score":95,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Looking for more photos of B.F.F. Virtual Friend toy from the 90s","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"I used to have these electronic toys from 1999 called \"B.F.F: Best Friends Forever\". I think there were 4 in the series, and each was a virtual best friend a la Tomagotchis. I have Sheila and Ashley, and the other two are Michelle and Whitney. The keychains are personalized to each girl and came with all sorts of accessories (Sheila is a poet so she had paper and a special pencil, Ashley is a fashionista who came with a comb, lip gloss, etc) and the accessories all fit inside the squares electronic thing you see in the picture.\n\nWhen I look for info, all I can find is that the toys were made by Playmates Toys but I cannot find ANYTHING else except a now defunct copyright for the cute logo. Does anyone have any photos of the other models, or know where I could find a database of 90s toys like these? I contacted Playmates a while back but they never responded.","score":2,"comments":[]}]},{"title":"MySpace!","not_safe_for_work":false,"locked":false,"body":"","score":30,"comments":[{"body":"I miss Tom. He was a friend to all of us.","score":5,"comments":[]},{"body":"I loved Myspace. I remember when Facebook started taking over, I just couldn't understand why everyone was going crazy over Facebook when Myspace was so much more fun. I mean, making your own page and filling it up with the things you like and whatever makes you, you was a blast.","score":4,"comments":[]},{"body":"I’m going back","score":4,"comments":[{"body":"Can I suggest you check out SpaceHey?","score":2,"comments":[]}]}]},{"title":"Consumers Distributing (1996)","not_safe_for_work":false,"locked":false,"body":"Fill out the form and wait for them to bring your merchandise","score":11,"comments":[{"body":"The pre-Amazon Amazon reseller.   Smart business model but the technology didn’t exist at the time to support the model.\n\nYou had to wait for their catalogue to see what they were selling and then go into the store and fill out a paper order form and then patiently wait for the clerk to come back and either confirm your order or tell you that you’re SOL.  Imagine what they coulda been with the technology and immediate access we take for granted today\n\nI bought some games for my new Colecovision there.   Yeah, I’m older than mud.","score":1,"comments":[]}]},{"title":"Roger Rabbit talking plush commercial","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[{"body":"I dressed up as him for a mall Halloween contest. My mom mad the costume. I won first place 😂","score":1,"comments":[]}]},{"title":"PBS Kids (Weather, 2001, HQ)","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"Da da da da.... doink!","score":1,"comments":[]}]},{"title":"Orbitz - I've overdosed on these at 12... Not sure what was in it to make me sick","not_safe_for_work":false,"locked":false,"body":"","score":24,"comments":[{"body":"I couldn’t drink those, or those jello like drinks. So gross","score":4,"comments":[]},{"body":"Orbitz walked so Boba could run","score":7,"comments":[]},{"body":"Society peaked with these. Everything since has been denouement.","score":1,"comments":[]}]},{"title":"Chuck E Cheese's Pizza - Aliens (1991)","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[]},{"title":"Saddened to hear of the Passing of Jason David Frank The OG Green Ranger.","not_safe_for_work":false,"locked":false,"body":"","score":28,"comments":[{"body":"Wtf? I’ve heard nothing about this!","score":1,"comments":[{"body":"Details are still coming out. I just found out from a mutual party.","score":3,"comments":[{"body":"Kinda shocked by this one, it’s such a shame","score":1,"comments":[]}]}]}]},{"title":"Lemmings computer game","not_safe_for_work":false,"locked":false,"body":"","score":125,"comments":[{"body":"Amiga version has one of the greatest soundtracks of all-all time.","score":2,"comments":[]},{"body":"*Creeeaakk*","score":3,"comments":[{"body":"\"*Rets Go!*\"","score":4,"comments":[]}]},{"body":"I still play all the time ha [here’s a link to play in browser](https://www.elizium.nu/scripts/lemmings/)","score":2,"comments":[]},{"body":"They need to release a new version with updated graphics. This game was amazing.","score":2,"comments":[{"body":"Oh, they actually do have a modern version on the Apple App Store btw! I’m not sure how similar it is to this version, but I’ve played it and the little lemmings are so cute.","score":2,"comments":[]}]},{"body":"All my friends played this so I did too","score":1,"comments":[]},{"body":"Who would have thought this was the start of GTA….","score":1,"comments":[]},{"body":"Oh my gosh my brother and I got farrrrrrr into this game. We had pages of the codes to start at the next level. Music was 👌🏼","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Do-a-dot canned paints","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"bingo daubers","score":2,"comments":[]}]},{"title":"NES Contra alien's lair. Do you think it is Octopuses or spiders?","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[{"body":"Scorpion","score":6,"comments":[{"body":"Agreed","score":1,"comments":[]}]},{"body":"Face huggers from Alien.","score":2,"comments":[]}]},{"title":"Spiderman 2 inflatable on Burger King, 2004","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[]},{"title":"Freebie Mickey snow globe handed out to the first 100 customers at JC Penney on Black Friday 20 years ago. Three people were there at the 5 a.m. opening.","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[]},{"title":"The Willow 80s movie was great, hope the Disney Plus series does well","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[]},{"title":"Rawlings Joe Rudi baseball mitt. Mid 1970’s.","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"Ah, I can smell the leather and saddle soap now.  Upgrading to something like that was like getting your first pocket knife and first bb gun.  You were a grown up!","score":1,"comments":[]}]},{"title":"Stoop kid afraid to leave his stoop","not_safe_for_work":false,"locked":false,"body":"","score":67,"comments":[{"body":"Classic","score":3,"comments":[]},{"body":"This, *Helga on the Couch* and that episode about the kids starting a rebellion against the Jolly Olly Man are the ones I remember in stunning detail.","score":1,"comments":[]},{"body":"This episode taught me that a stoop was kind of like a porch.","score":0,"comments":[]},{"body":"This episode taught me that a stoop was kind of like a porch.","score":0,"comments":[]}]},{"title":"Classic 1981 series five dollar bill","not_safe_for_work":false,"locked":false,"body":"Got this baddie with my change recently.","score":17,"comments":[{"body":"You forgot to black out the number so no one could use it….","score":3,"comments":[]},{"body":"I forgot what those looked like..","score":2,"comments":[{"body":"I realized that too.  I love classic designs.","score":1,"comments":[]}]}]},{"title":"Found the carrera hungaroring in my closet, still working","not_safe_for_work":false,"locked":false,"body":"","score":43,"comments":[{"body":"I can smell this picture.","score":3,"comments":[{"body":"YASSSSSSS","score":2,"comments":[]}]}]},{"title":"Multifunctional pencil case","not_safe_for_work":false,"locked":false,"body":"","score":36,"comments":[{"body":"Memory unlocked. Damn those were cool. I never had one but kids in my class sure did.","score":1,"comments":[]}]},{"title":"Home Alone 2 (1992) The funniest Christmas movie you can watch.","not_safe_for_work":false,"locked":false,"body":"","score":24,"comments":[{"body":"Love the cameo by Piers Morgan as the pigeon lady","score":6,"comments":[{"body":"It's Brenda Fricker not Piers himself.","score":-3,"comments":[{"body":"We know. It's a joke.","score":7,"comments":[]},{"body":"That’s what he wants you to think","score":2,"comments":[]}]}]},{"body":"Came out thirty years ago today.","score":2,"comments":[]},{"body":"This is the third Home Alone post I saw on this subreddit in the past 2 days.","score":2,"comments":[]},{"body":"Don't go to New York, Kevin! Donald Trump lives there!\n\nI'd love to see a Home Alone where instead of the wet bandits getting bonked by paint cans, it's Donald Trump.","score":1,"comments":[]},{"body":"Christmas Star is a beautiful song","score":1,"comments":[]},{"body":"Scrooged, National Lampoons Christmas Vacation, Love Actually, Die Hard, A Christmas Story, Elf, Home Alone, Kiss Kiss Bang Bang, Lethal Weapon, Mean Girls, and A Very Harold and Kumar Christmas are all funnier.","score":1,"comments":[]}]},{"title":"Primal Rage for SNES","not_safe_for_work":false,"locked":false,"body":"","score":147,"comments":[{"body":"This one got me right in an old memory I forgot all about. Thanks!","score":3,"comments":[]},{"body":"Vertigo was my favorite","score":2,"comments":[]},{"body":"I loved this game! My favorite character was Chaos. I wish it would get a update like Killer Instinct did.","score":2,"comments":[]},{"body":"PNDK&amp;M did a really good retrospective on this on YouTube.\n\nOne of my favorites when I was a kid.","score":1,"comments":[]}]},{"title":"Saw some original littlest pet shop today…","not_safe_for_work":false,"locked":false,"body":"My daughter was playing with the collection I put together for her and it warmed my heart.","score":11,"comments":[]},{"title":"3D Magic Maze Ball","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[]},{"title":"Mighty Final Fight - NES (1993)","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[{"body":"Does Guy level up into Ryu?","score":2,"comments":[]}]},{"title":"Fox Sports Net - 1996 Big Ten College Basketball Tournament Intro","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[]},{"title":"80s Read-Along Book and Tapes","not_safe_for_work":false,"locked":false,"body":"","score":109,"comments":[{"body":"Many of these are on YouTube, complete with photos of the pages.","score":5,"comments":[]},{"body":"When you hear the tone...\n\n*BEEP*\n\n... Turn the page!","score":3,"comments":[{"body":"Star Wars has R2-D2. Disney had those chimes. Ahhh yes","score":2,"comments":[]}]},{"body":"I had a gremlins one with a record. The narrator was really into it.","score":2,"comments":[]},{"body":"Dark Crystal for the win!","score":2,"comments":[]},{"body":"E.T.! Drew Barrymore is the best!","score":2,"comments":[]},{"body":"I used to listen to the ET book on tape when I got a cavity filled at the dentist.","score":1,"comments":[]},{"body":"I love when you watch a movie from the 70s or 80s that you were pretty sure you'd seen multiple times as a child, but although you recognize the characters, some of the sets, and the general plot, 80% of the movie seems totally new. Then you realize you just listened to the record storybook a lot.","score":1,"comments":[]}]},{"title":"Changed all my app icons to the good old days (2008-2010)","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"How do you do that?","score":9,"comments":[]},{"body":"But how?","score":4,"comments":[]},{"body":"They still look like that on my old ipod touch!","score":5,"comments":[]},{"body":"The YouTube and photos icon are the best","score":3,"comments":[]},{"body":"Can you say 'simpler times'?","score":3,"comments":[]},{"body":"Omg what a great idea","score":2,"comments":[]}]},{"title":"Dr. Terminus - Pete's Dragon (1977)","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[{"body":"Money money money by the pound","score":4,"comments":[]},{"body":"Jim Dale was an underappreciated talent.","score":3,"comments":[]},{"body":"Passamaquoddy","score":3,"comments":[{"body":"No, no, Passamamassy, Quoddamapoddy, Passamadaddy","score":1,"comments":[]}]}]},{"title":"Beakman's Inquizator (1994)","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"Bluhp bluhp bluhp, bluhp bloop bluhp, bluhhh bluhp bluhhhhh.\n\nI was going to post about this (I had one long, long ago) but couldn't find a decent picture!\n\nI used to make my own books by putting in random numeric codes that didn't appear in my other books (e.g. #1111, which IIRC is a true-false/1-2 quiz) and mapping the answers out.","score":2,"comments":[]}]},{"title":"Yahoo! in 1995","not_safe_for_work":false,"locked":false,"body":"","score":46,"comments":[{"body":"That is when my website first started. Still online today.","score":3,"comments":[]},{"body":"Lol back when we needed pointers on what to search for!","score":2,"comments":[]},{"body":"So what happened if you clicked on the \"WWW\" hyperlink?","score":2,"comments":[]},{"body":"If the Unabomber was just caught then this is from 1996","score":2,"comments":[]}]},{"title":"Jason David Frank has died.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"He died, like, 8 times yesterday.","score":1,"comments":[]}]}]}