{"name":"PirateFolk","description":"This is a spoiler free One Piece subreddit!\n\nManga SPOILERS Subreddit. Memes, shitposts, fanart and discussion are all allowed including talking about the newest chapter without including a spoiler warning.","subscribers":15420,"posts":[{"title":"One Piece Chapter 1067 spoilers","not_safe_for_work":false,"locked":false,"body":"","score":158,"comments":[{"body":"Raws are out [here](https://imgur.com/a/Uh9P4eL)","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Are these spoilers for ants?","score":79,"comments":[]},{"body":"Obviously Kuma is running to Wendy's to get the 4 for 4 deal before they close.","score":75,"comments":[{"body":"Of course not! He's going to go see One Piece Red (TM) in theaters now!","score":33,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"No mention of Law which means he's getting off-paneled as we speak.","score":59,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Is Lucci aware that Luffy is on the island? If he is then he's one bold mf. Luffy will turn this dude into a fur coat if he tries to go for round 2.","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If I had to guess some of the kings framed the fishmen people for the attack and used it as a way to justify discrimination/slavery","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"need more lore drops, inject that shit into my veins","score":26,"comments":[]},{"body":"Any theories on what Kuma could be up to? What are the possibilities he slaps himself to Egghead?","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The world government has no use for Bonney anymore? \n\nWas she simply a bargaining chip to prevent Kuma from leaving or was she providing some kind of service to the WG, like rejuvenating older people?\n\nVegapunk trying to invent the internet is fire","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"One piece Chapter 1067 English is out","not_safe_for_work":false,"locked":false,"body":"","score":43,"comments":[{"body":"Momo's fruit is a failure because Vegapunk couldn't get the colour right. Looks like those theories were true lol","score":86,"comments":[]},{"body":"I love vegapunk","score":27,"comments":[]},{"body":"The Kuma Panel goes hard","score":20,"comments":[]},{"body":"Vegapunk trying to build the internet lol.","score":19,"comments":[]},{"body":"Fantastic chapter. Very little of the frustrating bits that are intentionally left vague.","score":11,"comments":[]},{"body":"Where?","score":8,"comments":[{"body":"TCB now too","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Can't wait to see Kaku and Lucci vs Jabura seraphim (offscreened ofc)","score":8,"comments":[]},{"body":"Oh great Bonney is a afraid of bugs just like every woman irl. Goda never disappoints with his intricate knowledge of how women work","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The old GrandLineReview died a long time ago.","not_safe_for_work":false,"locked":false,"body":"","score":124,"comments":[{"body":"There is literally only one good one piece youtuber and it’s the hidden island","score":11,"comments":[{"body":"And tekking101","score":7,"comments":[{"body":"And KoL","score":4,"comments":[]}]}]},{"body":"Hes always been cringe trash, no idea why he has so many subs","score":18,"comments":[]},{"body":"His older videos are very nostalgic. I remember waiting daily for him to post.","score":5,"comments":[]},{"body":"To me it's his snarky and holier than thou attitude. For some reason there's always this arrogant undertone in his voice.","score":12,"comments":[{"body":"yeah like chill bro you’re a one piece chapter review channel","score":5,"comments":[]}]},{"body":"Ya I watched him from when he first started. Like when he had like 300 subscribers. \n\nHe use to be pretty good, but I eventually stopped watching him. Idk something just changed with him over the years, and made me not like him as much.","score":3,"comments":[]},{"body":"I am not really old onr piece follower when I finished my manga , i started searching for theories and saw his channel . It might hurt some people and it's obviously subjective opinion but that dude is really  too much .i know humour is a part of making videos but it's not the other way around where you upload a video which has 10% content ,90% bullshit.","score":2,"comments":[]},{"body":"And his video still got hundred of thousands views, such a shame","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Do you think he’ll remain ambiguous for the entire story or go completely bad toward the end? I have never trusted this mf and still don’t to this day🤷🏾‍♂️","not_safe_for_work":false,"locked":false,"body":"","score":45,"comments":[{"body":"Nah, \n\nShanks is the most neutral person out there.  I'm sure he knows everything but he knows hes not the one that's meant to pull the trigger.  I'm pretty sure we're going to get this gigantic flashback about shanks where we know everything he knows then hes going to get absolutely bodied by Im-Sama. Which will set off the final war.","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He’s good, this Shanks being evil theory is stupid","score":31,"comments":[{"body":"Genuinely. Mfs saw one or two panels of Shanks being into some shady shit when he’s a pirate and immediately suspected he’s the final villain lmao,","score":16,"comments":[]}]},{"body":"Never trust redheads","score":15,"comments":[{"body":"except for Kidd\n\ncuz he's just a little tsundere that is a little edgy","score":6,"comments":[{"body":"That likes to slaughter people. But I too am a kid stan","score":3,"comments":[]}]}]},{"body":"Man is too shady not to have some sort of major twist occur from him. Either he is a villain, or will do something major regardless.\n\nOda must have god tier patience to be waiting for the perfect moment to fully bring out Shanks","score":21,"comments":[]},{"body":"Idk man I don't see why he would be a bad guy he's never done anything bad, I feel like that would be shitty writing. But I do feel like he will die to Blackbeard as hinted they will fight eventually","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Villian or not shanks #1","score":3,"comments":[]},{"body":"i posted a nice theory two hours ago, go read it its good","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"How many road poneglyphs each character in the story currently has","not_safe_for_work":false,"locked":false,"body":"","score":169,"comments":[{"body":"Obviously just speculation, but I bet BB has the missing one. That would make him relevant in the race since he would be the only one to know the location","score":46,"comments":[{"body":"We already know the last poneglyph is linked to the man marked by flame.","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"How tf is Kidd supposed to get the Zou poneglyph? BB can probably snag it from Law but Kidd needs to make some insane play.\n\nThen again, Kidd could just walk into Zou and take what he wants with fucking Wanda and Shishilian as their rulers.","score":30,"comments":[{"body":"There is no way the minks give up their poneglyph when forced to. See what happened to Jack.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Law has 2, he was in zoo and wano","score":49,"comments":[{"body":"And Kidd has 3. \n\n-WCI poneglyph that he was heavily implied to have stolen.\n\n-Zou poneglyph that Law shared\n\n-Wano poneglyph that Law shared","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Law has the same amount as Kidd I’m pretty sure","score":68,"comments":[{"body":"Law had no reason to give Kidd the Zou poneglyph. Law might have more depending on whether luffy shared the WCI poneglyph.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Law has 2","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They all have 3 apart from Blackbeard, as far as I'm aware?","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"WHAT'S THE MATTER KUMA? WHERE ARE YOU GOING?! STOP RIGHT NOW!! NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO","not_safe_for_work":false,"locked":false,"body":"","score":328,"comments":[{"body":"My bro Dragon's acting like Kuma could even comprehend basic vocabulary 💀","score":60,"comments":[{"body":"Between this and him actually being unsure about Sabo murdering Cobra because he read it in the fucking WG newspaper, I'm not sure he's the brilliant strategist we've been led to believe he is...","score":53,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Kuma: im going, dragon…. Im going to dragon deez nut on your face","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What if dragon is a cuck and Luffy isn't his biological son","score":68,"comments":[{"body":"akainu 👀👀👀","score":39,"comments":[]},{"body":"akainu 👀👀👀","score":20,"comments":[]},{"body":"If that's the epic reveal foreshadowed since the beginning and Oda brings in an NTR artist to draw the rest of the chapter then One Piece might be peak fiction again","score":20,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"“NOOOOOO NOT MY KUMERINOOOO NOOOOOO”","score":19,"comments":[]},{"body":"I hope dragon doesn’t go on fraudwatch","score":19,"comments":[{"body":"Literally everyone has their own headcanon about Dragon. We know so little about him im kinda concerned hes not gonna be on just fraudwatch","score":25,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"I saw this post about rage power ups a while ago , what are your opinions on it","not_safe_for_work":false,"locked":false,"body":"","score":254,"comments":[{"body":"that's not a rage, luffy woke up to reality, realized that there is a crap ton of people WAY above him and decided to train to become strong enough to protect the only thing he still got: his crew","score":177,"comments":[{"body":"Best rage moment for Luffy is punching the celestial dragon in Sabaody","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"HxH probably has the best but overall they can be really cool and I appreciate Luffy's approach as well.  I think it fits him as a character. \n\nLose against Magellan &gt; Try harder &gt; Win against Magellan\n\nLose against Akainu &gt; Can't try again bc Ace ded &gt; questions his strength","score":95,"comments":[{"body":"Wait when did he win against Magellan","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"One Piece doesn’t really have rage power ups. They have cool rage moments, like Luffy punching the celestial dragon after he shot Hachi.","score":54,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Naruto vs Pain was peak, i remember when i was waiting for new episodes. Goddamn man that was so long ago, we getting old.","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Not including Ichigo in this is a crime.","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Only 2 characters in the picture were actually raging. Nothing wrong with rage powerups in battle shonen either, it's cool. It's also realistic since people irl get stronger through anger. When I do deadlifts I trash talk myself just to piss myself off lmao.","score":7,"comments":[]},{"body":"Gon's powerup was more than rage and it didn't come from his rage. His boost came because he gave up his humanity. He was completely broken. That's why that scene is more sad than triumphant. \n\nLuffy immobilizing Arlong with his fingertips was a real rage boost.","score":61,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Rage powerups are more towards DBZ and H2H.","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Funniest Moment in One Piece in years....","not_safe_for_work":false,"locked":false,"body":"","score":138,"comments":[{"body":"Wasting all that precious energy on a single archer? Kaido needs to learn tactics. Kaido truly likes fair fights.","score":54,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"damn kaido couldn't even kill a child and her horse and we're supposed to believe this guy is the strongest","score":53,"comments":[]},{"body":"What we learnt from this: Down D Stairs &gt; Kaido.","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I knew Kaido was Fraudulent...but still....","score":37,"comments":[]},{"body":"1. Why is she just drawing the fucking bow instead of shooting, Kaido is fucking huge, you can't miss!\n2. They actually survived that shit lmao","score":36,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"To kill somebody in one piece you need to role a 1 on a 1000 side dice","score":28,"comments":[{"body":"Funny how Ace landed that","score":17,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"And they didn’t die were barely injured. Once again Toei making the dumbest decisions just have Kaido blow some wind or hit them with his whispers. what’s even worse the episode before this they present him using the same attack to obliterate a mountain it makes no sense.","score":25,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Will of F (fraud)","score":12,"comments":[]},{"body":"Looks like she might slice off her ear with that bow lol.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Fraudhawk fans punching air right now","not_safe_for_work":false,"locked":false,"body":"","score":23,"comments":[{"body":"Killer of Observation Shanks fans when I tell them that a fish Luffy no diffed on day one is stronger than Shanks: (he killed Odas observation haki so he couldnt see him losing his arm to the fish made no sense)","score":22,"comments":[{"body":"Nah, shanks nullifying haki was a little weaker back then, it was hard to control so he nullified his own observation haki","score":7,"comments":[]},{"body":"😂","score":2,"comments":[]},{"body":"Dude you just don't know , shanks gave his arm to sea king becuase he knew sea king was hungry ( since he was trying to eat luffy ) , he could send luffy to guilt trip and he could give mihawk his flimsy title . All according to shank's mastermind . DON'T cry when oda reveals shanks is one piece and luffy can never have it becuase he can't surpass shanks becuase shanks is the real mc of one piece.","score":2,"comments":[]}]},{"body":"vista=mihawk&gt;=fish&gt;shanks","score":8,"comments":[]},{"body":"Vista is just built different. Don't hold it against Mihawk for not being able to beat his superior.","score":5,"comments":[]},{"body":"Fuck Oda and his inconsistencies.","score":3,"comments":[]},{"body":"All jokes aside though Mihawk's more likely around Admiral level, likely around Kizaru and Fujitora. \n\nCommanders usually get one shotted by Emperors but have had decent portrayals against Admirals, which fits the portrayal here.","score":2,"comments":[{"body":"tbf jozu got oneshotted by aokiji, and gb and akainu both solo’d yonko commanders\nlotta the top tiers are inconsistent to say the least","score":2,"comments":[]}]},{"body":" We got another Shanks fan boys. LETS PUSH THAT AGENDA","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Peak fiction","not_safe_for_work":false,"locked":false,"body":"","score":70,"comments":[{"body":"HAHAHAHAHAH THIS IS THE BEST THING IN MY DAY HAHAHAHA","score":12,"comments":[]},{"body":"Seven piece","score":9,"comments":[]},{"body":"5*","score":5,"comments":[]},{"body":"My stomach hurt","score":3,"comments":[]},{"body":"Akainu so strong","score":1,"comments":[]},{"body":"How can something be so blessed and cursed at the same time","score":1,"comments":[]},{"body":"Something similar to this is still possible in juanpiss, luffy's plot bs and convivence is that stronk. \n\nbut ofc non of them will die during the process. lmao","score":0,"comments":[]}]},{"title":"GODA has his influence all over the world","not_safe_for_work":false,"locked":false,"body":"","score":5,"comments":[{"body":"The third legendary!The third legendary is real!","score":2,"comments":[{"body":"CAN WE GET MUCH LOWER","score":1,"comments":[]}]}]},{"title":"Most of the fanbase doesn't realize this is a gag manga because Oda's jokes aren't funny.","not_safe_for_work":false,"locked":false,"body":"This IS a gag manga.  Every chapter we have multiple jokes one after another, and all the strawhats are stereotype versions of some form of a gag.   Sanji ogling women, Brook asking for panties, and all the other silly events.\n\nThe problem is since these jokes don't make you laugh, you never even realized Oda was trying to write a gag manga this whole time.  Kine'mon farting during a \"serious\" moment.\n\nLike think about how Nami is shown naked, that was meant to be a gag. But it wasn't a funny gag.  So it just came off as immature/rude to a lot of people.  \\*Oda is a comedian who no one finds funny.\\*\n\nThe only times people laugh is when Oda is trying to actually make a moment serious, like with the Ohara books or Greenbull ranting about celestial dragons or Luffy being vague about his dream.   Someone needs to tell Oda he isn't funny so he can stop making Sanji pervert jokes. He probably thinks you guys been laughing at those scenes the whole time.","score":6,"comments":[{"body":"its far from a gag manga. one punch man and gintama are shonen gag mangas. one piece as comedy but it takes itself too seriously regarding some aspects","score":1,"comments":[]},{"body":"It isn't a Gag manga. Gags 99.99% of the time do not drive the narrative forward which is the core meaning of gag manga.","score":1,"comments":[{"body":"You just prove my point, the sanji pervert jokes don't move the narrative forward.  One Piece has the slowest plot progression out of any shounen, even Gintama &amp; One Punch Man.   Most of Wano was filler.  So yeah it's a gag manga.  Gintama's arcs are much shorter so if that's a gag manga then one piece definitely is.","score":1,"comments":[]}]},{"body":"Nah it’s like 45-55% gag and uninteresting dialog to try and be funny. The rest is kinda alright","score":1,"comments":[]}]},{"title":"a lot of you need a reminder that World Government is still good for majority of One Piece World. Celestial Dragons are still Gods who created the world. They still need to maintain a rep. They can't go around openly committing genocide everywhere they want.","not_safe_for_work":false,"locked":false,"body":"I am tired of all these \"why can't WG use 16 lasers/Uranus on this and that island\". \n\nWhy are you acting like it's as easy a pulling a trigger of a gun?\n\nEven buster call is a big deal in OP world and remembered throughout the history for every attempt of theirs. Going around flexing AN ANCIENT WEAPON reading islands randomly on the fly gotta be dumbest thing possib when you been ruling for 800 yrs.\n\nWhy is it so hard to understand?\n\nEven lulusia kingdom was done after a shit ton of planning. (Atleast 2 weeks passed since gorosei asked for what's to be erased, upto the and of raid. And probably one more month after that upto Egghead rn.)\n\nThey got things to worry about. Stop acting like they are some random evil cartoon organization which only knows to kill and massacre.","score":5,"comments":[{"body":"the guys who slave people in the street, have no problem killing civillians in the spot, rape them have problems by showing a bad side to the public? thats new lil peeper","score":0,"comments":[]}]},{"title":"Is Yamato?","not_safe_for_work":false,"locked":false,"body":"\n\n[View Poll](https://www.reddit.com/poll/z3cmj4)","score":3,"comments":[{"body":"Ok guys here me out.\n\nIs?","score":1,"comments":[]}]},{"title":"Basketball match (Devil fruits allowed)","not_safe_for_work":false,"locked":false,"body":"Title.\n\n[View Poll](https://www.reddit.com/poll/z30d9v)","score":18,"comments":[{"body":"**Admirals take the dub. Better teamwork and versatility.** \n\nAokiji and Fuji on defense/as forwards: any shots that go up are blocked with a wall of ice or gravity well. \n\nAramaki as center, he can grow and make hundreds of limbs to get rebounds, Ally oops, etc. \n\nAkainu and Kizaru as PG/SG, Kizaru can literally go anywhere on the court and Akainu got that Bron-like energy to split the lane for an easy point. Logia DFs also give them insane movement. \n\nYonkos are a bit better on defense.\n\nBig Mom and WB as forwards, BM can use her homies to block shots and WB can disrupt plays with his quakes. WB might foul out if his quakes affect players though.\n\nBlackbeard as center, using darkness to pull in the ball and get rebounds.\n\nKaido and Shanks as PG/SG, Shanks is definitely the fastest of the yonkos and can get a bucket when he needs to. Similar to Akainu, Kaido would probably be more bully-ball focused. He can back you down in the key for an easy point.","score":21,"comments":[{"body":"Yo what if Big Mom could turn the ball into a homie??","score":6,"comments":[{"body":"Gonna have to be some type of foul or even worst since she is tampering with the ball which is illegal in basketball","score":5,"comments":[]}]}]},{"body":"Bro, one of the admirals can literally control gravity. You can't get more broken than that in a basketball match","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Kizaru alone make the big difference in match in favor  of admirals","score":9,"comments":[]},{"body":"Kizaru solos","score":8,"comments":[]},{"body":"Great, now the court, ball, hoop and backboard are Homies.","score":6,"comments":[]},{"body":"Yonko are just used to swinging stuff. Only Fujitora, Aokiji and Kizaru can do the same.","score":4,"comments":[]},{"body":" Wizaru solos","score":3,"comments":[]},{"body":"Kaido and Big Mom can just stand afront of the basket and prevent any ball from going through. Shanks uses Killer of Observation Haki to turn it off for Fujitora, making him basically useless, as well as preventing any observation haki in general for admirals to use. Could also use his haki to basically lock down Ryo, and probably Fujitora and Kizaru as well. Now all you have really is Aokiji and Akainu, but we still have Whitebeard (assuming this is WB before Marineford starts) who can incapacitate Akainu, and probably Aokiji too. So yea Yonkos are winning\n\n(assuming that hurting each other are allowed)","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"People Forget that One Piece is a Story about Pirates....","not_safe_for_work":false,"locked":false,"body":"EDITED: I've re-read One Piece 8 times and by every new reading is becoming clearer what kind of story Oda wants to tell... a story about PIRATES, and consequently a story about treachery. Yes.... its true: SHANKS WILL BE AN ANTAGONIST, AND A GOOD ONE AT IT. Shanks and Blackbeard are clear parallels to each one and to their respective captains/mentors - Roger and Whitebeard, but the big difference is that while the first two marked an era with good values, they really didnt accomplishe anything. it wasn't their time, they \"were too early\" as Roger said. But now... now its the \"PIRATE'S ERA\" as its been told since chapter one. And the Pirate Era will be marked by true pirates - scheming, shady, treacherous and ambitious - BlackBeard and Shanks, the two characters more close to a classic idea of what a pirate is. They will be a dark version of their mentors and the final wall Luffy will have to topple to be Pirate King. I'm gona divide my theory in points so it can be clearer.\n\n1. Black Beard and Shanks were allies since the begining and possibily cousins/brothers. Don't you think its odd that of all characters, we don't know Shanks name!? He will probably be Marshall D. Shanks or Something D. Shanks.\n2. Both of them had ties with the WG because they were part of royal family who was secretly a D. and thats why they were expelled and tortured and wanted to take revenge, be pirates.\n3. The point 2 gives some clues on how Shanks had the power to meet the Gorosei. But how if he is an enemy seeking for revenge? That's right he knows the secret of Marijoas! And is working as a double agent without them knowing.\n4. Teach scared Shanks because Shanks tried to convince him to kill Tatch in order to get the Yami Yami no Mi, part of their plan. Yes, Shanks is the mastermind who corrupted Teach. Teach at the end of the day was a lost boy who couldn't sleep, his main goal was always to dream someday, a peaceful dream...\n5. Shanks is using Luffy to unlock the One Piece because he always knew he was Joyboy, since the fruit choose him to be Nika. Does Shanks emphatize with Luffy? Certainly! Isnt he a true pirate who puts his goals above any ties? Yes! and that will be the true lesson Luffy will learn. What's the meaning of a true pirate, a lesson that Shanks left it unswared since chapter one \"comeback and give me the straw hat when you're a real pirate\" our hero will have a new answer to his mentor of what a real pirate really is!\n6. Shanks will kill Garp in front of Luffy and both of them will clash.\n7. Mihawk will be disgusted by the reveal of Shanks true intentions and will oppose him, but this time it's for real and Shanks, a cunning pirate, will not give his rival a final confrontation. Blackbeard will appear and kill Mihawk.\n8. Zoro + Luffy, who were always equals and parallels, will fight Black Beard + Shanks and will be victorious all of this in LaughTale. EDITED: **bb will defeat zoro and shanks will cut luffy's right arm so they're equal. like if luffy payed a debt. in gear 5, luffy will use zoro as is true RIGHT HAND, and zoro being luffys arm and hand will use a sword to finish both of them, like a combined attack. like luffy and zoro were only \"ONE PIECE\".**\n9. After the victory, we readers, will be digusted with Shanks but the secret of One Piece will reveal that him and Blackbeard were part of a prophecy and that they all did this for Zoro and Luffy to have their final lessoan and unlock the true power of One Piece in order to defeat Im and msot of wall, in order to change the world's geography as it was.\n10. Shanks was always led to believe he was an honorable pirate, there will be a twitst that he is a final villain, but at the end he will be a tragic hero, just like Itachi.\n11. Im will still be the final villain, and I don't have that much clue on how the final fight will be.\n12. Shanks and Blackbeard are references to true pirates, and shanks also means \"the realm that guards the dawn of men\". I think my theory is pretty solid.\n\n&amp;#x200B;\n\nSorry for my English!","score":9,"comments":[{"body":"Imma need proof, from panels, to even believe this theory. Seems just too far fetched. Shanks is just chilling.","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"So your theory is based off headcanon and wrong information.\n\nWe know Shanks' name, its &gt;!Figarland, a celestial dragon name.!&lt;","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Didnt read it enough his name is obviously Red Hair Shanks.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I didn’t read your post, but the title sounds very funny. Because Strawhats are so much far away from being what pirates are, it’s funny to say it’s a story about Pirates. It’s definitely a pirate world, but Strawhats are basically just a group of superheroes who go from island to island to save people from tyranny. Basically the complete opposite of what Pirates are known for and usually do. I love One Piece, but Strawhats can very very barely be described as pirates if we are being honest.","score":9,"comments":[]},{"body":"I was not expecting this reaction","score":9,"comments":[]},{"body":"Bro is reading Bleach Piece 💀💀💀","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"OP fans try not to craft a theory from headcanon and claim it legit challenge (impossible)","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This is hilarious","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"&gt;Black Beard and Shanks were allies since the begining and possibily cousins/brothers. Don't you think its odd that of all characters, we don't know Shanks name!? He will probably be Marshall D. Shanks or Something D. Shanks.\n\nI prefer aokiji being brother to teach. Or at least from the same homeland.\n\n&gt;Blackbeard will appear and kill Mihawk.\n\nLOL Oda is the worst writer on planet earth if this happens.\n\n&gt;Zoro + Luffy, who were always equals and parallels\n\nAlways equals? Lol no.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"shanks Fearland","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"As much as I HATE this design, I have to admit it's very likely to be Imu-sama's actual appearance. Hence I just put it here to Say \"I knew it 😏\"","not_safe_for_work":false,"locked":false,"body":"","score":55,"comments":[{"body":"You are the only reason I still wake up everyday with a smile","score":12,"comments":[{"body":"These are extremely kind words to Say 🙏","score":6,"comments":[{"body":"I just hope that one of your designs turns out to be true 😂","score":3,"comments":[{"body":"Tbh, This very One will probably be the closest of all of them.\n\nI'll keep having fun while I Can though 😇","score":4,"comments":[]}]}]}]},{"body":"Love these, you are doing God's (Imu's) work","score":5,"comments":[{"body":"Will be back for more. Next one is Dandy Imu","score":2,"comments":[]}]},{"body":"Where the wild things are. I am here for the stupid amount of sense that makes.","score":5,"comments":[{"body":"🙏","score":2,"comments":[]}]},{"body":"As I don't plan what I draw and do Everything randomly, I just realized that he might be on the Moon planting his flag.\n\nMy 2 cents","score":1,"comments":[]},{"body":"dude why do you this every day!? its wtf but hillarious","score":1,"comments":[]}]},{"title":"Is this devil fruit statement true of just a self statement","not_safe_for_work":false,"locked":false,"body":" \n\nYeah i see that aramaki stated that its logia its nature itself and thats its power can rival the see itself as shown here:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6327nwrs8t1a1.png?width=1228&amp;format=png&amp;auto=webp&amp;s=e3d2c0011832fb3abde906fb8695b9c96c0cb871\n\nBut is it the same as the other statements from the likes of:\n\n&amp;#x200B;\n\n[gura gura no mi](https://preview.redd.it/yw4qtox59t1a1.jpg?width=602&amp;format=pjpg&amp;auto=webp&amp;s=f28ac432da8e40fd285ad561495b335848c4ff13)\n\n&amp;#x200B;\n\n[hito hito no mi model nika](https://preview.redd.it/e58klp5a9t1a1.png?width=233&amp;format=png&amp;auto=webp&amp;s=e21b0d67b25384a231d03713866047fad4551faa)\n\n&amp;#x200B;\n\n[yami yami no mi](https://preview.redd.it/6i6w8hlk9t1a1.jpg?width=300&amp;format=pjpg&amp;auto=webp&amp;s=74ec140910a904a2bfb4aa989fbb2e78c2ed70e4)\n\nor is it just a selfstatement?\n\nI really want to know this answer.","score":5,"comments":[{"body":"His fruit is literally the woods woods fruit. Why would he be lying about trees being apart of nature?","score":1,"comments":[]}]},{"title":"What if Imu-sama was a Dandy? just a very wealthy man, from a good family that enjoys drinking wine and collects fine art?","not_safe_for_work":false,"locked":false,"body":"","score":16,"comments":[{"body":"How do you get this ideas? lol","score":4,"comments":[{"body":"Well outta my head I Guess 🤷‍♂️","score":3,"comments":[]}]},{"body":"I love how you draw eyes","score":3,"comments":[{"body":"To be honest, my only goal as an artist is to draw eyes.\nEvery single of my drawings's main subject are eyes.\nBy browsing [My DoubleFace Collection](https://www.deviantart.com/lartnestpasdemain/gallery/75989386/lartnestpasdemain-s-doublefaces) (My main collection of artpieces) you can easily be convinced about this.\n\nFor this Imu-sama series, I just draw some Imus around the eyes I already drew. I never plan anything, let myself be hypnotized by the drawing. \nThat's also why I never produce the same Imu twice.\n\nTL,DR: thanks a lot 😁👀","score":5,"comments":[]}]},{"body":"My headcanon is that he is both goofy and creepy at the same time. Judging by the silhouette, he definitely has expensive and exotic clothes. Maybe made from the skin of fishmen?","score":2,"comments":[]},{"body":"What if Imu was just a guy doing goofy drawings of himself?","score":2,"comments":[{"body":"Hahaha nice theory I Guess we have to wait and see 🤷‍♂️","score":1,"comments":[]}]},{"body":"I wonder when this sub will get tired of these shitty drawings.","score":-6,"comments":[{"body":"I wonder when your parents will get tired of you living with them.","score":7,"comments":[{"body":"Never, they love their little boy 👶","score":1,"comments":[]}]}]}]},{"title":"How did you start one piece?","not_safe_for_work":false,"locked":false,"body":"For me I thought it was too weird and character were shit then I played pirate warriors 3, I liked it now I’m enjoying it.","score":4,"comments":[{"body":"March 2004 Shounen Jump I ordered from a Scholastic magazine in the 4th grade.","score":2,"comments":[]},{"body":"An anime magazine was comparing who was stronger between Naruto, Ichigo, and Luffy. My brothers and I were like who tf is this Buffy guy? anyway eventually my brother found out about one piece and I thought it was completely stupid he was a rubber man but I still watched. I watched like 300 episodes in Spanish dub btw (not that anyone asked)","score":2,"comments":[]},{"body":"first scene i saw was whitebeard mercelessly crushing blackbeard's crew and it hooked me, i was spoiled about ace's death but i didn't care because he is dumb","score":1,"comments":[]},{"body":"Afro Luffy vs. Foxy anime clip","score":1,"comments":[]},{"body":"HxH left a hole in my heart so I looked up the most similar animes and people recommended OP.","score":1,"comments":[]},{"body":"I was catsitting for my crush during college. I was using her Netflix to pass the time and saw One Piece and thought \"fuck it, I'll give it a shot\", that was almost exactly a year ago today and now I'm a super fan lol","score":1,"comments":[]},{"body":"Either 4Kids or just a random Shonen Jump from Borders I think","score":1,"comments":[]},{"body":"One Piece was shown before the anime that i am waiting on TV, This happy boy punching out of a barrel took my attention.. after few days I got hooked to it especially when he met the badass swordsman(i tought he will be opponent)..after that i watched it every weekdays on tv because it only air on weekdays..and eventually i've catch up to the latest episode through anime streaming sites, that is when i started reading manga.. and i was so amazed that manga is even better","score":1,"comments":[]},{"body":"Just randomly started watching it when I was like 14 and liked it, then proceeded to binge 16 hours of it every day to ignore my responsibilities.\n\nRead the manga during timeskip break and switched to weekly chapters then I think","score":1,"comments":[]},{"body":"Just heard about it after watching attack on titan in 2016 and watched the East blue saga. I’ve been following the story on/off ever since.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Daily reminder that the only antagonist that ever managed to break Luffy’s spirit was Akainu. No other antagonist will ever come close to him for that reason alone imo.","not_safe_for_work":false,"locked":false,"body":"","score":402,"comments":[{"body":"Makes me think what would've happened to Luffy if Winbe wasn't there. Dude would've been in a very dark place without that pep talk.","score":156,"comments":[{"body":"Man would’ve been six feet under without Jinbe","score":104,"comments":[{"body":"Tell that to the guys who said jinbe’s bounty was overrated...","score":23,"comments":[]}]},{"body":"Fucking Winbe lmao.","score":66,"comments":[{"body":"Luffy got a huge scar from a punch that went through Jinbe.\n\nJinbe has no scar lol. Winbe indeed.","score":50,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Cool. But I hope you're ready to see Luffy defeat Akainu by tricking him into running off a cliff without realizing there's no solid ground under him until he looks down, prompting him to hold up a sign that says \"Yikes!\" before falling in water and drowning.\n\nAnd Akainu will scream \"AHH HOO HOO HOO HOOEY\" as he falls.","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Idk how people read this shit and go \"yeah, that sounds like a job for Sabo\"","score":80,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It is not really Akainu himself tho. It is the entirety of Impel Down and Marineford itself (you can even include Sabaody).\n\nHe got reality check on both arcs and it all accumulated to this.","score":120,"comments":[{"body":"Facts, tbh kurma gave him the first reality check","score":47,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Don't forget aokiji . He is the one who started the reality check gauntlet","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The Moria vs Kaido lore is kinda unnecessary?","not_safe_for_work":false,"locked":false,"body":"So Kaido seems to be dead or at least it looks like he won't come back any time soon, and it left me wondering what even the point of \"Moria lost to Kaido and got his old crew killed\" lore was.\n\nI'm not saying the lore itself is useless. On the contrary, it's the event that shaped current Moria. Afraid of losing his crew again he started to create horde of zombie soldiers who wouldn't die and he himself became lazy during the process.\n\nMy question is....... what does Kaido have to do with any of these? I know it's to establish Kaido's power as one of the 4 emperors but it simply doesn't sit right with me. Does it really have to be Kaido? We've had Kaido for 3 years and it never was brought up again. Sure it's for worldbuilding, hype, etc. so it's not even a foreshadowing Oda has to acknowledge but for some reason this piece of information just exists and is currently living rent-free in my head and I don't know what make out of it.\n\nI know the anime had a poorly animated sequence of Moria vs Kaido but it's very short and quite bad so I don't know if that counts.","score":0,"comments":[{"body":"It was to Hype up the New World pre ts. Same goes for Crocodile with WB. Just shows that the Yonko reign Supreme in the New World and unless you work for them you get destroyed.","score":1,"comments":[]}]},{"title":"What would be the most WTF moment if it actually happened in the manga","not_safe_for_work":false,"locked":false,"body":"\n\n[View Poll](https://www.reddit.com/poll/z3cykc)","score":1,"comments":[{"body":"Are People still not understanding Hyoris words?","score":1,"comments":[{"body":"people think that she's on some BDSM shit with burning stuff and torchs, i personally think she a nazi","score":3,"comments":[{"body":"Do you know what a nazi is? Because she definitly isnt one lel","score":2,"comments":[{"body":"yea I do know, do you know my fist? though so","score":3,"comments":[{"body":"Im so scared.","score":3,"comments":[]}]}]}]}]},{"body":"Of all characters Hawkins dessrves a fakeout death","score":1,"comments":[]}]},{"title":"One Piece Powerscaling + Chill Server","not_safe_for_work":false,"locked":false,"body":"Join if you want to have a good time with fellow one piece fans on discord. There is currently 110 members , but I am certain with our combined strength we shall grow.","score":1,"comments":[]},{"title":"Dumb BW question","not_safe_for_work":false,"locked":false,"body":"If the WG has a weapon capable of wiping out whole islands, and they what to stop the SH's... then why don't they target Islands the SH's care about and threaten to destroy them if the SH's don't surrender?\n\nhttps://preview.redd.it/5yxuzb27xp1a1.png?width=468&amp;format=png&amp;auto=webp&amp;s=2e63f76f642325a1ab3f5331342f7dfb86e472ea\n\nhttps://preview.redd.it/70t482e8xp1a1.png?width=602&amp;format=png&amp;auto=webp&amp;s=c00080f717093b545bf12c1bf6d073a7f3330bb5\n\nhttps://preview.redd.it/r6tajg29xp1a1.png?width=596&amp;format=png&amp;auto=webp&amp;s=d83044a836d68caac20e2832b9eeac2f96f936c5\n\nhttps://preview.redd.it/p817kxk9xp1a1.png?width=604&amp;format=png&amp;auto=webp&amp;s=a923237cfc6f387544837fd00468d88d61c70db9\n\nhttps://preview.redd.it/sbk0054axp1a1.png?width=592&amp;format=png&amp;auto=webp&amp;s=a9c280b5b9433a3d20843f1e2ddf09414f7b97be","score":15,"comments":[{"body":"Because they can't just go wiping out every island. Too many islands getting mysteriously wiped out so close to each other is bound to raise questions.","score":6,"comments":[]},{"body":"\"Why doesn't the WG start wiping out all of its member nations to stop the SHs?\"\n\nDoesn't seem like a very cost effective strategy tbh.","score":4,"comments":[]},{"body":"The point of the Ancient Weapons is that they are supposed to be kept secret.\nThe WG can’t just flaunt that they have one without exposing themselves.","score":14,"comments":[{"body":"what's the point of being secret? EVERYONE knows what a buster call is, and that the WG is no stranger to using force to get what they want. Just ask the enslaved countries...\n\nAlso, no one is going to notice a previous existing island and kingdom suddenly gone missing...\n\nHard to put the (Big-F\\*\\*\\*-You-Lazer) Genie back in the bottle after you let it out...","score":4,"comments":[{"body":"That’s part of the point. A Buster Call is what they use to send a message. This weapon (likely Uranos) is for Imu wanting to completely erase a location. It is meant  to be a secret because the WG than bans knowledge of the ancient world can’t go around using things from that ancient world willy-nilly. \n\nThe WG still wants to maintain the illusion of being the good guys, so going around using Ancient Weapons that they told people that no one should use defeats that purpose.\n\nThere’s nothing anyone can do about a disappeared kingdom either. It’s not like you can point and say “there it is!” When it’s literally gone without a trace. Most people would rather go along with the pretence because that’s what people do.","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"&gt;why don't they target Islands the SH's care about and threaten to destroy them if the SH's don't surrender?\n\nWG doesn’t have a weapon capable of wiping out whole island more specifically imu does and we have no idea what his/her motives even are\n\nIt’s a mystery that Oda has set up just like he’s been doing for the past 20 years, if you’re not satisfied waiting then Oda might as well also tell you what the one piece is","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Because Oda can't write a story where Luffy's actions have consequences","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Plot, you need to understand it's a fictional story 💀","score":2,"comments":[{"body":"Ironic how Ennies Lobby was about keeping the WG from obtaining pluton, when they had this Big-F\\*\\*\\*-You-Lazer the whole time...","score":4,"comments":[{"body":"Indeed","score":1,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Which fruit is the best in the series?","not_safe_for_work":false,"locked":false,"body":"\n\n[View Poll](https://www.reddit.com/poll/z36iar)","score":2,"comments":[{"body":"1. Ope Ope\n2. Yami Yami\n3. Hito Hito no mi model nika\n4. Nomi Nomi no mi\n\nThere’s a good amount of fruits that are still better than this most of this list or have the potential to be","score":2,"comments":[]},{"body":"The hobi hobi no mi","score":2,"comments":[]},{"body":"I just like the *nom nom nom*\nWhat were we talking about again?","score":1,"comments":[]}]},{"title":"Shanks: \"didn't see that comming huh? They don't call me the 'killer of observation haki' for nothing m8\"","not_safe_for_work":false,"locked":false,"body":"","score":233,"comments":[{"body":"based","score":42,"comments":[]},{"body":"This is why mihawk doesnt want to fight shanks","score":32,"comments":[]},{"body":"*teleports behind u*\npssh, nothing personnel kid","score":25,"comments":[{"body":"Coldsteel the swordsman? 👀","score":9,"comments":[]}]},{"body":"Lucky roo &gt; fraudhawk &gt; bb’s victim","score":16,"comments":[]},{"body":"Mihawk fans be like that aint fair. Then Ben comes along and said we are pirates not swordsman😂","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"that's what  you get for bringing a sword to a gunfight","score":7,"comments":[]},{"body":"Mihawk fans are punching the air right now","score":14,"comments":[]},{"body":"Mihawk &gt; Blackbeard's offscreened victim","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"![gif](giphy|26DOxzk67dwJN1nUI)\n\nDidn't see that coming too.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Hmmm…","not_safe_for_work":false,"locked":false,"body":"","score":113,"comments":[{"body":"Oda doesn’t really do revivals, he does fake out deaths. Similar but different in significant ways.","score":92,"comments":[{"body":"Lol he got around the rule he made for himself pretty well .","score":29,"comments":[]},{"body":"in your opininon, which of the two is worse?","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"And his favorite series was dragon ball, that's tuff","score":48,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I won’t do revivals but I also won’t kill people lol","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“My characters don’t die”.\nLast I checked Ace is a donut now and Wano also got some support characters dying.\n\nOda is trolling further with fake deaths.","score":7,"comments":[{"body":"Ace actually had the Mythical Zoan Model: Doughnut Lord that Akainu awakened \n\nhe will be back for the final war","score":5,"comments":[]}]},{"body":"Swear this gets posted every other week","score":13,"comments":[]},{"body":"Be honest piratefolk, Saul wasn't as popular as you're pretending him to be now","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":" And for that , I am doing fake out deaths instead  and barely killing anyone in the series","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Law vs Blackbeard shouldn't have been off-screened.","not_safe_for_work":false,"locked":false,"body":"Imagine if Rock Lee vs Gaara &amp; Kakashi vs Obito was off-screened.  \nImagine if everything Meruem did was off-screened.   \n\n\nFans defend this by saying \"Law isn't MC, he's not important\" or \"It's to hype up blackbeard and keep his abilities a secret\"  Meanwhile Fullmetal Alchemist, most fights don't have Edward in it and it hypes viewers up a lot watching what they can do.  \n\nI have never heard of any story becoming better by off-screening fights.   Would Dragon Ball Z even be worth watching if every fight without Goku was off-screened.  Letting side characters fights adds diversity &amp; unpredictability to the story, instead of everything just ending in a giant punch by luffy.   It also adds tension &amp; stakes since side characters can die unlike the MC.","score":60,"comments":[{"body":"I was ok with offscreen fights in the early and middle stage as it kept a top tier fighter strenght and abilities a mystery. But we're entering endgame now. All that mystery stuff should be done with.","score":27,"comments":[{"body":"Yeah cause eventually it'll be at the point where the first and only fights for any top tier will be the one they have to lose due to plot.","score":8,"comments":[]},{"body":"I mean... It's endgame and we still don't know what Luffy's motivation/dream is","score":4,"comments":[]}]},{"body":"&gt;It also adds tension &amp; stakes since side characters can die unlike the MC.\n\nPfft.","score":9,"comments":[]},{"body":"It shouldn't have been but it's the norm these days. Fights just don't hit the same and aren't something to look forward to nowadays. Too many off-screened fights, too many blue-balled fights, and with the recent low quality of the Wano fights I'm losing faith in Oda delivering on that aspect. I'm not going to be surprised or disappointed when the next time we hear about law it'll be a newspaper announcement that Blackbeard has captured Law.","score":45,"comments":[]},{"body":"Was it off screened? I dont remember it getting off screened","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You really think side characters can die in One Piece? They have just as much plot armour as the MC lmao.","score":4,"comments":[]},{"body":"Oda has long been unable to draw normal fights for characters whose name is not Luffy. So it's not surprising that it only shows 10-20% of the combat from the original 100%. One Piece as a combat shonen has long been dead. All hopes for the resurrection were in Wano, but they never came true. Empty fanservice without a clear combat system and hierarchy.","score":9,"comments":[{"body":"it doesn't help that Oda despite not wanting to give us real fights.  Has nonstop fight after fight each one ending in blueballs.  Switching back and forth between 8 different fights in one chapter without a conclusion on any of them.  Shit is terrible to read in Wano.","score":10,"comments":[{"body":"Plus, the fate of the losers is unknown. Even the fate of King and Quinn. Were they killed, left in jail, or taken to Impel Down? What about the rest of the Beasts Pirates and Orochi's samurai? There are 20,000 people there. Because of all this and many other plot points, Wano's story and arc feel unfinished.","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Favorite non mythical Zoan? Mine’s still gotta be Kaku’s Devil Fruit. He made being a giraffe cool asf","not_safe_for_work":false,"locked":false,"body":"","score":39,"comments":[{"body":"As a devil fruit it kinda sucks but kaku is just too cool for it","score":12,"comments":[{"body":"The man carried that fruit like a badass.","score":2,"comments":[]}]},{"body":"Lmfao he drew the worst looking fruit yet I respect him","score":7,"comments":[{"body":"He had no choice but to make it work lmao","score":3,"comments":[]}]},{"body":"Neko Neko no Mi, Model: Saber Tiger","score":4,"comments":[]},{"body":"I honestly like Jabra more","score":4,"comments":[]},{"body":"[Pell so far. Not a freak hybrid form.](https://i.imgur.com/nOkKt6c.jpg)","score":2,"comments":[]},{"body":"It's gotta either be the the saber toothed cat or the spinosaurus","score":2,"comments":[]},{"body":"Brachiosaurus.\n\nQueen wasted it's potential,but it's a really cool fruit and the hybrid looked badass.","score":1,"comments":[{"body":"Wasted it’s potential to do what? What Jack did but with a longer neck? Him being a cyborg is what gave the fruit potential in the first place.","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"RunPiece Episode 88","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[]},{"title":"[Chapter 1067] Rested Review: Vegapunk shows his true colors","not_safe_for_work":false,"locked":false,"body":"&amp;#x200B;\n\n[Ch. 1067 p1](https://preview.redd.it/q7b39jhsxo1a1.png?width=944&amp;format=png&amp;auto=webp&amp;s=d95041652387212e5c2918042dd9487ee8ce8c6d)\n\n In Germa 66, Caesar Clown arrives and we see he and Judge aren't in the best of terms. This is a cover story that shows something unlike the previous one. \n\n[Ch. 1067 p2](https://preview.redd.it/j9xnbyuuxo1a1.png?width=1034&amp;format=png&amp;auto=webp&amp;s=524ffc497c85ba504e7ddeaec60789221f68bd36)\n\nI apologize for the wall of text that will follow. There's a tl;dr just before the next pic.\n\nIt turns out that Vegapunk ate the Nomi Nomi no Mi (brain fruit). It lets him store infinite knowledge at the cost of a supersized physical handicap. Let's give this some thought:\n\n* This devil fruit allows Vegapunk to remember an infinite amount of information at the cost of enlarging his brain in a very uncomfortable, inconvenient and even dangerous way. A head the size Vegapunk had in the flaashback would make his neck snap at every move. That usually means death or *only* tetraplegia if *you're lucky*. Maybe such an injury could have been used so that his design referenced not only Albert Einstein but Stephen Hawking too.\n* I don't remember any other devil fruit having a benefits/cost ratio this low. Maybe the Doku Doku no Mi (Magellan's poison fruit) that has the user self-poisoned permanently would be a distant second place. Caribou has infinite storage inside his quicksands without the need for his body to become huge. The same applies to Bramenco's pockets and Blackbeard's darkness. Why would the brain devil fruit require for the brain to physically grow to satisfy the increase in storage capacity?\n* An average adult brain can store up to 2.5 million gigabytes (that's a bit more than 2500 x 1TB hard drives). If you're not familiarized with these units, let me tell you that is an unfathomable amount of memory. No human being ever has run out of memory space (unless there's malfunctioning involved) because having a limit makes our brain be selective about what information it stores and what it discards. That's why there are so many useless things we don't remember no matter how recent they are. And let me tell you too that the amount of memory space needed to store some information is not related to its usefulness in the slightest. For example, a single image in this post takes thousands of times the amount all the text in the post requires. A compendium of all scientific knowledge humans have ever discovered wouldn't occupy more than a 4k HD movie.\n* Having a brain the size of Vegapunk would mean that he remembers perfectly every single detail of every life event he has ever experienced. So, most of Vegapunk's brain's contents are useless. He's suffering a severe physical condition in exchange for remembering useless things such as what he had for dinner two weeks before his 28th birthday or what shape, color, origin and placement had all the stains he has ever had in his shirts.\n* What's worse, memory capacity is not the main nor the best feature of a bigger brain. It's computational power. What makes us humans really much more intelligent than other animals with a smaller brain isn't memory storage, but the more efficient way to use it. Specifically especializing brain regions in different tasks such as logic, language, etc. In the case of humans, memory capacity is in fact of very little importance because we have a variety of artificial ways of storing data. In the world of One Piece is widely spread the use of books.\n\n**tl;dr (because I realize this got out of hand): Memory capacity is the least important perk of having a big brain, if all that devil fruit does is turning you into a walking library and gives you a supersized head in exchange that's very likely to snap your neck at any time, this might be the most useless and hazardous devil fruit ever.**\n\n[Ch. 1067 p3](https://preview.redd.it/ju6l82521p1a1.png?width=1040&amp;format=png&amp;auto=webp&amp;s=04329620952f20e8486173cd3094f5c2e7d74a2c)\n\nThe sooner I speak... Faster access to data is the only perk to his devil fruit because it's all in his brain. He doesn't need to look for a book that has the info, he remembers. But since the handicap was too much, Vegapunk sacrificed his faster access in favour of mobility and lower instant death risk. Totally understandable. Why do I say he sacrificed his faster access? Because now his body isn't physically connected to his brain and he relies on an antenna. This is like the difference between having your laptop physically connected to the router or it using the wi-fi. Now his access speed to info has a bottleneck due to the antenna. All in all, in his current state, Vegapunk is a man who ate a devil fruit and he takes no benefit from it. He can't swim, his brain is disconnected from his body and far from it which raises lots of risks like what if someone bombs the island? Vegapunk can escape only for him to die anyway as his brain is destroyed. Or if someone just cuts off the signal either by damaging the antenna or blocking the brainwaves at Punk Records.\n\n[Ch. 1067 p4](https://preview.redd.it/euxm91v51p1a1.png?width=1032&amp;format=png&amp;auto=webp&amp;s=dae3856125702b08c2055dd3d620af89bf093f69)\n\nNote in the second panel that Vegapunk has been now been drawn in a handful of panels only, and his head's size is already inconsistent. I'm not joking. I refer only to the apple-top Vegapunk. The portion above his eyes changes in size from panel to panel.\n\nOkay... Am I the only one who has the feeling that this information is redundant and we already knew most of it despite it technically isn't? All the exposition we've been having about the satellite Vegapunks was (inconsitently) showing this pretty much, so now that this is explicitly said, it feels repetitive. And the two bits that would be truly new have their issues too.\n\nMy \"clones\". With quotation marks obviously, because they're not clones. So, Vegapunk should be saying what the satellites are (simply robots or cyborgs, in which case, are they purely artificial or modified natural beings... whatever) but he doesn't. So that part is just useless dialogue.\n\nThen he says the satellites connect to his brain once a day. Really? Why? I'm going to try and come up with an explanation for this to be consistent with what was previously shown about them, but first and foremost: If the second or third time a character is talking about one specific topic and not in a mysterious manner but trying to explain things, that topic isn't clear yet but rather it raises questions, then someone is doing an awful job at explaining things.\n\nOkay, we've seen how the satellites share feelings and can speak among them in real time. That means they're in permanent connection. It's pressumable that each one of them has a \"brain\" of their own for obvious reasons. A memory storage they won't exhaust in a lifetime, just like we don't either as I said previously, so they use Punk Records as a back up with the excepcion of possibly the True Vegapunk who might lack any brain other than Punk Records.\n\nThat would mean that he doesn't have the same connection the other satellites have among them. But why? If he can easilly be permanently connected to Punk Records why would the others, who clearly have built-in technology to permanently be connected to one another, not be permanently connected to Punk Records and the true Vegapunk by extension?? It makes no sense.\n\nBy the way, I'm leaving out of the pics some of the filler panels that add nothing of value and that just like last chapter they're more than a few.\n\n[Ch. 1067 p5](https://preview.redd.it/ac4yyr5a1p1a1.png?width=1033&amp;format=png&amp;auto=webp&amp;s=c101db121f052b1e05127d34334f0cd2d1e5d6b9)\n\nAnd just like that Vegapunk reveals himself to be the archetype of the hivemind villain. The villain that wants all people to merge in a single conscience. Vegapunk just said he wants to take over the world by connecting the mind of everyone to his.\n\nI like this because I didn't see it coming and I like it because it's not presented as an evil plan or something like that. I really detest the shallow evil villains that are bad for the sake of being bad. No one really does things because they're evil. Everyone thinks what they do and especially what they want to do is good and right. They might be wrong or even crazy, but ultimately they believe in what they want.\n\nThis is similar to a real fact that involves Albert Einstein. When Nazi Germany was doing research to creat an atomic bomb (they didn't exist yet), Albert Einstein wrote to the president of the United States and told him to start researching them too so that when Germany suceeded, they wouldn't be the only ones. Einstein was a pacifist and detested the idea of atomic bombs. However, his words were the ones that lead to the Manhattan prooject by which the United States succedded in creating atomic bombs. Germany on the other hand failed. Later, Einstein said that if he had known Germany would fail, he wouldn't have said anything to the US and atomic bombs wouldn't exist. He had the best of intentions, but they also lead to awful things.\n\nJust like Vegapunk thinks it would be great for everyone to become part of his mind, yet if you think twice about it, it's not difficult to see how terrible it would be.\n\n[Ch. 1067 p5 &amp; 6](https://preview.redd.it/yv76jg8d1p1a1.png?width=1106&amp;format=png&amp;auto=webp&amp;s=ea29587dc97637add0f3af117c5c7e049394a92d)\n\nJinbe raises some concern about Vegapunk's plan and Vegapunk happily takes a machiavellian approach and justifies everything in pursuit of a goal.\n\nBonney reproaches him, but not for his selfishness, the evilness or the flaws of his plan. She does it only out of a personal grudge.\n\nNotice how for the whole scene, Luffy disappears. He isn't even drawn in the distance or anything. I really think Luffy, who values freedom above everything else (not to mention he's now \"the warrior of liberation\" to be even more explicit), should have said something about Vegapunk's plan. And obviously something in the line of \"*you're evil incarnate and my number one enemy if you want all mankind to share a single mind.*\"\n\nBecause it's not just a regular hivemind what Vegapunk wants. He wants everyone to be connected to **his mind**. Not just any mind, not a common mind, no. **His mind**. So, if we take away all the sugar-coating in his words, what he wants is to colonize the mind of every person so that everyone is Vegapunk. Better worded, **so that Vegapunk is everyone** and only Vegapunk exists as a rational living being. Put this way, the evilness shows a bit more, right?\n\nSo, I find it disgustingly convenient that Luffy is nowhere near to speak his mind about it. I wonder if he's going to ignore this for the rest of the arc, given after this, Vegapunk isn't even depicted as a villain in the slightest but rather as a damsel in distress.\n\n[Ch. 1067 p6 &amp; 7](https://preview.redd.it/vruupwih1p1a1.png?width=1093&amp;format=png&amp;auto=webp&amp;s=b8c5e393069cf4f7d1d8d57a00c20c4c8fd1c779)\n\nBonney threatens Vegapunk with the jedi saber and guess what? Lots and lots of insects immediately come flying towards the light. Great. It's not shown, but I imagine the insects are killed by the jedi saber, right? I mean what else could be those lightnings roasting the insects, right?\n\nOkay, some questions:\n\n1. Why would the jedi saber toast the insects? In chapter 1064 (3 chapters ago) that jedi saber cut. It cut through metal even. And now the insects are merely burnt not cut.\n2. Given that now the jedi saber only burns without even deforming what it hits, why would that be any threat to Vegapunk who was introduced by using teleportation?\n3. We see the insects come from across the sea. This is just surreal. Where all those insects swimming in the sea waiting for a jedi saber to activate?\n4. How do they notice that?\n5. Do all insects come at once? So, after the initial batch there are no more left that will come? Wouldn't then be no problem in using the jedi saber again?\n6. Why didn't they come earlier when Bonney used it to cut?\n7. And most important, how much time are Bonney and Vegapunk waiting in that same position for the insects to come from so far away?\n\n[Ch. 1067 p7](https://preview.redd.it/3f722zgk1p1a1.png?width=1045&amp;format=png&amp;auto=webp&amp;s=f66debacf730f971362895b0912b634742639705)\n\nLook who's here now! Luffy wasn't there when his freedom and the rest of the world's was being discussed, but he's back to pick up a beetle. Way to dumb down the manga.\n\nBonney fainted upon the insect onsalught. If she fainted... how did she toast all the insects? I think we were just victims to a stupid way of conveniently getting rid of Bonney for the time being.\n\nNow look how well linked is everything in this scene. Vegapunk reflects on the irony of one of his failures saving him. Are we really to believe Bonney was seriously threatening him instead of that being just an overdramatic scene for the sake of flashy comedy?\n\nBonney wants Vegapunk to fix his father, why would she kill him before he can do that? But the most intelligent person in the world really thinks he was in danger. So... \"*speaking of which*\", right? No. Not right. You weren't speaking of that at all. You just started a stupid reflection in order to conveniently bring up this other topic. So, the question is, why would you want to talk about Momo's devil fruit now?\n\nThat is considering how awkward it is that he knows about ~~Momo~~ someone who ate his devil fruit, about him being from Wano, about him being in Wano... I mean, in the Government's side only the CP0 had that info. They're trying to kill Vegapunk, why would they have shared this or any other recent info with him?\n\nEven more, why would he leave a synthetic devil fruit of that caliber abandoned in Punk Hazard?\n\n[Ch. 1067 p8](https://preview.redd.it/wc725yqn1p1a1.png?width=1033&amp;format=png&amp;auto=webp&amp;s=b92e180f1fb62c641376c8e37a04bbbe183bc5e3)\n\nNow we know why you wanted to bring up that topic! To make this silly charade and try to show yourself as a humble guy while in truth you brought up the topic out of nowhere just to show off.\n\nSo far:\n\n1. World domination plan: **✓**\n2. Mass destruction weapons: **✓**\n3. Little or no moral concerns: **✓**\n4. Megalomaniac personality: **✓** **✓** **✓** **✓** **✓** **✓** **✓**\n\nYet he's not treated like the villain he is.\n\nAnd regarding the \"joke\". Did you laugh at this? Because I didn't. I wouldn't have laughed at this even over an internet text message.\n\nBy the way, anyone else thinks it's not the brightest idea to butt your head against the ground antenna-first when that's literally the one thing that separates life from death for you?\n\n[Ch. 1067 p9](https://preview.redd.it/3v5ugfqq1p1a1.png?width=1045&amp;format=png&amp;auto=webp&amp;s=0cddc6215665322cd03a386a9d414efc32fd16dc)\n\n\"*Make it move!!*\" Luffy was rooting for the robot to move too last chapter and he's vehemently showing his interest in it. That's good. That's what I would expect from Luffy. Basically because that has had much focus after the time skip everytime Franky showed something robotic. It makes me wonder what was happening through Luffy's mind back in Wano when Robin told her: \"*Hey, there's the Pluton down there. Do you want to like... take a look or something?*\" And he said: \"*Nah, not interested. In fact I haven't even really seen this country because I was captured the very same day I entered it and I only left prison to fight Kaido and now that I just woke up after the fight, I only want to leave. Nothing on this country has my attention. Not even a giant ancient warship of futuristic technology that has been very important during our journey as a pirate crew.*\"\n\nOn the other hand, reading something about 900 years ago and 200 years ago, I really like that. I think it's good to have more variety than put all the eggs in the same 800-years-ago basket as usually.\n\n[Ch. 1067 p9 &amp; 10](https://preview.redd.it/5vqnkheu1p1a1.png?width=1105&amp;format=png&amp;auto=webp&amp;s=7b437bcc5ccf9dd091dda265bf70833ade9e56bc)\n\nSo, a giant robot makes it to Marie Geoise and then runs out of power. The World Government wants it destroyed but scientists think it'd be interesting to study it. Up to this point everything seems reasonable.\n\nBut it turns out the scientists took the giant robot and brought it to Egghead and hid it there to study it. Well...\n\n1. I don't want to tell anyone how to do things, but in my humble opinion, that robot is not particularly well hidden. I mean, it's in an open area next to the shore of the island. Insects just got there from outside the island, they only had to fly in that direction. The very security measures of the island threw the protagonists right there after causing a very big explosion at the site and didn't care at all afterwards. I don't know... that's not my definition of hiding something.\n2. That's not my definition of studying something either. Usually you want to take a bit more careful approach with the things you study.\n3. The robot was right there in Marie Geoise, city of the tenryūbitō, who order its destruction but somehow before an admiral or some other military force can do so, \"scientists\" snatch it away. I find that hard to believe. Like, very hard. Marie Geoise is anything but unguarded and not really known for harbouring scientists, so... How come?\n4. This one I know it might be too much of a nitpick, but I'll write it for completeness I guess: How did they move the giant robot out of Marie Geoise and to wherever? Especially provided the orders where to destroy it, it seems rather obvious that the thing would need to be disassembled before it could be transported.\n5. Anyway, a group of rebellious scientists, betraying the World Government, took the giant robot from the void century that attacked Marie Geoise to Egghead and \"hid it\". How come no one has ever gone there to retrieve it and ensure it was destroyed?\n\n[Ch. 1067 p10](https://preview.redd.it/6ovrswix1p1a1.png?width=1042&amp;format=png&amp;auto=webp&amp;s=fd978c071be5abf951fbd43aa3feb2a6572edb9a)\n\nCan you believe that?? Aware that the giant robot is anything but hidden, we get additional useless panels to try and convince us it was well hidden. \"*Good job finding this place... it has a hidden entrance*\" Sorry evil old man, but you only need to come from the beach to get there.\n\n\"*Oh no, we didn't find it, it was a coincidence, we were lost*.\" Are we meant to believe that? Really? How come you didn't turn yourselves in at the nearest Marine Base accidentally since you were old and senile? Oh right, because not only is an ultra stupid excuse per se, it's also false. Jimbe was actually a bit younger, same as Bonney. So no getting lost. You're trying to divert the fact that you got there because a policeman pacifista opened a whole to that place from inside a facility.\n\nI don't know how relevant will that bit of info regarding fishmen be, but it's fake news. You can check chapter 620. 200 years ago, fishmen and mermen separate from other fish, form their own country, enter the World Government, establish friendly relations with the Government and even attend reveries. There was nothing like fishmen right movements then. They weren't discriminated against like they have been in the recent past. The same chapter explains the problems for fishmen mostly arrived with the Age of Piracy. That's 20 years ago not 200.\n\n[Ch. 1067 p11](https://preview.redd.it/c98aub102p1a1.png?width=1044&amp;format=png&amp;auto=webp&amp;s=1ce75b93f8f973907f088c9c9934c33d42c2a72f)\n\nLet me get this straight, the main feature of that robot was its incredible power source, so amazing that 200 years of study later, no one including Vegapunk could recreate it. Yet what happened to the giant robot in Marie Geoise is that it run out of power. Nice.\n\nOn another matter, oh how I await for the time someone takes the mask off that character that's been impersonating Luffy for so many chapters now.\n\nFirst he doesn't care at all when Vegapunk speaks about his world domination plans. But now, now he sticks his nose in something he doesn't know at all. That is, what happened to Kuma. None of us know. Original Luffy would be cautious and not judge something or someone based on the first thing he listens about it. The first example that comes to mind is Johnny &amp; Yosaku saying Nami killed Usopp and how they saw it with their very own eyes. Luffy decided not to outright believe it and waited to have more info on the matter. Not anymore. Bonney says Vegapunk is bad because he did things to her father, so Luffy just hates Vegapunk for it. Not for his world conquering intentions though. That, he doesn't care at all.\n\nIt's surreal.\n\n[Ch. 1067 p12](https://preview.redd.it/uarn0yd32p1a1.png?width=1048&amp;format=png&amp;auto=webp&amp;s=94eebd770cfbda73a4c3b747d0c30e3f29973b8f)\n\nPromises, nice! I can't wait for them to never be addressed again.\n\nVegapunk asks Luffy to take him away. If this was chapter 452 I'd expect the reason for such request to be something completely different than the immediate threat that represent the CP0 as they would more likely be a red herring. But we're in chatper 1067 and I'm afraid Vegapunk's reason is the obvious one. He doesn't want to die. This comes with some questions again:\n\n1. He can't take Punk Records with him so... Is his brain inside a cage so durable that he's confident people like Rob Lucci or Akainu couldn't damage it? Because otherwise... He's dead regardless of how far his body escapes.\n2. Why was Shaka a couple of chapters ago telling Dragon he'd die? He already knew about the Mugiwara pirates being there. If he thought an escape plan was possible, he wouldn't take his death for granted, so... does he believe on the escape plan or not?\n3. He was introduced last chapter by teleporting. I know I've said this already but... can't he just teleport away by himself?\n\nDo you see Luffy's face in that panel? That's the face of not knowing how to act because you once had a personality but now you're nothing more than a clown and it's got difficult to know when are you supposed to be serious and when aren't.\n\nLuffy doesn't know if he has to say:\n\n1. You have an apple instead of a brain, welcome to my pirate crew!!\n2. You want to steal the freedom of every single human through your hivemind project, don't expect help from me.\n3. You made Bonney cry, drop dead somewhere already you old creep.\n\n[Ch. 1067 p13](https://preview.redd.it/ydxz6sn72p1a1.png?width=1041&amp;format=png&amp;auto=webp&amp;s=ebaa7bcce2d081066513e4c007c5b363b69c0a1e)\n\n\"*Reports indicate Jewelry Bonney is here too*\". Reports from who?\n\n\"*She's served her purpose*\". More promises. short-term hype increases, long-term potential disappointment also increases. We'll see.\n\nCan someone remind me why are they returning a problematic seraphim to egghead if they plan to assassinate the one man that can fix it?\n\nAnd what's the point in putting a mask on if everybody knows who you are? At least for the previous CP0 agents we didn't know who they were. I mean, we immediately knew whenever we saw them because they weren't precisely hiding but at least their identities were unknown. We know all three CP0 agents this time around. Why? Because Oda has to put masks on them because Robin said not so long ago that masked agents are stronger than unmasked ones. If they didn't put a mask on, there would be no hype at all, and Oda can't afford that. But narratively and plotwise, it makes no sense.\n\n[Ch. 1067 p13](https://preview.redd.it/la5aclra2p1a1.png?width=1038&amp;format=png&amp;auto=webp&amp;s=e77906b0d33664ac3ae7e7db5e00c702c352a72c)\n\nThis chapter, despite being only 15 pages long, still has so many filler panels. But, wouldn't you just prefer a blank panel or one or two less pages instead of this?\n\nI mean, that's disgraceful. At this point Luffy should kick out of the crew everyone except Jinbe, Zoro, Brook and maybe, just maybe, Nico Robin. I remember the way Jinbe or Brook stood in front of Big Mom and then I see this... What were you doing for the last two years? Were you preparing to conquer de Grand Line or what?\n\n[Ch. 1067 p14](https://preview.redd.it/n93zmh4d2p1a1.png?width=993&amp;format=png&amp;auto=webp&amp;s=9109a1815e227df698f3d65a604b42708327dc17)\n\nA character addressing the situation at hand, making sense, honouring the attribute that was said to define him, not being overly dramatic, not attemtping an anti-climatic joke, getting shit done. It's my favourite panel of the chapter and it's actually the only one I'd spare. Because this should be the minimum standard.\n\n[Ch. 1067 p14 &amp; 15](https://preview.redd.it/4jd9gwqf2p1a1.png?width=1098&amp;format=png&amp;auto=webp&amp;s=79010ebb7b505298254fbb3db0208b800aa72f96)\n\nMystery! Why is Kuma running away? This one looks like it should have a short-term follow up so I'm inclined to think this will be addressed, but again, we never know nowadays, so we'll see.\n\nBy the way, this is the first time we see Kuma run. Do you know why? Because Kuma doesn't run. He teleports or pseudo-teleports with his devil fruit power. But plot required Kuma to be overly dramatic and yet not to actually leave the place so... Kuma doesn't do that anymore. It's time to use those strong legs he's got.\n\n[Ch. 1067 p15](https://preview.redd.it/9kg9cqji2p1a1.png?width=1051&amp;format=png&amp;auto=webp&amp;s=d414ae823aef60bee76044b8f31d7564c8703817)\n\nNo one knows why he's running. Everyone tells him to stop but no one does anything besides that. They're aware he's a pacifista. They should expect him not to answer and not to obey them.\n\nThere's a man there that stopped Smoker with his presence alone. Noy just stopped him but made him obey (and we're talking about Smoker here). But he can't stop a damaged Kuma unable to make three consecutive steps without tumbling. All for the sake of ending in a dramatic cliffhanger.\n\nAnd I want to end this review by noticing that a couple of chapters back I praised the illustration. I said it got way better. Well, I think the illustration is also good in this chapter too but there's a very big difference with respect to that other chapter. This one barely has any backgrounds. There are lots of panels that feel really empty. That's not good.","score":15,"comments":[{"body":"Least piratefolk analyst.\n\n&amp;#x200B;\n\nJokes aside, good analaysis of that, it could turn out to be true, just hope Oda doesn't have a GODA moment.","score":4,"comments":[{"body":"Yes, my style is really different than the usual around here. I'd love to be as creative and talented at doing memes as some piratefolkers, but I'm not, so I have to do with what I got \\^\\_\\^\"","score":5,"comments":[{"body":"Well, if the future posts will be as detailed and well thought like these, Piratefolk just got another good user.","score":5,"comments":[{"body":"Thanks! But... I've been here for a while, to be true. In fact I joined and started posting before the sub hit 500 users.\n\nYou can check other posts of mine in my profile. If you like detailed posts, you might like them.","score":5,"comments":[]}]}]}]},{"body":"Welcome back. [rested review] post. I heard this one got removed in the main sub. Sad..","score":2,"comments":[]}]},{"title":"KAIDO TRULY THE STRONGEST CREATURE 😍💪🐉🐲👹😈","not_safe_for_work":false,"locked":false,"body":"","score":463,"comments":[{"body":"Laido","score":116,"comments":[{"body":"100 Leasts Laido","score":43,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"He also failed to kill Orochi (Oda just wanted a cool scene where Kaido cuts off Orochi's head)","score":114,"comments":[{"body":"shit i forgot to add that in\n\nlmao more Ls for Laido","score":71,"comments":[{"body":"He couldn’t kill himself","score":89,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"The Speed/Tama moment in the Anime, is the funniest shit in the anime in years;\n\nThat was enough of a hint that Kaido was on Fraudwatch","score":68,"comments":[]},{"body":"Kinemon really should've died to Kaido. And if Ashura is to die anyway, atleast let him die to Kaido bruh, why kill him with a fkin dynamite when Kinemon, someone weaker than him survived Kaido's hits that are way stronger than dynamite explosion?","score":69,"comments":[{"body":"*Hyped up as one of the strongest scabbards*\n\n*folds Jack in base with ease*\n\n*does nothing else*\n\n*dies to dynamite*\n\n🗿","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Even failed to kill himself multiple times","score":51,"comments":[]},{"body":"one of oda's biggest flaws as a writer is his inability to kill a character","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"True or false?","not_safe_for_work":false,"locked":false,"body":"","score":314,"comments":[{"body":"He's the better brother for sure, just not the better character.","score":282,"comments":[{"body":"Bro really was about to get Luffy, Jinbei and himself killed over a playground insult thrown at him by Akainu 💀. He shit on everyone’s efforts and WB deaths just cause Akainu said “your daddy bad harr” completely disregarding everyone’s safety.","score":49,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"As a brotherly figure? I can't imagine anyone worse than Itachi to begin with.","score":159,"comments":[{"body":"yeah, all these people seem like the read another manga, itachi straight up tortures sasuke when he is introduced, than says he did it make him stronger but really just him giving him more trama, also hid the fact his family were dicks who were going to murder a lot of the leaf village. No wonder sasuke went full blown nuts at the end by trying to kill everyone to be leader, worked for itachi.","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Better brother yes. Better written character, no.\n\nNaruto gets a lot of flack in the modern day, but it legitimately was good for its time in the shonen-space.","score":64,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yes he is. Itachi was a Mass murderer and traitor. He is better written but was not a hero. He even admits that to Sasuke when his edp tensei version vanished. He said he wished he could do better than what he did. And that he wouldn’t go as far if he had another chance. And still his dumbass fanboys think of him as some kind of tragic hero „uwu he killed his whole clan and family to save the village and ofc sasuke“ ahh because the village was doomed to destroy itself or be destroyed in a civil war? Danzo gaslighted itachi into that.\nAce is a far better brother tho","score":64,"comments":[{"body":"It blows my mind when people try to defend Itachi's actions. I would have defended him too if he only targeted the leaders of the coup but this dude targeted babies and children too lmfao. People say that's because it would kill the possibility of family members taking revenge but what?. That's like saying when we sentence to death criminals, we should also kill their families because they might take revenge. It's just insane how people say that it was not evil of him to do that. The story/author was even painting it as if what Itachi did was the morally correct thing which just rubbed me the wrong way. I can get understand if Naruto/Sasuke understood what Itachi did but still admonished him for his actions but they were flat out praising him lmfaooo.","score":34,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Itachi as a character &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Uh yeah and that's the fucking point? At what point did you think Itachi was supposed to be portrayed as a good brother/person? He loves sasuke but that's not the only qualifier for good brother lol","score":6,"comments":[{"body":"Itachi himself is humble, even he admits to Sasuke when he’s reanimated that he regrets his decisions. But the story and every other character sure as hell loves treating him as a saint","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Could aramaki creat new lifeforms with the forest forest fruit like giorno giovanna?","not_safe_for_work":false,"locked":false,"body":"","score":20,"comments":[{"body":"No. Giorno can make luggage into a frog, blood into ants, guns into banana's, body parts etc. Green Bull can only make IKEA furniture and Christmas trees. Two different power sets lol.","score":10,"comments":[{"body":"Who wouldn’t want free IKEA furniture, best devil fruit.","score":2,"comments":[{"body":"No assembly required? Yes please!","score":2,"comments":[]}]}]},{"body":"I thinks that's a bit of a stretch,creating lifeforms other than plants will be too op.","score":3,"comments":[]},{"body":"My baby boy can make and enhance plant life,while Giorno's power is more akin to flat out transmutation by turning non-organic objects into creatures/living beings(ie his jellyfish tooth,frog/ladybug pin etc).\n\nIt's an entirely different set of abilities","score":1,"comments":[]},{"body":"In the viz translation he has the wood logia so I don't think wood can make live animals and stuff","score":1,"comments":[]},{"body":"crossover of my dreams","score":1,"comments":[]}]},{"title":"Me regretting criticising one piece, after the masterpiece that the last arc has been","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"facts tbh, Egghead isn't a masterpiece but man. Can't believe im calling a 6 to 8 out of 10 arc peak one piece rn. What Wano does to a mf","score":4,"comments":[]},{"body":"Wano was the biggest mistake Oda ever did, he will never top it 😭","score":13,"comments":[{"body":"Damn, what will happen to piratefolk then ?","score":3,"comments":[{"body":"Fanart subreddit","score":6,"comments":[{"body":"NOOOOOOOO","score":3,"comments":[]}]}]}]},{"body":"Did you see when Luffy revive them all ? Peak fiction !!!","score":1,"comments":[]}]},{"title":"Zoro dying would hit luffy more than ace?","not_safe_for_work":false,"locked":false,"body":"Definitely true\n\n[View Poll](https://www.reddit.com/poll/z36zn9)","score":1,"comments":[{"body":"His dream dies with zoro so most definitely.  honestly his crew is the think that kept him sane when ace died to lose anyone would break him","score":8,"comments":[]},{"body":"luffy has known zoro for 2 years","score":2,"comments":[]},{"body":"This question  is so disrespectful towards luffy's, zoro's and ace emotions. there are definitely better polls to make .","score":1,"comments":[{"body":"poor manga character :( i feel bad for them. we should send them hugs, k?","score":3,"comments":[]}]},{"body":"People here actually think Luffy cared about anyone in REMOTELY same way as he did for Ace? \n\nJesus.\n\nZoro not even been with Luffy for 1 proper yr.","score":1,"comments":[]},{"body":"It would still hit him hard but not as hard as Ace, he literally knew Ace for 90% of his life, while he knew Zoro for 10% of his life, sure it’ll hit hard af, but not harder than Ace, no one tops Ace imo when it comes to this for Luffy","score":1,"comments":[{"body":"Sabo probably would equal Ace","score":1,"comments":[]}]},{"body":"If the story was written realistically? No not at all.\nBut if Oda ever killed off any crewmate, especially the right hand, it would be played up as the worst loss to date and potentially the worst loss in the series for the sake of the narrative. The audience has known Zoro for like 25 years so the impact of the loss would have to reflect that.","score":1,"comments":[]}]},{"title":"Egghead vs Wano topics","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"That bottom board position doesnt even make sense. How is that black pawn even able to exist in the corner like that, that isn't possible","score":10,"comments":[{"body":"My brother in Joy Boy it’s not in a corner. The perspective is weird, and you don’t have a full view of the board.","score":10,"comments":[{"body":"Goober that shit is literally in the corner. Count the spaces. Board is an 8x8 and that is on the first tile.","score":1,"comments":[{"body":"I was mistaken. You’re right. Thought the camera and their position was making things seem off.","score":1,"comments":[]}]},{"body":"Bro count the squares","score":1,"comments":[]}]},{"body":"It makes sense.\nIt was played by Magnus Carlsen and Hikaru Nakamura\n\nand of course, it ended in a draw.","score":3,"comments":[{"body":"Show me a game where the pawn was in the corner, because its literally impossible","score":1,"comments":[{"body":"Because it's not in the corner :skull:","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"It's not in the back","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Wano is so shit that the fanbase thinks Egghead is some type of masterpiece when almost nothing happened outside of meeting Vegapunk.  \n\nThis community is so deprived of good storytelling that giving them the smallest of crumbs makes them praise Oda.  Frankly. Egghead so far is below most pre-timeskip arcs starting out.  Pre-timeskip was more funny, had more strawhat interactions, and wasn't just guy standing there giving exposition.","score":7,"comments":[]}]},{"title":"Jack - Joyboy","not_safe_for_work":false,"locked":false,"body":"Jack wasnt afraid to 1 v 2 Fuji and sengoku or to clap Zunisha. I think he would have been a great candidate for the nika fruit and to be a sucessor of joyboy if luffy wasnt around. what you think?","score":2,"comments":[{"body":"Jokes aside, I liked Jack a lot. He didn’t get his moment to really shine but he gets more hate than he deserves.","score":9,"comments":[]}]},{"title":"\"Marines aint shit but hoes and tricks! Lick on these nuts and suck the dick!\"","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[]},{"title":"I swear I didn't see anything about Egghead today","not_safe_for_work":false,"locked":false,"body":"","score":107,"comments":[{"body":"Forgot about piratefolk discussing Imu-sama's identity","score":33,"comments":[]},{"body":"Legit the only discussion I've seen about egghead so far is vegapunk's design","score":30,"comments":[{"body":"Rob Lucci and Saul","score":13,"comments":[]},{"body":"Because Oda off-screens shit?   We had Law vs Blackbeard get off-screened killing a lot of hype.","score":6,"comments":[{"body":"I already forgot about them lol","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Well, we got the vegapunk reveal, now we are waiting for what comes next. No need to speak if there is nothing to speak about yet","score":13,"comments":[]},{"body":"Egghead hasn't been super shitty or super good so this sub has no real reason to talk about it","score":9,"comments":[]},{"body":"There's not much to talk about yet that hasn't already been talked about","score":5,"comments":[]},{"body":"Because Egghead has actually been good. Alt least, other than the Saul reveal which was atrocious.","score":5,"comments":[]},{"body":"Egghead breakdown? Check post from u/the_real_katakuri","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Do you like the strawhat pirates?","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"Yes. I like them a lot. They are probably my favourite main characters in anime but I have only really seen a couple of animes so that is probably why I think that way.","score":7,"comments":[]},{"body":"Huh?","score":6,"comments":[]},{"body":"Who are they? never heard of them","score":12,"comments":[]},{"body":"Yes. Sure, they're basically caricatures rather than actual characters, but there's still a lot of depth to them which is both generic enough for you to build your own head canon off of while also being specific enough to where they all feel unique to each other. It's honestly impressive that Oda has managed to write all the SH's in such a way. Most writers can do this sort of thing once, maybe twice and even then that's for the main character. Somehow, Oda has done this 10 times.\n\nOda has the perfect template, now all he has to do is fill in the blanks.","score":3,"comments":[]},{"body":"Pre time skip,I love them all.Now not so much,excluding Luffy and Robin","score":3,"comments":[]},{"body":"I prefer the woolhat pirates","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yeah but better pre time skip. Man zoro was wasted in wano kuni, it was his arc to finally shine","score":3,"comments":[]},{"body":"Nah","score":3,"comments":[]},{"body":"yes and i would love if oda spread some light on the weaker crewmates","score":2,"comments":[]},{"body":"Of course. Why would anyone watch/read over 1000 episodes/chapters if they didn’t? That’d be concerning…","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Pedro my beloved","not_safe_for_work":false,"locked":false,"body":"","score":186,"comments":[{"body":"Don’t worry bro he’ll be back soon. 💪","score":34,"comments":[{"body":"which one?","score":18,"comments":[{"body":"Yes","score":33,"comments":[]}]}]},{"body":"Pro tip: don’t try to assault Nami (or anyone) in the shower lol","score":12,"comments":[{"body":"That scene was weird as hell","score":9,"comments":[{"body":"even weirder that it was in a shonen manga, imagine Ben 10 or Teen Titans having a scene like that Lmaoo","score":14,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Mecha Pedro will arrive to watch the dawn In the end of the final laughtale fight…. Because Nen become stronger after death….\n\nAnyways after using banking Dawn of redirection Bb is gonna get  rekt","score":11,"comments":[]},{"body":"My irl name is Pedro, I thank my mother everyday","score":3,"comments":[{"body":"My IRL name is Absalom, I thank my mother everyday too.","score":3,"comments":[]}]},{"body":"Thank God that Perospero put an end to this dangerous terrorist attacking a sovereign country","score":1,"comments":[]}]},{"title":"Nami is lesbian?","not_safe_for_work":false,"locked":false,"body":"Do you think nami is lesbian?\nNami is not interested in any men just like luffy to women.Nami always complement women.She said kalifa was sexy, carrot was beautiful in sulong form,has weakness for the eyes of female marine(tashigi),vivi and her bond is sus, wanted to save robin and hugged her in passionate way So Nami might be asexual or lesbian.She is not attracted to any male characters till now. Who do you think nami will end up with?","score":0,"comments":[{"body":"I guess Luffy is gay coz he shows no interest in boa","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"How old are you?","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"No, all those moments which people perceive as the evidence of Nami being a lesbian are either taken out of context or people just talking things at face value","score":12,"comments":[{"body":"she isn't attracted to male so she must be lesbian","score":0,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Oh man , this  theory really triggers the shippers . I honestly wouldn't be surprised if nami is a lesbian , she has this kind of \" all men are idiots \" kind of mentality , and is often bitchy towards men. A sbs said that nami is only kind to women and children . \n\nMy idea if nami's future is her being a single foster mother like bellemere .","score":3,"comments":[{"body":"that's why i kinda thought nami was lesbian but i got downvoted.","score":2,"comments":[]}]},{"body":"Just stfu and piss off","score":7,"comments":[]},{"body":"I think that Nami has meet more decent females than males. Its normal for her to not show any interest in men since every fucker they meet is trash.","score":3,"comments":[{"body":"yeah like sanji met viola and  pudding,zoro met hiyori who loves him,luffy met boa who loves him in different arc but  nami never met such male character till now. she might be single at the end😭","score":2,"comments":[{"body":"Yeah. Nami met Arlong, who scarred her for life, BB, Aokiji who looked at her tits, hell, even Vivi's father, a fucking king, tried to see her in the bath. There isn't anyone worthy for her. Most people in the story are men too and antagonist, she wont show interest. She was even kidnapped in Thriller Bark.","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Akainu &gt;&gt;&gt;&gt; Kaido","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Yea nah","score":6,"comments":[]},{"body":"That’s cool powerscaling and all but narratively doesn’t really matter.","score":2,"comments":[]},{"body":"Great and all but Oda already indirectly confirmed that [kaido is stronger than Akainu](https://www.reddit.com/r/OnePiecePowerScaling/comments/uwbu5f/person_asks_if_his_mother_is_stronger_than_akainu/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\nI still have more evidence I can show if this isn’t enough","score":3,"comments":[{"body":"Huh, didn't know he actually said that. Can't get any more official than that. Kaido is top1.\n\nI already have Kaido &gt; Akainu but what's the other one, if I may ask?","score":2,"comments":[]}]},{"body":"Will of K","score":1,"comments":[]}]},{"title":"Rob Wucci time","not_safe_for_work":false,"locked":false,"body":"","score":75,"comments":[{"body":"Well lucci finna beat lanjis ass . Sad times","score":27,"comments":[{"body":"happy times*","score":5,"comments":[]}]},{"body":"Nah.\nIt's Smoker.\nChapter 1070 we'll finally have the fight last setup in chapter 670 and built up since Loguetown.\n\nEdit: Also apparently Luffy ran into Smoker in Alabasta in chapter 168 soooooo","score":23,"comments":[{"body":"an upgraded smoker vs cp0 lucci might be cool","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Who? Who else but \"THAT\" man.","score":50,"comments":[]},{"body":"Wucci gonna kill someone to give more L's to Laido","score":15,"comments":[]},{"body":"The 5th yonko.....","score":7,"comments":[]},{"body":"Zoro! Who hasn't yet realized he's no longer on the ship.","score":7,"comments":[]},{"body":"It’s me, about to get my revenge","score":20,"comments":[{"body":"Isn’t monet dead tho ?","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Mounblutain","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"both are the \nsame","score":3,"comments":[]}]},{"title":"Literally","not_safe_for_work":false,"locked":false,"body":"","score":62,"comments":[{"body":"Aokiji was just misunderstood this whole time, what he told Robin was \"Saul gave his life to ~~save~~ see you\" see this is what happens when you go by low quality scans instead of the official translation 😎","score":46,"comments":[{"body":"Never doubt goda 😭😭😭","score":11,"comments":[{"body":"GODA!","score":4,"comments":[]}]}]},{"body":"It was foreskinned bros. Planned from the START. Say his name with me now: GOOODDDDDAAAAAA!!!!!!!!!!!","score":20,"comments":[{"body":"GODA","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I actually want an explanation for how black maria did this. Oda really just implemented a crazy power with no explanation. My current head canon is the weapon black maria used( head on a stick) had some type of magic or weird power","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Is it bad that I thought this was a leaked page before I noticed the Wano outfits.","score":11,"comments":[]},{"body":"Did this happen in the manga?","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Is that Nami ?","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Hi, my name is Jaguar D Saul, did you know that you have rights, the constitution says you do, and I believe that until proven guilty every man woman and child in this sea is innocent, that’s why I fight for you Ohara!","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I finally realized the joke and irony of Kaido","not_safe_for_work":false,"locked":false,"body":"It all makes sense now Kaido is unkillable and unable to kill. Does he have even 1 confirmed kill by his own hand? I don't care if you say Oden or anyone else what no it's not just my headcanon. This joke of a man could not kill 1 person and how Kinemon survived is just the gOdA french kiss seal of Pellproval strongest creature in the world hyped up for 7 years what an absolute failure but that's the joke! He can't even kill himself! He can't kill anyone! What no I'm not cracking up you're cracking up hahahah\n\nBet he's still not dead now mark my words he'll be back in the final war","score":11,"comments":[{"body":"Will of K: being unable to kill","score":11,"comments":[]},{"body":"Maybe he is cursed by that old witch.\nCannot kill or be killed.","score":4,"comments":[]},{"body":"Are we judging villians now by their kill count? Because if we do OP doesn’t have any good villians.","score":6,"comments":[{"body":"Akainu who committed genocide:\n\n![gif](giphy|CAYVZA5NRb529kKQUc|downsized)","score":21,"comments":[{"body":"Kaido who killed thousands of samurai over the course of years, entire army that went to raid Onigashima 10 yrs ago leaving Ashura behind, Moria's whole crew, been Oppressing a whole nation for 25 fucking years:\n\n![gif](giphy|t13LikHkOflrW)","score":2,"comments":[{"body":"Only has one onscreen kill and it was in a flashback.\n\n![gif](giphy|O5NyCibf93upy|downsized)","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Is there something I’m missing? Is there like a new influx of people that are just reading Wano now or something? There’s been a ridiculous amount of Kaido posts lately and he hasn’t been mentioned in several chapters.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"All I see is Kaido slander on here, are people really butthurt that bad about kaido?","score":5,"comments":[{"body":"I can’t blame them. Oda really overhyped Kaido as the strongest creature alive. How the hell did he fell so hard? People are also questioning if Kaido battle with Luffy was too early in One Piece.","score":11,"comments":[{"body":"The whole concept of the fight was not bad, it was just how it was executed by Oda.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Who?","not_safe_for_work":false,"locked":false,"body":"\n\n[View Poll](https://www.reddit.com/poll/z2wa40)","score":0,"comments":[{"body":"What would happen if Kuma repelled Barto’s barrier.","score":2,"comments":[]}]},{"title":"is Sabo written as an Ace 2.0 because oda regretted killing him off in MF","not_safe_for_work":false,"locked":false,"body":"\n\n[View Poll](https://www.reddit.com/poll/z2cih0)","score":16,"comments":[{"body":"More like oda being greedy here. Oda is known for  having his cake and eating it too. Here oda could not bring ace back since his death was confirmed, so he just brings sabo back. He tried to deceive us by saying look sabo had amnesia and all but bringing this character back had such a bad impact on the story and introduces some plot holes. Also it made the death of ace less impactful. For this reason i just hate sabo, which is so regretful as he has such a cool design and abilities. In my opinion, oda should have not made this character Sabo but instead a completely new character who met luffy during Dressrosa. Since it was revealed that luffy is dragon son during MF, he allied naturally with luffy and helped him by holding the marines and burgess. He could act as a liason between the revolutionary and SHs in the future, setting things for when luffy will meet with his father and all.","score":27,"comments":[{"body":"You took the word out of the mouth 😂","score":3,"comments":[]}]},{"body":"Oda really wants to have his cake and eat it too. He wants you to be both be sad for someone's death but also happy for his \"I am alive and partying scene\". Which is why he goes way too hard on showing someone is dead only to bring him back later as if nothing happened. With ace this was kinda impossible with that chest hole and everything. I think this same logic got us shank's back story. He wanted to make him a cool guy and a good mentor figure for luffy so he made a great sacrifice for his sake. But he also wanted him to not be a has been loser so he lost nothing from losing his arm. So he both made a great sacrfice and lost nothing. Selfless AND badass.","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Iirc, sabo as a character wasn’t even introduced until after ace died…. And ace wasn’t introduced until Alabasta….. it’s almost like oda was just making shit up as he went","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Rip Ace CHAN!","score":3,"comments":[{"body":"Ah do not worry we have ace at home.","score":2,"comments":[{"body":"You do?","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"No Sabo feels totally different as a character. The revo army connection mainly plus his fighting style has more martial arts","score":9,"comments":[]},{"body":"ace 2.0 is the bootleg version of the og ace.\nI hope he and the whole monkey family gets killed and strawhats too fck all the cringey jokers in this show.\nblackbeard is the mc.","score":5,"comments":[]},{"body":"Or maybe ace is sabo 0.5","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Rewatching One Piece","not_safe_for_work":false,"locked":false,"body":"So I’m rewatching OP and I’m on Skypiea and I just can not imagine watching this as it was coming out because I would’ve been TOO STRESSED to function. Having to wait a whole week between some of these episode would’ve sent me spiraling for sure! Lol this really was a great Arc. As always I continue to believe Oda is one of the best Mangaka’s to ever exist. His story telling amazes me and draws me in even after watching it multiple times. I couldn’t help but scream and yell at the tv like the first time I watched. Eneru is still a B word for sure! I love how Luffy figured out how to beat him in the most Luffy ways. I think Skypiea is still one of my favorite Arcs. Luffy is such a great character! Crying for Going Merry 🥺🤧","score":2,"comments":[{"body":"Thought this was posted on the main sub then saw it was piratefolk, now idk if this a genuine post, a copypasta, a bait post, or something new….🗿","score":3,"comments":[{"body":"This is an actual post with my actual thoughts from an actual person who is actually watching OP again.","score":2,"comments":[{"body":"![gif](giphy|9WXyFIDv2PyBq)","score":1,"comments":[]}]}]}]},{"title":"Who is the most powerful admiral now?","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"Kizaru","score":10,"comments":[{"body":"This. He just don't show it. But his DF is strong af. His only counters are Future Sight which is incredible rare and armament Haki. No other element counters it. Meanwhile Aokiji and Greenbull both can be countered by fire.","score":6,"comments":[{"body":"Greenbull has fireproof forest","score":1,"comments":[]}]},{"body":"What he said","score":1,"comments":[]},{"body":"Akainu.","score":1,"comments":[{"body":"He counts?","score":1,"comments":[]}]}]},{"body":"Kizaru but their all close","score":1,"comments":[]}]},{"title":"What if Imu-sama is the Legendary Sad Boy ? perfect antagonist for Luffy that won the War during the void century with the power of sorrow","not_safe_for_work":false,"locked":false,"body":"","score":139,"comments":[{"body":"He's sad for THAT reason","score":56,"comments":[{"body":"Because of what happened THAT time in THAT kingdom 🔬","score":37,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Joy boy vs sad boy..what a clash?! Sad boy ate a mytical zoan fruit too.","score":37,"comments":[{"body":"Maybe he's the moon god. Maybe he Can fight with his tears. Idk 🤷‍♂️","score":22,"comments":[{"body":"Ok but if we gonna go there, Joy Boy's rival is clearly Sad **Lad**.\n\nGotta keep up the nifty rhyme scheme, even for genocidal supervillains, after all.","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"And when luffy defeats him he covers his head","score":15,"comments":[{"body":"He covers his head first thing in the morning 🤣","score":8,"comments":[]}]},{"body":"keep em coming","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Sounds goofy enough to become canon","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What if imu Sama is Magellan he works at a prison and Luffy loves freedom and shit","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Any thoughts?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"No one genuinely has a clue on how strong EoS characters would be, why are you even scaling them 😭 (Not to mention 30% of these characters you listed are still featless, you acknowledged this but still wanked their fraud asses 💀)","score":2,"comments":[{"body":"[read this ](https://www.reddit.com/r/OnePiece/comments/z1r665/was_seeing_a_lot_of_posts_about_eos_power_levels/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button)","score":1,"comments":[]}]},{"body":"For a prediction based thing like EoS i think this is actually pretty good.  That being said even putting unlikely after it,  i don't see how Usopp even comes up for discussion for the list.  Idk maybe I'd ballpark something like 80 for a max","score":1,"comments":[]}]},{"title":"Question: if the god fruit theory is correct and aramaki's ate one of the god fruits i.e. the god of the forest then what would his awakened power be?","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[{"body":"I think all the admirals have awakened their devil fruits and that’s why they can effect the environment how they do","score":9,"comments":[]},{"body":"Don't know exactly what the god fruit theory is but after Nika was revealed I thought it would be funny if:\n\nBrooks awakening made him the god of death/underworld\n\nChoppers awakening made him the god of wisdom (or something)\n\nAnd Robin's awakening to make her Durga (Hindu god with all the arms, I apologize if that isn't right or is disrespectful in some way I just looked it up and am not familiar with the religion)\n\nHonestly it would ruin the manga even more to just start making everyone gods but it would definitely be funny.","score":7,"comments":[]},{"body":"If the “god fruit theory” is correct then the powers those fruits have probably won’t reflect whatever god title it’s linked to, at least directly like in this case. They could end up being anything . Luffy’s fruit grants him a rubber physiology not solar powers. And The fruit itself is the hito model nika. Nika is referred to as a “sun god” (most likely because of a previous user) by people not that it actually is one with respect to classification","score":2,"comments":[]},{"body":"Morning wood","score":2,"comments":[]},{"body":"Not being a bitch.","score":1,"comments":[{"body":"He's already one with or without awaken","score":1,"comments":[]}]},{"body":"Wtf is the god fruit theory?","score":1,"comments":[]},{"body":"Bullshit, that’s what it would be","score":1,"comments":[]}]},{"title":"He’s here","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"Dope.","score":1,"comments":[]}]},{"title":"Who has the most versatile logia aramaki or eneru","not_safe_for_work":false,"locked":false,"body":"\n\n[View Poll](https://www.reddit.com/poll/z2lru5)","score":0,"comments":[{"body":"I'm surprised enel doesn't have more votes. Enel is a fundamental force. You don't get more versatile than that.","score":2,"comments":[{"body":"That’s because mr aramaki is Mother Nature so people assume he’s mythical god and stuff","score":0,"comments":[]}]},{"body":"Oda can create a tree with any imaginable random power, so Aramaki","score":2,"comments":[]},{"body":"We don’t even know the extent of what Aramaki can do.\nIf it’s like Hashirama cells bs then it could get pretty ridiculous.","score":1,"comments":[]},{"body":"If Green Bull can manfiest anywhere there’s plant life then I would easily put him above Enel. He did go from his giant forest form to a sprout a distance away, but I’d like to see him do it from a considerable distance.","score":1,"comments":[]}]},{"title":"even wapol got to be a king","not_safe_for_work":false,"locked":false,"body":"","score":185,"comments":[{"body":"Doffy still being the best villain in OP is sad","score":17,"comments":[{"body":"Ikr...big mom was good tho but doffy is just another level","score":4,"comments":[{"body":"Right ? Doffy was till this day goated BM had potential in WCI then Wano ruined her. Kaido was just sad.","score":5,"comments":[{"body":"That is why I said doffy is just another level...big mom is nowhere near him","score":1,"comments":[{"body":"Yea I was agreeing I didn’t know I typo’d 😅","score":2,"comments":[{"body":"Its okay...anywho, DOFFY = the best written character by oda","score":1,"comments":[]}]}]}]}]},{"body":"The bar is pretty high imo, the problem is that no one is even close other than Akainu that killed a sibling of the MC, Magellan that is a gigachad and an antagonist not really a villain, and Crocoboi.","score":4,"comments":[]}]},{"body":"Amount of times Doflamingo mid-diffed Law: 3  \nAmount of times Kaidou mid-diffed Law: 1","score":14,"comments":[]},{"body":"Kaido was supposed to surpass him, yet instead he was a horny drunk (oda why)","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Wapol has caused more deaths than laido","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"RunPiece Episode 87","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[]},{"title":"I liked the raid.","not_safe_for_work":false,"locked":false,"body":"It to me was very entertaining, had its issues cough *mink medicine* cough but was interesting and kept me reading and watching the series. It was still rushed to me and the conclusion seemed super quick and overly simple but all in all the Raid was cool.","score":35,"comments":[{"body":"The biggest problem I have with it is the way Oda disrespected Big Mom for no reason lol. Also the focus on Otama was way too much imo.","score":33,"comments":[{"body":"oda prefer to focus on 9 sacabbards, otama, momo and ice oni fodder than on kaido flashback","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Was it really a raid though? Marco existed simply to stall for Zoro and Sanji, labbards somehow didn't die against Kaido, most matchups were shit, characters were running up and down, roof piece purgatory, characters that were beaten wouldn't stay down, Big Mom was a joke and did more harm than good and Queen destroyed his own forces. Beast pirates were so trash it's amazing they didn't implode by themselves earlier. Strongest creature in the world couldn't take down anyone btw.","score":21,"comments":[{"body":"enemies were acting like their IQ was 1 digit","score":10,"comments":[{"body":"Queen: kills his own men  \nAlso Queen: why are my men betraying me?\n\nKaido: I beat Luffy but he keeps coming back stronger, I should kill him now and end the raid\nAlso Kaido: ehhhh I'm not gonna kill him \n\nPeak intellect.","score":7,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"How dare you like the raid 😡😡 , we are supposed to absolutely thrash oda here","score":31,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Giving you a like for being open about it on the sub, keep it up","score":4,"comments":[]},{"body":"The only thing I really disliked was how rushed the end felt. The raid itself was pretty fun to read imo","score":11,"comments":[]},{"body":"i hated it it was boring and had no tension","score":5,"comments":[]},{"body":"The only way the raid would have been better is if zoro died and Moria showed up and made him a zombie along with ryuma, then they perform dual god twister together and kill kaido.  Afterwards moria joins straw hats and marries big mom, calming her down.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Anyone here who is fan of Whitebeard or Marco(could be both) but hate Ace?","not_safe_for_work":false,"locked":false,"body":"Just for research\n\n[View Poll](https://www.reddit.com/poll/z2g8oe)","score":0,"comments":[{"body":"Eh I wouldn't say I hate Ace, but I definitely dislike him.\n\nLuffy went through so much to save him, and Ace threw his life away (and almost his brother's) all over words. \n\nLike Ace should have known how strong Akainu was. Since he was a commander, he should know to get away from an admiral. Especially when his fodder (at the time) little brother was around.","score":7,"comments":[]},{"body":"Used to Love Ace till he threw out everyone’s sacrifice by taking such simple bait and running back to fight Akainu where he proceeds to get one shotted","score":6,"comments":[]},{"body":"I don't really like any of them but liked whitebeards and marcos abilities enough to like them too","score":2,"comments":[]},{"body":"Bruh.... Ace is mid af. Luffy, Law and Kidd are stronger than him in lesser time than Ace was as pirate.","score":2,"comments":[]},{"body":"Ace is one of the dumbest most stubborn characters in the series, he deserved to die tbh. I still don’t hate him though lol","score":2,"comments":[]},{"body":"I love ace","score":1,"comments":[]},{"body":"F you, Ace! The dumbest WB pirate!","score":0,"comments":[]}]},{"title":"Idea for a 4d chess maneuver that Blackbeard could possibly pull off: Fake final war.","not_safe_for_work":false,"locked":false,"body":"This plan might require that Blackbeard has knowledge on how to read poneglyphs himself. But then you might be asking: \"isnt that what Pudding is for?\". Think that him capturing Pudding is a fakeout, and essential to this plan.\n\nHe will have Pudding read the poneglyphs in full view of everyone. He will also make sure that a Cipher Pol agent is nearby and escapes.\n\nBecause he is betting that Pudding will not actually read out the coordinates, but make shit up. Either out of malice,  or so that she can buy time for herself.\n\nSo that these 3 fake coordinates get leaked to the navy and cipher pol, which will have them searching all along a triangle for Raftel. \n\nSo with those people occupied, he will be able to do whatever he was planning unhindered. If he knows how to read poneglyphs, which he could due to having archeaologist leanings, he could actually just do the search himself on the triangle. Or he could realize that there's something on the last poneglyph that he needs as a clue, motivating him to search it out.","score":22,"comments":[{"body":"Nah too pre timeskip-ish them days are gone.","score":5,"comments":[]},{"body":"-The WG seems more interested in stopping people from getting the OP than having it themselves \n\nI’d imagine their response would be to increase surveillance on BB’s movements rather than sending out resources to follow any kind of trail \n\n\n-But even still, the World Gov is massive and could easily threaten BB while being led astray. Honestly that’s only thing these guys do right, not taking bait and being conservative with their important strength.","score":3,"comments":[{"body":"1) every pirate would gather around that triangle, forcing all the marines to go there.\n\n2) The WG has taken the bait everytime it was offered by Teach.","score":1,"comments":[{"body":"1.) The marines would do the opposite \n\nThey actively encourage situations where pirates take each other + no high level pirates would fall for false level info so it’d be a bunch of fodder going at it \n\n+ the marines in this situation would think that Blackbeard has all 4 ponegylphs. Why would they suddenly let him go + again the marines would never spread themselves too thin and  would be able to deal with Bb\n\n2.) When?\n\nBlackbeard tricked them with the warlord system but that was an insanely flawed system that was asking to be exploited. I mean literally every warlord was screwing over the WG. That’s was just more the WG being stupid than BB getting one over on them.","score":1,"comments":[{"body":"1) The marines would only think he has 3, enough to search a triangle of possibilities in the New World. Also, people in this situation would think that they got leaked rather than it being a trick.\n\n2) the entire Marineford saga was engineered by Blackbeard to make the Whitebeard pirates fight the WG. That was the bigger bait. He got one over on them by making them engage in that war.","score":1,"comments":[{"body":"1.The poneglpyhs are some of the most important treasures in OP +  they hard to access and no one in history has ever leaked such information. For someone to find a poneglpyh at all they’d have to be powerful, knowledgeable, and interested in the one piece. In this theory, it would be like someone going on twitter and leaking nuclear launch codes. Not only would the government want to focus on the leaker. But most people would take it as a joke since nukes are way too important to get leaked so casually. \n\n  \nAlso and this a big thing. Why would the World Gov ignore BB. This whole plan hinges on Blackbeard diverting attention away from himself. But why would the WG ignore a powerful guy who just found a poneglyph? Like even with the threat of other pirates, it would make no sense for the WG to ignore the dangerous individual right in front of them. \n\n2.) He didn’t make them engage in the war. The WG actively prepared for and goaded WB into attacking. They treated the whole thing as a spectacle to prove their strength. They weren’t at all forced into it.  knew exactly what they were doing and wanted to fight.","score":1,"comments":[{"body":"&gt;1.The poneglpyhs are some of the most important treasures in OP + they hard to access and no one in history has ever leaked such information. For someone to find a poneglpyh at all they’d have to be powerful, knowledgeable, and interested in the one piece. In this theory, it would be like someone going on twitter and leaking nuclear launch codes. Not only would the government want to focus on the leaker. But most people would take it as a joke since nukes are way too important to get leaked so casually. \n\nAll depends on who's doing the leaking and the circumstances behind the leaking tbh\n\n&gt;But why would the WG ignore a powerful guy who just found a poneglyph?\n\nIf the Poneglyphs are portrayed as only having information relating to the location of the One Piece and everyone beleives that, that means that the Poneglyphs are useless when their only encrypted information has been convincingly leaked. That would make the Poneglyphs useless.\n\n&gt;They weren’t at all forced into it. knew exactly what they were doing and wanted to fight.\n\nMarineford would have never happened had it not been for BB. Stop it.","score":1,"comments":[]}]}]}]}]}]},{"body":"Ugh that would actually be really cool.\n\nToo bad it won't happen lol.","score":6,"comments":[]},{"body":"oda doing sum cool like that yeah aight","score":3,"comments":[{"body":"i like this idea tho","score":3,"comments":[]}]}]},{"title":"Sanji only beats bepo and killer from this list","not_safe_for_work":false,"locked":false,"body":"","score":155,"comments":[{"body":"What an insane take","score":137,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Op power scaling is cancer","score":103,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"As a sanji fan, this ain't my mans lol. Check out this guy called Porter Peak II on twitter too, he's this dude's Zoro equivalent and the takes are equally hilarious.","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Mid diffs Katakuri and King??? Bro why even have bepo on the list too","score":18,"comments":[{"body":"The picture was a cover spread which Oda later confirmed was the 2nd strongest of each of their crews. Including Zoro, basically a confirmation he's #2 in power after Luffy.\n\nBepo is the 2nd strongest of Law's crew...says a  lot about his crew.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I’m sorry mid diffs KING?! High diffs ZORO? WE’RE TALKING CURRENT SANJI!?!?","score":102,"comments":[{"body":"What are all these words?!","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This guy is like me when I talk about lolanola zolo","score":23,"comments":[]},{"body":"Only way sanji gettin past marco is with sea prism stone handcuffs","score":57,"comments":[{"body":"Sea prism shoes","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"oda☕","not_safe_for_work":false,"locked":false,"body":"","score":82,"comments":[{"body":"To be fair kaido had a pretty dumb look when first “introduced”. Eventually oda realized how little people could take such a character seriously. So hopefullly he does the same for imu","score":6,"comments":[]},{"body":"u/lartnestpasdemain","score":7,"comments":[{"body":"😇","score":10,"comments":[{"body":"At this rate I am not sure if I will be surprised by oda's design for im","score":4,"comments":[{"body":"My goal is that when he reveals it, I'll be able to Say \"I knew it\"\n\nI'm no Oda though, I know he'll do better than whatever I Can think about, since he crafted it carefully for 25 years.","score":6,"comments":[]}]}]},{"body":"He is a god damn genius","score":3,"comments":[]}]},{"body":"Me, since chapter 1 ------ Me, before chapter 1","score":6,"comments":[]}]},{"title":"Dumb BW question...","not_safe_for_work":false,"locked":false,"body":"Before Bon woke up, Luffy's treatment had gone on for 10 hours. Then after some more time Passed, Luffy was healed and continued to save his brother...\n\nQuestion: After watching Luffy and Bon, knowing Luffy and Ace were brothers, and also being known for rescuing prisoners... during Luffy's recovery, why didn't Eva go rescue Ace?\n\nhttps://preview.redd.it/jiderloikl1a1.png?width=398&amp;format=png&amp;auto=webp&amp;s=f9fc8ac6322d7c154fe7f4effd43ae0c37acee19","score":2,"comments":[{"body":"No, Ivankov learned Luffy was dragon's son only after his treatment.","score":10,"comments":[{"body":"So...\n\nHe knew Luffy and Ace were bros and Luffy nearly died to get as far as he did... why didn't Iva go save Ace while Luffy was being treated?","score":-7,"comments":[{"body":"Why would Ivan care about Ace?","score":6,"comments":[]},{"body":"Ivanvok had his own responsibilities wym","score":3,"comments":[]},{"body":"Lol, why exactly would Ivan care to save ace ? He didn’t know luffy was dragon’s son until after he woke up. U don’t throw away ur fellow revolutionaries and prisoners for some random dude’s brother . \n\n- also u do realise he’s in Prison right? It’s not like he was in a shopping mall to simply go and grab ace . He would risk the position of all of his revolutionaries etc and also just because u like a random dude, u don’t go to save another prisoner without knowing him. All he knew was luffy and ace are brothers . He had no idea luffy is dragon’s son.","score":3,"comments":[{"body":"They would save random prisoners ALL THE TIME, and someone as important as Ace would be worth the risk considering Iva was willing to heal Luffy...\n\nThat's like saying, \"you put on a good show for us and we were cheering you all the way. Were also willing to heal you, but your brother whom you were risking your life for... yeah were just going to leave him where he is\" then later, \"Oh C\\*\\*\\*, Ace might be dragon's son... in hindsight, maybe we should have saved him a lot sooner\"\n\nThey are A\\*\\*holes as characters, and bad writing for Oda. He could have given a better reason...","score":1,"comments":[{"body":"What do u mean bad writing? U want Iva to try and rescue ace (the most important prisoner in the world at that point ) because he liked a random kid he never knew about before and doesn’t know who he is? \n\n- Iva was planning to hide and collect more and more army of weaker prisoners because taking in level 6 prisoners can be risky on the terms of that person being evil and the government cracking down more on the secret location.\n\n- till they had crocodile and jinbe , he wasn’t even sure they can escape magellan and they literally hit the lucky bells with Bb opening one gate for them using hypnosis and jinbe calling his whales .\n\n- u wanted him to rescue the most important prisoner with tons of marines outside impel down to escort him and in case he did manage to rescue ace. U think an admiral or the vice admirals outside can’t block the gates? With the main water gate closed and on high alert , they can’t go out.\n\n- they were able to escape because Bb decided to raid it at the same time and they had jinbe . Ivan had none of this information before and neither did he have the info that luffy was dragon’s son. So why ? Think properly atleast. Ace isn’t a random weakling whose absence will go unnoticed. Rescuing ace would’ve meant a death sentence to him and everyone else including luffy and ace even if he did try after knowing about luffy.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"He didn't knew. Ivankov learned “after” treatment from luffy's own word.","score":1,"comments":[]}]}]},{"body":"That really is a dumb question","score":3,"comments":[]},{"body":"Why would Ivankov care to save Ace?\n\nThis is one of the moments when someone makes a terrible argument then says this part of the series is bad writing lol.","score":2,"comments":[]}]},{"title":"which seraphim should luffy meet","not_safe_for_work":false,"locked":false,"body":"\n\n[View Poll](https://www.reddit.com/poll/z29jp7)","score":2,"comments":[{"body":"Blackbeard","score":2,"comments":[]},{"body":"Kuma. He is a right there","score":2,"comments":[]},{"body":"Jinbe. Luffy Vs his crew.\n\nZoro (whiskey peak)\n\nUsopp, (enies Lobby)\n\nSanji (Whole cake)","score":1,"comments":[]}]},{"title":"Will Black Beard die?","not_safe_for_work":false,"locked":false,"body":"Luffy has never out-right killed anyone, Kaido was knocked into a pool of lava but that wasn't Luffy's intentions...\n\nBut considering their history, will Luffy purposely kill Black Beard?  \n\nhttps://preview.redd.it/t8cixmbhcm1a1.png?width=747&amp;format=png&amp;auto=webp&amp;s=c6ff3b2cf65d7549368e12e3fdf39295dafefa56\n\n[View Poll](https://www.reddit.com/poll/z2dvon)","score":1,"comments":[{"body":"probably some shit like luffy and blackbeard are both drowning. zoro swims and saves him, blackbeard's whole team is DF eaters so he'll die","score":10,"comments":[{"body":"huh... T\\_l ... Neat","score":1,"comments":[]}]},{"body":"Oda doesn't even kill villains (with a few exceptions). I am inclined that he will die, like the rest of his especially sinister team members, but it is their own fault (for example, the black beard's dark fruit will go out of control and absorb Marshall himself), in other words, to make them die, but at the same time it was not a murder by the straw hats or the \"good guys\". It would be in the style of Oda.","score":4,"comments":[{"body":"Consumed and destroyed by one's own power... sounds possible","score":4,"comments":[]}]},{"body":"I've always been a fan of the idea that Blackbeard will be the one Devil Fruit user shown to drown","score":3,"comments":[]},{"body":"I see it like maybe Luffy beats Blackbeard and is leaving him to wallow in defeat then Blackbeard tries to do something in a last ditch effort to kill Luffy and something else that resorts to his death. Either his fruit acting out after the fight or an external factor","score":1,"comments":[]},{"body":"As others have said, Blackbeard has got to drown.","score":1,"comments":[]},{"body":"Would be cool if the first DF user to die by drowning is Blackbeard","score":1,"comments":[]}]},{"title":"One Piece Reloaded: Chapter 923 + 14i","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"mf really introduced imaginary numbers into one piece 🗿","score":3,"comments":[]},{"body":"# Follow this thread using the bell at the top-right corner of the post to be notified when a new chapter is out!\r\n\n(Not your notification menu, another bell inside the post. You can use the Back to Top button in the bottom right to go there.)","score":1,"comments":[]}]},{"title":"Luffy vs big mom. Who wins?","not_safe_for_work":false,"locked":false,"body":"G5 is allowed. Remember that luffy wouldnt be able to hold g5 for extremely long, because it'd just exhaust him. Besides, it took 2 of the strongest supernovas teaming up in order to defeat her. BM is tough. Luffy for sure cant beat kaido in a 1v1 because kaido took damage from zoro's ashura, zoro in general, the strongest supernovas, the scabbards and yamato, while lifting a whole island and fighting back to back with no break. Luffy got defeated and came back, and he even got a break and even got time to eat. So luffy vs kaido is out of the question.\n\nSo can luffy defeat bm?\n\nRules: Luffy isnt immune to like basically half her kit 💀","score":1,"comments":[{"body":"Oda not nerf BM? Ahaha he'd have Luffy embarrass her worse than he did when he jumped rope with Kaido","score":9,"comments":[]},{"body":"Tbh Luffy vs Big Mom would’ve and could’ve been the greatest first display for Gear 5. The entire gimmick of Luffy turning the world into a rubberized comic book clashing with Big Mom who can imbue anything with a soul would’ve looked wild.\n\nImagine if Big Mom wasn’t Big Meme and could literally turn everything in the surrounding area into a homie that she commands. Then even ground that Luffy is rubberizing would be trying to literally swallow him. Flying clouds, mini suns, etc. Imagine Luffy turning giant and BM either using 10 years of her life to match it or putting several years into a massive mountain golem like the one Momoshiki created in Boruto. Luffy grabs a lightning bolt and throws it at BM and she turns it into a homie that flies right back at him. \n\nThe fight would literally look like a Cuphead boss battle.\n\nThis is my prayer for Elbaf.","score":2,"comments":[{"body":"Yoo that'd be insane, except luffy is basically immune to a lot of her attacks, so they need to buff big mom","score":1,"comments":[]}]},{"body":"With G5 it's not even fair","score":1,"comments":[]}]},{"title":"Ok am i the only one who thinks that greenbull's forest forest fruit is on the same potential and power to be on the same level as the nika fruit and the op oop fruit?","not_safe_for_work":false,"locked":false,"body":"","score":68,"comments":[{"body":"This power is like Naruto wood jutsu but more broken, since even the user themselves can transform into plant life. We saw that it was considered OP in Narutoverse, it should be 10x that in One Piece where there are weird plants around if Usopp's arsenal is any indication. \n\nToo bad Greenbull is trash at using it though.","score":43,"comments":[{"body":"It was OP in Naruto cause it had a bullshit chakra sucking power. Otherwise it wasnt all that special unless it was the 1st Hokage using it","score":28,"comments":[{"body":"Bro this df sucks energy in a different way like literally sucking it out","score":6,"comments":[]}]},{"body":"&gt;Too bad Greenbull is trash at using it though.\n\nHuh? \n\nHow on earth do you figure?","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I think it has crazy potential but idk about Nika levels","score":13,"comments":[]},{"body":"I do think it’s incredibly powerful. I don’t necessarily agree with the hate he got though. One piece fans are quick to powerscaling and immediately started talking about him being weak as shit","score":11,"comments":[{"body":"Greenbull is weak for not wanting to take on 2 whole ass yonko crews at the same time ALONE lol","score":13,"comments":[]}]},{"body":"Oda will just introduce new haki ability that stops the plants from growing.","score":23,"comments":[]},{"body":"Probably not quite as high, but it certainly is one of the stronger AND more durable fruits we've seen. Greenbull can easily negate his weaknesses by simply growing elsewhere. It is quite possibly on of the best logias out there.","score":6,"comments":[]},{"body":"I like it because you can use one of my favorite abilities where you just fall backwards and absorb into the grass and then reappear elsewhere out of the grass","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Will Akainu leave WG (We have seen in previous chapters how mad he is that his Job is restraining him from just go and kill pirates","not_safe_for_work":false,"locked":false,"body":"\n\n[View Poll](https://www.reddit.com/poll/z2afra)","score":0,"comments":[{"body":"He's a dog he'll never leave his masters","score":1,"comments":[]},{"body":"No, there is no time and build up enough for that","score":1,"comments":[]},{"body":"He will not leave. But he will maybe leave his position to kill some pirates.","score":1,"comments":[]},{"body":"Maybe WG but not the Marine","score":1,"comments":[]},{"body":"No","score":1,"comments":[]},{"body":"I think the same way Aokiji is able to see the real world bc he’s not an admiral, Akainu is seeing how limited and blind he is bc he’s fleet admiral and has to answer to the Gorosei. \n\nEventually that will culminate in them both making a major decision. For example, Aokiji may have to choose between saving Koby’s life and learning whatever from BB. And Akainu may have to choose between his position as fleet admiral and his desire to stop pirates and enact absolute justice (maybe even on the Gorosei).","score":1,"comments":[]}]},{"title":"Dumb BW question...","not_safe_for_work":false,"locked":false,"body":"How many pirates saw Black Beard gain a second DF, and thought \"If he can do it, so can I\" and then started exploding all across the GL? ...","score":3,"comments":[{"body":"Not much since there  probably is a very limited number of devil fruits","score":3,"comments":[{"body":"yah, still be funny thou... just imagine what the Marines would think","score":1,"comments":[]}]}]},{"title":"Who’s the most overrated non strawhat in one piece","not_safe_for_work":false,"locked":false,"body":"For me it’s enel","score":68,"comments":[{"body":"i like ace, but with how the story works on him he's overrated","score":62,"comments":[{"body":"I agree.  \n\n\nPre-Marineford Ace: Luffy's cool older brother, Whitebeard commander. Appears a few times, Luffy doesn't spend much time thinking about him.\n\nPost-Marineford: Son of the Pirate King, taken in by Whitebeard to be the next Pirate King, The Chosen One who could've been, Luffy is carrying on Ace's will.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"wdym by overrated","score":17,"comments":[{"body":"Their strength is exaggerated","score":21,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"It's definitely Enel. \n\nHe's nowhere near as strong as people evaluate him to be. \n\nSome claim he's upper commander tier, when in reality he'd be effortlessly flatlined by even the weakest Vice Admiral.\n\nAt least others like Shanks are in the ballpark of where people scale them, even when they're exaggerated, it's still in the right tier level. \n\nWhereas Enel gets hyped by several orders of magnitude from where he actually ranks.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yamato","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Katakuri. Big Mom pirates hype him up as undefeated. However, we can assume that Katakuri hasn't fought someone of Luffy Gear 4 level or above in a LONG time. How would he fare against other Yonko commanders? Admirals? Law or Kid? \n\nKatakuri hasn't been tested against someone equal before Luffy, so this raises questions about what exactly Yonko were doing for 20 years.","score":33,"comments":[{"body":"&gt;so this raises questions about what exactly Yonko were doing for 20 years.\n\nit's in the story itself. They were amassing armies and defending their territories.\n\nKaido after Oden told him to do so. SAD + SMILES\n\nBig Mom with giants, her whole damn family and entire totoland + scheme with Germa.\n\n&amp;#x200B;\n\nYonko are certified losers of previous era as Akainu called them.","score":26,"comments":[{"body":"Interesting take. Perhaps Akainu is wiser than we know. Then again he works for a laughably incompetent bureaucracy.","score":20,"comments":[{"body":"he is definitely wise but the thing is, he used those words for Whitebeard lmao.\n\nWB prolly the only yonko those words don't apply to. (cud also be shanks since he only became a yonko 6 yrs ago)\n\nWb chose not to find the One Piece rather than being incapable of doing so. Others were incapable and thus losers.","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"When does chapter 1068 drop?","not_safe_for_work":false,"locked":false,"body":"..","score":0,"comments":[{"body":"First translations on Thursday/Friday, official translation on Sunday I think","score":1,"comments":[]},{"body":"There's a break this week. Scans drop next week Thursday","score":1,"comments":[]},{"body":"Next week","score":1,"comments":[]}]},{"title":"Japan based again","not_safe_for_work":false,"locked":false,"body":"","score":247,"comments":[{"body":"Blackbeard is already stronger than Rayleigh, he admitted it himself.","score":50,"comments":[{"body":"\"but what did he MEAN by that???\"\n🤓","score":38,"comments":[]}]},{"body":"Oda treatment of the Marine in Wano and Film Red was too much.","score":118,"comments":[{"body":"Oda’s treatment of the Marines since the timeskip in general has been too much, they literally become less and less of a threat every time they’re shown now","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Japnese fans are same as any other fan they are not the writer , these are just popularity polls .","score":80,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They forgot BB and BM existed lol","score":61,"comments":[{"body":"Ben Beckman and Black Maria have nothing on Go D. USSOP","score":59,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"We never saw dragon fighting how can he be in the top 10?","score":32,"comments":[{"body":"He one-shot a Yonko in Loguetown, duh","score":39,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"This honestly doesn't look that far from what you'd find on r/OnePiecePowerScaling, but other than that it's surprisingly pretty decent (for a popularity poll).","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"he was still alive...","not_safe_for_work":false,"locked":false,"body":"","score":422,"comments":[{"body":"Guernica was giga Chad all this time!!\nGoda i knell🛐","score":87,"comments":[{"body":"I knell? Enel? Enel was Guernica confirm 😱😱😱","score":30,"comments":[]}]},{"body":"Laido of the Frauds, The Weakest \"Creature\"","score":86,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Funny thing is, Oda could've avoided all of this just by changing his original intentions on who took the photograph. No one would've given a shit because it would be predictable and expected, mostly insignificant in its own right. But lo and behold, GODA.","score":59,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"His iPhone is more recent than mine","score":30,"comments":[{"body":"The WG pays really well","score":28,"comments":[]}]},{"body":"How did we go from akainu to this","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The content I was waiting for thank you Tomio Sama","score":9,"comments":[]},{"body":"Guernichad","score":10,"comments":[]},{"body":"“Joseph”","score":30,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"They laughed","not_safe_for_work":false,"locked":false,"body":"","score":89,"comments":[{"body":"Is that Saddam Hussein?","score":11,"comments":[{"body":"Yes , and this is the ultimate foreshadowing","score":7,"comments":[]}]},{"body":"AYOO ODA","score":1,"comments":[]},{"body":"At sanji for being so weak","score":-11,"comments":[{"body":"If only you could wank Monet with me as much as u downplay sanji","score":11,"comments":[{"body":"Monet got no diffed by zoro so I dunno about wank her .","score":1,"comments":[]}]},{"body":"You could at least like,\n\n*Try* to make a joke with it","score":7,"comments":[]}]}]},{"title":"Controversial take: Imu will be the goofiest character in One Piece, yet he will One shot Luffy.","not_safe_for_work":false,"locked":false,"body":"","score":191,"comments":[{"body":"This take ain't even controversial it's just fact.","score":76,"comments":[{"body":"Glad I'm not the only One to be aware of that","score":19,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"His reasoning for wiping islands: for the lolz","score":35,"comments":[{"body":"Could be a one punch Man kind of character. Too strong for anyone, so ended up on top by default","score":9,"comments":[]}]},{"body":"This is the ugliest shit I’ve ever seen ngl","score":38,"comments":[{"body":"Then you haven't seen the next One yet lmao","score":31,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Reminds me of squidward 🐙","score":11,"comments":[]},{"body":"Your drawing start to be on another level... Soon you're gonna draw the manga.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Usopp: he just like me frfr","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Honestly it's going to suck if Im-sama is just this scary looking guy.  We need something so goofy looking it's going to be demonic.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"But....but Admirals don't have any top tier potrayal , it's never implied that they need to be that strong 🤡 I don't see any Yamato, Beckman(ass to Shank's dick), warlord or any other character in these panels.","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"Powerscaling aside, the fact that being the strongest is a requirement to be pirate king (not just finding the onepiece) is a well established idea from odas part, I'm pretty sure there's been debate about it before","score":10,"comments":[{"body":"Its not said you have to be the strongest, you just have to find the one piece. However, finding the one piece usually will require being able to defeat every other pirate in your way, ergo you do have to be the strongest. But it is not a specific requirement to being pirate king","score":1,"comments":[{"body":"Read the images on the post. Particularly what it's said about bullet, it cites that from Oda's perspective being the pirate king means being the strongest too\n\n\nIt's more an artificial requirement, you don't need it per se but the author intention is that you do","score":3,"comments":[{"body":"Yea I just said that","score":2,"comments":[{"body":"It's the same I said originally lmao, we agree","score":1,"comments":[]}]}]}]}]},{"body":"Based and admiral pilled","score":8,"comments":[{"body":"Akainu solos One Piece with his superior ultra supreme gigachad haki.","score":3,"comments":[]}]},{"body":"This is good. I like this.","score":1,"comments":[]},{"body":"they got subs for that shits? oda is shitty mangak interm of power scale and consistency","score":1,"comments":[]},{"body":"Admirals dont have a good haki like the top tier characters","score":0,"comments":[]}]},{"title":"Am I the only one who likes Greenbull over Fujitora?","not_safe_for_work":false,"locked":false,"body":"I like his design and powers. He might be racist but at least he won’t debuff the marines and join Luffy during the Final War.","score":31,"comments":[{"body":"Aramaki took on an island full of yonko, yonko commanders, and Samurai warriors. Of course he'd get overwhelmed by himself. Hopefully he gets at least one good moment before the end","score":34,"comments":[]},{"body":"Chadbull inspiration is Akainu so we love him \n\nFuji is spoiled brat who don't take orders from his officer seriously","score":19,"comments":[]},{"body":"He looks cool and has a cool ability. Shame he was used to promote a film but whatever. Fuji is cool but just another Luffy sackrider","score":13,"comments":[]},{"body":"Aramaki is my boy \n\nsucks he got clowned on","score":8,"comments":[]},{"body":"Fujutora the only admiral who showed me a whole other level of destruction other than akaniu","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Fuji sucks cause he throws off the Logia theme.","score":6,"comments":[]},{"body":"No. I liked him in the chapter before the break, when he seemed competent. Then he came and became comically racist and got no diffed by someone 3 kilometers away. Greatest disappointment after Kaido","score":3,"comments":[]},{"body":"Facts. Fujitora is the weak link of the admirals.","score":13,"comments":[{"body":"Cmon, fujitora is a great character. I mean it sucks we can see him changing sides coming from a mile away(or in this case years away). But im a big fan of the blind man can ‘see’ justice/morality better than any normal man. Also his df is just so OP id like to think he could end the world at any moment if he so chooses.","score":18,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Remember when we all thought Greenbull was going to come and cause the tragedy of Wano and give the arc some real consequences? Yeah... hot Shinobu though.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Answer honestly: how many of you would be disappointed if Imu-sama's crown was a Fork, and he actually was a ramen ramen no mi user?","not_safe_for_work":false,"locked":false,"body":"","score":48,"comments":[{"body":"Greatest of all time. Zenith of the medium. Hallmark of media. Gold standard of storytelling. Apogee of creativity. Vertex of invention. Crest of ingenuity. Acme of imagination. Pinnacle of innovation. Epic of epics. Legend among legends. Peak fiction.","score":12,"comments":[{"body":"Best comment of all time","score":1,"comments":[]}]},{"body":"This might be my least favorite meme","score":3,"comments":[{"body":"I hate it myself tbh","score":5,"comments":[]}]},{"body":"Too good to be true 0 disappointed","score":3,"comments":[]},{"body":"After vegapunk it doesn't even surprise me","score":2,"comments":[]},{"body":"Lmao. Cursed as fuck.","score":1,"comments":[{"body":"I will make worse, don't worry 😇","score":2,"comments":[]}]},{"body":"disappointed? this is pure KINO","score":1,"comments":[{"body":"Thanks mate 😁","score":2,"comments":[]}]}]},{"title":"Dumb BW question...","not_safe_for_work":false,"locked":false,"body":"https://preview.redd.it/9d90pa6k4f1a1.png?width=583&amp;format=png&amp;auto=webp&amp;s=6b80947d1c4ac9ca78c69151af1a8054e90a84ff\n\nMaster of Poison vs Master of Aura\n\n[View Poll](https://www.reddit.com/poll/z1ilja)","score":7,"comments":[{"body":"Steel is immune to poison,lucario wins.","score":25,"comments":[{"body":"Unless magellan has the ability corrosion","score":4,"comments":[{"body":"Yeah.Now that i think abt it his df effects him too,so he prolly does have corrosive","score":5,"comments":[]}]}]},{"body":"Steel resists poison,unless we are talking about corrosion ability.","score":3,"comments":[]},{"body":"[deleted]","score":1,"comments":[{"body":"Magellan is technically Venom rather than poison too","score":1,"comments":[{"body":"Lucario is a steel type, meaning Poison and Venom (which is also a poison) won't effect him. Corrosion may be a problem, but Lucario has a large set of long-range attacks to choose from to avoid close-up fighting. Even if Magellan was Logia, Aura Sphere which is no different to Haki would hurt him. Plus, Lucario's become stronger the more damage they take...\n\nWho wins depends on who can last the longest... Lucario's can be glass canons, But Magellan isn't used to being hit for a long time cuz people avoid his poison, however his is tough to beat. Lucario's have strong Ground and Psychic type moves which are super effective against poison. And Lucario's can be speedy, use Aura like Observation Haki, and has many different types of attacks...\n\nBoth have strong will's... its a matter of who gives up first...","score":1,"comments":[{"body":"[deleted]","score":0,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"body":"Lol putting a Pokémon vs Magellan ??","score":1,"comments":[{"body":"If you go with the ability of that Pokémon the fight isn’t far fetch wht this Pokémon you are underestimating. \n\nPoison isn’t effective on steel Wich is already bad","score":1,"comments":[]}]}]},{"title":"Hvly…we did it piratefolk! #MPFGA","not_safe_for_work":false,"locked":false,"body":"","score":90,"comments":[{"body":"We didn't get lucci but anything is better than yamato","score":41,"comments":[{"body":"Being different from R/onepiece actually felt good.\n\nFor some reason, Yamato is popular with onepiece reddit mods.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Still remember when we had 6 weeks of Nika bs. This was truly a great time in this sub","score":8,"comments":[]},{"body":"Even Cum Boy is slightly more palatable than Yamabro.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[Something feels off...](https://cdn.discordapp.com/attachments/651769926381731852/1044241760374763562/unknown.png)","score":5,"comments":[{"body":"Am i missing somethin?","score":6,"comments":[{"body":"Quality?","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"this is what they will speak of in history books…","score":2,"comments":[]},{"body":"We back to the original","score":1,"comments":[]},{"body":"The second coming","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"RunPiece Episode 86","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[{"body":"Damn, it's already 86","score":2,"comments":[]},{"body":"brah is consistent as fuk","score":2,"comments":[]}]},{"title":"Either brook has some supernatural extra will power with him or he has already gone insane.","not_safe_for_work":false,"locked":false,"body":"","score":99,"comments":[{"body":"Not worth it. You would lose your sanity long before a year has passed. No sunlight or fresh air either so by the time you come out you'll be so sick it will be a miracle if you could even recover physically.","score":32,"comments":[]},{"body":"With 30 Billion you could see all the panties you want.","score":23,"comments":[]},{"body":"Off topic but if these rooms make people crazy how do they separate the correlation since people go straight to this room","score":11,"comments":[{"body":"Not sure I understood the question","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"i would just start doing shit sculptures to terrify the observers","score":5,"comments":[]},{"body":"Or oda isn’t a good writer and the character makes no sense (on top of the fact that the character has not developed one bit in the over decade since his introduction)","score":4,"comments":[]},{"body":"Where’s Brook’s coc he deserves it after that","score":3,"comments":[]},{"body":"I’m definitely going crazy but a billion is a billion","score":3,"comments":[]},{"body":"I can do it. But for 50 billion dollars.","score":3,"comments":[]},{"body":"id regret it but i would definetly do it","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Which of these three had the best timeskip?","not_safe_for_work":false,"locked":false,"body":"Title\n\n[View Poll](https://www.reddit.com/poll/z119kp)","score":38,"comments":[{"body":"I can’t say anything about narutos because I haven’t seen it, but Dragonball’s was nearly flawless. Goku winning the tournament proved he became the world’s strongest, while also being able to defend the planet. It brought a conclusion to everything before it. \n\nThe Saiyan saga in Z expanded off planet. The same core of dragonball was there, the stakes were just way higher. I’d argue dragonball improved with the time skip as the characters were allowed to physically and mentally grow. In onepiece they physically grew, but I’d argue all character development stopped full force until Whole Cake. \n\nWhereas DB’s time skip expanded the series in a believable and interesting way for the sake of character progression, Onepiece kinda did it so we could get that stuff over with as fast as possible, with little to show besides new attacks. Just my opinion","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"For how much this sub shits on post time skip arcs in OP I’m surprised at how many votes OP got","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I will be honest with you. I prefer Naruto’s and Dragon balls timeskip to one piece. I like one piece on the whole more because it is more consistent but both Naruto and Dragonball had decent starts it was only the last couple sagas for both series we’re they blew it but I think One piece has used the strawhats better than other series used their secondly characters and that is saying something.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I feel like people are talking more about what happened in the timeskip rather than how the timeskip changed the series in designs, atmospheres etc\n\nI prefer Naruto timeskip way more than the other 2 from that point of view. It kept the great parts of Naruto, the designs are still super solid, Sasuke returning was really great and the feeling of the story changed a lot\n\nI didn't even count Dragon ball because it feels like a completely new series\n\nOne piece is by far the worst for me. The character designs were either mildly upgraded or drastically worsened (Robin and Nami are horrible and imo Franky looks quite bad) and the story barely got more serious, from one point of view becoming even more jokey than before, which I liked in moderation but now it has gotten way worse (gear 5 was horrible and as much as I like to cope I can't get myself to like it)","score":21,"comments":[]},{"body":"im surprised naruto came in last. personally i took the question as \"which series benefited from its timeskip the most\" as the question is kind of vague what \"best\" is supposed to mean specifically.\n\nfor dragon ball i would say that it definitely wouldnt have been nearly as popular if there wasnt a timeskip and the story continued from original DB, but the series as a whole and its story telling is still mid imo after the timeskip, the designs arent much better than before, and it stopped being a gag anime which makes the rest of the series kind of weak imo now that it didnt have as many moments that at least tried to be funny.\n\nfor one piece it really lies in the fact that a lot of the crew hardly improved. in terms of designs; luffy- slightly better, zoro- slightly better, sanji- basically the same, nami- slightly better, usopp- slightly better, robin- worse, franky- my eyes were fucking bleeding, brook- better, chopper- worse. in terms of development in strength a lot of the characters are still fodder too. it makes the timeskip feel kind of pointless when you look outside of the monster trio. the story immediately after the timeskip isnt greatly improved either. fishman island and punk hazard end up being kind of boring for how long they take and the series doesnt take that much more of a serious tone either (stuff like sanji in fishman island). to me one piece's timeskip couldve been done way better.\n\nfor naruto my main problem is that the side characters didnt improve all that much, but naruto hardly focuses on the side characters in the first place so it doesnt matter as much. otherwise it felt like it served a purpose with how both naruto and sasuke improved, the story after the timeskip is still good/interesting, and it felt natural.","score":6,"comments":[]},{"body":"Is there a post time skip one piece arc that would be considered by consensus as a top 5 arc? Both dragon ball and naruto has arcs post time skip that get a lot of love and are arguably the peak of the entire series. Don’t think one piece has that","score":23,"comments":[{"body":"WCI is praised even on this sub. And I do not think anyone can consider any of the post pain arc as peak","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"If we’re saying dragon ball to dragon ball z then it’s not even close I fear. Saiyan and Freiza Saga solo fiction","score":23,"comments":[]},{"body":"Which timeskip from Dragon Ball?","score":5,"comments":[{"body":"Dragonball to DragonballZ","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"This picture and it’s consequences have been a disaster for Sanji","not_safe_for_work":false,"locked":false,"body":"","score":91,"comments":[{"body":"Looks like Wyald from Berserk lmfao","score":41,"comments":[{"body":"i hate him so so much","score":4,"comments":[]}]},{"body":"I was genuinely hoping that Oda would use Sanjis genetic awakening to tone down his overly aggressive pervertedness and just revert him back to pre TS. Maybe turn him evil for a brief moment, throw in some internal good vs evil struggle where good triumphs over evil in the end, but he lost a bit of his over-the-top \"characteristics\" in the process.","score":23,"comments":[{"body":"Oda like to reuse the same joke. But the problem is using the same joke each time, it become less funny. It is a bigger problem when the joke has been seen in many shows before. So oda thinks that exagerating things, it will be funny. The Nosebleed gag for example. A joke since master roshi, very funny but we have seen it so many times that it will be difficult to laugh at it. It is a trope now in anime. So what oda did, he made sanji nosebleed so much that he almost dies. That is the joke. Please remember that at one point in the story, sanji (one of the best fighter in the SH pirates) almost died because he could not handled seeing women/mermaid. \n\nSanji was a character presented to love women, well he has the right. Any man will be attracted to beautiful women. Let me remind you because even oda seems to have forgotten himself. The joke was that sanji is presented as this clever person, a mastermind, a competent chef, one of the mature person of the SH with nami and robin but who also is a strong fighter as well, but when he is in front of women, he is a complete idiot. He is so trouble by women that he can easily be fooled, i.e sanji vs kalifa.  Where Zoro and Luffy are just raw strength, Sanji compensates his lack of strength with his smartness. Enies loby is a perfect example of Sanji's genius. So at this point the character of sanji was unique. He also does not go against his word, he said he will not hit a woman no matter what, and he stands on this. Even if it means death. This shows a weakness in sanji and a fatal flaw. Well as for me , a good character is a character that has flaws. Sanji afterall cannot change who he is and the values given to him by Zeff. This shows that he really value Zeff. Zeff told him to never hit a woman no matter the reason, and he sticks to this firmly. To overcome this flaw, Sanji relies on his nakama. Sanji said it himself, \"do what i can't do and i will do what you can't do\" to Ussop during enies loby. This greatly helped boost Ussop's self esteem, who was starting to feel useless as he saw that his nakama are more powerful or competent than him, he felt useless when compared to them, he had insecurity issues. But Sanji helped him get over this and shows to Ussop that he really has a place in the SH. This demonstrate Sanji high EQ. But then oda decided to make sanji a complete pervert after Enies Loby. This is there that oda completely butchered Sanji. He went from a complex character to just the perverted friend trope. \n\nI think oda underestimates his readers, he thinks that the more complex the character, the more difficult it will be for us readers to read. So some characters just regress or simply do not changed.\n\nThank you for reading.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"look at the green hair vinsmoke kid in chapter 826","score":3,"comments":[]}]},{"body":"Sanji stocks ⬇️","score":21,"comments":[]},{"body":"Hate what oda did to sanji 's character. When you at sanji post timeskip before enies loby and sanji now , there are two different characters. Oda started to mess sanji's character during thriller bark arc.","score":18,"comments":[]},{"body":"He has so much potential to be cool with a funny  side mannnnnnn","score":3,"comments":[]},{"body":"Sanji would rather let his crew die than to hit a woman .","score":13,"comments":[{"body":"And the crew would rather die than have Sanji abandon his morals\n\nJust like Sanji would die for Zoro just so Zoro’s dream can live on\n\nBut keep going i wonder how Sanji’s balls taste","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"They don't know...","not_safe_for_work":false,"locked":false,"body":"","score":354,"comments":[{"body":"Oceania a buncha horndogs","score":130,"comments":[{"body":"Yes, yes, we are","score":31,"comments":[{"body":"The British threw us in dessert jail and they wonder why we thirsty","score":32,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Based japan for nami being number 7","score":57,"comments":[{"body":"and for no Yamato in there","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Oceania based for simping","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"[ Removed by Reddit ]","score":40,"comments":[{"body":"Zoro gonna visit Paris.....","score":29,"comments":[]}]},{"body":"We do know. Those were votes out of fear. \n\nI mean, the chances of him finding his way to Africa is almost 0 but we still not taking any chances","score":29,"comments":[{"body":"You never know he might get lost and end up here","score":7,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"One Piece if the time skip never happened","not_safe_for_work":false,"locked":false,"body":"","score":244,"comments":[{"body":"That’s like if bleach stopped after the arrancar arc, (it would be full of plot holes)","score":85,"comments":[{"body":"Don’t care, pre time skip is peak 🗿","score":79,"comments":[{"body":"Based","score":20,"comments":[]},{"body":"W","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"When the final arc was so messy, i think i'd prefer it if it really did just end at Aizen. Or even fullbring, just to end it off as Ichigo reclaiming his powers to continue protecting people. Like him choosing to fight as opposed to Rukia giving him power at the start.","score":15,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Those days when Chopper wasn't a consumable and Nami was actually cool.(The WCI Nami was cool too but you won't feel it thanks to the gigantic gap between pre time skip and WCI)","score":54,"comments":[]},{"body":"If wano never happened","score":43,"comments":[]},{"body":"One piece was destined to never remain peak","score":41,"comments":[]},{"body":"one piece if oda never did an Art style substitution.","score":28,"comments":[]},{"body":"Indeed comparable with the bible. Full of plot-holes and incomplete.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Zoro Character Progress","not_safe_for_work":false,"locked":false,"body":"How are you all feeling about Zoro’s character progression post timeskip? He was my favorite pre timeskip but just looking at how he is now it’s boring. I could speak too about how Wano should have supposedly been his arc, but what really came of that? It’s been pretty disappointing. \n\nShamed to say I personally don’t  have a favorite character anymore in the main cast; It’s really strange. Maybe things change this arc or later on.","score":8,"comments":[{"body":"he was better pre ts, he was mature , serious and funny at the same time. Post Ts made him kinda edgy? it really shows in the anime tbh","score":17,"comments":[{"body":"I mean what SH wasn't better pre ts","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"His character is pretty boring. He's been stagnant for so long. All he is is a swordsman with \"cool\" moments. \n\nYou never really see him actively trying to be the words greatest swordsman. Like he doesn't actually look for strong swordsmen to fight; he just kind of finds an opponent who happens to pull out a sword near defeat. \n\nOda could have given him more depth in Wano. Mourning or getting revenge for Yasuie's death, learning anything about Ryuma, almost dying, the side effects from the mink med, and finding out his implied ancestry could all have been good moments for him.","score":21,"comments":[{"body":"Exactly. I don’t even recall a moment post timeskip of Zoro working out like he used to pre timeskip. Those made me feel like he was actively striving for that power.","score":12,"comments":[]},{"body":"As a Sanji fan, I owe Oda an apology.\n\nMany of us were grumbling that Sanji didnt do kuch in Whole Cake, despite it being year of Sanji.\n\nBut now....\n\nI had no idea how bad are Zorro fans gonna starve in Wano lmao","score":3,"comments":[]}]},{"body":"I never really subscribed to the idea that Wano was going to be \"Zoro's arc\", but I did expect *something* to come of the few storylines that were set up for him.  And we basically just got no follow up on any of the Zoro stuff from Acts 1 and 2. Just very disappointing.\n\nZoro is still probably in my top 3 favorite SHs just due to legacy, but man has he done NOTHING post-ts.  I mean, I guess most SHs haven't tbh.  But it feels especially apparent with Zoro; like Oda has stripped him of his personality.","score":5,"comments":[]},{"body":"I understand that the fight he had with Mihawk, the strawhats' defeat on Sabaody combined with the fact that Mihawk trained him for 2 years made him get a grip on what the New World would be like but damn, his character now is stale af.","score":4,"comments":[]},{"body":"i dont see how zoro can appeal to anyone who isnt under the age of 18 since the timeskip. theres just nothing going on with him personality wise for over 500 chapters now. most of the other SHs have that problem as well, but i dont see oda ever acknowledging zoros a boring character and doing something to correct that unlike the potential he might someday fix someone like franky or chopper.","score":9,"comments":[]},{"body":"Pee TS he was perfect. Post TS, not so much. \n\nHis chest might be bigger than Nami and Robin's, but his character is as flat as it gets.","score":10,"comments":[]},{"body":"Pre-ts zoro is my favorite character in one piece, the only thing post ts zoro beats him in is the design","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The idea of ​​equal (in terms of strength) team members","not_safe_for_work":false,"locked":false,"body":" What if the author did the battles and power scaling of pirate teams not according to \"weak guys\"-\"strong powerhouse\", but according to the principle \"everyone is relatively equal\"? Of course the captain would be a little stronger. Would it make the fights and powerscaling more interesting?  \nFor example: Usopp, Nami, Chopper would be on par with Zoro/Luffy/Sanji in terms of power, and this applies to villain teams (mostly).","score":2,"comments":[{"body":"Would allow for variety, however the whole crew should level up together, would been easier to pull off before haki","score":3,"comments":[]},{"body":"Like how everyone was kicking ass in Ennies Lobby?","score":2,"comments":[{"body":"Yes, it was really cool. Manga and anime forums of the mid-2000s exploded with hype during this arc. But still, even the CP9 agents were not equal in strength, in fact they were the same straw hats in terms of strength but without asspulls (even Jabura and Kaku have same powerscaling gag debate like Zoro and Sanji). I hope that during the final arc with a BB crew, Oda will catch up with the same hype and equal fights.","score":1,"comments":[]}]},{"body":"That would be better than what we have now. I feel like this only makes sense in certain arcs though. Kaido’s whole crew was set up with a hierarchy of strength.","score":1,"comments":[{"body":"Well, it would require good writing and creativity and them defeating the stronger beast pirates like kaido with wits and teamwork, but alas, big coc goes brrr.","score":1,"comments":[]}]},{"body":"What would happen is exactly the same, people will show bias for their fave characters and powerscaling debates will be the same.","score":1,"comments":[{"body":"Not really. There would be more feats for everyone, thus the powerscaling debates would be more plentyful. Now you can say nami is definitely weaker than anyone in monster trio, but with everyone relative, then there would be more discussion.\n\nAlso the fights would have to be different, less big fist, more finesse wits and teamwork.","score":1,"comments":[{"body":"There will be more of the same, instead of thousands debating Zoro is stronger than Sanji and vice versa, there will be debates about Nami being stronger than Zoro and Usopp being stronger than Jinbe etc etc. So powerscaling discussions would be just as bad. In fact it might be worse because everyone with a bias towards one of the current weaker characters would have more backing them up if everyone is roughly the same level.\n\nIf someone was biased towards Chopper now, they would have no leg to stand on and would be laughed at if they said Chopper &gt; Jinbe. But if everyone is roughly equal in power, all of a sudden Chopper fanboys have reason to back up calling their favourite char stronger. The whole reason these Zoro vs Sanji, Shanks vs Mihawk powerscaling debates exist is because of the ambiguity. Extend that ambiguity to the other strawhats and it's more of the same.\n\n&gt;Also the fights would have to be different, less big fist, more finesse wits and teamwork. \n\nDoubtful. Fights would be equal for a long time and end with a big fist/cool attack/comedy moment like it does now, that ideal could be brought in now if Oda wanted to, regardless of whether the strawhats are equal in power or not. He should  but he doesn't.","score":0,"comments":[]}]}]},{"body":"Big mom on par with flambé thats madness.","score":1,"comments":[]},{"body":"Would be more inline with real life pirates that battle shonen pirates. Can’t have these hierarchical factions like Marines and Emperor crews if admirals and yonkos are relative to their henchmen.","score":1,"comments":[]}]},{"title":"Which devil fruit would have the most potential to be as broken as the nika fruit","not_safe_for_work":false,"locked":false,"body":"\n\n[View Poll](https://www.reddit.com/poll/z1a9xz)","score":4,"comments":[{"body":"I bring this up everytime I know, but fujitoras fruit pretty much beats em all easily (excluding haki obviously).","score":7,"comments":[]},{"body":"Blackbeards fruit is very strong","score":3,"comments":[]},{"body":"Noro Noro Awakening\n\nKizaru's Awakening","score":3,"comments":[]},{"body":"why do you write them in Japanese","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Electro-Magnetism is the strongest force in the universe","score":1,"comments":[]},{"body":"bro asked about broken fruits and dropped some of the most lame ass power with lame ass users. (except maybe shiki and  vegapunk)","score":1,"comments":[]},{"body":"Goro Goro no mi.","score":1,"comments":[]},{"body":"How is op Op not in the list","score":1,"comments":[]},{"body":"Jika the damned","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"So is Luffy only going to use gear 5 for main fights?","not_safe_for_work":false,"locked":false,"body":"I thought Oda added looney toons to make the manga a gag manga or something.\n\nYou would think Luffy would fuck around with toon force just for the fun of it.   Like road runner the kuma instead of do a giant punch again.\n\nIf it is saved only for final fights as a power up then I am not sure why he was given toon force.  All that does is disrespect the main antagonists and remove tension from fights.\n\n\nToon force is supposed to be a gag not a tool to teabag villains and remove stakes.\n\n\nEdit:   Gintama is a great example of a perfect balance.  Gags are moments in between arcs and it gets serious during main fights.  Instead of the opposite","score":30,"comments":[{"body":"I expect every gear is going to be used just like Goku is still using all his weaker forms.","score":25,"comments":[{"body":"when was the last gear 2?","score":5,"comments":[{"body":"[Chapter 1037](https://cdn.onepiecechapters.com/file/CDN-M-A-N/op_Shuron_1037_013.png)","score":21,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"If I had to guess, Gear 5 will be the new \"stamina issue\" form. I'm sure there will be some sort of drawback to it that will keep him from using it in every fight willynilly.","score":11,"comments":[]},{"body":"He's gonna use gear 4 and struggle first every time and then go g5, its gonna be really stupid","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"In egghead, when luffy was not able to eat the holographic food he temporarily activated gear 5. I totally expect it to be used all the time.","score":18,"comments":[{"body":"I think thats not to be taken too seriously.\n\nIt was one panel and it looked a bit different","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Nah he was shown to have absolute mastery overy it, and to use it over trivial matters. Ir did not get the ultra instincts treatment where mastery remained a problem for a few fights.","score":5,"comments":[]},{"body":"Ah yes, a 20+ year manga will now suddenly turn into a gag manga. Top brain energy","score":6,"comments":[]},{"body":"My guess is that first he will try a haki only fight and if that doesn't work he would be using his gears with haki, as shown with kaido.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"What Impel Down power creep does to a mf","not_safe_for_work":false,"locked":false,"body":"","score":131,"comments":[{"body":"Bon Clay will emerge from there with an 8 pack and ACoC, then he'll make Shanks his bitch","score":30,"comments":[{"body":"Bon clay smh....","score":1,"comments":[]},{"body":"Or maybe 9","score":1,"comments":[]}]},{"body":"maybe Don Q will learn how to control his anger","score":19,"comments":[]},{"body":"Lol","score":6,"comments":[]},{"body":"Reverse this . \n\nLaw low diffs doffy currently lol","score":1,"comments":[]}]},{"title":"this panel goes mega hard","not_safe_for_work":false,"locked":false,"body":"","score":318,"comments":[{"body":"Agreed kuma looks like a titan here lol","score":87,"comments":[{"body":"the chin titan","score":10,"comments":[]}]},{"body":"Fr he was lookin like kaido for a sec","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Kuma is dying soon. His devil fruit will be passed on to a SH.","score":52,"comments":[{"body":"This is where usopp gets his insane power up the paw paw fruit making him able to basicly have a infinite ranged sniper with the ability to shoot ?damage bubbles like on thriller bark","score":58,"comments":[{"body":"i need a new df mugiwara","score":31,"comments":[]},{"body":"Global sniper. Truly deserving of the title \" proud Usopp\"","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Tbf this could be pretty cool, maybe it would also boost his confidence too","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"TO FRANKY!!","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Zeus will eat it","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Am I the only one bothered by the whole mink secret medicine thing?","not_safe_for_work":false,"locked":false,"body":"With the recent anime episode I was reminded by this but why tf do we ignore it so much\n\nLike out of all the things to give Oda shit for in Wano I seldom see anyone talk about how much of an asspull it was that Miyagi was \na) even on onigashima to begin with and \nb) had a never before mentioned drug that will completely alleviate all his pain and injuries so he can fight king\n\nLike I’ve seen so much nitpicky bullshit about Wano on this subreddit but nobody talks about this","score":77,"comments":[{"body":"Lol people called it a mink senzu been for months and when zoro had the grim reaper show up people thought it was the side effects just for all that to be scrapped for the rushed ending or “for the future”. There was so much wrong with onigashima it’s unbelievable","score":60,"comments":[{"body":"We are still finding new wrong things with wano each week.  It is laughably bad","score":14,"comments":[]},{"body":"What are you talking about bro? Wano was peak one piece. Don’t you remember Roof Piece? We’re talking about Goda here!","score":26,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I hated it. What's stopping the Strawhats from popping a mink pill every time they are close to losing? There's gotta be more than one mink pill ever made. The Strawhats would be dumb to not have some on hand. \n\nWe know nothing about this magical pill either. Like how it was made, how the isolated minks found a way to make it, and how hard it is to manufacture one.\n\nSo far it has no real downsides. Ya I know it apparently had nasty side effects but we never see them really so they must not be that bad.","score":36,"comments":[{"body":"Nah bro you get to see the grim reaper, and nothing happens. That’s a huge nasty side effect lmao.","score":30,"comments":[{"body":"The side effect is u see a spooky skeleton 😳","score":13,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"It's one of those things that's just so fucking stupid we don't even acknowledge it","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Most people thought it was stupid at the time. Oda needed Zoro to fight a commander for his growth but also got him severely injured against kaido so needed Zoro back in the mix. I wonder if it’s bc he wanted Zoro to have a cleaner slate of health going into the one on one vs king he was planning so getting him super hurt vs kaido and then healing him was better than having him damaged like law and kidd were but still beating king. In any case it was shit","score":11,"comments":[]},{"body":"It was obviously an asspull so that Zoro can fight, it's literally weird that he didn't had any repercussions , we definitely need a proper explanation for that . \n\nMy theory is The grim reaper is obviously enma's soul ,maybe enma just saved zoro  ,otherwise he would have died becuase of those side effects. Since enma is the king of the underworld maybe it has some control over peoples soul .","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nobody ignored it lol. It obviously sucked ass, and there were plenty of people saying as much throughout the end of Wano. There's just no point in beating a dead horse, everyone agrees it was awful. There's nothing to discuss","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"the one that has the job many desire ...06🍕🍔🍟💤","not_safe_for_work":false,"locked":false,"body":"","score":20,"comments":[{"body":"Droopy ass cheek mf 😡😡😡 just eating all the damn time","score":5,"comments":[]},{"body":"Fuck York, Shaka is the better vegapunk","score":1,"comments":[{"body":"To be honesto yes, I just find her cute and I really wanted to draw her, who knows I maybe draw shakka next","score":3,"comments":[{"body":"York is one of my favorite female designs from Oda in a long time! I love that he had the courage to draw a rounder face and still make it attractive","score":0,"comments":[]}]}]},{"body":"Not sure what people like from that worst job Imo I’d go mad. When my job is on dead time and all we do is chill and listen to tv show or even play console.\n\n\nAt one point it become pretty dull to the point you won’t even have fun doing those activity at home since you could do them all time","score":1,"comments":[]}]},{"title":"Make Piratefolk Great Again (Little Dark Age)","not_safe_for_work":true,"locked":false,"body":"","score":279,"comments":[{"body":"For real tho, I always feel like I could be doing better with my post quality, I want to help the cause, maybe another One Piece Slander video, that was well recieved","score":25,"comments":[{"body":"It can and will happen if enough people come together. I hope I see you at the next MPFGA rally.","score":8,"comments":[]}]},{"body":"u/bortomio is the best person in this subreddit","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I think we are too infiltrated with mainsubbers for it to happen tbh(Post Wano damage control has been going strong.) Also the current arc is nowhere near as insufferable as Wano was.","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"We need a true shit arc like Wano to prosper again. Egghead has the potential, we're gonna have to wait for Gucci to enter the scene.","score":35,"comments":[{"body":"I'm like a wano citizen waiting to be freed from this hell","score":15,"comments":[]}]},{"body":"That’s what a relatively boring stretch of the story does to a sub\n\nWhat made piratefolk entertaining was hilarious shit like Kaido’s backstory, Toon Piece, Yamato not joining, Carrot cope, Greenbull agenda etc.\n\nI promise this gonna be fun on the final arc\n\nI do try to post funny stuff from time to time, but I’m not as good or frequent at it as the greats of piratefolk","score":37,"comments":[{"body":"You are based, since titanfolk, you always have been...","score":11,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"the King is back! #MPFGA","score":9,"comments":[]},{"body":"Hello piratefolkers. It has come to my attention that there is a recent daunting presence that disrupts the very essence that makes r/piratefolk piratefolk. From repetitive shitposts, increased inactivity, and unfunny polls, it has been harder and harder for me to contain my inner incel demons. First the great holy light aka myrmonden decided to forsake the very ideals of piratefolk, then u/sulongcarrotchan spiritually died and became a husk of his former self by touching grass, and now u/BasedSigmaMale is actually fucking dead. All our heroes are slowly dying out. Who's next?! If something happens to u/Dinarchi (minister of r/Godafolk) you can count me among the oh so many corpses. Why do we keep these vapid repugnant posts so this subreddit can be destroyed as the old subreddits in the likes of r/MemePiece and r/OnePiece were? Is that worthy of piratefolk is that to be the future of this sub?! We must rise above those insolent fools and save this decaying place!\n\n##Make. Piratefolk. Great. Again. Who's joining the r/Piratefolk chud force?! Who’s ready to save the world???\n\nCredits:\n\n[One Piece was always a gag manga](https://www.reddit.com/r/Piratefolk/comments/ttlmzd/one_piece_was_always_a_gag_manga/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/Warbande\n\n[If Greenbull ends up stopping them](https://www.reddit.com/r/Piratefolk/comments/vdyb82/if_greenbull_ends_up_stomping_them_then_it_makes/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)by u/PokLao\n\n[Poor Zoro](https://www.reddit.com/r/Piratefolk/comments/v42gn2/poor_zoro/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/IstanLaw\n\n[He still got a flashback](https://www.reddit.com/r/Piratefolk/comments/v7wxfz/even_dead_he_still_got_flashback/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/Dinarchi\n\n[That’s it](https://www.reddit.com/r/Piratefolk/comments/uol6ej/thats_it/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)by u/mhwsloe\n\n[The crew and I praying for Greenbull’s success](https://www.reddit.com/r/Piratefolk/comments/ve4px9/the_crew_and_i_praying_for_greenbulls_success/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)by u/celerytaxi\n\n[Admiral Planet](https://www.reddit.com/r/Piratefolk/comments/w6pemx/admiral_planet/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)by u/bortomio\n\n[The bad ending](https://www.reddit.com/r/Piratefolk/comments/vrzm4f/the_bad_ending/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/midofloor\n\n[iis that the heckin joyboy](https://www.reddit.com/r/Piratefolk/comments/w617fn/iis_that_the_heckin_joyboy/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)by u/midofloor\n\n[Piratefolk’s new favorite character](https://www.reddit.com/r/Piratefolk/comments/ve8z76/piratefolks_new_favorite_character/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)by u/Aurora_Vorealis\n\n[final war leaked](https://www.reddit.com/r/Piratefolk/comments/vsxfcp/final_war_leaked/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)by u/midofloor\n\n[Get looney](https://www.reddit.com/r/Piratefolk/comments/ty7bqu/lets_get_looney/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)by u/2-2Distracted\n\n[chosen one burgess!](https://www.reddit.com/r/Piratefolk/comments/wafka6/chosen_one_burgess/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/bortomio\n\n[Chapter 1057 behind the scenes: PEAK FICTION](https://www.reddit.com/r/Piratefolk/comments/wqv3jt/chapter_1057_behind_the_scenes_peak_fiction/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/bortomio\n\n[LowTierPeros](https://www.reddit.com/r/Piratefolk/comments/wgywme/lowtierperos/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/bortomio\n\n[Zoro finally visits Ryuma’s grave](https://www.reddit.com/r/Piratefolk/comments/wf98es/zoro_finally_visits_ryumas_grave/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/midofloor\n\n[Are you having fun Akainu?](https://www.reddit.com/r/Piratefolk/comments/wp7aar/are_you_having_fun_akainu/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/bortomio\n\n[Prejudice breeds stability](https://www.reddit.com/r/Piratefolk/comments/w56mq9/prejudice_breeds_stability/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) by u/midofloor\n\n[yt video](https://youtu.be/ScTb9xIAnck)","score":36,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I Would like to use all OP OC for my original series inspired by one piece. let's make it as big as one piece!","not_safe_for_work":false,"locked":false,"body":"All OC will be credited","score":1,"comments":[{"body":"Oh that would be interesting. You could check out my FF \"unusualities\"\n\nThere you can find my OCs of you're interested.","score":1,"comments":[]},{"body":"I  have OC but sadly emperor level OC...he is emperor of the sea with some changes or addition in the story.","score":1,"comments":[]}]},{"title":"Sanji hot take?","not_safe_for_work":false,"locked":false,"body":"Sanjis best feat is being compared to Zoro (wings of the pirate king) and shown in duo panels with him, withou that people would not even say that Sanji is close to Zoro anymore. when we would only look at combat feats Zoro&gt;&gt;Sanji, for the peopl that get mad because of that im not saying Zoro&gt;&gt;&gt;&gt;Sanji im saying when Oda want to make them look close in strength then maybe he should show it more with feats and not statements. btw same goes for Kid&amp;Law compared to Luffy","score":0,"comments":[{"body":"What actual combat feats though?\n\n100% Zoro has Acoc which is huge but he struggled against King equally if not more then Sanji did against Queen until they both one shot their opponents with their new power ups . So Im not really sure how anyone can say they are miles apart in strength, the only thing is that Zoro has a better form of Haki.","score":9,"comments":[{"body":"thats because King is way stronger than queen why tf you comparing how they strugled when they did not fight the same guy? King has higher ap, is faster and more durable and has higher battle iq. and even with that Zoro low diffed King after he got acoc and after that was only koed because of the mink med, Sanji was koed because he was actually exhausted","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Ifrit jambe’ing Queen as far as hybrid kaido did pre-G5 Luffy is only not a good feat because you choose not to focus on it. Same with clashing with oars pre-timeskip, lifting/defeating/grilling an enlarged wadatsumi in fishman island, being the first person we saw to damage a cp9 member through iron body, impressing katakuri with his reflexes/observation haki, consistently defeating marginally less weak opponents than and improving at the same rate as zoro, instantly healing from having his heart and lungs flattened by Queen, literally being stated to have “the power to disappear” against a second commander through his new germa speed, etc. It’s not anyones fault but your own if you need to wait for new feats to believe he’s strong enough to be compared to zoro.","score":8,"comments":[{"body":"Sanji fans realy mastered to make average feats look good lmao, if you listed Zoro feats like you do with Sanjis it would look 20x better than that shit.\n\nedit: like first person to damage cp9 iron body, Zoro first person to scar Kaido after Oden","score":0,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Statements and not feats is exactly how one piece operates, it's a hype machine and lately we started to see the cracks.","score":5,"comments":[{"body":"yeh that is my problem, like I said im not saying Zoro&gt;&gt;Sanji im saying that Oda can do better to make Sanji look comparable","score":2,"comments":[]},{"body":"Not really. People just want characters to be stronger than they actually are so they try to grasp at every straw to elevate their favorite characters.","score":2,"comments":[]}]},{"body":"Sanji = Zoro is over wit after wano","score":2,"comments":[]},{"body":"Sanji be leeching of zoro .","score":2,"comments":[]},{"body":"My boy spittin","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"What happened to the injuries zoro was supposed to get after wano?","not_safe_for_work":false,"locked":false,"body":"&amp;#x200B;\n\nRemember when zoro took the ultra healing medicine to make him get in good condition? Well, the doctor said he's gonna have twice the damage/pain later because of side effects. But now after wano, zoro isnt affected at all. I forgot about this lol. With oda being oda, I feel like the effects are gonna come in when hes in a fight.\n\nEdit: I forgot about the grim reaper","score":71,"comments":[{"body":"It meant nothing. It’s one of many plot threads that were dropped for a rushed Wano ending.","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Chopper healed him \n\nOda offscreened the best big bro little bro relationship in the story for no reason. Normally it’s Zoro taking care of chopper and this time it would have been chopper taking care of Zoro. \n\nGapping missed opportunity for chopper to be more than a mascot","score":71,"comments":[{"body":"…Sir this is a McBooba’s….take your order of Post TS Nami boobas or leave please.","score":44,"comments":[]}]},{"body":"Nothing happened","score":49,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I might be tripping but there was like a week of gap from Kaidos defeat and Momonosuke's goodbye.People heal fast in this universe.","score":48,"comments":[{"body":"I mean everything happens fast in one piece. 20 years of one piece condensed to a few years of actual time","score":19,"comments":[{"body":"i think aside from time skips its been like 6 monthes in story","score":11,"comments":[{"body":"It has been only about 90 days since the timeskip lol.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"The pacing isnt fast tho","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"He got them he literally saw death itself and took a week to heal just like Luffy who literally died","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}