{"name":"playrust","description":"The largest community for the game RUST. A central place for discussion, media, news and more. Mostly PC users, for console Rust please use r/RustConsole.","subscribers":634286,"posts":[{"title":"QOL - What 3 things?!?","not_safe_for_work":false,"locked":false,"body":"","score":523,"comments":[{"body":"Allow us to hit R to rotate roof pieces while placing","score":382,"comments":[{"body":"Also, allow 45 degree rotations for high external walls.","score":86,"comments":[{"body":"What if you could build a twig hi. ext. wall that can be upgraded to the unlocked BP of choice? That way, if you make a mistake, you can just destroy it.","score":41,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"It'd be cool if you could turn a bucket into a bucket helmet instead of having to use just metal frags","score":281,"comments":[{"body":"Yeah, that’s one of my biggest wtfs\n\nSeems super obvious that’s how it should be made","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Let us load the water barrel and sprinkler items with low grade fuel instead of water so the igniter can play a role in boobytraps for raid defense or trap bases.\n\nI want to make an \"all this fucking shit is on fire now\" button and all the pieces are here except for one","score":426,"comments":[{"body":"YES","score":83,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Shirt under snow jacket","score":136,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Fix horses, cars etc to make traveling lesss of a headache","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"2% chance you fart when you crouch","score":187,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"[Discussion] Why do you like or dislike the tech tree and are there any changes that can be made to make it better?","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"For me I'd like all guns/explosives removed from each tech tree and/or no tier 3 tech tree at all.\n\nEveryone rushes guns within an hour which absolutely kills the normal progression and it's boring. No tier 3 tech tree forces people to do high end monuments.","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"i play on a no-bp-wipe server because having to grind for hours every wipe to get a basic gun is just too exhausting as a solo. I have better things to do than to hit barrels for 7 hours to get 5min of gunfights","score":10,"comments":[]},{"body":"I like it because it opens a clear and streamlined path of progression for solos and casual players in general. You can't rely on getting a gun from a green crate, the RNG is too bad and you would have to loot tons of crates. So you need to live somewhat close to elite crate or locked crate spawns and since there are so few these monuments would be highly contested, keeping most solos primlocked. \n\nThe only other way to relieably get guns is to buy them from Outpost or bandit. So DB/Revo grubbing until you \"make that play\" (doorcamp a zerg) or you drop all your scrap on M92s which are horrible. \n\nAnd yes, people will say \"But groups roam AKs 3 hours into wipe, they just techtree them.\". Well they roamed AKs 3 hours in before techtree too. Don't act like progression was EVER hard for zergs.","score":7,"comments":[]},{"body":"Tech tree should not be available past t1 easy fix","score":14,"comments":[{"body":"T2\n\nGarage door is a nightmare to find in the wild","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"It shouldnt exist.","score":10,"comments":[{"body":"If you're interested, our server has tech tree disabled!","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I like the tech tree as a concept but dislike how someone may need both a T2 and T3 workbench inside their base, as well as a T1 outside, if they don't have blueprints. Why not simply add tabs on the T2 and T3 to access the tech trees of earlier benches? For example after getting down a level 2 workbench there's 2 tabs at the top of the tech tree - \"Tech Tree Level 1\" and \"Tech Tree Level 2\" where you can access the T1 tech tree from a higher level workbench.\n\nOne thing I dislike about the tech tree is the extremely forced nearly-linear progression of a *ton* of junk items that total several thousand scrap before you actually get the stuff you want. For example, the level 1 workbench - it takes I believe 575 scrap until you finally get the waterpipe shotgun if you're blueprintless and use the tech tree with no researching (and we know that most starter bases don't provide room for a research table). If you're a primlocked solo, it could take several real-life days to get 575 scrap. That's also NOT a small amount. I guess I don't get Facepunch's goal with the tech tree here - is it supposed to be bad (ridiculously expensive) on purpose to encourage researching? That seems to be the motivation behind making the tech tree even more expensive on hardcore servers. Its like the tech tree was added with the goal of discouraging people from actually using the feature.\n\nBack to the 575 scrap worth of tech-tree BPs before you unlock your first ranged weapon at the level 1 workbench. Why lock the waterpipe shotgun, some of the most basic weaponry, behind a payload of over five hundred scrap that only the most successful groups can get on wipe day? Does facepunch think that 575 scrap is relatively easy to come across in a relatively short-medium length of playtime after a wipe when there's bows and nailguns around every single corner also after resources like scrap? Another thing that upsets me in the early game is that damn salvaged hammer at the start of the tech tree on a blueprint wipe forcing you to waste 75 scrap before you can get *anything else* at all from it. No one has metal tools after a blueprint wipe. Nobody will find metal tools in a box after a blueprint wipe, and if you're the one in a million lottery winner that does, you take it straight home before the crossbow grubs nab it from you. The only way to get a hatchet and pickaxe is scrap. But no, you can't get even the most basic tools right away, it's of course locked behind a useless melee weapon that costs 75 scrap! That is NOT a small amount of scrap on wipe day after a blueprint wipe, just so you can throw it at the salvaged hammer blueprint of all things, and then you need to get ANOTHER 75 scrap before you can tech tree just one of the metal tools you'd like. Oh, and you have to buy 2 more nearly identical weapons - the salvaged cleaver and the mace - if you're on your way to the waterpipe. Did facepunch smirk adding that in with the salvaged hammer? Are they sadists that enjoy watching people squirm for useless hammers before they can get tools or use any other part of the level 1 tech tree? It's almost enough to convince some people focused on progressing at a non-snail pace to actually stay at stone tools until they get a level 2 workbench because tech-treeing anything is an enormous down payment of scrap. If the salvaged hammer only costed 20 scrap to research like the sword did it would be understandable, but demanding an immediate 75 scrap from new players is just going to drive people away from the game, or if it doesn't, will encourage methods like horse dung and fishing bases that the playerbase generally doesn't like as those seen as \"illegitimate\" methods to getting scrap compared to risking what you have trying to fight groups way bigger than you or monuments that are always patrolled by clans. A kid with 4 hours on Rust will go to a monument trying to find 75 scrap and get creamed. Then the player will try 20 more times and get creamed 20 more times because the different monuments, their loot tables, and radiation levels aren't explained in game at all. Either the new player rages and quits rust at that point, or they look up easier ways to get scrap... and see horse poop base videos.\n\nI barely go to monuments and I researched everything in a wipe due to horse poop and bandit camp merchants - don't regret it as a bit as that's a no BP wipe server with a decent population and I can pick up much easier now that I know the blueprints in future wipes. I totally understand other players complaining that it's not how the game is supposed to be played though, and I do want to run monuments in future wipes on that server because I was seriously short on components in the horse base.\n\nIt takes forever and an obscene amount of scrap to get stuff I'd like out of the T2 just by the tech tree. When I get a T2, the first thing I know I'd like to be getting are garage doors, SARs, and strengthened windows in case I have windows in my base. To get all of that? Like, 2000 scrap. At that point I used a vending machine to trade a good amount of sulfur ore for the items and scrap and just researched them. Is this what the tech tree is trying to accomplish?\n\nSo, what are the solutions then? I suppose the solution to this is to make the tech tree wider and be less linear with paths that go *down* forever but pretty much never go *out* with pathways. This way people who want guns don't have to spend hundreds of scrap early game on useless melee weapons, those who want defensive items like clothing and deployable blueprints can prioritize those. This way it'll feel more like a tree instead of just a line.\n\nTl;dr - Primlocked solo rages about the tech tree costing too much, questions what Facepunch's goals are.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I like the tech tree as a solo player. From the moment the wipe starts, I’m already behind as it is. “Players are forced to go to high end monuments like oil rig and military tunnels” being camped and constantly run by 6-12 man squads/zergs. I understand larger groups will always have an advantage in either scenario, but at least I’m not permanently prim locked anymore. You could give servers the option of removing it as a change, then see how long those servers last. Everyone saying how much they hate it are either in a large group, play on low pop servers, or never played before its existence.","score":6,"comments":[{"body":"I played before the tech tree was a thing and let me tell you, wandering around hoping to find a gun, any gun, and never ever getting one from a crate was super demotivating. Tech tree was added around the time I reached 200 hours though so I don't have years of experience under both systems or anything. I also remember random experimenting where you'd throw scrap in and it'd spit out a random blueprint you didn't already know. The RNG on that was so terrible lol, tech tree is much better than that. That's not to say the tech tree can't be improved, though, it definitely has its flaws.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"whats ur kill guys kill bind","not_safe_for_work":false,"locked":false,"body":"","score":1073,"comments":[{"body":"Just light the torch, run 10sec and you are dead again","score":138,"comments":[{"body":"Jokes on you i work 9-5 so it’s 30 pop or bust","score":51,"comments":[{"body":"I work 6-2 what server are you on and what location so I can offline you?","score":31,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I will dodge and weave straight into the ocean just in the off chance the asshole shooting a neked might be depraved of the satisfaction","score":23,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Shift + k","score":25,"comments":[{"body":"When you accidently press k when running","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Mine is \"L\" because I usually need it after taking an L, plus it is far enough away from my other binds to not cause accidents ;)","score":15,"comments":[]},{"body":"Yup, I drown myself if need be.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The \"end\" key to end my life","score":30,"comments":[{"body":"Suicide Hotline Numbers If you or anyone you know are struggling, please, PLEASE reach out for help. You are worthy, you are loved and you will always be able to find assistance.\n\nArgentina: +5402234930430\n\nAustralia: 131114\n\nAustria: 017133374\n\nBelgium: 106\n\nBosnia &amp; Herzegovina: 080 05 03 05\n\nBotswana: 3911270\n\nBrazil: 212339191\n\nBulgaria: 0035 9249 17 223\n\nCanada: 5147234000 (Montreal); 18662773553 (outside Montreal)\n\nCroatia: 014833888\n\nDenmark: +4570201201\n\nEgypt: 7621602\n\nFinland: 010 195 202\n\nFrance: 0145394000\n\nGermany: 08001810771\n\nHong Kong: +852 2382 0000\n\nHungary: 116123\n\nIceland: 1717\n\nIndia: 8888817666\n\nIreland: +4408457909090\n\nItaly: 800860022\n\nJapan: +810352869090\n\nMexico: 5255102550\n\nNew Zealand: 0508828865\n\nThe Netherlands: 113\n\nNorway: +4781533300\n\nPhilippines: 028969191\n\nPoland: 5270000\n\nRussia: 0078202577577\n\nSpain: 914590050\n\nSouth Africa: 0514445691\n\nSweden: 46317112400\n\nSwitzerland: 143\n\nUnited Kingdom: 08006895652\n\nUSA: 18002738255\n\nYou are not alone. Please reach out.\n*****\nI am a bot, and this action was performed automatically.","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"While we are on the topic of QoL improvements: How about the toggleable option to clip boxes with each other, much like planter boxes and high walls clip onto each other and clip them with walls too? Would make their placement a lot nicer and more convenient.","not_safe_for_work":false,"locked":false,"body":"","score":253,"comments":[{"body":"bro i've practiced my box placement on ukn for hundreds of hours. this change would be devastating to the core rust population (me and my cat)","score":226,"comments":[{"body":"Agreed! We should be rewarded for being rustcel virgins and those that prefer a casual experience should be punished!!!!","score":38,"comments":[]},{"body":"I'm assuming you'll quit and never come back as well","score":32,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Mhmhm, i think it would be better an option to clip them to walls so you can place them perfect 100% of the time. If you place one wrong, doesn't matter you can attach one next to it because it will have no space.","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Just FYI:\n\n\"Clip\" is what prevents two solid 3-d objects from overlapping, it's the collision system. That's why the \"noclip\" command lets you fly through walls/floors/objects, your model no longer collides with anything.\n\n\"Snap\" is when objects pop into a specific place, like walls snapping to the edge of foundations.\n\nYou want these boxes to \"snap\" into position, not \"clip\" through each other.","score":42,"comments":[{"body":"Yeah, that's exactly what I meant. Thx for clarification.","score":9,"comments":[]},{"body":"This guy CADs","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Skill issue","score":44,"comments":[]},{"body":"Nah I love the Tetris mini games","score":6,"comments":[]},{"body":"I'd like finer graduations than a 90 degree rotation.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Cassius Marcellus Coolidge - A Friend in Need (painted in game using a mouse)","not_safe_for_work":false,"locked":false,"body":"","score":100,"comments":[{"body":"\"Painted in the game using a mouse\" wtf how is it possible to draw something like this, I barely can even write xd","score":8,"comments":[{"body":"haha, its like anything, just takes a bit of practice. Just think of it like an ak spray or something.","score":6,"comments":[]}]},{"body":"Always a pleasure to see your artworks on the subreddit. Do you put these outside your base or do you keep them inside for safekeeping?\n\nAlso do you know if there is a way to make a copy of a sign/painting in vanilla?","score":7,"comments":[{"body":"Thank you, very kind words. Usually I play on a \"Vanilla\" that's protected by written rules. No plugins to reinforce anything but people usually are very respectful. I haven't had an issue yet. As for a way to make a copy in \"vanilla\", there isn't a method that I know of at the moment to do that. To get a raw output copy (the true original) the owner needs to have a plugin installed called Discord Sign Logger. With that plugin, any changes made to a sign are sent to discord in format that can be downloaded.","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Jeez this is a great painting keep up the good work 👍","score":2,"comments":[{"body":"Thanks! It was a fun one to paint!","score":1,"comments":[]}]},{"body":"Would you be down to do commissions in other people’s bases? Always a pleasure to see these being dropped on the sub","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"my parents had this painting in our base growing up this is tight bro. 14/10","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"#banitcamp","score":1,"comments":[]},{"body":"That's some amazing shit right there! &lt;3","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Took them long enough XD","not_safe_for_work":false,"locked":false,"body":"","score":261,"comments":[{"body":"Does this also mean that Garage Doors no longer take damage when picked up, in line with other doors?","score":30,"comments":[{"body":"Ye, ye for sure, somewhere in 2028 ...","score":42,"comments":[]}]},{"body":"Dude, imagine if they made these kind of changes every wipe instead of once every 2 years","score":52,"comments":[{"body":"TBF they usually do a big QoL patch once a year.","score":12,"comments":[{"body":"Sure but honestly most of those barely touched on any good qol changes. Things like fractional reloading were promised and talked about for years and years. Theres tons of stuff that have been issues for way too long like hit boxes on rocks, monuments, objects. Stuff like that been issues for so long. \nBut these changes for this qol update look pretty nice so far","score":6,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Consistency. No you can't pick up a sleeping bag, but you can a garage door.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"All I want is to pickup a large furnace and refinery.","score":6,"comments":[{"body":"or the compound external walls, or at least let me break them within certain time.\n\nits so easy to fck up these shitty walls","score":9,"comments":[]},{"body":"Would be nice. Just hide all expensive deployables in stashed before logging off lol.","score":2,"comments":[]}]},{"body":"\"requires lock removed\"\n\nohh really","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Now this is the update we were all waiting for. No more misplaced walls","not_safe_for_work":false,"locked":false,"body":"","score":163,"comments":[{"body":"So many good updates this week","score":22,"comments":[{"body":"So many. Long may they keep on coming.","score":9,"comments":[]}]},{"body":"Keep your rotation, let me demolish them with a timer like normal building pieces.","score":8,"comments":[]},{"body":"Please make them able to demolish them too if placed wrong. (in 10 mins, just like normal walls)","score":11,"comments":[]},{"body":"BIG","score":8,"comments":[]},{"body":"People on this subreddit love to give Facepunch a lot of shit. This deserves respect. Thank you to FP and all the hard working and creative people for making our awesome game even better.","score":7,"comments":[]},{"body":"Wtffff where can I see all the other updates? This is amazing","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"the next update is going to be the  best update ever","score":7,"comments":[]},{"body":"It's great they are trying to give QOL updates to the high walls, but making them rotate 90 won't fix most of the issues...\n\nHopefully it's just a start and they keep adding upon it..\n\nLet ue demolish them like other pieces, maybe place a twig model first and upgrading later... Make them variable sizes to fit in gaps... Idk but rotating them 90 is cool but far from what is actually needed..","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Now the redditors can cry while I rotate my zecko lmao","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"military tunnel is real guys","not_safe_for_work":false,"locked":false,"body":"turn the sound on bozos","score":505,"comments":[{"body":"lmfaoo the scientist noise was the cherry on top","score":60,"comments":[]},{"body":"The headshot crunch is the most satisfying injection of dopamine","score":41,"comments":[]},{"body":"Rare footage of a random naked throwing their rock down military tunnels and hitting a clean headshot kill on a scientist that Merked a full metal plate guy","score":20,"comments":[{"body":"Makes you wonder if distance thrown affects the damage of the rock. Like if you threw it off a cliff towards the spawn beach, would it deal more damage or is there a set damage cap.","score":4,"comments":[]}]},{"body":"i’m mad I laughed at this","score":5,"comments":[]},{"body":"Perfection.","score":4,"comments":[]},{"body":"lmao","score":3,"comments":[]},{"body":"u/savevideo","score":3,"comments":[{"body":"###[View link](https://redditsave.com/r/playrust/comments/z1b4xb/military_tunnel_is_real_guys/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&amp;#32;|&amp;#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Feedback for savevideo)&amp;#32;|&amp;#32;[**Donate**](https://ko-fi.com/getvideo) &amp;#32;|&amp;#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Content removal request for savevideo&amp;message=https://np.reddit.com//r/playrust/comments/z1b4xb/military_tunnel_is_real_guys/) &amp;#32;|&amp;#32; \n [^(reddit video downloader)](https://redditsave.com) &amp;#32;|&amp;#32; [^(download video tiktok)](https://taksave.com)","score":2,"comments":[]}]},{"body":"this game looks so real rn but why they buffed rock throw to a one shot headshot kill","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Suggestion: Gun turret module for cars. How do you guys like the idea? I think it would make people use cars a lot more and lead to some interesting roams and PvP situations.","not_safe_for_work":false,"locked":false,"body":"","score":316,"comments":[{"body":"Eoka humvee, truly the peak of rust experience.\n\nI want it.","score":164,"comments":[{"body":"Belt fed eoka","score":65,"comments":[{"body":"I am rock hard rn","score":55,"comments":[{"body":"Username checks out","score":8,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"\"Can't be combined with camper module\" it can if you enslave nakeds to push the car along while you shoot","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"FP tried to make cars work but they aren't and they are going to be staying that way unless they make cars actually driveable, even after everything they did nerfing copters, less horse spawns, more roads etc. they are still rarely used because their car design is utterly stupid, they have wheels like market cart which gets blocked by the slightest of bumps also game isn't optimized enough for a smooth ride I guess.","score":36,"comments":[{"body":"Also level 1 car parts need to be on the god damn tech tree for cheap.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Cars are very playable?\n\nMy buddy did a whole wipe from his camper, he hd a couple of garages around the map with work benches. \nBut he would just load up his car with some stuff. \nAnd drive over to whatever monument he wanted. \nOf he died he spawned in with hus camper and had a retake kit. \n\nIf we got attacked he just drove across the map to help. \nIt was hilarious but worked well","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Would make cars good again like the suck ass rn: No offroad, expensive to make, you have to search for them, lots of scrap to get parts, losing the key is a pain in the ass","score":5,"comments":[{"body":"Cars should just get code locks, if our naked characters can manifest a code lock out of thin air with 100 metal and lock all sorts of things with it, locking a car with it should not be out of the question.","score":4,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Is Rust enjoyable without sweating?","not_safe_for_work":false,"locked":false,"body":"Hey!\n\nI've been watching some Rust for a while and am tempted to buy it during Autumn Sale, but watching people like Welyn who seem to dedicate whole days to the game left me questioning that\n\nIf I wanted to play on a PvP server once I got basics down, is it enjoyable if you literally cannot dedicate your life to it? I want to shoot some people with bows, SARs and whatevers but with university and other games I just won't be spending a lot of time learning all exploits, building techniques etc.\n\nI reckon I would be solo/duo and we'd be logging in every few days/a week depending on uni  \n\n\nSo yeah, can you enjoyably play Rust SOMEWHAT casually or is it an \"all in or nothing at all\" type of game?","score":7,"comments":[{"body":"It's more enjoyable without sweating.\n\nThat said, it's really up to your personality. If you have issues with addiction, I'd say it would be best to stay away. I don't think most sweats intended to become that way.","score":9,"comments":[{"body":"I'm not gonna get addicted although that's a good point! I am more worried that getting up to some \"geared\" level takes hours that we'd be losing every time we logged out for more than a day, which would be honestly pretty frequent\n\nThat's actually a good question to ask, how long would you say it takes until you're able to get some guns on, say, a 2x-4x server?","score":1,"comments":[{"body":"I'd probably consider something between an hour or two to be a minimum to have a chance of saving your progress. I'd expect something like 3-4 hours to have enough time to build a base strong enough to likely survive overnight.\n\nIf you're gone for a few days, it's likely that the base will be gone when you return. \n\nIt's about expectations, too. You won't be able to compete with the sweats and they will push you around. You've gotta be OK with that if you're not wanting to play excessively. Rust gives you plenty of ways to get even and be a pain in the ass to the established players though, even if you're a very small fish.\n\nYou can get guns pretty quickly on anything but a fresh wipe. The idea is to gather sulfur on your way to Outpost or Bandit, and use the sulfur to buy a gun from a player via the drone system.","score":2,"comments":[]},{"body":"You can get to end game in a few hrs on a 5x and have the complete Rust experience in one night.","score":3,"comments":[{"body":"Can get to end game in a couple hours of vanilla as well.","score":1,"comments":[]}]}]}]},{"body":"PVE/PVP servers might be better for you. I do those now. You can play the whole game without losing everything and you can be selective when you want to pvp","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You can play it somewhat casually, although personally its not very fun as its hard to progress. I quit recently because you have to put so much time in to actually progress in this game. :/","score":2,"comments":[{"body":"You just need to alter your play style so it isn't so grindy","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I’ve been short on time recently and have been doing “one-life” runs.  I just don’t have the time as a solo to grind 4+ hrs.\n\nI start out by roaming the map to monuments and exploring/looting.  Once I get a bunch of stuff I make my way to the outpost and recycle literally everything.  The server I play on combines outpost and bandit camp which lets me buy an m9 and research the bullets.  I buy smoke grenades to recycle for gunpowder, craft ammo at the workbench and go out to fight to the death.  If I make it out with loot from pvp I make a small starter base with a metal door.  If I die at ANY point past 10-15 minutes of playtime I just log off and take a break.  \n\nThis makes server hopping enjoyable and I don’t feel tied down by a big project.  It’s not for everyone but it’s the only way I can play without getting sucked into a whole day of grinding.  Mess around on an aim training server to get a handle of some guns before you try this tho.","score":2,"comments":[]},{"body":"Absolutely.  \n\nI like a variety of servers. Sometimes I'll hop in an official high pop, sometimes community duo/trio, sometimes I'll try some weird modded stuff.  \n\nKeeping things fresh does wonders for longevity.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Hmmmmmmmm...","not_safe_for_work":false,"locked":false,"body":"","score":95,"comments":[{"body":"Sulfur is stored in the balls","score":8,"comments":[]},{"body":"Looks infected","score":5,"comments":[]},{"body":"I like that boulder, that is a nice boulder.","score":3,"comments":[]},{"body":"Balls like in nonutnovembre","score":3,"comments":[]},{"body":"These balls are dried defo winning nnn","score":3,"comments":[]},{"body":"Every raider , dreams of those balls.","score":2,"comments":[]},{"body":"I think No Nut November is getting to you...","score":2,"comments":[]},{"body":"\"umm, why ur not farming. Im kicking u from clan\" -13 yold clan leader","score":3,"comments":[]},{"body":"That's the tree you don't harvest. Man got some balls.....","score":1,"comments":[]}]},{"title":"Roof rotation FINALLY","not_safe_for_work":false,"locked":false,"body":"","score":720,"comments":[{"body":"No way","score":69,"comments":[{"body":"I am still trying to convince myself that this is happening","score":46,"comments":[]}]},{"body":"The Rust gods have heard our prayers.","score":54,"comments":[{"body":"Indeed!","score":11,"comments":[]}]},{"body":"Gotta say.\n\nI've been hyper critical of them doing stupid shit like poker cabooses instead of adding any QOL or balancing changes to the game these last few months.  Its good to see them focusing on slowing the game down, getting people off of the spoonkid water monument hype, and fixing other things like this people have been wanting forever.","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What does this mean?","score":7,"comments":[{"body":"When placing roof tiles they typically snap into one orientation based on where your character is standing.  You need to move your character to change the orientation, and it can be really tricky to get in the right position.  This will make it so if you are in a position to place a roof you can change the orientation without having to move your character","score":19,"comments":[{"body":"Yup, and if one tries to build a helipad currently, the builder ends up having to put up twig scaffolding and dangle from the edge of the base to put up the roof tiles. It's a dangerous thing to do on a populated server without someone covering you.","score":8,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Now if they could just do this with triangle tiles/foundations it would make the splash bug much more tolerable to deal with. Fixing the splash bug would be more ideal of course, but it seems like this would be a relatively easy solution for the meantime.\n        \nI’m so sick of having to line up just right in order to orient triangles in the right direction, just to upgrade them and find I got the wrong angle, again…","score":6,"comments":[]},{"body":"Finally not even going to make some snarky comment about how long it's taken I'm just happy it's here","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"He jumped into that one","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[]},{"title":"Oil Rig &amp; Cargo getting nerfed. Respawn timers increased on the rigs, Cargo won't spawn as frequently.","not_safe_for_work":false,"locked":false,"body":"","score":788,"comments":[{"body":"This slows progression think it might be good","score":335,"comments":[{"body":"Slows progression for smaller groups. Large groups just farm scrap and tech tree. Late night solo cargos were my go to.","score":175,"comments":[{"body":"Same :/","score":21,"comments":[]},{"body":"Agree, I'm experimenting on my server with disabling tech tree to try to even the playing field, but in the end every change is a buff/nerf to solos.","score":36,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What server do you play on where you can actually get on cargo as a solo? Any server I play on constantly has some cracked ass trio camping cargo. They don’t even go for the crates. Just leave them there as bait.","score":22,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"More pvp on mainland is good for the game.","score":182,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"FP: nerfs rig and cargo \n\nReddit: ThiS NerFs SoloS\n\nFP: buffs cargo and rig \n\nReddit: WHy FP heLP cLanS\n\nI swear every time they change something yall find a way to complain about how it benefits clans","score":35,"comments":[{"body":"This is it 100%, it's why devs don't read forums.  Can't please anyone.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Good. I mean, the groups that want to run oil non-stop are still going to sit there and wait for it depending on how long of a time increase it is, but at least they won’t be getting 25 rig runs in a day.","score":9,"comments":[{"body":"More time for spoon to play that slither.io game.","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Prim night vision buff lmao.","not_safe_for_work":false,"locked":false,"body":"","score":146,"comments":[{"body":"Miner's hat is the tits, and my standard gear until I get facemask. Being able to see at night/in caves &gt; risk","score":9,"comments":[{"body":"I gotta play a wipe in a cave","score":3,"comments":[{"body":"It’s fun, usually pretty safe, terrible for anything else though. Hear beef? Now you’ve gotta run through a whole cave to get up top. Just got shit on? Gotta do it again. Then you have the kids who come down and bother you constantly and call you a pussy for living in a cave when you know they’re just upset because you got the cave before them. \n\nThose kids usually will end up staying up all night just to raid you, if they don’t hop servers to go try to find another cave. \n\nIt’s usually dark as fuck, cold, and lonely as shit since there’s not really ever any foot traffic coming that deep into the caves. I don’t really recommend it.","score":3,"comments":[{"body":"Most of the downsides can be negated by building a 1x2 above though","score":5,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Maybe weapon flashlight slot for revo? It's already on DB and crossie. No reason not to have it on revo either.","score":10,"comments":[{"body":"A hat will work just fine if it can get 25 total prot with bandana, i will actually consider using it.","score":8,"comments":[]}]},{"body":"a welcome buff","score":2,"comments":[]},{"body":"You people unironically use the miner's hat? Outside your base?\n\nIf I see a moving light in this game I run towards it like a moth...","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Good job Facepunch, I'm looking forward to the day Rainbow Pony and Fish Head 'Miners Hat' skins come out! I gotta look good while I'm out grubbin!","score":1,"comments":[]},{"body":"Where do u see this kinda things","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"I got scammed on rust gambling sites and I want to share it to spread awareness.","not_safe_for_work":false,"locked":false,"body":"So around a year ago a random user messaged me and he wanted me to promote his website, and in exchange he would make me the winner for jackpots. Apparently he could choose winners. So me being greedy I instantly counted myself in. I didn't think too much of it. I'm still young and I'm not the smartest. I am 15 years old. This happened when I was 14. So then after he made me win many jackpots. I won around 5000$.  I felt really guilty. I thought I was stealing so much money from other people. But I was young and greedy. But it turned out I wasn't able to withdraw it and he blocked me and stole my skins. I deposited around 200$ of my own skins. But fast forward to the present. I just got another random friend request the other day and the same thing was happening. I feel like an absolute idiot. Because it was really obvious that it was a scam.  But anyways, almost the whole process repeated itself. But I noticed a couple more things now since I'm a bit older and know slightly more things. I noticed that these people weren't real. I understood the whole scamming process. There were no real people. All of those people depositing were bots. None of that shit was real. I was probably the only player there and that's why he could easily make me win. I noticed that because in the chat. Around every 5 seconds a random user says some random stuff in the chat. They all had steam URLs. They were all bots though and none of them responded to my messages. I was alone on that site. I still don't completely understand this whole thing but I'm not falling for this again. I don't know why I'm being targeted though. I have never seen anyone else go through this. But the sites have real links and you can visit them. But the other site from a year ago is no longer reachable. It was either taken down or I'm banned from it. I just wanted to share this to spread awareness so that people don't make the same mistake as me. I lost around 300$ of steam currency on this. I mostly made this amount from gambling. I got a little bit of free scrap and I snowballed with it. So I never used any real money on this whole thing. But I'm still sad that I lost all my skins that I earned through gambling. I'm aware that I am an idiot for doing this. But now I won't repeat the same mistake. I told myself I wouldn't repeat the same mistake last time but now I actually understand that the entire thing is a scam. Even the users and the site itself.  I have video proof of most of the stuff but not everything. Since I lost the proof of the older event on another device that I no longer possess. The link to the site of the older story is [https://rust-jackpot.com/](https://rust-jackpot.com/) and the link to the one that happened recently is [https://rusty-golden.com/](https://rusty-golden.com/). That's pretty much it. I just wanted to share this. You guys are free to say anything in the comments. Be careful with trusting everyone. I hope this helps some people and prevents someone from getting scammed. Stay safe out there :)","score":1,"comments":[{"body":"Pro tip guys don’t do dumb shit","score":1,"comments":[]}]},{"title":"How Much Low Grade is a Lot of Low Grade?","not_safe_for_work":false,"locked":false,"body":"Day 3 of Wipe and I have about 6 stacks and soon to be more, is this a lot? I have about 70 hours so I have no clue.","score":0,"comments":[{"body":"so much youd realistically never use it","score":2,"comments":[{"body":"I’ve just been grinding the oil pump refinery infinite fuel technique I discovered over at power plant.","score":1,"comments":[]}]},{"body":"You are just going to make the day of the guys who raid you.\n\nFocus on what you know you need, not what you imagine you might need.  If you can't think of a need for all that low grade right now, why have it?\n\nIn general, low grade is pretty easy for solo players with a refinery because crude is so abundant.  I wouldn't worry about stacking it early.\n\nOne common mistake of new players is that they build a base and go into 'MMO Farm mode' and get loaded with things they don't need, which is one reason why small bases are targeted so often.","score":2,"comments":[{"body":"Appreciate the advice!","score":1,"comments":[]}]},{"body":"the amount of lowgrade the production of explosves takes kills me","score":1,"comments":[]}]},{"title":"Rust crashing upon loading server.","not_safe_for_work":false,"locked":false,"body":"My friends has a pretty low end pc and we used to play rust a lot. Just tried to get back into it and his pc just keeps crashing when trying to load into servers (it will crash on loading assets part or whatever) and we’ve tried all sorts of weird remedies online. His specs are RX 580, ryzen 3 2200g and 12gb of ram. I’m guessing it’s just a hardware problem but want to know if there’s any other solutions. Thanks","score":0,"comments":[{"body":"I'm not sure why it happens.. I have a high end pc and when I click play now and try jump straight into a server it crashes while loading in\n\nbut If I click play now but instead let the servers menu load for like 20 seconds then it loads in without crashing.\n\nno idea why","score":1,"comments":[]}]},{"title":"underwater labs solo andys, our time has come. we'll have to fight the only waterlab in the map with the zergs. F","not_safe_for_work":false,"locked":false,"body":"","score":612,"comments":[{"body":"i just want them to optimize monument placement, so tired of seeing both inland bluecard puzzles 2 squares from eachother","score":132,"comments":[{"body":"now that u said this, how are they gonna control that the underwaterlab that spawn in the map has even red card puzzle?\n\nit was random everytime.\n\ni hope they AT least guarantee that the waterlabs has red puzzle card, would be a shame that 1 shitty waterlabs is to be shared by the whole map.","score":41,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Looks like they also increased oil rig reset timers and made cargo spawn less","score":97,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"If they do this they should bring back the original size","score":113,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yuck. Not a fan. \n\nRust needs more shit to do, not less.","score":178,"comments":[{"body":"waterlabs were kind op, but since the new IA behaviator i actually tho right now they were in a kinda fair spot.  cuz now bots fcking rush u as soon u hit one of them, its like they all are communicated. and they are dangerous as fck, u can die to underwater bots more now than before.\n\nsad that they are reduding it to just 1, i dont think its the solution for the \"waterlabs op, on force wipe\" etcetc\n\nits not like the monument is fun either","score":60,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Should have reduced to two first","score":39,"comments":[{"body":"How about we meet halfway? One and a half.","score":14,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I can get behind the oil nerf but this one is a very large L","score":11,"comments":[]},{"body":"Nooooo, my Playstyle!!!!","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"I play rust on pc and console.. why are scientist on rig harder than on pc when console is already hard to play on?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Hi, it looks like you're trying to post about the console version of Rust. If you're trying to have a discussion about the console version please use /r/RustConsole. If you're trying to find players on console then use /r/RustConsoleLFG.\n\nIf this comment was placed in error, please report the comment. Otherwise your post may be removed later per rule 11.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/playrust) if you have any questions or concerns.*","score":1,"comments":[]},{"body":"How do you mean harder I only play pc what’s different ?","score":1,"comments":[]},{"body":"No matter how hard they are or they were there was always a pattern to their behavior once you learn it then there is 0 problems taking them on with a bow and 0 fucks given on how strong or weak they are.","score":1,"comments":[]}]},{"title":"how to find like minded players?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"As above I'm trying to find players that are like minded such as myself, easy going and like to have a bit of fun doing pvp. I'm fairly new to the game (about 500 hrs) and hate it but I want to party up with a team  to do some fun pvp and learn more of the mechanics. Any help is appreciated,\nSincerely a naked with a dream","score":1,"comments":[{"body":"The official Rust discord has a Find-a-team section, can always start there. You can also just talk to people in game. I ran into another trio with my duo and we just started shooting the shit, ended up playing the rest of the wipe together and continued playing together for a while","score":2,"comments":[{"body":"I tried just going up to people in game and just getting instanta killed lol ill have to check out that discord though for sure! Thanks dude","score":1,"comments":[]}]}]},{"body":"Voice chat and team up with people and if you don't like them after a while leave and do it again","score":1,"comments":[]},{"body":"You consider 500 hours new? I have a little over 100 hours in Valheim and i consider myself a pro. Cmon bru.","score":-6,"comments":[{"body":"If u don’t have 2k hrs in rust you’re still a bot","score":5,"comments":[{"body":"If that isn't the truest statement, and that is 500 hours on pve or low pop servers mostly so there isn't the toxic pvp steal all your stuff aspect figured in those hours.","score":1,"comments":[]}]}]}]},{"title":"Finally got the youtooz!","not_safe_for_work":false,"locked":false,"body":"","score":40,"comments":[{"body":"Put it in the recycler.","score":9,"comments":[{"body":"This right here.","score":5,"comments":[]}]},{"body":"Put it in the jar.","score":5,"comments":[{"body":"Never","score":1,"comments":[]}]},{"body":"It despawns after 30 minutes","score":3,"comments":[]},{"body":"If u low on meds u can farm him for cloth","score":2,"comments":[]},{"body":"Where ya get that?","score":1,"comments":[{"body":"On the youtooz website I pre ordered it before all of them sold out not that long ago if you logged into rust it even show cased it","score":2,"comments":[]}]},{"body":"I would of ordered the hazmat guy if it didn't have walyn's face logo on it.","score":1,"comments":[{"body":"Same","score":2,"comments":[]}]}]},{"title":"I've been getting Anti-Cheat detections and don't know what to do.","not_safe_for_work":false,"locked":false,"body":"It's an ongoing bug when I'm mid-game, it closes the game and I get a notification that anti-cheat detected a violation. Need a solution because I get kicked from the game at least a dozen times a day. I'm not doing anything suspicious.","score":0,"comments":[{"body":"You could verify the integrity of your game files. You could uninstall and reinstall the game. Sometimes there is a process in your task manager that might need to be ended, or a restart of your PC to take effect. This is assuming you haven't tried any of these solutions yet and went straight to reddit first, though.","score":3,"comments":[{"body":"I have verified integrity several times, reinstalled two times. I have no other intensive programs running.","score":1,"comments":[]}]},{"body":"Insert inevitable \"stop cheating\" comment here.","score":2,"comments":[{"body":"Haha 7.4k hours and anti-cheat finally decided it hates me.","score":1,"comments":[]}]}]},{"title":"Sound distance for explo (c4, rockets, explo ammo)","not_safe_for_work":false,"locked":false,"body":"Any idea on the sound distance (grid-wise) on how far people can hear a C4 v. Rocket v. Explo Ammo (silenced and unsilenced)? Wondering grid distance so I can plan raids (doing high pop server 300+).","score":0,"comments":[{"body":"You're going to get countered by the whole server anyways, just go yolo it and have some fun. But if you really want to plan, I have no clue, I just know that explo ammo is the quieter. \n\nI believe that it doesnt really matter if you're using silencer or not, a couple updates back they made It so explo ammo would be loud indepently from being silenced or not","score":1,"comments":[{"body":"\"a couple updates back they made It so explo ammo would be loud indepently from being silenced or not\" im too lazy to search it up but its been more like 2-4 years not a couple of updates xd","score":2,"comments":[{"body":"Thanks. I've noticed that too that now the SAR is a lot less loud and sounds like a spring, but explo is louder.","score":1,"comments":[]},{"body":"Damm has It really been that loud? Im starting to turn old I guess\n\nEdit: its been 3 years.","score":1,"comments":[]}]},{"body":"Yeah good call. The key is rockets v. C4. If the grid distance of sound is significantly less.... rockets I can hear from 6 grids away.","score":1,"comments":[]},{"body":"I member when I used to make raid base , took a good 1 h preparation between go and back , and if i forgot something i would fukin travel even more tocget the fukin electricity cord.. just cause I was scared asf to solo raid as the boom wake up the whole server . Now I just yolo and yes it s more fun and tbh I don't get counter much anymore . Just get the tc quick .\nFor context I raid only base between 12 and 25 rocket on vanilla .","score":1,"comments":[]}]},{"body":"Here yah go\n\n[range](https://imgur.com/a/L0pqr40)","score":-1,"comments":[{"body":"Horrible quality...","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"wow thanks - did not expect c4 and rockets to be the same range?","score":1,"comments":[]}]}]},{"title":"What yields the most scrap per hour? Boat farm w/ scrap tea or train tunnels?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"For low risk decent reward, boat farming. Chances you get killed while boat farming are really low, and It also provides a decent ammount of components and scrap.\n\nFor medium risk decent reward, train tunnels. Chances are you will get countered or grubbed at an exit, but the rewards are pretty good.\n\nFor high risk high reward, artic. You're getting countered 99% of the times, I've never done an artic run without getting countered, but the loot you get it's straight up op, 2 runs will yield on average 200+ hqm.\n\nEdit: Artic usually yields about 600+ scrap per run.","score":2,"comments":[{"body":"Hes asking solely about scrap, not hqm.","score":1,"comments":[{"body":"Legitimate comment. Yet worth mentioning that 1 hqm = 2 scrap at bandit right away and can be sold at 4 scrap pet piece to players if you are not in rush.","score":1,"comments":[]}]}]},{"body":"Artic overall loot HQM/Scrap/Crude, afk for 10mins and you are loaded xD.\n\nLooted 2 boxes the small ones on the shelfs/tables got 61 hqm 3 tech trash and a smg body took 5 seconds.","score":0,"comments":[]}]},{"title":"Apparently I was chosen by the admin 😂","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[{"body":"This some Moses shit.","score":3,"comments":[]},{"body":"Is this a comomo video from the other pov?","score":2,"comments":[{"body":"Possibly, idk!","score":1,"comments":[]}]},{"body":"Fire Bending update when????","score":2,"comments":[]},{"body":"[The Special One](https://www.youtube.com/watch?v=KXVdTT1Sis0)","score":0,"comments":[]}]},{"title":"December force wipe date?","not_safe_for_work":false,"locked":false,"body":"So I want to take some time off work to no-life december force wipe, just was hoping someone could confirm the date. Thought it was generally first thursday, which would be Dec. 1st, but sometimes it seems like it gets pushed to the 2nd Thursday, which would be the 8th instead.\n\nTried googling around but couldnt really find anything useful saying exactly what date it would be etc. If anybody knows Id greatly appreciate it, gotta get my time-off request in lol.","score":0,"comments":[{"body":"First Thursday of the month, always the same.","score":4,"comments":[{"body":"Sweet, thanks!","score":1,"comments":[{"body":"I don't recall them ever pushing an update a week ahead before, it could be that the first Thursday was 5 or 6 days into the month. This October's force wipe, I believe, was on the 6th because the Thursday prior was the 29th.","score":3,"comments":[{"body":"I thought I recalled a force being pushed to the second week of a month a couple of times, but I could be nuts lol. I havent played much in quite a while though, what I think I am remembering literally could have been pre-pandemic so my memory could be off lol.","score":1,"comments":[]}]}]}]},{"body":"&amp;#x200B;\n\nAre the wipe dates different for PC?\n\nThe Rust Console Edition wipes take place once a month, on the last Thursday of every month. These wipes all start at the same time, at 11am PST/2pm EST/7pm BST.","score":1,"comments":[{"body":"PC has wipe 1st Thursday of the month, so I guess it is different, which is weird lol. I think the time of day is the same though.","score":1,"comments":[]}]},{"body":"The odd time it wipes friday if something really got screwed on patch day but I dont recall ever being pushed back a whole week.","score":1,"comments":[]}]},{"title":"QOL update idea: The hammer upgrade wheel shouldn’t change where the different upgrade options are depending on what type of building placement you are upgrading.","not_safe_for_work":false,"locked":false,"body":"Currently, depending on what you’re upgrading, the wheel options are in different spots leading to a lot of accidental upgrades to the wrong materials when working quickly.","score":12,"comments":[{"body":"Ngl I never noticed this, I believe you, but I never noticed.","score":3,"comments":[]},{"body":"Yes please this is very needed","score":2,"comments":[]},{"body":"that would actually be amazing","score":2,"comments":[]},{"body":"I've felt this, but never really thought about it. Would be a great change.","score":2,"comments":[]},{"body":"So I didn't go crazy when I upgraded the wrong piece of my bunker!\n\nI fkin knew it","score":1,"comments":[]}]},{"title":"Menu sliders glitched Please help!","not_safe_for_work":false,"locked":false,"body":"","score":4,"comments":[{"body":"Unplug your controller","score":11,"comments":[{"body":"thanks man!","score":2,"comments":[]},{"body":"This, I had that with a plugged in Joystick that annoyed me for so long before I figured it out","score":1,"comments":[]}]}]},{"title":"Quarries &amp; Pumpjacks being switched to consume diesel fuel instead of lowgrade.","not_safe_for_work":false,"locked":false,"body":"","score":158,"comments":[{"body":"I have never used quarries and pumpjacks before, except that one time when I was realy low on crude. This is gonna be a great change.","score":45,"comments":[{"body":"Ive taken over sulfur/hqm quarrys couple times. Its meh if you leave it over night etc, not worth to use as a \"farm\" but below ok to use as passive income.","score":17,"comments":[{"body":"Don't you need acces to tons of lgf for them to be somewhat viable? I know the rates are abysmal.","score":7,"comments":[{"body":"Only real way to get that much LG is through trains or PVE'ing every goddamn bear to extinction.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"and it is completely useless on anything but vanilla. x2 x3 etc","score":6,"comments":[]}]}]},{"body":"Cool change!","score":11,"comments":[]},{"body":"What if they ran quarry’s on crude instead","score":7,"comments":[{"body":"That’s how it should be imo","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Generally they need to buff Quarries.","score":18,"comments":[]},{"body":"i can do something on smaller maps with the damn fuel now","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"thoughts on my starter design...","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"Good work. I will add this base to the list of my favorite base designs to use on the build servers and never try on the ordinary pvp servers.","score":2,"comments":[{"body":"Can confirm it has a 0% raid success on build servers 🧐","score":2,"comments":[]}]},{"body":"Nice editing, but what about the unlimited water?","score":1,"comments":[{"body":"[Here ya go](https://youtube.com/shorts/rs1j33qTk6E?feature=share) 😉","score":1,"comments":[]}]},{"body":"just build a 2x2 at that point","score":1,"comments":[{"body":"The main reason I build it is to not stand out. Most raiders won’t touch a 2x1 🙂","score":1,"comments":[{"body":"Tell that to every 2x1 I built ever","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"I think these should be called 2x1x1.5, I've been building similar things myself but this is good work with the storage capacity and fitting in a permanent repair bench.\n\nOf course I wouldn't be able to resist honeycombing it but even a honeycombed 2x1 doesn't stand out too much, will probably last for days.\n\nMy only problem is that I usually whack down a 1x1 with a double door as an emergency starter (usually when loaded up with gear and looking to put down a quick base) and it's so easy to forget to make that a 1x1x1.5...and I need to tattoo the correct TC position on the backs of my eyelids because holy shit I put it in the wrong corner to allow the half wall triangle every time","score":1,"comments":[{"body":"It’s so much fun cramming as many items as humanly into the base.\n\nI often add electricity too, cause the original build is so simple 🤠","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I admire the creativity in building this. But with half walls costing as much as full walls it is only slightly more expensive to just build a 2x2. It's 600 more stone. So the savings are not worth for how crammed this is.\n\nEdit: People will be able to tell that this is built with high walls easily if they see through the metal shopfront and know it has more loot storage than it first appears.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Which DB skins have the best sights?","not_safe_for_work":false,"locked":false,"body":"Glow in the dark? Red/Green tip? Anything good?","score":0,"comments":[{"body":"Just use a crosshair overlay. They are allowed by the devs and the game even has it's own crosshair. Crosshair V2 is the free version of Crosshair X.","score":1,"comments":[]},{"body":"All DB skin got the same sight sadly.\n\nUse overlay if you really need one, but why would you need a crisp sight on a DB? Slug?","score":1,"comments":[]}]},{"title":"The Way Of The Naked","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"DLC's need QOL / improving","not_safe_for_work":false,"locked":false,"body":"I have purchase most of the dlc's for Rust, and for such a high price for no large additions and changes better quality and fully completed features are expected!\n\nI have no regrets owning th DLC's that I do, they are much fun, but similarly like the voice props dlc got an update to fix the radio feature before hand it worked like shit. The Sound lights that produce light reacting to music needs improving. \nThe light produces is barely visible and should have a clear RGB colour on walls surrounding it (it barely has that effect currently) \nThe musical instruments are fun but the range of notes is bad. For example trumpet only has small amount of notes it can play. For high price I expect a complete instrument with full capability. *For the price of a whole map or gamemode in other games we get half-assed roleplay items that partially work*","score":2,"comments":[{"body":"I play a lot of Rust but I don't see myself buying those DLCs for more than maybe £1.99 a pop. Pricing of skins is ridiculous too, you'd need to be off your head to pay some of these prices (...and apparently a good chunk of the community are in fact off their heads). The fact that the 'skins' are actually pay to win with functional changes (metal door with window, warm version of the hazmat suit etc) just leaves a bad taste for me. Yeah, I know they have to keep the lights on, but it's not like the base game sells for a tenner.\n\nI'll happily put the same money into VIP for a well-run server.","score":3,"comments":[]}]},{"title":"Periodically run command on Rust Server?","not_safe_for_work":false,"locked":false,"body":"Hello Reddit,\n\ngot a server config question:\n\nI'm running a small (10 players only) Vanilla Solo Server where I use RustAdmin to periodically skip the Night with this command every 52minutes:\n\nenv.time 7;say \\[NightSkip\\] Time is 07:00\n\nThis makes the night very short. Time will jump from ca. 20:00 to 07:00.\n\nHowever this works only while my local PC connected to the Server with RustAdmin.\n\nCan I somehow set this up to be run from the server side? Preferably without Plugin.","score":0,"comments":[{"body":"If your going to skip night, you probably need an events plugin to spawn, ch47(locked crate), attack heli, cargoship, and seasonal events. Because the game tracks the time and needs to roll into the next day. Your not increasing the counts on the day when you skip midnight for instance \n\nSo you probably need a plugin anyway.","score":2,"comments":[{"body":"Also try setting env.nightlenght instead of skipping","score":1,"comments":[]},{"body":"I assume OP doesn't want a plugin specifically for the reason it would raise the need to put his server into the \"modded\" section. The loophole in use is that you're allowed to change anything on the server using convar without the need to put the server into modded.","score":1,"comments":[]}]},{"body":"- You are not running a vanilla server if you change so much about the gameplay, like time and events.\n- Buy Rustadmin premium to run commands without the need to have RA open on your computer.\n- Use a Plugin to control time and events and set your server to the modded section\n- or, use a shellscript on a cheap virtual cloud  to run rcon commands periodically","score":1,"comments":[]},{"body":"Try asking at /r/playrustadmin if you haven't already","score":1,"comments":[]}]},{"title":"Where is the fun?","not_safe_for_work":false,"locked":false,"body":"Hi,\n\nI recently bought Rust on Steam. A bit late to the party, I guess.\n\nAnd man, is it a tough game on newbies!\n\nSo, I'm in Europe so I figured I'd join the biggest European Official server. Just to get a taste. After many hours just getting killed, by everyone and everything, without making any progress at all -- not even a sleeping bag! I finally realised that if I played in the middle of the night, the server was quite empty, so maybe I stood a chance of some progress, you know what I mean -- maybe a sleeping bag, some clothes, maybe a base...\n\nSo, it's 3-4am here now and there are less than 50 people on a 500 max server. I must be one of the only naked guys on the server right now.\n\nSo, why is it there is some guy named 'skafand3r', and he seems to be camped out along the main road that runs along the spawning beach. And he's killed me with an AR Rifle maybe 3 times tonight. In a 2-3 hour period.\n\nI mean, think about it, there's hardly anyone on the server, it's 3-4am here in Europe, and this guy is just spending his time waiting for some naked, lootless newbie to come running off the beach.\n\nIS that really what this game is all about?\n\nCan anyone tell me where the fun is in that? (Seriously, I don't get it!)","score":12,"comments":[{"body":"play on a lower pop server if u are new","score":17,"comments":[{"body":"U can swim to a diff locations it will be harder for them to see u and grab hemp and make sleeping bags till u get where u want to go..also u can wait till night and try and get by them…ops this was supposed to be a reply to the post not this comment sorry..lol","score":5,"comments":[]}]},{"body":"Your trying to run before you can crawl. Join a low pop server or a pve server and figure out the mechanics before you go solo on a max pop server. \n\nFirst thing you need to do it get far away as you can from the spawn beach. Look at your map places like oxum and suoermarket are going to be high traffic areas because of the recycler. \nMonuments are going to vary in pvp but avoid military tunnels, power plant and excavator for now. Monuments like airfield and satellite are generally a lot quieter. \n\nSecond get used to dying ALOT, people will go on a server on wipe just to kill people on the beach with spears then leave when people start rolling gun.","score":12,"comments":[]},{"body":"I had a similar start when I started playing. Go to a solo duo trio server with decent pop. Trying to play in a max pop server as a new player isn’t fun. I play a lot of solo wipes on max pop servers and live by finishing village usually. You can farm ocean for comps. Highly recommend watching willjum on YouTube for good solo content to get an idea how he plays on max pop servers. Another solo chad is aloneintokyo but he is way more aggressive and messes with zergs.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Learn the game on less populated servers, not officials, they have been known to be unmonitored and prefered by cheaters.\n\nMight be a good idea to look for limited servers, where there is a hard cap on team size. Look for solo servers, teaming there is disallowed, everyone is a lone wolf.\n\nOfficial servers wipe monthly. Right now it's 3 weeks into the month, most people have progressed far enough to have guns. A freshly wiped server will have less armed people, although still be prepared to be killed on sight as a newcomer.\n\nThe game can be extremely intense and fun, but it has a tough learning curve. Good luck, don't give up.","score":4,"comments":[]},{"body":"This game is not for fun, it is for suffering.   \nPeople actually like it, even though many deny it. (Adrenaline, etc.)","score":5,"comments":[]},{"body":"It's fun to play on vanilla servers. It's also fun to play on modded, empty, building, pvp focused, and role playing servers. I've played on all kinds of unique servers to try things and learn things (how to fly a mini) etc... I don't recommend vanilla high pop to my friends trying rust for the first time.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Honestly, Skafand3r is probably just running around near his base with a gun. Why are you running up a main road, and why are you running back to the same spot where you just died?\n\nYou want a sleeping bag? Okay, go find three hemp bushes. You don't want to die? Start creeping around like the naked man-rat you are.\n\nThe fun happens when you make it and start being able to do unto others.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I wrote a guide that should give you an idea what server to pick, where to build and how to progress at a good rate.\n\nhttps://www.reddit.com/r/playrust/comments/ybpple/the\\_tier\\_2\\_chad\\_a\\_solos\\_strategy\\_on\\_how\\_to/","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"There are pve and limited pvp servers for learning. That's what I did and it was a big help. I was able to practice running monuments, practice building (there are servers just for this), growing, selling, farming, running tunnels, fixing and driving vehicles, knocking down npcs, crafting, using work benches, etc.... There are also servers for practicing with weapons and flying minis and scrappies. There's so much to learn and dying all the time doesn't really allow the process of learning. It's like learning a language before visiting a new country. It makes things a whole lot easier.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"One grenade would have done it. Life is a gamble.","not_safe_for_work":false,"locked":false,"body":"","score":16,"comments":[{"body":"You sleeping bag psychopath","score":3,"comments":[{"body":"It makes the play sometimes! Never sleep on the bag count.","score":2,"comments":[]}]}]},{"title":"Is there a way to change the volume of certain sounds?","not_safe_for_work":false,"locked":false,"body":"I am recording some videos in Rust and i would really need to do something about Sciencist sounding like 300 kilo yetis in metal shoes. Is there a command or can i perhaps modify a file? I make it on my own server so I have all the permissions and I already looked for solution elsewhere.\nHelp would be appreciated. 🙏","score":0,"comments":[{"body":"You can take a look at [this](https://www.reddit.com/r/playrust/comments/yy0enc/why_is_gathering_resource_loud_ass_fuck_in_this/iwt5meo/) thread about using audio compression, and you might be able to EQ out some of the heavier stuff (at the risk of deadening that element of the mix entirely).\n\nIf you follow my audio compression guide you could additionally use [TDR Nova](https://www.tokyodawn.net/tdr-nova/) as a *dynamic* EQ, before the compressor. What a dynamic EQ can do is detect a spike of energy going over some threshold in one region of a sound and pull that region down for just as long as it lasts, then let the volume in that band return to normal. You can expect to do a bit of tweaking and tuning of course if you want to pick out just the clumpy footstep sounds and react to those.\n\nAll of this may introduce tens of milliseconds of latency to your audio, but if you're making a video that's no big deal as you won't be worried about real-time responsiveness, you can just nudge the audio back the appropriate number of frames. You can also just process the audio in a DAW (after recording) rather than bothering with all that live audio routing setup that I've described in the link.","score":3,"comments":[{"body":"Thank you very much, i will check it out later 🫡","score":1,"comments":[]}]}]},{"title":"Hey is rust being glitchier than usual?","not_safe_for_work":false,"locked":false,"body":"Hey guys I've just noticed recently don't know if it's my setup but is rust being glitchier than usual like more game kicks to desktop and just weird stuff?","score":4,"comments":[{"body":"Happend 3 times just closes down No Error or anything","score":2,"comments":[]},{"body":"Yes, I have felt it also","score":1,"comments":[]},{"body":"Yes happens to me at least once a day. I've been flying minis close to the ground.","score":1,"comments":[]},{"body":"Yup. I never had issues with Rust randomly crashing until a month or two ago.","score":1,"comments":[]}]},{"title":"Default BP Bow-able Flare","not_safe_for_work":false,"locked":false,"body":"I feel like we ought to be able to light up the opponent without weapon flashlights by using some ingenuity. Like, I was thinking of a default BP of a flare + rope (+ maybe an arrow or wood) and it basically is this bow ammo that lets you shoot out an arrow that basically throws a flare out to light up an area. I think it's important that it's able to stick into wherever it hits, to sell the usefulness of lighting up far off places at night. \n\nInstead of using a flashlight, or a weapon flashlight you don't have, you should also be able to have this other form of early light where you tie a flare to an arrow and anything that can shoot an arrow can shoot this. It'd probably be similar to a fire arrow in how far and fast it travels, and the flare flame visible in the dark (without the glow until it's fired)","score":15,"comments":[{"body":"Great idea, flares need more uses IMO","score":4,"comments":[]},{"body":"You can throw flares","score":2,"comments":[{"body":"Yeah I'll just throw the flares long distance using the power of my mind","score":1,"comments":[]}]},{"body":"That would be cool","score":1,"comments":[]}]},{"title":"Armored Door Buff","not_safe_for_work":false,"locked":false,"body":"","score":510,"comments":[{"body":"This is huge","score":158,"comments":[{"body":"I feel sorry for the ore farm bitches of all the zergs now they have a little more to grind","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"let the raid calculators re calculate !","score":42,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"That makes upgrading from garage door to armored feel worth it, right now it’s so minimal","score":106,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Nice. It'll finally be worth it to upgrade the double door wall frames from stone to metal!","score":107,"comments":[{"body":"Was it not worth it before..? \n\nI didn't know this if it wasn't.","score":14,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Does this make it 5 rockets now? (800 hp was 4 rockets before buff)","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Still 2 c4? 5 rockets now? Used to be 200 explo.. Now will be 240?\n\nAnyone know the math on this?","score":15,"comments":[{"body":"C4 does 440 damage to doors, rockets do 220 damage, explo does 4 damage per bullet.   \nSo the options are  3 C4, or 5 rockets, or 2 C4 and 1 rocket, or 250 explo.","score":25,"comments":[{"body":"Game changing stats","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Why did we replace fun for results ?","not_safe_for_work":false,"locked":false,"body":"(sorry for bad english, not my first language)\n\nThis is kinda rant but also a question , maybe i do not understand the modern rust meta anymore...\n\nI started rust in 2017, peak blueprints time. I feel like back then, the game was more difficult , but the mentality was more fun focus. Finding a team that you could join , meet new people, have fun doing everything (even if limited back then) the game had to offer.\n\nFast forward to today. I still play time to time, around 1.7k hours. The game is bigger then ever, so many things to do, to create and to enjoy, and yet... I feel like everyone is results focus, grind, pvp spray skills, base design copy pasted a hundred time. If you are not doing pvp or raiding, then you are loosing your time. Finding a team ''fun focus'' almost seems impossible. 90% of them have a big list of skills and hours quota requirements.\n\nWhat changed ? What did i miss ? Do i hang on an outdated way to see/play this game ?","score":33,"comments":[{"body":"This is why I play on lower population servers. Yeah pvp and raiding are fun, but at the end of the day I want to progress without having to constantly war with the thirty-seven neighbors around me. I like farming, building, etc, but it's definitely difficult to have fun when everyone treats the game like douche simulator.","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I play mostly on a limited PVP mostly PVE server. I think its the \"420\" series of \"NON KOS\" . Basically you can fight people by shooting near them, if they return fire you can fight. You can raid people and shoot them when raiding and all of that you just cant kill people on sight... why does this matter? It gives rust a much more community feel when you come across other players, everyone is pretty friendly cause they will get banned if they just shoot you. Or if you dont want a NON KOS server just try to find one with less than 100 people and see if you can find one with a decent in game community","score":4,"comments":[{"body":"Those servers are fun till a 4 man team builds a raid base with turrets and you have to sit there and watch till they raid because you have no explosive to make it a \"raid\" and justify shooting them on sight. They then doorcamp with explosives to get you on a bag timer and start blowing though. Your kinda defenseless raid wise in those servers. They where tons of fun though before people figured out the loopholes in them.","score":2,"comments":[]}]},{"body":"the game was more focused on PVP, if you compare rust from 2016 recoil to today's rust, it's horrendously fucking hard to shoot an ak back then, there was no aim train server no nothing.\n\nPeople don't really give a shit about AK or any other high-tier firearm because it's so fucking hard to get one. me, and the group I was playing back then only encounter people with bows and crossbows, Tommy was rare and AK was like a fucking unicorn because it is VERY hard to get an AK if you are not in a big group let alone craft one for 50 HQM and multiple 1500 RNG fragment to get the BP.\n\nthere is no map nor plan, people ran around like a caveman setting up bases near a monument that is close to them, you look for your friend by using landmarks and shit, the server lasts for an entire month, people come and go around you, primitive/midtier PVP were solid ttk was fair (bar a few anomalies such as the old slug waterpipe, 4 crossbows, 3 spears naked, etc. which they patch out with time.) and interaction was plentiful because you don't just immediately die the moment someone with a gun got his sight on you, bases are hard to raid because sulfur is hard to get, I consider this the golden age of rust.\n\nnowadays you got a map, monument guide, and a surefire way of getting an ak in 2 hours into a wipe, sulfur is plentiful, and 3 days in everybody in the server is rocking full kit ak, which can erase you from existence in 0.2 seconds if you spend 2k hours in UKN but sike not anymore because they just give everybody 2k UKN hours for free lmao (I'm not against the new recoil, I'm against the current gameplay loop, I want the golden day back)\n\npeople were focusing on \"progression and efficiency\" because they **have to** otherwise their neighbor will just get ahead of them and at that point, you just can't really effectively fight back anymore eh? or if you sleep for too long they might just farm 20 sulfur note and erase you and your friend from the map if you don't copy paste the most efficient base from youtube.\n\nThe game got more competitive, and guns are more effective and easier to acquire meaning the game turn into an FPS game. FPS games attract Big streamers who are also very good at the game and got no problem spending 2k hours on UKN, people see a big streamer pull big play in a big clan and want to do the same so they set out to spend 2k hours on UKN, and here we are with a toxic mentality of Competetive FPS game where you want to be the global elite of Rust, killing everything in sight to stroke their ego, but here lies the problem, toxicity breed toxicity, I'm not saying it's the streamer fault we are in this mess, people were always dick since 2016, since forever, rust is basically a Minecraft anarchy server, but with easy gun and no rule, it just shoots before you get shot mentality, get good or get shit on mentality.\n\nand with all that said, compared to 2016 rust was always a cesspool of degenerate, but it's a lot less fun, and friendly because of the new progression and gunplay model, there is no changing this tho, because everything is already set in stone, people mentality already used to this model and this model clearly sell well and it would be stupid to do anything about it.\n\nbut in the meantime, there is hope, streamer already starts to complain about the state of the game, and people catches on, every now and then people complain about the progression, and the oil rig meta. little voice grows louder and they listen, they already plan to change cargo/oil this coming month, so we might see rust slowly creep toward a better future.\n\nif what you seek is a team that focuses on the \"fun\" aspect of the game, you just gotta look for chill people, they existed, rarer than a unicorn but they do in fact exist, you just gotta look for them in a bizarre way, I met a 40-year-old guy at the fishing village who doesn't know how to play the game, he just brought it because he saw some role play streamer play it and to this day I still hang out with this man, another set of people I met was when I was driving a van to the outpost to refine some crude and pick up 3 naked who I team up with on a whim, we got fucked hard by some random roof camp m249 so we take turn respawning in the camper to try to drive away to safe our little car, I stick with this 3 rando the whole wipe.\n\nif you want to find fun people you just have to play the game in an unhinged way, stop doing the efficient stuff, and start doing crazy shit, crazy shit attracts crazy people, give a revolver to random naked and roam with them, start your own car garage, become the junkyard hobo, live inside the spermket, placing down 40 sleeping bag near a clan base and grub the whole wipe, DO CRAZY SHIT and I ensure you, that you will eventually meet these crazy people I mention, you gotta have some charisma and social skill tho.\n\n(sorry for my English too, not my native language)","score":21,"comments":[{"body":"thank you for this great text, this give me some nice ideas going forward :)","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"A big difference between now and then is now there is a solid linear progression path, before it was more random. Players will take the path with least resistance, meaning they'll farm straight to T3 and go do end game activities.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Everyone tries to play like streamers now. Min maxed for “content” and snowballing.","score":3,"comments":[]},{"body":"Low pop servers ftw.","score":3,"comments":[]},{"body":"The same thing happened with ARK. \n\nIt started out as a fun game, to tame/fight dinosaurs, make tribes, epic battles, etc. \n\nThe common element though is loot. At any given time you can lose it all, or gain it all. This comes with extreme highs and lows. People chase the highs and do everything in their power to attain it as often as possible.","score":2,"comments":[]},{"body":"Crazy idea but have you considered playing how you want and not worrying about what everyone else does. I’ve been into snowballing and pvp since I started in 2013 and still am because that’s what I find fun. Plenty of others were the same way just like plenty of people prefer to work on unique base designs and do a bit of role playing. If your issue is that too many people find the same playstyle fun, that sounds like a you problem because they’re clearly enjoying the game and could care less if other players stick to metas or not.\n\nAs for finding a team there’s plenty of people out there who play for fun and don’t care about pixels, like my group of half irl friends and half people we met in game who’s been playing together for years. Unfortunately for you, these groups aren’t usually recruiting people off reddit","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"You may not like it, but this is what peak grub performance looks like.","not_safe_for_work":true,"locked":false,"body":"","score":165,"comments":[{"body":"Real bodycam footage of Chicago's meth addict","score":33,"comments":[]},{"body":"But did you make it to base or die in the snow","score":10,"comments":[{"body":"Giving him the benefit of the doubt that he has a base is bold in itself","score":6,"comments":[]}]},{"body":"You must be a menace on wipe day","score":7,"comments":[{"body":"it's my favorite holiday","score":6,"comments":[]}]},{"body":"W","score":16,"comments":[{"body":"W","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I like it. Well done.","score":7,"comments":[]},{"body":"Wow that guy must have been so mad. Well played!","score":3,"comments":[]},{"body":"ppl talking abt his plays but he’s a menace to society for playing uncensored","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Does this mean 1 day in game or 1 day in real life? Im wondering if I don’t play the game for 1 day straight will it still last.","not_safe_for_work":false,"locked":false,"body":"","score":722,"comments":[{"body":"It means in real life","score":653,"comments":[{"body":"So i cannot play for a whole WEEK and it will be fine?","score":451,"comments":[{"body":"Yup, as long as you aren't raided your base will be fine","score":408,"comments":[]},{"body":"It's a wooden base. It will be raided before the game closes when you click Exit Game.","score":607,"comments":[{"body":"Ha ha I have a stone base now but ok","score":257,"comments":[{"body":"Add as many metal doors as you can, remember for every stone wall that separates you from the core of the base you need at least 2 metal doors each","score":180,"comments":[{"body":"Just dont build a base, live the nomadic life. They can't raid you if you don't have a base!","score":57,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Bro living on a single triangle foundation","score":355,"comments":[{"body":"probably a pvp chad with 6k hours that decided to finally check how building works in rust","score":151,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Any time indicator is realtime","score":65,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Small dogs bark the loudest.!!","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"I couldnt possibly be the only one this has happened to right?","not_safe_for_work":false,"locked":false,"body":" [https://streamable.com/q86750](https://streamable.com/q86750)","score":1,"comments":[]},{"title":"[SUGGESTION] Having now increased storage of boxes and vehicles to match how many items there are are in the game now, I believe it's time to increase inventory space accordingly","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"nah","score":12,"comments":[{"body":"Very well constructed argument","score":2,"comments":[{"body":"I see no point to it, u can farm enough with current space","score":2,"comments":[]}]}]},{"body":"pass","score":3,"comments":[]},{"body":"I don’t think the player inventory needs increasing…like how much more do you think is needed? All of the inventory updates were around the furnaces and bbq changes, because you can’t store items in there anymore","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"and so continued the powercreep..","score":2,"comments":[]},{"body":"If anything they should add a backpack that'll take an armor slot but gives a row of inventory space.","score":3,"comments":[]},{"body":"I think this would be a solo player buff.","score":1,"comments":[{"body":"Nope, just means you can transfer loot between bases easier as a zerg. It might slightly buff solo, but it would buff groups way more. Easier to raid, because you can now hold more boom. Can build more without having to grab more materials. Might help solo, but buffs groups way harder.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"The Rust rendering issue","not_safe_for_work":false,"locked":false,"body":"Im having an issue with trees and sorroundings not rendering correctly. I have looked everywhere for a fix but there dosen't seem to be a fix.","score":0,"comments":[]},{"title":"Bring Duct Tape Back for Crude Attachments","not_safe_for_work":false,"locked":false,"body":"Let us tape shit to weapons by wasting a duct tape on it (or duct take has 2-3 durability so multiple uses before it's gone).\n\nFlashlight instead of tactical light but doesn't have that epic vision that taclights do\n\nBinoculars instead of a scope but has no crosshair when aiming (DO NOT SAY UNTURNED)\n\nCan anyone think of one or two more? Maybe tape combat or bone knife to gun for CQC bayonet or something of the sort?","score":3,"comments":[{"body":"I want to tape a flashlight to a rocket launcher!","score":1,"comments":[]}]},{"title":"Where do I find stone","not_safe_for_work":false,"locked":false,"body":"I’m literally going insane. First thing I do when I go in a server is to find stone even before wood. So I spend 30 min running around as a naked looking for stone. Is there anywhere specific I should look I’m kinda new so am I missing something?","score":1,"comments":[{"body":"[https://rustmaps.com/](https://rustmaps.com/map/4050_991782178)\n\nlook for your server and toggle the option of node spawns on.","score":2,"comments":[]},{"body":"Less trees=more stone \nCliffs\nDesserts \nOccasionally beaches\nMountains \nSnow (generally)","score":2,"comments":[]},{"body":"Look at the Map and you will find Stone in the snow area and on top of Mountains","score":1,"comments":[]},{"body":"Check for cliffs and mountains. Nodes do usually spawn there on mass. Green area contains mainly stone, while desert and snow are more sulfur and metal \n\nhttps://youtu.be/Wb0fF092iA4","score":1,"comments":[]},{"body":"In general the flatter the terrain the less stone.\n\nZoom in the map and look for \"bumpy\" areas there will always be stone there(unless its been mined) coastlines can also have a lot of stones hidden in them.","score":1,"comments":[]}]},{"title":"Whats the most budget gaming specs i need to play rust?","not_safe_for_work":false,"locked":false,"body":"Like the cheapest way to play 1080p with 60 fps at like low settings.","score":0,"comments":[{"body":"Cheapest way is to buy used stuff, i bet you can get like 5600x with 1080ti for something like 500€ for the whole thing","score":3,"comments":[{"body":"thanks for your comment! What's the difference between 960, 1060, 2060... are they the same? sorry I'd love to play rust but not a computer pro","score":1,"comments":[{"body":"those are generations of gpus, the latest one currently is rtx40 series and no they are not the same\n\ngoogle nvidia gpu series and scroll down a bit to understand what series is from what year and what models it has\n\nIf you want to build a pc, I'd recommend monitoring the internet and youtube for some guides and builds so you eventually understand what is better with what\n\nYou don't want to have overpowered gpu with poor processor and viceversa + there are a lot more different pc componnets to take in to account\n\nTo conclude my advice is to first of all understand what market has to share and what perfomance you need. I'm pretty sure you'll find some decent budget pc builds if you spend some time + if you really want to save money buy used stuff, though it's quality and state are not guaranteed to be good, which means you need to be careful and triple check what you buy before you buy","score":1,"comments":[{"body":"thanks so much for your advice, didnt know maxing out a single component such as gpu would be held back by cpu","score":1,"comments":[{"body":"Rust is heavily cpu bound. Using the newest gpu won't change anything for your rust performance. All cpu.","score":1,"comments":[]}]}]}]}]},{"body":"Geforce Now free tier if you're willing to play modded servers.","score":1,"comments":[]},{"body":"I'd recommend rx 580 https://www.youtube.com/watch?v=t9skqmaemr0\n\nUsed on Ebay around $80 - $100. Maybe cheaper elsewhere.\n\nWith ryzen 5 3600 or maybe even 2600 (can be had for $50 while 3600 is like $100), b350 also under $50 motherboard and 2x8gb ddr4 3000 around $50.\n\nPretty much $350- $500 to build the whole thing and seems to run rust 1080p at decent framerate.","score":1,"comments":[{"body":"Wow thank you sm !!","score":1,"comments":[]}]},{"body":"Nvidia Geforce Now.","score":1,"comments":[]},{"body":"I'd recommend saving up and just getting a good pc so you can play on good fps with a good hz monitor, it's a different game","score":1,"comments":[]}]},{"title":"Low fps+ terrible constant shuttering/lagging/freezing on a decent lenovo laptop","not_safe_for_work":false,"locked":false,"body":"I am using Lenovo legion 5 with 3060 at 130w and ryzen 7 5800h\n\nBasically no matter what I do (trust me I have tried evrything I could find and know myself) the game wants me to uninstall it and never play it again.\n\nI am using rivatuner to check info while playing and everything seems fine except on whatever settings I play the game stays around 80-100 fps and shutters (especially when moving around/ the map loads). On lowest settings possible usage of my gpu doesn't go over 30% which is +- the same for cpu.\n\nTried control panel tweaks, launch options tweaks, vsync- gsync etc... manipulations, power options tweaks and obviously updating drivers\n\nInteresing if anyone knows what else is possible to do to fix this crap\n\nP.S. I know that this game behaves differently depending on hardware, some have no issues running it, some can't play like me. What this means is that it might have nothing to do with the hardware of pc/laptop but the game optimization itself.","score":0,"comments":[{"body":"I have 1650ti on a laptop and I get 50fps medium graphics","score":1,"comments":[]},{"body":"Your processor and gpu is overheating. Good paste and cooling pad should help out a lot. I also have a gaming lapto so i know what im talking about.","score":1,"comments":[]},{"body":"Minimum specs for rust include the new rtx 4090 to maintain 24fps","score":0,"comments":[]},{"body":"Turn off tpm in bios, put maximum battery performance mode, make sure it's not in hybrid mode in legion vantage software, try updating or downgrading GPU drivers, also rust just runs terribly on laptops for whatever reason, I got a decent 1660ti laptop and it just stops at 50-60% gpu usage so I can't get more than 80 either","score":0,"comments":[{"body":"Have done all that already and I agree with you, seems like rust doesn't like laptops.\n\nMy max fps on lowest possible potato settings is 90 fps with rare occurrences to 100, when it should be 200+ at minimum\n\nAt maximum highest though it runs like 30-80 fps depending on map load","score":-1,"comments":[{"body":"Why should it be 200+ fps? The most powerful gaming GPU and CPU in the world can't run Rust that high. \n\nYou also are probably stuttering because you only have 8GB of ram which is just far too low and the CPU isn't that great, plug the power in and play on low pop servers.","score":1,"comments":[]}]}]}]},{"title":"Why is every upcoming change always a discussion about groups vs solos?","not_safe_for_work":false,"locked":false,"body":"I've been apart of this subreddit for years. For literal years, any small change devolves into \"This hurts solo players\". It doesn't matter what the change is, instantly people's thought process is how it affects a group compared to a solo.\n\nFacepunch could make the grass slightly taller in the game and someone would comment \"Well I guess now solos are fucked\". What mind fucks me the most is that those comments also get upvotes too.\n\nAm I out of the loop? Is this just a meme at this point and im not getting the joke?\n\nThat 5 man group of highschool friends that hop on Rust every day after school will destroy you if you're solo, why is that a bad thing? Keep in mind those are 5 real people with 5 mice and 5 keyboards all being used against you.  \n\n\nImagine you hopped onto a game of League, it's just you alone because you don't have any friends that play League, and your first match is up against a 5 man group of friends who all know each other IRL, and are just logging on after school to have a good time. Yeah, you're going to lose.","score":0,"comments":[{"body":"because it makes group play the only viable option if you want to get anywhere in the game.","score":6,"comments":[{"body":"That's just the nature of the game. Who gets more wood, 1 guy using a hatchet and chopping trees or a 3 man all with hatchets chopping trees? More people sitting down at their keyboard and doing work, SHOULD do more then a single guy.","score":1,"comments":[{"body":"Right. The game will always favor groups, therefore any changes should b3 carefully to not make it even more imbalanced","score":4,"comments":[]},{"body":"Who are you so wise in the ways of not solo?","score":2,"comments":[]}]}]},{"body":"you are right , the game will and has always favored large groups over solos, more man power etc \n\nI dont think that there are that many changes which hurt the solos , i think instead it might be its lack of stuff aimed at solos / small groups that make them feel that the devs are slowly pushing the game into that direction\n\n&amp;#x200B;\n\ni've always seen rust as a really hard game that you can enjoy however you want with whatever playstyle ... solo / group , raider , pve , role player , pvp chad , camper , trader , running around outpost screaming in vc like a twat. \n\nBut it does seem that the devs tend to favor adding content for the large groups which kinda sucks since solos / small groups get neglected and end up unable to enjoy the newer stuff.  \n\nNot everyone likes the whole clan zerg play style , personally i've tried  it and hated it , i know the common response is \"GO PLAY ON SOLO SEVERS BROOOOO !!!  \"\n\nbut we do,  but we run into zergs there too :D   \ni play on rustafied trio servers , and **ALMOST EVERY WIPE** we run into chinese clans  who split up into multiple groups of 3 players and just wreck everything. but thats another story :)\n\n&amp;#x200B;\n\nso yeah tldr \n\nI do think they should add stuff that benefit small groups / solos instead of rubbish like the caboose ... maybe more smaller monuments that offer enough scrap to make it worth fighting over for solos and not worth the time of the big boys who can go to places like oilrig / mili instead and duke it out with other groups \n\nit should be Solos / small groups need more content geared at them, it wont take anything away from the game and wont affect the 500000000 man zergs in anyway.","score":2,"comments":[]},{"body":"Because the advantages of group play are massive. A 5 man is not simply 5 times stronger as a solo but 7-9 times. Their advantages mutiply. \n\nYou start the wipe with your 5-man. Each of you loots 5 different monuments, 5 times higher chance to find a T2 gun in a green crate. Usually you will have enough comps to equip everyone in the team with 5 guns and have 5 times more HP, dmg output, eyes to watch around, etc.","score":2,"comments":[{"body":"Yes and that's not a bad thing. If there were no advantages to playing with a group, then why would anyone ever play with a group? Don't you think it would be silly if a solo player could dominate a 5 man team? This is a team of 5 real life people at the other end of the screen too keep in mind, not bots.   \n\n\nI am a solo player btw, but I don't get annoyed when a group of 5 people kill me.","score":0,"comments":[{"body":"I am saying that the advantages could be a little less","score":2,"comments":[{"body":"I think something that everyone forgets is that a group of 5 people, is a group of 5 solo players working together. If you give some sort of advantage to solo players, that is essentially buffing group players. It's impossible to not buff groups.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"I’m primarily a solo and I actually like how hard it is for a solo to compete against groups in terms of realism, imagine in a post apocalyptic world being completely by yourself it’s inevitable you’re going to come across groups or even colony’s of people and 1 man being able to kill an entire group of people just isn’t gonna happen unless that 1 person has tremendous skill and knowledge of combat just as it is in rust","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Small video of the grand hotel which was built on rustopia US large this wipe","not_safe_for_work":false,"locked":false,"body":"","score":520,"comments":[{"body":"I was room 4 for this! It had a lil farm set up. Penthouse on the top floor. Chippy record was 371. The whole process was automated with notes in the shop. In the beginning Bandit paid off the local zergs to lay off the nakeds running to and from outpost. I've never seen something so role player like on an official server.","score":106,"comments":[{"body":"Bandit on top!","score":19,"comments":[{"body":"\"The roleplayer?!? On top!?!\"\n\"YES!\"\n-fave line of the wipe","score":11,"comments":[]}]}]},{"body":"Bandit built this wonder, 36 rooms out of 38 were occupied.\nThe atmosphere was awesome, it was like living in the hotel in john wick :D\nThe end was also epic, we received two MLRS attacks in 10 minutes XD","score":60,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Hotels are super fun to play out of, and I highly recommend people give it a shot if you get the chance.\n\nMy hat goes off to all you mad bastards who make them wipe after wipe.","score":16,"comments":[]},{"body":"i wanna know how you did this, i’d be very interested in joining on another wipe or replicating this on my own","score":15,"comments":[{"body":"Only bandit knows how to do it, he has the respect of the whole server. Next wipe come to rustopia US large, this server has something different","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The real question is , how that minicopter still there ?","score":5,"comments":[{"body":"the hotel staff watched over it and the customers were respectful","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Howww do you get the arcade game?","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Weaponize fertilizer","not_safe_for_work":false,"locked":false,"body":"So you know how nitrogen based fertilizer can be used to make boom in real life. Why not make something like that in Rust? Fertilizer swapping for scrap is good, but this would give it more use.\n\nJust a thought I had while watching the new Willjum video.\n\nFertilizer + metal frags + maybe a tiny bit of gun powder or sulfur (but not heaps compared to other explosives)","score":0,"comments":[{"body":"It's been pointed out before that the kind of fertilizer that can be used for explosives isn't the same as manure.\n\nAlso raiding doesn't need a buff in any way, shape or form.","score":6,"comments":[{"body":"its a game so they could just do it. but you're right raiding doesnt need a buff. in fact it's so damn annoying lmao","score":1,"comments":[]}]}]},{"title":"what if monuments are no longer spread out based on tier but instead randomly generated around the map and spawn are also random?","not_safe_for_work":false,"locked":false,"body":"Some madman went and map the bases around the server:  [I mapped out all the bases I could find on a recent wipe : playrust (reddit.com)](https://www.reddit.com/r/playrust/comments/xxhd8s/i_mapped_out_all_the_bases_i_could_find_on_a/)\n\n[Absolute mad lad](https://preview.redd.it/icapugdbad1a1.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=8712d0d4586a541435051bfc8d03422d8878f103)\n\nwhich gives me an insight look into how people choose their location, most of you fucker just build near spawn beach?\n\nI mean looking at this map it seems to spread out just fine but when I count the dot, there are 259 houses on the spawn beach side of the map and only 69(nice) on the other side.\n\nwhat if the spawn were random just like the good ol'day and monuments are just scattered around the map high tier or otherwise, so people would be more spread out? there would guarantee to be more PVP, and more Roam, Later-tier monuments would be more populated just like the golden age where spawn was random and we don't really know what we are doing just setting up a base near whatever monument that we spawn near?\n\n* Less running around on wipe day, but no naked apocalypse on wipe day.\n* Less running around and killing yourself over and over just to get a good spawn location.\n* More incentive to build near random monuments near you.\n* more viable build spot on the map.\n* more PVP, and Roam?","score":3,"comments":[{"body":"1 island. Bad map.","score":2,"comments":[]},{"body":"Rust players, like all humans are lazy. I wrote a guide with [my thoughts](https://www.reddit.com/r/playrust/comments/xjpm23/always_find_the_right_build_spot_and_server_how/) on why Rust players build where they do.\n\nI think the current system is quite good. Understanding the map and how densely populated an area will be is a skill and choosing the right build spot based on that can be quite rewarding.","score":2,"comments":[{"body":"but I like killing people boss man.","score":0,"comments":[{"body":"Then build in a high pop area. Go on roams. Take a train, horse, car, boat, heli.","score":2,"comments":[]}]}]}]},{"title":"When you play rust for a day","not_safe_for_work":false,"locked":false,"body":"&amp;#x200B;\n\nhttps://preview.redd.it/hmutcfxatc1a1.png?width=754&amp;format=png&amp;auto=webp&amp;s=f6ef1bbcaa694bf82712511bcc3b6a1d5609f318","score":4,"comments":[{"body":"They are printing new accounts like citadel prints naked shorts","score":1,"comments":[]}]},{"title":"[OC] Rust in a nutshell","not_safe_for_work":false,"locked":false,"body":"","score":85,"comments":[]},{"title":"Devblog","not_safe_for_work":false,"locked":false,"body":"In the devblog recently there have been lots of medium to big changes. What are your thoughts on these like how will they change metas and etc?","score":0,"comments":[{"body":"It's not the devblog, it's the commits.\n\nAnd they aren't very big changes, just QoL, item balances and loot table cleanups. Less frequent oil rigs/cargo ships are a good start, but still doesn't address the issue fully. All the big changes like rocket silo monument, pets, automated machines are still in the works.","score":2,"comments":[]}]},{"title":"Best skins/ DLC to buy to make a super obnoxious base","not_safe_for_work":false,"locked":false,"body":"Currently I have the Neon Signs, and Music pack DLC. I set up a ton of lasers and speakers to blast music and make it extremely obnoxious. My base speakers are on a loop of me screaming at the top of my lungs and I have collected pretty solid loot from people trying to raid.\n\nAny ideas on what else I could get?","score":1,"comments":[{"body":"Sunburn. You get the camera and picture frames which gives you infinite creative freedom. You can photopgraph horse poop, animals, a stone wall, anything really and put the pictures up at your base. You get the pool and more summer decorations too.","score":6,"comments":[]},{"body":"Have you learned about the blue siren light?","score":2,"comments":[]},{"body":"The strobe light, and spookie speaker?","score":2,"comments":[]}]},{"title":"Lol","not_safe_for_work":false,"locked":false,"body":"","score":371,"comments":[{"body":"I know exactly what the dog doin","score":3,"comments":[]},{"body":"bruh the mods of this subreddit are on crack dude\n\ncan't post memes like this without getting them taken down","score":1,"comments":[]},{"body":"u/savevideo","score":1,"comments":[{"body":"###[View link](https://redditsave.com/r/playrust/comments/z09252/lol/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&amp;#32;|&amp;#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Feedback for savevideo)&amp;#32;|&amp;#32;[**Donate**](https://ko-fi.com/getvideo) &amp;#32;|&amp;#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Content removal request for savevideo&amp;message=https://np.reddit.com//r/playrust/comments/z09252/lol/) &amp;#32;|&amp;#32; \n [^(reddit video downloader)](https://redditsave.com) &amp;#32;|&amp;#32; [^(download video tiktok)](https://taksave.com)","score":1,"comments":[]}]},{"body":"[deleted]","score":-5,"comments":[{"body":"Bro get off my line with that hating shit","score":3,"comments":[{"body":"idk even know what he said but bro was hating fr\n\ndeleted his shit n everything","score":3,"comments":[{"body":"I don't know even know either dog. He left real quick","score":2,"comments":[{"body":"Bro couldnt handle the heat","score":1,"comments":[]}]}]}]}]}]},{"title":"Rust is a horror game","not_safe_for_work":false,"locked":false,"body":"","score":127,"comments":[{"body":"Need to end up in the carriage in Skyrim. 6/10 missed opportunity haha","score":25,"comments":[{"body":"Honestly though","score":3,"comments":[]}]},{"body":"are you actually blind?","score":3,"comments":[]},{"body":"The lights didn't make you suspect the train?","score":7,"comments":[]},{"body":"[Bish it's art.](https://www.aci-iac.ca/art-books/alex-colville/key-works/horse-and-train/)\n\nPS this is the kind of thing we *absolutely have* to do on Hardcore.  Train tracks become the map lines.  Join us in the Hardcore.  Be Hardcore like us.  We all grub down here.","score":8,"comments":[]},{"body":"Then it comes to be that the soothing light at the end of your tunnel\n\nWas just a freight train coming your way","score":2,"comments":[]},{"body":"What did you expect?","score":2,"comments":[]},{"body":"You are an idiot but ok lets blame FP","score":3,"comments":[{"body":"Who blamed FP?","score":6,"comments":[]}]},{"body":"Why is there no light on the front of the train? Why just the sides?","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"Best torpedo kill of 2022","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Your poor mouse.","score":1,"comments":[{"body":"G502 can take it lol","score":1,"comments":[]}]}]},{"title":"Notable commits by Alistair today. Cargo and Oil less frequent, less labs","not_safe_for_work":false,"locked":false,"body":"Increased Oilrigs reset timers\n\nCargoship events less frequent\n\nReduced underwater labs to 1 from 3\n\nHot Air Balloon storage increase 12 -&gt; 18\nBoat storage increase 12 -&gt; 18\nRHIB storage increase 30 -&gt; 36\nSubmarine storage increase 12 -&gt; 18","score":13,"comments":[{"body":"finally. Was saying for months that water is just to strong at this point. No point to build inland if all the high tier monuments are on the water. Hope this changes actually makes a change how inland is populated.","score":12,"comments":[{"body":"all its gunna do is make oil more contested","score":8,"comments":[{"body":"good. Nothing is more boring than having a oilrig thats not contested. Same with cargo.","score":10,"comments":[{"body":"yeah 100% agree, that 15min wait sucks when youre just staring at the ocean.","score":6,"comments":[]}]},{"body":"good, i get 0 counters on servers with 100 distinct groups","score":2,"comments":[{"body":"Any time I try to do oil I get counter wtf","score":1,"comments":[]}]},{"body":"I mean it respawns less so there will just be less loot in general idk how that makes it 100% more contested","score":1,"comments":[{"body":"because if someone is an oil grinder (which most are) than all they know and are comfortable with is oil. which means thats still all theyre gunna do. youll just have to wait longer, when you lose, to try again. which means more people will be waiting to do oil and showing up when its up.","score":1,"comments":[]}]}]}]},{"body":"Probably making room for that new monument","score":1,"comments":[]},{"body":"Lol i feel like he's been sitting on these commits locally forever and finally just getting around to rebasing and merging them.\n\nI know the feels.","score":1,"comments":[]}]},{"title":"Rate my fit","not_safe_for_work":false,"locked":false,"body":"","score":116,"comments":[{"body":"Hard out there for bald gingers","score":20,"comments":[{"body":"Yes","score":2,"comments":[]}]},{"body":"A solid 7.6","score":8,"comments":[]},{"body":"Frog boots + wet suit is my standard go to","score":9,"comments":[]},{"body":"scooba steve","score":7,"comments":[]},{"body":"Kinda sexy ngl","score":3,"comments":[]},{"body":"Does that beard glow in the dark though?","score":3,"comments":[{"body":"It glows during the day","score":4,"comments":[]}]},{"body":"Strapping","score":2,"comments":[]},{"body":"Would bang","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Rust game decor","not_safe_for_work":false,"locked":false,"body":"Me and the wife are putting together stuff for a gaming room. I was curious if anyone has a place they have got some cool Rust themed stuff for their gaming rooms. Really would like to find maybe some led doors or something to that affect. Thanks.","score":0,"comments":[{"body":"if you have a 3D printer you can probably find a lot of cool models [here](https://www.thingiverse.com/search?q=rust&amp;page=1&amp;type=things&amp;sort=relevant)","score":2,"comments":[]},{"body":"YouTooz had a limited edition run of a Scientist, a Naked (Blurred box over the goods), and a few streamers. They are sold out now, but if you go to their website, there is an official resale site attached to the products pages if you just search for Rust. Some people may be selling theirs.","score":1,"comments":[]},{"body":"Rust gaming chair seems pretty cool.","score":1,"comments":[]},{"body":"Paint the back of the door like your favorite wood door skin, start a campfire in the middle of the room to burn your wood 2x2 down\n\n\nI'm sure it wouldn't be hard to commission someone on Etsy to make you a rug like the default one from Rust.","score":1,"comments":[]}]},{"title":"QoL idea.","not_safe_for_work":false,"locked":false,"body":"Remove that section on top of double doors. You know when you open them but that 2 feet up top is just solid.","score":2,"comments":[{"body":"Would make them viable to use in jump ups without having to take the door off every time.","score":4,"comments":[{"body":"I mean but thats what garage doors are for.","score":1,"comments":[{"body":"Yes and if you imrpove double doors they can be for that too.","score":1,"comments":[]}]}]},{"body":"Yeah, we're like 100+ double door skins deep. Not happening lol.","score":5,"comments":[]},{"body":"This is more than 'QoL' as this removes a progression barrier. And we don't want even faster progression, do we?","score":1,"comments":[]}]},{"title":"F","not_safe_for_work":false,"locked":false,"body":"&amp;#x200B;\n\n[I guess my solo hqm quarry days are gone, time for Zerglings to take over. :\\(](https://preview.redd.it/ea4n4prmdg1a1.png?width=745&amp;format=png&amp;auto=webp&amp;s=8b0b9a1fea7dbbbf9dac43ff9fe3b0377ac72ba0)","score":0,"comments":[{"body":"Not an F. Gives another great use for diesel! Run dome/junkyard for an easy diesel supply","score":1,"comments":[]},{"body":"Will zergs wall in the quarries and protect the roads to them with turrets? Most likely. Will solos be able to compound bow out the turrets and steal an inventory of quarry loot after the zerg ran it over night? Most likely.","score":1,"comments":[]}]},{"title":"How Do I Get Cool Skins?","not_safe_for_work":false,"locked":false,"body":"Hello fellow...Rusters? I dunno\n\nI've noticed that many people that kill me tend to have some pretty cool skins, and my question is how do I acquire these?\n\nI've looked in the Rust store and there's about 5 things to purchase, the Steam workshop offers no options either (I'm fully aware that I may be being dumb on both counts) and now I'm stuck.\n\nWhat's the best approach here?","score":1,"comments":[{"body":"There are frequent Drops on Twitch that tend to give nice skins. Thoses are the ones I know about.. sorry to not be able to help more.","score":3,"comments":[{"body":"I didn't know about that, so a great help.\n\nCheers mate.","score":5,"comments":[{"body":"Another trick is you can Google rust labs skins and you can see every skin in the game then you just search for it on the marketplace :)","score":1,"comments":[]},{"body":"I got some nice gun and garage door skins from spanish streamers, they prolly aint worth much but style beats price ahaha\nHappy Rusting ✌️","score":1,"comments":[]}]}]},{"body":"Go to the steam marketplace and filter by rust","score":3,"comments":[{"body":"Ah! Steam marketplace! I didn't even know this was a thing. Thanks very much, you have a great night.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Then can filter by single items like large wooden box or metal face mask, etc","score":2,"comments":[]}]},{"body":"Rustlabs.com","score":4,"comments":[]},{"body":"Go to Rustlabs.com to browse skins then when you know what you want, go to steam marketplace to purchase the skin then it’s automatically added to your library. You can craft items directly to your new skin or use the paint can to apply skins to items that are already crafted.","score":1,"comments":[]},{"body":"Steam market or third party sites.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Finishing some stuff for DreamHackWinter to give away. Not sure of the interest but I'm looking for at least a couple of simple challenges to get one. Would be fun if they were related to Rust and Aliens.","not_safe_for_work":false,"locked":false,"body":"","score":170,"comments":[{"body":"You could do a “naked” challenge. May see some weenies and boobies though.","score":9,"comments":[{"body":"LoL I thought that this  might be a bad idea just as I pressed post... 😅","score":4,"comments":[]}]},{"body":"I love that Water Catcher","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Look lush man , people like you make the game even more alive ¡","score":3,"comments":[{"body":"Thanks :)","score":2,"comments":[]}]},{"body":"Since you've got a 3D printer, my suggestion is that you 3D print a functional bandit town roulette wheel (probably need a metal rod), preferably set up next to a garbage can - so that those who wish to play can throw some trash (scrap) into the aforementioned garbage can have a spin on the wheel, if the punter lands on 20, they win.\n\nReally nice work btw, love the cloth/tarp on the water catcher.","score":2,"comments":[]},{"body":"Oh man that turret if hollow I could wire up a lazer and motor for it to make it realistic looking.","score":3,"comments":[]},{"body":"Whats that thing on the left that looks like a fossilized spider","score":2,"comments":[{"body":"Hehe that's a Facehugger from Aliens. 😀","score":5,"comments":[{"body":"for that size its the perfect nuttsack grabber 😵","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"I struggle to see other players in fights, is there a setting I need to turn up to make people more visible or am I just blind?","not_safe_for_work":false,"locked":false,"body":"&amp;#x200B;\n\nhttps://preview.redd.it/kg757e0bwc1a1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=b8cd76af8665a01a9ee52b19522d65a782cd59b1\n\nhttps://preview.redd.it/zq314j9awc1a1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=2b13ce097b645c2d3893dc0656a2c7d96c9b19ec","score":0,"comments":[{"body":"Do you struggle to see the NPCs in the pictures? Try increasing the brightness on your monitor. If you do struggle to see the NPCs then you may very well have poor vision.","score":2,"comments":[{"body":"I'm near sighted so I guess maybe it might have something to do with that. I always struggled to see people in games like DayZ, Tarkov, etc anything with dark areas especially.","score":2,"comments":[]}]},{"body":"Something that might help is to bind your fov to 2 diff hotkeys (i do it on my mouse) that goes between like 90 &amp; 120 i think it was. I can’t remember the f1 binding for this but it is googlable.\n\nThis along with a dpi shift on the thumb mouse button help me a lot with visual issues","score":1,"comments":[]},{"body":"Play a high pop 10x and learn awareness especially alt looking! My team mates call out esp as a joke but all i do on rust is roam","score":1,"comments":[]},{"body":"graphics.itemskins false\n\nType that in console and you can't see (camo) skins anymore but everyone else can still see your skins. Do it before loading into the server tho or suicide, respawn on the beaches and then spawn back into your base since skins need to be reloaded.","score":1,"comments":[{"body":"Do I have to type this before every server load, or just once","score":1,"comments":[{"body":"It does not save the setting, so unfortunately yes. But it's worth it. Ever since I use it my awareness has been superb.","score":1,"comments":[]}]}]}]},{"title":"Can’t get water to third floor…","not_safe_for_work":false,"locked":false,"body":"I have three water pumps and a switch pump every level, but can’t get water on my third floor crops, even though I get just as wet under the third’s sprinklers as the first two floors. Any suggestions; is it bugged?","score":0,"comments":[{"body":"Hand water your crops first then the sprinkler takes it from there.","score":2,"comments":[]},{"body":"If you're pulling salt water, make sure you have your desalinization unit connected too.  I made that mistake and the switch fluid pumps were acting really weird when I was trying to pump salt water to things expecting fresh water.","score":1,"comments":[]}]},{"title":"Title","not_safe_for_work":false,"locked":false,"body":"","score":1566,"comments":[{"body":"wait wtf, it's like an underdeveloped voldemort","score":171,"comments":[]},{"body":"😭😭 there ain’t no fucking way that’s what their graphics look like 😭😭","score":135,"comments":[{"body":"It’s really shit but not as bad as this pic","score":75,"comments":[{"body":"This used to happen all the time the surface of the character models just got really stretched. Trust me I've played way to much console since closed beta.","score":8,"comments":[]}]},{"body":"It's better, it just hasn't rendered yet.","score":28,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"hide yo brindas, sexy voldemort is in the town","score":47,"comments":[{"body":"Yea, bitch.","score":3,"comments":[]}]},{"body":"Wait fr","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Its like the Xmen movie when the guy turns into water","score":6,"comments":[]},{"body":"I play console and I’m pretty sure it’s just unloaded, cuz my game never looks like this lmao, this man is playing on an Xbox 360 lol","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"R6 or Rust?","not_safe_for_work":false,"locked":false,"body":"Hello all!\n\nI'm getting a PC for Christmas (if interested it has a GeForce RTX 3050 with AMD Ryzen 5 processor) and was wondering if my first game for PC should be R6 or Rust? I've played both on console and I find both fun but was wondering mainly which one is more friendly towards a starting PC FPS player. I've played games on kb&amp;m before so I'm familiar with finger placement but just wanted some other inputs. Thank you and all opinions are appreciated!\n\n(Note that I do understand this is a rust community so there will be a little bias.)","score":0,"comments":[{"body":"Your on a rust Reddit come on lol","score":3,"comments":[{"body":"I understand, that's why I put the note on the bottom. I also posted the same thing in r/R6","score":1,"comments":[]}]},{"body":"If your going to do anything for rust invest in ram. 16 is fine but I'd recommend 32. I got lucky and found a great deal so I'm running 64gb and the game runs like butter. Only stuttering I'll have is if it's the server. 9700k , 64gb ram 2070 super o/c . 60fps average on 1440p .","score":1,"comments":[{"body":"Do you think my stuff will affect my performance? I also bought a 1080p, 144hz monitor to accompany my pc so do you think I'll run high or low frames assuming I'm playing med-high Rust graphics settings?","score":2,"comments":[{"body":"Youll be fine, default settings rust is pretty good for play and later you can adjust the settings to your playstyle as you go.","score":2,"comments":[{"body":"Agreed +1","score":1,"comments":[]}]}]}]},{"body":"I am a champ on xbox r6 and I also play PC r6. That being said I think youll have much more fun for your dollar buying rust instead of r6.","score":1,"comments":[]},{"body":"Rust or GTFO","score":1,"comments":[]},{"body":"Anything that’s not Rust haha. Looks cool on the outside but will honestly piss you off instead. Find a different game you’ll more likely enjoy","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"You'll be miserable playing either.","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Can we make main monuments more better?","not_safe_for_work":false,"locked":false,"body":"Oil rig was nice because of it's convenience and the fact that nobody can build roof camp towers right outside of the monument, but if you're going to nerf Cargo/Oil then you need to make mainland monuments better. Fix Chinook crates and keycards/fuses grids away from each other. \n\nI say make some kind of radiation fog stretch out grids from let's say Water Treatment and is only like above 2 walls high and stretches above infinitely to rid of towers 1000ft tall. The radiation is strong that you only need a hazmat suit however it chews away the hazmat suits health at the rate of holding a compound bow this way you can be protected and fly by but can't hold high up in a tower for long and your vision is obstructed by a radiation fog.\n\nor we can forget about the fog/damage to a hazmat but if you're high in a tower near water treatment you get the radiation vision to make it hard to see. or maybe it fogs up the scope. \n\nthere's so many ways to deter roofcampers in a easy manner. this might sound horrible but it's really not. you can still build bases outside of the treatment plant but you can't build a 20ft tall tower looking over the whole fucking thing. \n\napply this to launch, powerplant and there won't be any tall bases within render of the monuments but still there will be bases. \n\nBut these places need more love and touch ups, also add a woodlands military base that spawns a quad bike.","score":0,"comments":[{"body":"They already massively extended the no-build zones around monuments so roof camping is less of an issue.\n\nNobody remembers this though because everyone has been on oil rig for the past 3 years.","score":3,"comments":[{"body":"You can build practically in the sewer branch on most servers - Source: I've done this","score":2,"comments":[{"body":"yeah, I'm sure a few of them could use a bit more attention.   \nI feel like sewer branch should just connect to a handful of cave exits around the perimeter. Most of the monument is underground, so roof camping shouldn't be a massive problem.  \nA lot of the other monuments have so much cover that roof camping, while still a very powerful supportive tool, isn't as grossly overpowered as it used to be for just making a monument unlivable.\n\nI always think about air field, which they went to pretty significant lengths to make roof camping not as egregious. It used to have a wall that was short enough to jump over and you could literally build 4 foundations outside of. My trio would just build behind the hanger with the oil barrels and run a couple quarries all wipe right there lol.","score":1,"comments":[]}]},{"body":"every oxums or supermarket has a dildotower next to it","score":2,"comments":[{"body":"Sorry. I meant like, the actual big rad towns that basically nobody runs anymore because offshore monuments have been busted.\n\nIf they remove grinder and / or mili crates from gas station and spermket then we'd probably see fewer 8+ player groups \"dominating\" T1 monuments.","score":1,"comments":[{"body":"well imo oxums and supermarket are really important too. Its basically a free recycler if you have a tower there kinda like outpost for your gang","score":1,"comments":[{"body":"yeah and that's kinda the problem lol.","score":1,"comments":[]}]}]},{"body":"I feel like there need to be like underground escapes or entrances that lead up into the oxums bathroom or backroom same with supermarket, not sure where it'll go but this can give people a chance to fucking actually loot it without one guy claiming a whole small supermarket to himself.","score":1,"comments":[]}]},{"body":"maybe it's just the servers I play on (because now vanilla community servers ARE slightly modded) but you can build so close to them. It might just be the servers I play on, but if what you're saying is the case then that's awesome and then this post can be ignored.","score":1,"comments":[]}]},{"body":"IMO, remove key cards as the main draw of going to a monument and replace it with some kind of AI boss.  Sure it's a step away from realism, maybe.   For for access T3 loot, I'd rather have a battle, chance of death, chance of counters, etc rather than just running cards.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Rust keeps randomly crashing","not_safe_for_work":false,"locked":false,"body":"For some reason my rust keeps crashing with no sign of it coming, no freezing, no frame drops, no lag, nothing. Then the game just closes. My GPU hovers around 80%\\~ usage and my CPU around 35%-45%. I keep an eye on the temps and nothing too high, with the most i see 85C but both hover around 70-75. tried verifying integrity, re-installing, even windows wipe. This also happens consistently with 7 days to die, if that info helps at all.\n\nAny input is appreciated, thanks.","score":13,"comments":[{"body":"My game keeps crashing after November update. I play on a Legion 5 laptop.","score":4,"comments":[]},{"body":"Crashed more in the past 3 days than I've done for the past year, good game.","score":3,"comments":[]},{"body":"Check how much memory rust is using before a crash. This game is prone to memory leaks.","score":2,"comments":[{"body":"What is the solution if that is happening?","score":1,"comments":[{"body":"I couldn't tell ya. It probably depends on the rig as well. My computer is getting up there in age.","score":1,"comments":[]}]},{"body":"nah, they mess up something  in the nov patch. this wasnt happening before that, not crash way too often and to way too many people to be pc related.\n\ni keep seeing players complaining about crashed on general chat.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Same","score":2,"comments":[]},{"body":"its been happening alot lately since the last patch, i hope they do something about it.\n\nmy friend keeps crashng out of nowhere too.","score":2,"comments":[]},{"body":"Friend and I have the same problem :( I'm on an rtx3080 and she's on a radeon 5700","score":1,"comments":[]},{"body":"Yeah same here ffs. Happened 4 times today.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Can this be fixed already please? Sincerely, people with OCD.","not_safe_for_work":false,"locked":false,"body":"","score":39,"comments":[{"body":"Tbh I would marry facepunch if they added a sort box button.","score":10,"comments":[{"body":"So I could find my 200 missing hqm and 7 rockets.","score":2,"comments":[]},{"body":"The modded server I play on has sort, loot all and deposit by category (food, comps, etc) buttons.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I think we should keep it purely to inconvenience you","score":14,"comments":[{"body":"i respect that","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"what exactly?","score":9,"comments":[{"body":"The fact hover loot doesn't put it back on the first stack","score":8,"comments":[{"body":"maybe the first slot starts from the bottom like this\n\n&amp;#x200B;\n\n13 - 14 - 15 - 16 - 17 - 18\n\n7 - 8 - 9 - 10 - 11 - 12\n\n1 - 2 - 3 - 4 - 5 - 6","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"just stack your one cloth?","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Its intentional, rust fills the one with the least amount first","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Idea to make Cargo more difficult","not_safe_for_work":false,"locked":false,"body":"Have up to 4 skiffs with like 2-3 scientists with one on each side of the boat that will shoot approaching players. And have a SAM on top of the boat that forces players to fly in low and therefore in range of the skiffs.","score":0,"comments":[{"body":"Bro its already hard to counter a good duo on cargo, with this it would make it impossible","score":3,"comments":[{"body":"Hmm, what if the skiffs drive off once the crates start being unlocked?","score":0,"comments":[]}]},{"body":"And also add 2 Bradley Apcs on it!","score":5,"comments":[{"body":"Bradley on cargo would be hilarious","score":6,"comments":[]}]},{"body":"Cargo is miserable to counter unless you don’t care about blowing up your mini heli making a crash landing. \n\nThe issue with cargo has nothing to do with how easy/hard it is to do/counter. The issue with cargo is it spawns too frequently (already being addressed) and there is (imo) too much good loot.","score":2,"comments":[{"body":"Good loot wouldn't be a problem, if it was insanely difficult to do.\n\nI think the issue lies in the scientist AI. It's possible to chip their health away with primitive weapons until they die, because they won't gang up and rush you (as people with superior numbers/firepower would), but are very quick to duck into cover. They also don't utilise everything they should, like grenades or syringes (right now only some scientists heal themselves). If they could yeet grenades like they could before, it would be significantly more difficult to do high-end monuments like oil rig.","score":0,"comments":[]}]},{"body":"Add a boss to cargo, mech suit pirate!","score":1,"comments":[]},{"body":"Having a section of cargo on the bottom open that boats can drive into with ladders going into the underneath part of cargo could be a great way to make countering more prevalent and easier","score":1,"comments":[]},{"body":"They should change one set of current ladders on either side to lead in to the cargo hold and then add another set at the front on either side. Also make it possible to climb on to the ladder from the water. Holding the current ladders is a piss take.","score":1,"comments":[]},{"body":"the doors that aren’t used on cargo should be one way doors that send out more scientists every time a new crate spawns","score":0,"comments":[]}]},{"title":"Since we are talking about balancing. Lets discuss armor.","not_safe_for_work":false,"locked":false,"body":"I personally think they should look to buff road sign. Full metal is at %50, hazzy %30. Road sign should be %40 IMO. Thoughts???\n\nI would also keep wolf head and bandana at %35.","score":0,"comments":[{"body":"Do you mean coffee can helmet or road sign armor? There should be a new 40% helmet imo.  or allow bandana with coffee can, which would hit 40% and there'd be a tradeoff vs. chest or legs because of 7 equipment item limit\n\n&amp;#x200B;\n\nedit:\n\n&amp;#x200B;\n\ni'll add that since the recoil change greatly reduced TTK, aka kills are faster with a simpler pattern, it makes sense to either buff Armor or HP.  I don't dislike the new recoil, i do dislike dying nearly instantly.  It really reduces the desire for me to roam Full Metal, because in many many situations it seems to not make a difference.  If you really keep track of each encounter and think back \"Which fights today would have been different if i was in a hazzy or full metal\" the answer will be 0 most of the time.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Road helm for sure should be 40%","score":10,"comments":[]},{"body":"Roadsign chest armor is the same bullets to kill as full metal from almost any weapon within max dmg range. Coffe can could use a buff in the new slug meta tho.","score":5,"comments":[{"body":"See I did not know that. Good shit.","score":2,"comments":[]},{"body":"So is there a benefit to going full metal v roadsign chest?","score":1,"comments":[{"body":"The mask is 50% head protection over 35% of coffe can helmet. Makes the difference for many one-shot headshot kills.\n\nMetal chestplate is a waste of HQM for idiots.","score":1,"comments":[]},{"body":"Metal chest plate gives 5% extra protection over roadsign. Not worth the mats","score":1,"comments":[]}]}]},{"body":"Personally, I think the best change they could make is to make a T3 leg armor. That way we have a full set for each workbench. Metal chest isn’t even worth running most of the time so that needs a buff as well.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I've been thinking, military style armor that can't be crafted and isn't as strong as full metal but instead has other bonuses, like a vest that increases inventory, or boots that make you run faster, kind of like a full version of the tac gloves","score":4,"comments":[]},{"body":"Are you just talking about coffee can helmet? Because full roadsign is 50% to the torso. Full metal is 55%.","score":1,"comments":[]}]},{"title":"Does memio script his videos?","not_safe_for_work":false,"locked":false,"body":"I swear I've had this hunch that his videos are scripted. He had decent content about 2 years ago but now he is too lucky in his videos. Any idea?","score":0,"comments":[{"body":"My brother in Christ, if you think he is lucky we have very different definitions of luck - that man loses kits like no other","score":4,"comments":[{"body":"Still a real chad because he just goes at it and has fun.","score":1,"comments":[]}]},{"body":"Err...\n\nI mean...\n\nHe builds trap bases on fresh wipe modded servers... \n\nIt's really not hard to do, he's just entertaining.","score":3,"comments":[]},{"body":"I don’t watch Memeio anymore unless Stimpee is in his videos. I love Stimpee. Besides I see enough Memeio in Stimpee’s videos to get my fill lol\nBut that cRust video was good, not gonna lie.","score":2,"comments":[]},{"body":"This is a good meme","score":1,"comments":[]},{"body":"Man, I miss Memeio solo series.","score":1,"comments":[]}]},{"title":"I think facepunch should give people a discount for anger management classes every time you buy a copy of rust lmao","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"I think it would be hilarious if they put rage detection on the VOIP (easy enough to detect that someone's mic is clipping for seconds at a time) and started fucking with people's respawn timers, maybe playing calming elevator music.\n\nImagine all those Rust players just calmly cussing each other out, swallowing the rage deep down inside. \"Oh...you...rascal...you've done me again...\"","score":3,"comments":[{"body":"Fucking with respawn timers would be hilarious. Imagine every time You swear the timer goes up by 30 seconds. That would make me even more angry","score":2,"comments":[{"body":"It would birth a whole culture of polite insults","score":2,"comments":[{"body":"Rust would suddenly become a less toxic game which honestly doesn’t sound like a bad idea","score":1,"comments":[]}]}]},{"body":"&gt; (easy enough to detect that someone's mic is clipping for seconds at a time)\n\nLol \"easy enough\" my sides","score":1,"comments":[{"body":"I work in both sound and programming.\n\nI could easily tell if a mic is clipping (i.e. it has gone beyond the volume that the mic can handle) based on the waveform. Literally you can see it at a glance. Sustained samples of 0dB. Squared off waveform. A burst of clipping (or even just higher volume compared to their average dB level) would indicate a shout. No AI bullshit necessary.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"today is taco tuesday not shit post sunday","score":1,"comments":[{"body":"Hilarious.","score":1,"comments":[]},{"body":"It’s not Tuesday tho","score":1,"comments":[{"body":"He lives in australia","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"title":"What was the best Wipe you ever had?","not_safe_for_work":false,"locked":false,"body":"I just had mine, boxes full of guns, giant base, etc. What was the best Wipe you ever had and what happened to make it that way?","score":5,"comments":[{"body":"Lockdown 2020. The boys were all single, furloughed and had nothing else to do. \n\nMy whole life was dedicated to the wipe with nothing else to do.  I was lucky enough to not worry about my health or my family, fortunate enough to be furloughed and financially stable. Recently single and looking for a distraction. \n\nWe were fucking clueless, lost more than we won, made so many stupid mistakes and learned so many lessons. Lockdown sucked for lots of people, but for me it was a chance to live on rust with my mates and not have a care in the world, and I'll cherish that forever.","score":16,"comments":[{"body":"Didn't have a wipe that I can the best but yeah, what the fuck happened, people started having kids, getting married, and I just wanna game, none of my friends play anymore, some do, rarely, we still play some other games from time to time, but it's less and less gaming every year, guess I'm just stuck in time.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"We joined Rustafied Medium II as a duo. I went and bought a custom and some nades. We heard a big fight right outside bandit camp and killed two full metal ak guys with a nade and that custom. Run all the way to the other side of the map to launch, killed a guy full of sulfur and like 3 others. We didn't even had a base and already a row of guns. We build our base right next to launch. Bagged a irl friend in and continued countering brad 3 times. We got raided by 3 different grps like 7times in 3h and won all these raids in a shitty ass base we had to build mid raid. In the last attempt, one grp had to bag in a cheater and could not fucking win that raid. Felt good. Also invited some random ass solo that tried to grub us once and we play sometimes with him to this day.  \n\n\nThe wipe ended of us having a box of guns and full metal gearsets. Was the craziest day of rust i ever expirienced.  \n\n\nVideo of the snowball: [https://www.youtube.com/watch?v=1FALRJw4EH4](https://www.youtube.com/watch?v=1FALRJw4EH4)  \n\n\nvideo of our loot at the end of the day: https://www.youtube.com/watch?v=7ZsfqM\\_a1BI","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I had a pretty good wipe this morning. Only took 2 wipes and it was clear.","score":5,"comments":[{"body":"They really are the best wipes.","score":2,"comments":[]}]},{"body":"christmas wipe. it was full of love, happiness, gift-giving, sign-painting and typical rust toxicity &lt;3","score":3,"comments":[]},{"body":"I'm pretty numb to the idea of boxes full of guns as a metric for success. Loot comes easy enough.\n\nOne of my favorite wipes involved getting raided like 8 times in the first two days of wipe. We just lived on a big hill with clans on either side. We killed their farmers, used the resources to make base stronger, and immediately got raided. Over and over and over again. But we always managed to retake the base with minimum effort, even if we lost the loot lol. Our base stood atop that mountain in defiance of all the massive clans that kept trying to get rid of us, and we kept going out with revos to hunt their farmers.","score":2,"comments":[]},{"body":"2nd wipe I ever played, I managed to grab the most amazing base location and build an incredibly secure base despite being a total noob and terrible builder. That base was my BABY. I kept it the whole wipe. I have been chasing that feeling ever since but haven’t been able to find a spot/make a base that was that cool since then.","score":1,"comments":[{"body":"What kind of base was that?","score":2,"comments":[{"body":"It wasn’t any type of designed base; I managed to build in one of those rock formations and accidentally made my base really difficult to raid bc of where the rocks+honeycomb happened to land. The location (middle of a rock formation) also kinda camouflaged the base so even though it was a high traffic area, it wasn’t super noticeable. It was not intentional at all, and unfortunately I haven’t been able to replicate it or anything like it.","score":2,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"HUGE suggestion regarding improving rust and its gameplay *please hear me out*","not_safe_for_work":false,"locked":false,"body":"add sex to rust","score":0,"comments":[{"body":"and breeding.","score":2,"comments":[]},{"body":"You already get fucked 24/7 by groups of 5 or more men. No need to have more sex.","score":2,"comments":[]},{"body":"Happy cakeday….","score":1,"comments":[]},{"body":"Garry would love your recomendation","score":1,"comments":[]},{"body":"I still think the best suggestion was the one where the character's dick size was inversely proportional to the team size.","score":1,"comments":[]}]},{"title":"I just got the game and I have a few questions!","not_safe_for_work":false,"locked":false,"body":"So my friends and I want to play on a private server and none of us have played before, so I've got a few questions if anyone is willing to answer 😄\n\nIs this guide still accurate for creating a custom server? https://www.thegamer.com/rust-start-owner-server/\n\nIs there a way to edit server/game rules?\n\nAnd what would you recommend for world size for a group of 5-6 people?","score":0,"comments":[{"body":"You’re taking all the fun out of the game by creating a private server and only playing with 4 or 5 friends. Was the idea to play against each other? If so you’ll want a pretty small map. The best parts of the game are interactions with other players. You guys should form a team on Rust For Noobs and learn to play that way. Watch JFarr’s YouTube channel to learn the basics if you get stumped on anything. RFN is a relatively low pop server so it’s a great place for people that are new to the game.","score":3,"comments":[{"body":"We don't really know anything about the game but we've been told that public servers are toxic and we don't want to play PvP so we thought we would just create a server instead","score":1,"comments":[{"body":"You guys could play on a PVE server","score":5,"comments":[{"body":"Is this game impossible to play as a survival/crafting co-op game with just friends?\n\nEdit: what I mean is, again, we don't really know much about the game other than the basics. Is it just *better* to play on a public server or is it legitimately just an empty map because the game is meant to be played with many people?","score":2,"comments":[{"body":"There is pretty limited PVE content. You could still have fun making creative base designs and things like that but you will find the survival aspect of the game extremely easy without PvP. There are some NPCs at monuments around the map but the AI is pretty awful and most of the fun in completing monuments comes from running into other players at them.","score":3,"comments":[{"body":"Ok that makes sense, we will probably head into a pvp server once we get a feel for the game. Thanks for your help :)","score":1,"comments":[]}]},{"body":"Sounds like you guys would prefer a PVE at least until you get comfortable with the game and want to try PVP. I play on a modded PVE server and feel free to join to learn the ropes and everyone is more than happy to answer questions alot of the players used to PVP.","score":1,"comments":[]}]}]},{"body":"Oh man you'd be missing out on the whole essence of the game. Without the fear and tactical thinking that comes from the PvP element the game is really quite a thin experience.\n\nI.e. you're a solo, you build a 2x1 base near the fishing village for a bit of fishing and you like taking a scuba suit out to collect scrap. Without the PvP element this is a fairly boring grind. With the PvP element...you're stealing a guy's boat while he's diving...you're swimming underwater with an inventory full of loot to avoid the gaze of a mega base that's trying to control traffic in and out of a natural harbor...you're moving at night with an inventory full of scrap to avoid the players shooting at each other just 50m away...it's so tense and fun.\n\nYou just need to let go of the idea that dying/losing a fight is some kind of disaster. It's fine. You're going to lose fights, you're going to get shot in the back, you're going to lose loot. But the game respawns the loot constantly. You just mitigate your losses by only taking a minimum amount of 'expensive' gear out of your front door each time, just enough for the next task. But then of course if you take that better gun or armor with you, you have more chance of winning your next fight and taking the other guy's stuff...while risking losing it all to a guy with a bow in a bush. So it's all about judging risk/reward.\n\nYou've probably heard that raiding is some big deal but if you lose your base overnight you just start again, test a new design. And that's if you're just a passive player trying to avoid trouble. You can craft yourself an inventory of explosives and go looking for trouble if you like.\n\nYou can also just mute the chat and other players' VOIP if you like. Again, I think you'd be missing out on a lot of funny interactions and potential trades/alliances but you can play with those blinkers on if you want.\n\nWhat I would suggest though is that you play on a server that has team size limits. Like a trio server. They are better in terms of player experience (for the average, non-clan player) and performance, because clans tend to build these huge bases that consume every resource around them and shittify the FPS for anyone within a half mile. (Oh wait, just saw you said 5-6 people. Forget that then. Play medium/main together.)\n\nIf you want to develop a thick skin, play on one of the 'main' servers and take the pain for a while. You might have a hard time even getting to a tier 2 workbench though...but you'll come out a better player for it.\n\nI would also add that the goofy-ass animations of other players sneaking are worth all the trouble they cause","score":1,"comments":[]}]}]}]},{"title":"While you are at it with the nerfs FP. Please take guns out the tech tree.","not_safe_for_work":false,"locked":false,"body":"Guns in the tech tree are way too OP. please get them out of there  Thanks!","score":0,"comments":[{"body":"Ahhh no, we can't have solos progress at a decent rate. They HAVE to contest Oil Rig or Launch Site with all the zergs. How dare they have a way of getting guns that doesn't involve fighting over one of the 5 monuments that spawn Elite crates.","score":4,"comments":[{"body":"There’s plenty of well populated servers with a lower group cap for those who prefer a more equal footing, including solo only servers. Not only that, but with outpost and bandit, even running the road can provide enough scrap to reach Tommy within a few hours max.","score":0,"comments":[{"body":"There are also plenty of zerg only servers like vital. Why do we have to force solos out of vanilla into modded servers and not zergs?","score":1,"comments":[{"body":"They’re not being forced out of anything. Having more people group together increases the chances of flourishing simply by virtue of numbers alone, you can’t code a solution for simply having more people. You have all the tools available to select what size group you’d like to fight against, from solos to zergs, and there’s absolutely nothing stopping you from joining one of them too.","score":-1,"comments":[]}]}]},{"body":"We used to have a decent pvp system that allowed solos to easily get weapons and progress but bots prefer rng. If you're actually tech treeing weapons as a solo on vanilla, why not just get paid for work.","score":0,"comments":[]},{"body":"it is making it way easier for large groups to get guns more importantly.","score":0,"comments":[{"body":"It has always been easy for zergs to get guns. Even with bows an 8 man will wreck the solo with tommy.","score":1,"comments":[{"body":"It was not actually. The solo would not have a gun back in the day.","score":0,"comments":[]}]}]}]},{"body":"While I agree that tech tree is *almost* essential for a solo to have decent progression, especially on wipe day, I feel like we are resting on our laurels a bit here.\n\nAlmost every monument in the game spawns military crates. That was how you had to get a gun a couple of years ago, or make a play for your first gun. It was so much more exciting when you open that crate and get a python, or eoka/comp bow that hazmat who decided to W key you through a bush. Now, you can hit barrels for 2 hours and get a thompson/SAR. just caters to a very boring meta that we are currently experiencing.\n\nThe only guns I could see being on tech tree that would benefit a solo would be those tier 3 guns that would be tough to obtain unless you are a fearless solo who contests tier 3 monuments constantly.\n\nI think removing guns from tech tree would be putting a tiny bandaid on a very large cut that is currently the progression system and player behaviour in Rust.","score":1,"comments":[]}]},{"title":"The amount of Russian \"servers\" leading to the same garbage server just to clog up the server browser is getting way out of hand.","not_safe_for_work":false,"locked":false,"body":"Scrolling through the modded section is like trying to sort through 90% clickbait servers, 9% servers impersonating other servers and 1% actual good servers. What an absolute shitshow, how are new players meant to start playing the game when they either join an official FP server and get dumped on by blatant cheaters, or join a 50x with so many mods you won't even recognize the base game?\n\nIt's genuinely sad to see how rampant this shit is.","score":84,"comments":[{"body":"Region bans I say let them try vpns and play with 1500 ping I'm so tired of them on every official server, kinda mean I know but it is what it is","score":19,"comments":[{"body":"It’s kinda shitty but whatever. This is the only game where each Russian I come into contact with is somehow cracked as shit, and Russia barely has enough money to even pay people a decent salary so I know 100% there’s not hundreds of ruskies running top tier pcs wrecking shit on 1000 ping on US servers. Shits impossible. They’re all scripters. There’s a reason they play on US servers and not RU. Because the RU servers are so packed with hackers even other hackers can’t get shit done.","score":14,"comments":[]},{"body":"I disagree because battlemetrics clearly broadcasts the true player number of these servers. So it is possible from a technical standpoint to just sort them out, Facepunch just doesnt do ot.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Russians should just be banned from playing on Servers. They are nr 1 on the list of which nation cheat the most in video games","score":5,"comments":[{"body":"They should be banned on playing faraway servers* only Russian servers or smth","score":1,"comments":[]}]},{"body":"What is a \"clickbait server\" I rarely play anymore, like can you just not play it?","score":1,"comments":[{"body":"If you played you would notice hundreds of servers with slightly different names, but they all funnel into a couple Russian servers. These ports are so rampant it’s hard to find legit servers, especially for a noob.","score":5,"comments":[{"body":"Ah ok, that's kinda lame, I stopped playing and took up a different mental illness, runescape that is","score":4,"comments":[{"body":"Haha god speed brother","score":2,"comments":[]}]}]}]},{"body":"A verified server category might be necessary","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"When you give a naked a base with electricity \"for the lights\". *heavy breathing*","not_safe_for_work":true,"locked":false,"body":"","score":796,"comments":[{"body":"Big brother is watching","score":158,"comments":[]},{"body":"NNN is getting more difficult","score":117,"comments":[]},{"body":"'Cuteboy'","score":63,"comments":[]},{"body":"This truly is a Rust moment","score":53,"comments":[]},{"body":"Sometimes you need to fatten the pig before the slaughter.","score":36,"comments":[]},{"body":"probe ahoy!","score":24,"comments":[]},{"body":"im going fail","score":23,"comments":[]},{"body":"I love this game","score":19,"comments":[]},{"body":"airbnb be like","score":19,"comments":[]},{"body":"Amazing","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Setting up a plant farm is currently extremely underpowered and a waste of time","not_safe_for_work":false,"locked":false,"body":"Making a plant farm with corn/potatoes/pumpkins etc is currently a waste of time since you can just kill one bear and you will have enough food for the entire wipe. Planting berries is somewhat ok since you can make teas, but after your base is completed the farm becomes useless. Sure you can sell the teas to others, but they sell extremely slow. I just wish there was some sort of plant that was worth growing the entire wipe, its currently not worth the effort to make a plant farm unless you're in a massive 9 floor zerg that needs the extra resource buff for upkeep.","score":0,"comments":[{"body":"Cannot disagree more. If your teas are selling slow, you’re either on a dead server, they’re overpriced, or drone can’t reach your shop. Cloth also flies “off the shelf” as well. Teas are insanely overpowered and worth growing all wipe.\n\nThe only change id like to see regarding growing food is the ability to clone food (pumpkins) in earlier growth stages - the same as you can for hemp/berries.","score":11,"comments":[]},{"body":"this guy leaves the base with 2 med sticks and 50hp every time, i guarantee.","score":8,"comments":[]},{"body":"You're completely wrong. I for one eat 5 pumpkins when I respawn to get to full stats/HP. You have an unlimited amount of cloth, teas, food etc which you can sell for hqm/crude etc. How does farm become useless once your base is finished? You'll need upkeep, metal to upgrade and sulfur to raid etc","score":6,"comments":[]},{"body":"&gt; kill one bear and you will have enough food for the entire wipe.\n\nThis guy doesn't play Rust a lot.","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"20 bear meat is enough food for like 2 roams bro.\n\nPumpkins heal you for 10 hp, If you don't have at least 10 on your hotbar you aren't fully kitted.  The only way you can afford to lose 10 pumpkins every time you die is if you are growing them, buying them off someone who is, or constantly harvesting rivers.\n\nIts a bit of a pain to get the clone but usually someone is selling it anyways.","score":5,"comments":[]},{"body":"Kinda depends.\n\nBerry farms are great for longer wipes or larger groups where having one dude focus on farming isn't gonna remove 1/3 of your roaming party.\n\nFood farms are great if you don't live near a river. Even as a trio, I'll just throw a couple planter boxes on my shooting floor or even just on the roof and throw potato seeds in it, grow one yield an IRL day for way more food than we'll ever need.\n\nSetting up a massive 9 floor tall grow operation is rarely worthwhile for sure. People mostly just scale up that large because every big group has at least one farming roleplayer who just wants to chill in discord with friends and play farmville.","score":2,"comments":[]},{"body":"50% teas make a big difference when your farming....\n\nhttps://files.facepunch.com/jakerich/1b2111b1/wNAdJwKyLXNVj1GN.png","score":2,"comments":[]},{"body":"Even as a solo I still make a farm and ball out in the resources it nets me :D","score":1,"comments":[]},{"body":"i roam with 1k cloth","score":1,"comments":[]},{"body":"Definitely not true,\n\nLiterally just ran a tea shop on Rustafied AU Main and sold 3k+ scrap worth of teas over 2-3 days.\n\nSold pure ore teas for roughly 99-150 scrap depending on how early the wipe was and it was bought relatively quickly, I would have sold 10+ ore teas a day.\n\nAlso if you make yourself a pure scrap tea, you can get 2.5k scrap in 1hr farming the ocean barrels. \n\nIt is somewhat high maintenance, so if you don't enjoy it, don't do it.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"why is every clan advertising literally like","not_safe_for_work":false,"locked":false,"body":"EPIC GAMING CLAN IS RECRUITING!!!!\n(you're so lucky we're even allowing the opportunity to apply)\nYOU MUST BE ON EVERY WIPE 10 HOURS A DAY MINIMUM! \n\nPVP|\n10k hours (NO EXCEPTIONS)\n400 m spray (375 AT WORST!!!)\n14+ \nGood comms\n\nMONUMENT TEAM|\n7K hours (MINOR LENIENCY)\n300 m spray!!! \n14+\nGame sense\n\nFARMER|\n2K hours (NO EXCEPTIONS) \n250 M SPRAY!\n14+\nMUST FOLLOW ORDERS\n\nI have like 850 hours and I constantly see these clans that have like ridiculous requirements for even the simplist shit like famer which is literally hitting rocks. Half the time it's run by a little kid who has awful comms and loses shit. Everyone just boasts about their UKN stats and threatens to 1v1 you. It is required that you sell your soul to the clan and as soon as you join there's infighting and the clan kicks a member. Or you get insided by one of a little kid member's friends. It's fucking painful. Sorry this was kind of a rant","score":86,"comments":[{"body":"just throwing it out there. theyre advertising because they need people, and those expectations are why they still need people.   \nmy group is 5-8 2k+ hour players who never once asked to join the group, they got invited cause they were solo and cool people first, really good players second. we dont need to advert for \"clan members\" because we organically formed our group of players who enjoy eachother no matter how bad or good were playing at any given time.","score":87,"comments":[{"body":"I’ve been looking for a group to play i have 3.5k hours 25+ years old","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Welcome to middle schoolers","score":45,"comments":[]},{"body":"Do you really want to play with absolute incels like that? People that addicted to rust are probably irrational individuals and I can almost guarantee you will not have fun having some squeaker barking orders at you.\n\n(10k hours is 5 years full time work … 5 years full time playing rust…)","score":35,"comments":[{"body":"How long is the game out for? I remember starting around 2015-1016 ish.","score":5,"comments":[{"body":"Almost 9 years\n\nhttps://rust.facepunch.com/news/community-update-248#RUSTSBIRTHDAY","score":7,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Because they have unrealistic goals for what a team mate should be and are losing numbers I guess","score":4,"comments":[]},{"body":"Clans, in my experience, are a bit of a shit show. Egos are the biggest problem. It seems to be a matter of who has the biggest dick. When really it's who is the biggest dick. I've tried a few clans. I am really excited about team play. But it's usually disorganized and toxic. I'm not saying all but from what I've heard from others and in my own experience. I think, imho, teams/clans that work well together have come together over time and have the same shared experiences and goals. I think it's also a matter of personalities. If they don't gel, then the team won't work. Careful and thoughtful team building is really the best way. Takes time.","score":4,"comments":[]},{"body":"Reminds me of my cringe recruitment ads for Starcraft when I was a young adult who no-lifed the game.","score":3,"comments":[]},{"body":"Those people are generally playing on competitive servers like vital and atlas. They're basically playing an entirely different game than normal rust.","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Does anyone know what gun the M39 is supposed to be?","not_safe_for_work":false,"locked":false,"body":"I’ve had no luck finding the answer and I thought if anyone would know it would be you guys","score":1,"comments":[{"body":"M39 Enhanced Marksman Rifle\n\nNot to be confused with\n\nMk 14 Enhanced Battle Rifle\n\n\nM39 is just mk14 Crack up to be use for longer range sniper support weapon for the Usmc, it got better barrel, variable stock, more rail, better bipod, probably more stuff but I'm not knowledgeable enough for that.","score":7,"comments":[{"body":"This is more than enough trivia brotha","score":0,"comments":[]}]},{"body":"emr, enhanced marksman rifle. It upgraded and modernised M14 Rifle.","score":2,"comments":[]},{"body":"Others have it right, but the thing looks very similar to a Hipoint Carbine as well.","score":1,"comments":[{"body":"Looks like a m14 lol not a sub2000 or hipoint carbine, which are more like really long barreled pistols as they both feed from magazines in the pistol grip like a pistol","score":1,"comments":[]},{"body":"No it does not","score":1,"comments":[]}]},{"body":"an m39","score":1,"comments":[]},{"body":"Looks like a m14 to me","score":0,"comments":[]}]},{"title":"What resolution do you play on?","not_safe_for_work":false,"locked":false,"body":"My default resolution is 2560x1440 but I've been experiencing a lot of fps drops on higher pop servers. I tried a lot of different settings to try to solve this issue so far the only thing that has worked is turning my resolution down to 1920x1080. Is this common on this game?\n\n3060ti gpu\n\nryzen 9 5900x\n\n32gb ram","score":0,"comments":[{"body":"wow its almost like rust is a pretty demanding game and you dont have a gpu that is good enough to run it smoothly at the desired resolution","score":2,"comments":[{"body":"Its almost a 10 year old game. Even the 4090 tested on rust drops to 30 fps when using maxed out resolution/settings.","score":1,"comments":[{"body":"homie may i know the source you got this data from","score":1,"comments":[{"body":"I dont think he understands how cpu heavy this game really is.","score":3,"comments":[{"body":"you have a point but this clearly isnt his case, he is simply gpu bottlenecked","score":1,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"On a 3060ti you won’t push massive fps on 1440p. In high pop servers due to them lagging with anything less than high end current gen stuff. Either use vsync/freesync to make stuttering less obvious and reduce tearing. You can just shove down the resolution but it will look blurry if your monitor is 1440p so I would not recommend. \n\nI am going to get a comment saying “BuT i GeT 100 fPs WiTh A GTX 970” and my response is no you don’t and shush.","score":1,"comments":[{"body":"Sadly even with vsync I drop to 20-30 fps in some areas at 1440p. You are right about the game being a bit blurry at 1080 but its the only setting ive found that keeps me above 60fps the whole time.","score":1,"comments":[{"body":"Yeah I would drop it if you can’t deal with that fps. Can you not drop your graphics settings? And if so, does it have much of an affect","score":1,"comments":[{"body":"It helps slightly but I still drop a lot of frames when the pop is high. Mostly at bandit camp and areas with a lot of bases.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"body":"I run 1440 by 1080 because the screen stretch used to be advantageous when you were running around walls and needed to instantly headshot someone. their heads are wider because of the  stretched res. I just keep using 1440 by 1080 because muscle memory. changing your res wont solve a lot of performance issues if that is what you are wondering though.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Why no water, water there plant no water?","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[{"body":"You gotta place 3 sprinklers centered above the 4 beds.  Like in a triangle configuration. 1 is not enough.","score":6,"comments":[{"body":"It work","score":10,"comments":[]},{"body":"Oh ok ty I’ll let u know if this works","score":4,"comments":[]}]},{"body":"It's a bug. Usually gets solved at server restart which is usually daily, or you can kick-start it by using a water jug.\n\nAlso; is it fresh or salt water? Salt water just drains it.","score":2,"comments":[]},{"body":"Just that planter box not get water?","score":1,"comments":[{"body":"Every plant from each box gets no water","score":1,"comments":[{"body":"Try putting water in the bucket and splashing it over the boxes. Do you have planter boxes on the roof or the floor below?\n\nAlso make sure it’s not salt water from the ocean","score":1,"comments":[{"body":"Just this floor, dumping works","score":1,"comments":[{"body":"I am not sure if this is true, didn't test it, seedlings and saplings use more water than mature plants. \n\nAlso, make sure your water income is bigger than your consumption, there are also various bugs, for an example, if my total water income is 12, I get more water in planters if I spread it through two sprinklers on 4 planters, rather than using only 1 sprinkler.\n\nTLDR: One sprinkler is not enough to cover 4 planters if your water supply is 12 (not sure of this is the exact number)","score":1,"comments":[]}]}]}]}]},{"body":"Make sure it’s not salt water lol","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"My mini copter is stuck in shallow water how can I get it back.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"a motor boat or submarine can push it back to shore if the angle is not too steep make sure to keep the mini repaired as ramming it does damage","score":3,"comments":[]},{"body":"Start pushing. Water floods them out, so you have to push them back up. It takes forever, but as long as it’s not deep enough to need scuba gear it’s possible.","score":1,"comments":[]},{"body":"Try to get on top of the mini and push it till you can fly it.","score":1,"comments":[]},{"body":"place a foundation from ocean side so that you can stand on it and start pushing mini out of water","score":1,"comments":[]}]},{"title":"5800x3d vs 13600k","not_safe_for_work":false,"locked":false,"body":"Hello, I am currently building a pc and I am wondering which processor would do better in rust. I am using rust to determine which processor to buy since I love the game so much.","score":0,"comments":[{"body":"It's very close performance wise for most games but for rust the 5800x3d would probably take the cake just because of all that 3d v cache it has.","score":9,"comments":[]},{"body":"I see over 200fps at times in rust with a 5800x3d and 3070 at 1440p","score":4,"comments":[]},{"body":"I went from a 5950x to a 12900k and saw a 30%++ increase in FPS in 4k (my main resolution) other components remained the same basically, and watched some rust benchmark content about how the 1% lows on AMD are just fucked. I'm team Intel for Rust specifically. Turn off e-cores.","score":1,"comments":[{"body":"Yeah, for Rust you gotta disable cores on the 5900x and 5950x since Rust only uses four cores to see better and more stable performance. I talked with a guy who had a 5950x and they manage to get a nice 20 fps boost and less frame drops after I helped them with their Ryzen Master tuning. Rust still prefers intel for performance even on their older models compared to Ryzen’s newer chips (except maybe the 5800x3d)","score":2,"comments":[{"body":"Damn Fam mind helping me out? I have a 5950x, 3090ti and frames between 80-120","score":2,"comments":[{"body":"When I get home, I’ll share the chat log, which he already gave me permission for. Was going to make a post about this a year and a month ago, but life got busy and I forgot about making it lol","score":2,"comments":[{"body":"hell yeah ty bro","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]}]},{"body":"Do not get the 5800x3d for rust. 13600k is wayyyy better\n\nthe 5800x3d has major problems with 1% lows  in rust","score":0,"comments":[{"body":"this 100%","score":0,"comments":[]}]},{"body":"Wait for ryzen 7000 series with  3d v cache , they are announcing release dates January.\nEdit: Should also wait to see 7000 x3d series benchmarks","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Rust keeps CTD after \"Loading Music Systems\" anyone know a fix for this?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Title's self explanatory, been trying to play rust for about a week now. Goes to the loading screen, and then seemingly right at the end, it instantly kicks me to the desktop with no error message. I've tried anything I can think of. If anyone's got any ideas or fixes I'd greatly appreciate it.","score":1,"comments":[]}]},{"title":"Need a server please","not_safe_for_work":false,"locked":false,"body":"I need a server that's chill and new player friendly. Like molded with instant craft and 3x crate spawn. Also low populous please. Can any help?","score":0,"comments":[{"body":"lol","score":3,"comments":[{"body":"I kinda suck at the game so I need practice","score":1,"comments":[]}]},{"body":"I’ve played paranoid.g 3x solo for awhile I got 400 hours alone on it. After the first 2-3 days it dies and has maybe 20 people","score":1,"comments":[{"body":"Sounds great thanks","score":1,"comments":[]}]},{"body":"Cannot remember the server name but I chill out on a PVE server with no raiding etc. has a monthly wipe so gives you plenty of time to build, only down side is the zombies but not that many.","score":1,"comments":[{"body":"That one's called the graveyard. I tried it but the zombies killed me quick","score":1,"comments":[]}]},{"body":"RustyRusty. New server, 5x, low pop and everyone is friendly!","score":1,"comments":[{"body":"Sounds cool thx","score":1,"comments":[]}]},{"body":"How low pop do you want? I have a private server you can play on if you want to just mess around and learn.","score":1,"comments":[{"body":"I want like under 10 so that would be amazing","score":1,"comments":[]}]}]},{"title":"I’m currently working on a full solution to rust recoil and what to know what you want to see.","not_safe_for_work":false,"locked":false,"body":"I currently have an idea and how to implement the idea which should satisfy everyone from the old chads to new role player.\n\nIs their anything you would like to see?\n\nI want to get as much feedback as this has been a month in the making and includes details like how the actual code implementations would work so I really don’t want the idea to flop.","score":0,"comments":[{"body":"Not to be pessimistic here but do you actually expect facepunch to start crowdsourcing their game/code?","score":5,"comments":[{"body":"Not at all, but if an idea makes enough noise within the community I like to think they would be willing to change/tweak. (No code has been written just sin equations as a proof of concept to show the recoil patterns could be described as a ratio to a sin wave. (Mainly to show it’s possible to do it in a un-resource intensive way)","score":-1,"comments":[{"body":"There would need to be server side / some form of randomness to get around scripters having an extreme advantage, for example a set of waves that are all slightly different for the same gun and picked at random. This would at the very least require a hacker to read memory.\n\nI think people will complain no matter what system is used though considering Rust has tried about 5 different systems since legacy iirc and each one complained about, personally I think the last one was the worst in all ways though.","score":1,"comments":[{"body":"Scripters can still script with 0 recoil. They just use hacks for recoil that don't get detected and have no aimcone either.","score":1,"comments":[{"body":"The problem with a set pattern was that you didn't even need to inject into a program and could do it all externally which is why there was such a hoo-ha a couple of years ago with on mouse profiles and FP straight up kicking you if you had a certain device.\n\nIf your point is people will still hack I don't disagree but it's a lot easier to detect with EA updates than a profile on a mouse, especially the more server side it is.","score":1,"comments":[{"body":"I believe it's client side and reads your memory which is where the recoil pattern is and it reads its it off that(i have no idea how any type of programming works or how things run but thats my understanding). It doesn't get detected at all if you do it right. My duo started cheating quite some time ago and is still not banned. He's got quite a few other people to start scripting too.\n\nHonestly from what I've seen, it gets detected even less. I only know of one person getting banned for it and he didn't remove something from his recycling bin so it got detected.","score":1,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"No","score":5,"comments":[]},{"body":"every 15 bullets fired will pulled up a Google captcha that you will have to 2fa with an email confirmation","score":1,"comments":[]},{"body":"you don't work for facepunch","score":0,"comments":[{"body":"Okay but it as a community we can make a better solution that satisfy everyone maybe someone at facepunch will care. Jeesh sorry to try and fix something people like you won’t stop crying about.","score":1,"comments":[]}]}]},{"title":"Best gun ever","not_safe_for_work":false,"locked":false,"body":"","score":903,"comments":[{"body":"That’s just the w a t e r p i p e","score":82,"comments":[]},{"body":"Take your upvote and go.","score":27,"comments":[]},{"body":"shit this is good","score":9,"comments":[]},{"body":"fuckin love these types of memes","score":5,"comments":[]},{"body":"This is top tier, well done op","score":4,"comments":[{"body":"Thank you, at least somebody appreciate my art","score":6,"comments":[{"body":"Oh no worries, I 100% down voted your comment at the bottom. Much love homie!!","score":3,"comments":[{"body":"Ahahahahahahaha","score":3,"comments":[]}]}]}]},{"body":"Agree with Danny here","score":5,"comments":[]},{"body":"Waterpeepo is the kind of girl to talk a big game and then leave the other guy with 10hp to kill you.  \n\n\nDebrah Barrel on the other hand is the girl who delivers, bringing another shot to make sure the twat you're aiming at actually goes down","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Rust using 30GB of RAM. 7950x / 4090","not_safe_for_work":false,"locked":false,"body":"","score":42,"comments":[{"body":"Rust will use whatever is available. Its a greedy program.","score":40,"comments":[{"body":"Tbh it's a good sign the os is doing what it's meant to. A load of unused ram isn't a good thing.","score":13,"comments":[]},{"body":"except the cpu it seems. its at 22%","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"#optimized","score":8,"comments":[]},{"body":"Rust is impossible to run at 144 fps 💔","score":18,"comments":[{"body":"144 fps minimum requirements: \nping under 10\ni17 processor\n128gb ram\n30600 graphic card\n4th dimension ssd","score":21,"comments":[{"body":"Also you need the rust gaming chair, obviously","score":9,"comments":[]},{"body":"So basically it's a java worker","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"i present you the Ryzen 7 5800X3D,that CPU can prolly push to 140-150 fps cus of the huge cache","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"i get similar/the same frames with 7700x/3090.\nWhats limiting the frames, is the single core speed of the cpu.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How does that work","not_safe_for_work":false,"locked":false,"body":"So my cpu uses about 50% and my gpu as well while playing rust. I have a Ryzen 5 5600 with a aorus master 3070. I mean I run 160 fps for like the first 10 mins then it goes down to 80-100fps. I also have 32 gigs of ram so I wouldn’t think that’s a issue.","score":0,"comments":[{"body":"Open ur computer side panels and hire a chinese worker to fan your pc for better airflow. Should do the trick.","score":3,"comments":[]},{"body":"Rust wont use all cores, you are probably 100% usages on the cores it does.\n\nYour problem sounds like not enough cooling what are temps?","score":2,"comments":[{"body":"My temps stay around 65- 70c nzxt kraken water cooling for cpu","score":1,"comments":[]}]},{"body":"Does \"gc.collect\" in f1 console still work? Could just bind that to a key.","score":1,"comments":[]},{"body":"I have a Ryzen 5900X and a 3070, with the same cooler and 32 gig ram too. Sounds pretty normal to me. Rust will just vary I guess depending on servers and where you are. High pop servers and being in dense locations give me about 70fps whereas lower pop open areas give me 110+ fps","score":1,"comments":[]},{"body":"Rust has had mem leaks for ages hence why you need at keast 32 gog of ram.  Monitor it y b orself using task manager - over time rust will consume exponentially more ram even with the best (optimization) settings.","score":1,"comments":[{"body":"Okay I will. Is there a fix for this or it’s inevitable","score":1,"comments":[]}]}]},{"title":"Got rusted","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Im sorry for your loss.","score":1,"comments":[]},{"body":"What was your ping?","score":1,"comments":[{"body":"51 it says in the console","score":1,"comments":[{"body":"RIP your bullets. The rust gods ate them.","score":1,"comments":[]}]}]}]},{"title":"Can't throw survey charges anywhere","not_safe_for_work":false,"locked":false,"body":"Hey guys!\n\nso, i want to build mining quarry and i've already craft the survey charges\n\n&amp;#x200B;\n\nthe problem is, i can't throw any my survey charges, even my friends too\n\nso any solutions?\n\n&amp;#x200B;\n\ni'm playin on Russian PVE Amigos Server\n\n&amp;#x200B;\n\nthanks!","score":0,"comments":[{"body":"They might be running the virtual quarry plugin. Try typing /quarry or just /qr. You don’t physically place the quarries or physically throw the survey charges.","score":2,"comments":[]},{"body":"they were removed from the game years ago but are still in the F1 menu, the in-game mechanic has probably been removed, idk","score":0,"comments":[]},{"body":"Quarries were removed a while ago and you shouldnt be able to craft them.\n\nThis sounds like a modded server that re-enables them but they dont work the same way, you'll have to ask the server how it works. It might say how /help command or on the servers web page.","score":0,"comments":[]}]}]}