{"name":"programming","description":"Computer Programming","subscribers":4875493,"posts":[{"title":"How I Quit my Programmer Job to Become a Chicken","not_safe_for_work":false,"locked":false,"body":"","score":398,"comments":[{"body":"This isn't the worst medium article I've seen.","score":249,"comments":[{"body":"Best saying I've seen is that \"it's called Medium because articles on it are rarely well done\" . \n\nAlthough if I want to find another undergraduates opinion on architecture or a scrum master trying to justify their job's existence, it's good for that.","score":124,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I was going to say it's above average","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Reject modernity\n\nReturn to poultry","score":97,"comments":[]},{"body":"&gt; Puk puk pukaaak! Cluck cluck… Bwak Bwak Bwaaak, puk puk pukaaak! Cluck-cluck-cluck bok.\n\nThis right here is where it finally clucked for me. Thanks OP, that was truly insightful.","score":16,"comments":[]},{"body":"I get it man, the honeymoon phase is intoxicating, like, look at me with all these feathers and talons yo! But there are a lot of chickens out there, and very few make it.","score":66,"comments":[{"body":"I’m honestly just sick of the junior chickens thinking they need to be senior chickens within a few years. \n\nI mean *cluck cluck*","score":18,"comments":[]}]},{"body":"he lost it","score":25,"comments":[{"body":"This One has crossed the road...","score":16,"comments":[]}]},{"body":"Feature request: allow `bwok` to be a config","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Microservices: it's because of the way our backend works","not_safe_for_work":false,"locked":false,"body":"","score":3044,"comments":[{"body":"This remains absolute perfection","score":863,"comments":[{"body":"I swear I watched this a few years ago and it meant nothing to me. A couple of months as an SDE at Amazon and holy cow is this accurate. Service named James, which is actually a backronym because it interfaces with some other service named BOND","score":560,"comments":[{"body":"Amazon had (had? It's been a while) Isenguard to manage AWS access internally.\n\nSo what did we call the service that serves updates to Isenguard? GANDALF (which was an acronym, but whatever) to fit the theme.\n\nWill never forget my buddy for suggesting we should name it urukhai because it 'brings the hobbits to Isenguard'. PM did not understand that suggestion or think that was a good idea.\n\n'But it's the Urukhai who bring the Hobbits to isenguard! Gandalf had nothing to do with it!'. He complained.","score":304,"comments":[{"body":"The Uruk-Hai never actually make it back to Isengard, though. Eomer's banished Rohirrim slaughtered them in the night.\n\nIf you really want to name a service responsible for updating Isengard, you should probably call it ENT or TREEBEARD. They *really* updated Isengard.","score":77,"comments":[{"body":"Great now I have to study leetcode AND tolkien","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Every shop has a fucking Galactus why is that?","score":247,"comments":[{"body":"Serious question, what's a Galactus?","score":41,"comments":[{"body":"It's what you eventually name the monolith that does like 70% of the real company critical work.","score":226,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"There is another video of the Omega Star developer talking about the delay in the patch to fix lack of ISO timestamps.\n\nIt's a universe.","score":46,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"1000s of RPCs","score":455,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Elon Musk just tweeted a photo of Twitter's architecture, for those who wondered","not_safe_for_work":false,"locked":false,"body":"","score":362,"comments":[{"body":"Nothing wrong with getting the high-level architecture explained, but why does Musk call it a \"code review\"?","score":494,"comments":[{"body":"i think you know the answer to that","score":401,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Looks like what you would get in the architecture interview part of recruitment","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"select \\* from tweets;\n\nHow hard could it be?","score":225,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Can someone re upload it?","score":31,"comments":[{"body":"[This Reddit post has it.](https://www.reddit.com/r/webdev/comments/yzcnui/elon_musk_just_tweeted_a_photo_of_twitters/).","score":22,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"This is a subset of the architecture at best","score":156,"comments":[{"body":"I have some friends who worked at Twitter and I believe this is what is referred to as the \"core services\" stack, i.e. the parts required to show a user a timeline. Twitter is a bit interesting since they support a ton of services that end-users never see, but are response for revenue generation. Twitter makes money by selling things like ad campaign management and data analytics for companies, and those are not included in this diagram, nor is content moderation.","score":93,"comments":[{"body":"Any sufficiently sized enterprise runs far more services that end customers will not see but definitely rely on than they do ones that impact customers directly.\n\nWhat makes Twitter interesting to me is the size and scale of their graph, which most of what we see here directly supports.","score":30,"comments":[]}]},{"body":"It's labelled as \"read path\"; as in the process that happens to load your timeline. Writes (making a new tweet, liking/retweeting etc) would easily be an order of magnitude more complex","score":24,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Senior Engineers are Living in the Future","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[{"body":"This is an excellent essay. Thank you.","score":3,"comments":[]}]},{"title":"The word \"Sprint\" in agile development: An unfortunate misnomer","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[{"body":"I doubt that renaming \"sprint\" to something else will change much. A rose by any other name, as the Immortal Bard once wrote. The real problems are more fundamental about how Agile is implemented and how often participants - mostly on the management and business side - have unrealistic expectations.","score":3,"comments":[]},{"body":"Kanban is the only method that actually maps to how you should be working.\n\nSprints are for managers and a way to place blame","score":3,"comments":[{"body":"How so?  I don’t think I’ve done anything but sprints. How does the kanban process track progress better?","score":1,"comments":[{"body":"Kanban says to just focus on the most important task at that time.\n\nThe issue with sprints are that you get into a problem and then things change and you often need to take a different direction. You then need to edit your sprint (bad) and now your burn down is all messed up (oh geez).\n\nKanban just matches what you should actually be doing, giving you a mechanism to communicate that, without the friction of requiring perfect insight into the future.","score":3,"comments":[]}]}]},{"body":"Agile is the stupidest shit. It's the exact same as just creating a list of what you plan to do. They just give it a special name and pretend it's some clever framework. \n\nIt's literally just list of tasks. Anyone with a brain has been doing it since grade school.\n\nAnd the biggest issue with agile is that non technical people get into the mix and just drag everyone down to their level. They have no idea what's going on, yet they are somehow helping planning. Usually all they do is waste other people's time having to explain things which they'll never understand properly anyways.","score":5,"comments":[{"body":"I totally feel you. I feel that this shit is driving software development into the ground. Productivity, morale, sanity, ability to do fucking anything. I said it before, and I'll say it again: If you presented the agile manifesto to managers and the like they would reject it as not agile. If you then told them that this is literally agile, and not the Agile they've had training in, they'd explode.\n\nYour comment about school reminded me of something that happened recently. We had just under 4 hours spent on \"ways of working\" and deciding how we'd work as a team - something everyone in those meetings has been doing for a long time anyway. 4 hours that boils down to \"be nice to each other, estimate user stories, blah blah\" again something we all do. I really don't think anything meaningful would happen if middle management vanished from many organisations. As terrible as things over at Twitter are, one thing is for sure - it's got to be a change to the status quo.\n\nI wrote a bit about a particularly dumb part of all this (story points) [here too](https://www.lloydatkinson.net/posts/2022/one-teams-eight-points-is-another-teams-two-points/).","score":1,"comments":[]},{"body":"Wow the agile fans are out LOL","score":1,"comments":[]},{"body":"&gt;Agile is the stupidest shit. \n\nThe ecosystem that built up around the [Agile Manifesto](https://agilemanifesto.org/principles.html) is indeed ridiculous and creates a lot of pointless jobs. \n\nHowever the principles that are in the Agile Manifesto were sorely needed and helped shape software development.  Which are far from saying \"have a list of tasks\". \n\n&gt;non technical people get into the mix and just drag everyone down to their level. They have no idea what's going on, yet they are somehow helping planning. Usually all they do is waste other people's time having to explain things which they'll never understand properly anyways.\n\nInvolving non-technical personnel in the development of software is important, but there has to be the right kinds of non-technical people involved. Developers operating in a silo from the business is a terrible idea, it's how you get well engineered products that fall flat on their face when it comes to them being profitable.","score":1,"comments":[]}]},{"body":"Just work on one thing at a time and tell your PM you're doing tabata sprints.","score":1,"comments":[]}]},{"title":"OCaml 5.0.0 - First Beta","not_safe_for_work":false,"locked":false,"body":"","score":40,"comments":[{"body":"Ocaml 5 i going to be a game changer. Basically a very good concurrency story, and true parallelism.\n\nAnd ocaml the languge is very nice. It has a impressive type system, and its very pragmatic. \n\nVery intresting times to come!","score":12,"comments":[{"body":"Honestly if Ocaml hasn't changed the game yet it won't in the future either.\n\nSo far the only thing that changed the game was typescript and rust","score":5,"comments":[]},{"body":"People say ocaml is useful only if you want to work on Jane Street","score":2,"comments":[]}]},{"body":"The algebraic effects system is great. However, I wonder with Rust gaining more popularity and is basically OCaml with a borrow checker, how well OCaml will do in the future. Cargo is still miles above whatever OCaml uses, esy? I used to use the ReasonML dialect which was great but it seems to have died out as well.","score":2,"comments":[{"body":"&gt; Rust [...] is basically OCaml with a borrow checker\n\nTotally incomparable. Rust doesn't have garbage collection, rust isn't functional, rust doesn't have tail calls. These all trade off productivity in exchange for performance.","score":3,"comments":[{"body":"All that being said, Rust is still more popular than OCaml due to their tooling, even if most would say Rust is harder to learn than OCaml.","score":3,"comments":[]},{"body":"None of those are productivity things.","score":1,"comments":[]}]},{"body":"Opam","score":1,"comments":[]}]},{"body":"Is it used in the wild?  \nOnly place I know who use it are french universities","score":1,"comments":[]}]},{"title":"The Basics of how QR codes work","not_safe_for_work":false,"locked":false,"body":"","score":915,"comments":[{"body":"It was a good read, it would be better if he shared more information about the error correction information.","score":159,"comments":[{"body":"I'm not surprised though, [its actually really really complex.](https://en.wikipedia.org/wiki/Reed–Solomon_error_correction)","score":145,"comments":[{"body":"Holy crap you aren't kidding.  That's cryptography level math.  I'm barely even smart enough to know how much I don't understand that.","score":58,"comments":[{"body":"It's apparently just as hard to implement too. Look at why ZFS supports 1, 2, or 3 parity drives but not 4: https://github.com/openzfs/zfs/blob/master/module/zfs/vdev_raidz.c#L47\n\n     * Note that the Plank paper claimed to support arbitrary N+M, but was then\n     * amended six years later identifying a critical flaw that invalidates its\n     * claims. Nevertheless, the technique can be adapted to work for up to\n     * triple parity. For additional parity, the amendment \"Note: Correction to\n     * the 1997 Tutorial on Reed-Solomon Coding\" by James S. Plank and Ying Ding\n     * is viable, but the additional complexity means that write performance will\n     * suffer.","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Eh, you could probably learn it with some study. In my experience, hiding behind the math words is usually something understandable to programmers. Especially in this kind of thing that is basically just binary data processing. Math just gives names to lots of ideas so you spend a lot of time chasing down what the names mean and not much time understanding.\n\nHere's a sentence from Wikipedia:\n\n&gt; This function C C is a linear mapping, that is, it satisfies C ( x ) = x T ⋅ A {\\displaystyle C(x)=x^{T}\\cdot A} for the following ( k × n ) (k\\times n)-matrix A A with elements from F F: \n\nand when you decide that F is \"bits\" (as opposed to, for example, complex numbers) it really means:\n\n&gt; Each bit in the output is generated by XORing a certain set of bits in the input.\n\nThere's a bunch of theory about how to decide which bits to XOR, but you might not have to know that to implement a certain code, only to generate new codes.\n\n---\n\n&gt; In the original view of Reed &amp; Solomon (1960), every codeword of the Reed–Solomon code is a sequence of function values of a polynomial of degree less than k. In order to obtain a codeword of the Reed–Solomon code, the message symbols (each within the q-sized alphabet) are treated as the coefficients of a polynomial p of degree less than k, over the finite field F with q elements\n\nPolynomials aren't terribly complicated math and if you know about them, you know that, like, knowing any 3 points on a parabola (a degree-2 polynomial) tells you the equation for the parabola. If you scale it up, knowing any 10000 points on a degree-9999 polynomial tells you the equation for the polynomial. Apparently this still works if you use bits (which are a type of \"Galois field\") instead of numbers - you can make a bitwise polynomial and have the math still work. So what if we 10000 bits of data into a degree-9999 bitwise polynomial and then sample 20000 points from it? Then we have redundancy because any 10000 out of the 20000 points can let us reconstruct the polynomial.\n\nAnd because adding bits is just XOR and multiplying bits is just AND it distills down into a really efficient bitwise algorithm.\n\nSomething like that, anyway. I didn't delve deep into it so what I just said probably isn't completely accurate - I think it might be using polynomials made of n-bit numbers instead of single bits. I hope it seems more approachable now, though.","score":42,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Hello, I tried to write one about those, it's clearly not as good as OP and feel free to tell me if you could understand it :)\n\nhttps://fast-qr.com/blog/error_coding and I implemented it: https://github.com/erwanvivien/fast_qr\n\nEdit: the whole blog is more like a tutorial than a simplification of the specification (that I link in the post)","score":38,"comments":[]}]},{"body":"Nice article.  Once watched a Chinese quiz show game,  where people would stand and look at qr codes reading them and telling the answers  in order to win the quiz show.","score":48,"comments":[{"body":"Excusemewhat?","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I dont understand why we need the alignment square. Arent the 3 bigger ones enough? And why do QR readers work better with a 50/50 black/white coverage?","score":14,"comments":[{"body":"I think the alignment square is there if part of the qr code is missing. If you cut off any one corner with it, computer still knows which way is “up”, but without it remove one corner and it’s impossible to tell which corner the missing should be, data/error correction.","score":21,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Single mom sues coding boot camp over job placement rates","not_safe_for_work":false,"locked":false,"body":"","score":454,"comments":[{"body":"While I know not everyone may know about this, or even think to look [CIRR.org](https://CIRR.org) published bi-annual reports for individual bootcamps with the job placement outcomes. \n\nIt is sobering data that anyone considering a bootcamp should look at, and carefully evaluate which ones to attend, if at all.\n\nUnfortunately they seem to have stopped publishing this year. Hopefully a similar resource becomes available.","score":357,"comments":[{"body":"Its actually better than I thought it'd be. Roughly 40-60% get employed within 90 days. 90% employed after 180 days. Am I reading this incorrectly? Or are my standards low lol","score":249,"comments":[{"body":"It varies strongly from bootcamp to bootcamp and year to year. Some bootcamps only hit \\~60% employed after 180 days. Combine that with dropout rates and it might be closer to 50% employed in some form. I'd also expect late 2020/early 2021 to have much higher outcomes than this year.\n\nThe bootcamp I went to achieves high employment rates by funneling graduates into coding sweatshops.","score":137,"comments":[{"body":"I'd say some 25 - 50% of people who learn to code aren't very employable so it's probably a really good statistic.","score":109,"comments":[{"body":"It’s a blaring fact many over look, lots of people, coders included, don’t have the right attitude to work well in a team.","score":45,"comments":[{"body":"It's not just the attitude towards teams; junior-mid coder is one of the professions where bullshitting people doesn't help your metrics...","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"A lot of it is down to the quality of the employment\n\nOften they’ll partner with a really shitty low end (minimum wage) software shop where the pay and conditions are so bad that you quickly leave… but technically they got you an offer of employment within the timescale claimed so they’re off the hook","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"A friend that attended a bootcamp told me that their class no one was employed as web developers not even a year after they took the course.\n\nEveryone got jobs in whatever they were doing before or took whatever they could find non web development wise.\n\nExcept for one classmate who was liked by the instructor and they were hired on as a tutor of the service providing the bootcamp.\n\nSeems like boot camps might want to hire ex students as a buffer to offset the reality that students won’t actually get real jobs in industry, but the camp can say well at least “someone” did get “hired”.","score":63,"comments":[{"body":"This is what happened to me and my cohort.","score":12,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"I took a job placement boot camp (it assumed you already knew basic programming).\n\nThat was a good investment.\n\nBut yeah I've heard learn to code in a month camps are no so great at that","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"GitHub - fwsGonzo/libriscv: C++17 RISC-V RV32/64/128 userspace emulator library","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"Well, your binary translation is certainly a very different approach than mine.","score":2,"comments":[]}]},{"title":"I made a free and open source app that tracks new features and changes in languages, frameworks, and libraries","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[{"body":"Haven't tried it yet, but I love the concept. And your app looks great.","score":3,"comments":[{"body":"Thank you! I hope you will find it useful.","score":1,"comments":[]}]},{"body":"So... rss/atom aggregator?","score":2,"comments":[{"body":"Pretty much. You will receive notifications once new updates are out and can learn more about them through the linked articles. \n\nI've seen you left a comment with some critique. I hope my reply made things more clear.","score":1,"comments":[]}]}]},{"title":"Updating Schema of Synced Realm and iOS App in Production","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[]},{"title":"D8VK project -- implementation of Direct3D 8 for DXVK (Vulkan-based translation layer for Direct3D)","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[]},{"title":"I created a Solar System simulation with Keplerian Orbits","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[]},{"title":"Fred Brooks has died","not_safe_for_work":false,"locked":false,"body":"","score":1215,"comments":[{"body":"At IBM in the 1960s, Brooks managed the System/360 and OS/360 projects, the backbone of the mainframe era. His experiences were captured in a series of seminal essays, later published in \"The Mythical Man Month\", a must-read for software engineers. Other books included \"The Design of Design\".\n\nHe later led the CS department at UNC.","score":485,"comments":[{"body":"&gt; \"The Mythical Man Month\", a must-read for software engineers\n\nAnd seemingly a must-ignore for engineering managers everywhere. The knowledge is out there, when will we learn? RIP Brooks. You will live on through your work forever.","score":226,"comments":[{"body":"Indeed. \n\n_”You should plan to throw one away. You will anyway.”_ — Fred Brooks\n\n_”There is never time to do it right, but always time to do it over!”_ — John W. Bergman\n\nSoftware industry never learns.","score":133,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[Seen it over and over](https://imgflip.com/i/719zw2)","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"The programmer, like the poet, works only slightly removed from pure thought-stuff. He builds his castles in the air, from air, creating by exertion of the imagination. - Frederick P. Brooks, Jr.","score":192,"comments":[{"body":"This quote always makes me wanna pick up a new programming language and spend the day making something really nerdy and fun.","score":54,"comments":[{"body":"Poets don't get syntax errors.","score":42,"comments":[{"body":"Warning: Iambic pentameter not met.  0xC00T2675B","score":54,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"I had a terrible Programming Languages teacher that made us read Mythical Man Month. The rest of the course was so bad many people underwrote it next semester (took the course with a new teacher for no grade), but MMM remains the most salient, prescient book I read in college.\n\nRIP Fred Brooks, I still say \"nine women can’t have a baby in a month\" on a regular basis","score":87,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I met the man many times and sat with him in many dissertation defenses. He was quite a character. His VR pit simulator was a fun experience.","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Secure and efficient QNetworkAccessManager use","not_safe_for_work":false,"locked":false,"body":"","score":6,"comments":[]},{"title":"git diff and git log and dots","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"ELI5? What's backpatching? Always thought diff would show all changes between two tree-like objects. Me confused.","score":2,"comments":[{"body":"If you have a patch you apply to the main branch, for example, and then you realise you need to apply it to another branch that was branched before the change, then you just cherry-pick the commit to that branch.","score":1,"comments":[]}]}]},{"title":"Stop using static credentials","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"Yes, use a password vault, but wait, then you need to store passwords to access the vault somewhere, so where do I put those credentials then? Also, wouldn't the one password to access a vault full of passwords be even more valuable than a single password anyway?\n\nPassword vaults seem like a good idea initially but in practice, they don't seem to be practical.\n\nAm I wrong here?","score":9,"comments":[{"body":"The idea is to use a separate storage for the credentials so that, if main data storage is compromised through SQL injection or by other means, the perpetrator will not automatically gain access to credentials.  Thus the attack surface for the credentials is reduced.  That is all there is to it.","score":3,"comments":[{"body":"It looks like this post is about setting up a service to provide ever-changing credentials on demand. I think the benefit to this is that if someone gains access then there is an automatic expiration for it all. The ephemeral credentials expire regularly, which limits their value if they are stolen. The credentials-issuing service could be monitored for irregular accesses too, so (maybe) an intruder can't just request excess temporary credentials unnoticed. I don't know if this is all worth the trouble, but it is a neat idea in a way.","score":3,"comments":[{"body":"Yea, when I ask vault providers the same question, they all pretty much admit that a password vaults does nothing to secure passwords and you still need a master password.\n\nWhen I ask them why do we need one they usually bring up the automatic password rotation and the postmortem access logs and that's about it.","score":1,"comments":[]}]}]},{"body":"The idea is not to keep it in code. Your service that runs on azure cloud can easily access your azure keyvault or if you run it locally you first need to authenticate but if someone snatches the code they can't immediately get all the secrets.","score":1,"comments":[]},{"body":"I think you are partially right. But I think (based on analysis, not the blog) that the \"master password\" is specific to the consumer service instance. The credentials-issuing server issues unique ephemeral credentials based on who is asking. Of course the token for getting credentials is sensitive, but the issuing service can be monitored for irregular accesses. So stealing the ephemeral credentials has limited value and trying to use the token to get more credentials risks announcing your presence to a service that does nothing but manage accesses.\n\nI also wonder if this indirection is worth the trouble. But monitoring demand for credentials in one place may make it easier to detect anomalies, so I can't dismiss it outright.","score":1,"comments":[]}]},{"body":"Yes but your CI system still needs a long lived refresh token to get those access tokens.\n\nThat's just a different secret you are storing\n\nAt some point somewhere you need to store a long lived secret.","score":1,"comments":[]}]},{"title":"A mesmerising morphing spirograph using SDL2","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[]},{"title":"Real System Design Interview: Step-by-Step","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[]},{"title":"What is Stack? - Data Structures","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Everybody asks \"what is stack?\", but nobody ever asks \"how is stack?\" :(","score":3,"comments":[]}]},{"title":"My first script in a while, a Powershell MSI extractor!","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Quake 1 port for Apple Watch","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"is there any video of you playing it? using the scroll wheel for movement seems like it's gonna wreck your scroll wheel pretty quick.\n\n&gt;\"how the hell did you do this\"  \n&gt;\"speed run bunny hopping\"","score":1,"comments":[]}]},{"title":"THERAC-25: History's Worst Software Error","not_safe_for_work":false,"locked":false,"body":"","score":72,"comments":[{"body":"Worst so far.","score":28,"comments":[{"body":"[homer.jpg](https://i.imgflip.com/2/3ua7gn.jpg)","score":9,"comments":[]},{"body":"Apparently nobody knows who wrote the code either. Trainwreck.","score":3,"comments":[]},{"body":"Yeh, don't count me out. I'm not dead yet.","score":2,"comments":[]}]},{"body":"Thanks for this, I remember reading the article on it years ago, very nice video they did regarding the incidents.","score":6,"comments":[]},{"body":"Kyle Hill is great, love all his stuff\n\nMedical software development makes me anxious just thinking about it, I can't imagine being one of the people responsible for the software in a situation like this","score":10,"comments":[{"body":"This story is actually taught every semester at the college I went to during the operating system course. Just to kind of stress safe defaults, and other good practices to prevent this. \n\nAnother point that the professor made is that often times the most talented developers go to the high paying cushy job that involves a lot less stress/risk because those talented developers have the option get mostly what jobs they want. So the software that is in machines like this or vehicles is often times (this may be pure conjecture) built by developers who are maybe a bit more desperate to get a job. So the professor urged us to keep in mind the impact you want your career to have on the world and such.","score":14,"comments":[{"body":"Yep, I distinctly remember this being taught in my first semester. It may in fact have been one of the first lectures. \n\nThe aim was to drive home that software development is all creativity, trial-and-error engineering, until it's not. And to be aware that your code can always have profound consequences whether that's because of an error in critical software or because it has been reused for malicious purposes. \n\nI feel like the latter probably isn't covered enough, as you have thousands of engineers building facial recognition systems and data manipulation software in the belief that it's just all revealing the awesome power of clever software without considering the likely consequences and power for oppression and prejudice they have.","score":5,"comments":[]}]},{"body":"You know, the theriac-25 code was a hot mess. As long as you got good quality control, and best practices software development, risk of something like this is small. Combine that with hardware safeties and you're talking zero chance of a failure like this.","score":3,"comments":[{"body":"I'm confident that all those protections do exist in critical infrastructure, but when stuff is un use in the real world theres always going to be an edge case you didn't think of. There will be a bug, of some sort somewhere, in any non-trivial software project","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]}]}]},{"title":"Introduction to Docker: A Beginners Guide for 2023","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"\"In this article, you will learn about the core concepts of Docker, its uses, and how containerization technology can help you scale your application to millions of users.\"\n\nMy favorite thing about Docker: its unnecessary for 99% of applications.","score":0,"comments":[{"body":"Docker or containers? Because containers are a complete game changer","score":1,"comments":[{"body":"Worrying about scaling to millions of users","score":1,"comments":[{"body":"You don't need to need to scale to millions of users for Docker / containers to be useful.","score":3,"comments":[]}]}]},{"body":"Out of curiosity how do you deploy your code?","score":1,"comments":[]}]}]},{"title":"SECDED Data Armor: Improving on Daniel Bernstein's Libsecded","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"This is an attempt to improve on djb's fantastic libsecded:\n\nhttps://pqsrc.cr.yp.to/libsecded-20220828/README.html\n\nWe're using a novel Hamming code that doesn't require any interleaving, so the original data can be left unmodified. The new Hamming code is simple and easy to prove correct.\n\nHere is the checksum generator:\n\nhttps://bugfix-66.com/6956d0447254a7adce9531669bb2d24e3d2e981887d00767fb00ad6612a80486\n\nHere is the corresponding SECDED scrubber, that uses the checksum to fix single bit flips and detect double bit flips:\n\nhttps://bugfix-66.com/f0a66d0ba87bd566172e5a880cdebd57c50bb80c160d57854f2f43fbb6a30f2e\n\nFuture work is to vectorize the index XOR loop (a tiny piece of code).","score":1,"comments":[{"body":"How do you deal with the \"encrypted RAM\" security feature that AMD and Intel introduced a few years ago (where a single bit error in the encrypted data in RAM causes an entire 64-byte cache line to become \"random\" in the decrypted data the CPU sees)?","score":1,"comments":[{"body":"In other words, that RAM turns a single bit flip into random flips of every bit in a cache line. We can't fix that at the software level using a SECDED scheme.","score":1,"comments":[{"body":"That's \"somewhat unfortunate\" given that modern Windows and Linux (and maybe other operating systems) just treat all RAM as encrypted by default (if possible) to guard against cold boot attacks.","score":1,"comments":[]}]}]}]}]},{"title":"One can create interactive trees in pure html with a single css rule","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"The CSS isn't needed. The example on MDN does this and you could then nest more summary/details/ul as needed\n\n [https://developer.mozilla.org/en-US/docs/Web/HTML/Element/summary#basic\\_example](https://developer.mozilla.org/en-US/docs/Web/HTML/Element/summary#basic_example)\n\n&gt;It won't be accessible though:   \nWarning: Because the &lt;summary&gt; element has a default role of button (which strips all roles from child elements), this example will not work for users of assistive technologies such as screen readers. The &lt;h4&gt; will have its role removed and thus will not be treated as a heading for these users.\n\nBut it is neat to see something you'd assume would need js being done with pure html","score":1,"comments":[]}]},{"title":"Pluralsight is free this weekend (November 18 – 20)","not_safe_for_work":false,"locked":false,"body":"","score":88,"comments":[{"body":"Really free or just free for newly registered users like usual?\n\nEDIT: Yep, looks to be only useful for people who've never used Pluralsight before.","score":17,"comments":[{"body":"I guess you can sign up with youremail+whatever@gmail.com and have a new account...\n\nGet this https://github.com/sahilsehwag/pluralsight-downloader-chrome-extension and get what you need","score":17,"comments":[]},{"body":"You can sign in with your old account, but then have to use the email link to \"register\" for the free weekend(and capture your country again)","score":2,"comments":[]}]},{"body":"Do I have to put a credit card down?","score":4,"comments":[{"body":"No (just tested)","score":2,"comments":[]}]}]},{"title":"Applying to Software Jobs - Parody of \"All Eyes On Me\" by Bo Burnham","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Oh good it’s so true.  Why are they all the same now?","score":2,"comments":[]},{"body":"Reposted 6 minutes ago due to the link not working. Should be all good now. Enjoy!","score":0,"comments":[]}]},{"title":"Are you interested in designing and building programing languages? We're trying to build a community about that on stack exchange. However, we need more follows and questions to make that happen.","not_safe_for_work":false,"locked":false,"body":"","score":115,"comments":[{"body":"Damn, just 45 questions an already a closed by  duplicate.\n\nTry posting on r/compilers, there is always a lot of questions and state of the art things.","score":24,"comments":[]},{"body":"Am I interested? Yes.  I even thought of a few example questions.\n\nAm I interested enough to get login to work on Area 51? Hell no. I'd rather be chained naked to a fire ant nest.","score":36,"comments":[{"body":"&gt; I'd rather be chained naked to a fire ant nest.\n\nIs this a new fetish? I just can't keep up with reddit sometimes. The things that show up in search results for completely innocuous terms make me question everything.","score":9,"comments":[{"body":"It's the new rage!\n\nPrevents you from sitting on the toilet for too long also if you putsome  fire ants on the surrounding area. Thus forcing you to keep your own downtime low!","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Yea it's a huge pain. I had to go to a private window then click \"create account\" (not log in like you'd expect) and then it worked.","score":4,"comments":[]}]},{"body":"That sounds as fun as asking people how they think we should design a speaking language. Not very fun or practical at all","score":4,"comments":[{"body":"There is an incredible amount of constructed languages and almost all of them were built for fun or because it is a very interesting idea. More people speak klingon nowadays than Cherokee.","score":14,"comments":[]},{"body":"Lmao, as someone into conlanging, it's very fun actually.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"/r/ProgrammingLanguages","score":2,"comments":[]},{"body":"whats wrong with other platforms of communication?","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"5 Uses of Lambda Functions in Python","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"This is really interesting and a good overview. \n\nAm I the only one who finds lambda functions inherently less readable? Take the interview question. Apparently the great programmer will jam all of his logic into one line and that's more elegant? What about more readable and thus more maintainable? At what point did that stop being important? \n\nI guess I just find it interesting that I looked through this and found lambdas or anonymous functions not really useful for any projects I work on currently.","score":1,"comments":[]},{"body":"There's only one use. To define an anonymous function. These \"five,\" are just slight variations on that.","score":1,"comments":[]}]},{"title":"SweetAlert2 - \"This commit adds what could be almost considered malware. Any navigator language that has ru in it will have the Ukrainian national anthem play.\"","not_safe_for_work":false,"locked":false,"body":"","score":14,"comments":[{"body":"[For those interested in the code](https://github.com/sweetalert2/sweetalert2/pull/2553/files)","score":16,"comments":[{"body":"OMG so childish and stupid","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Time to fork and make SweetAlert3. Now even sweeter.","score":13,"comments":[{"body":"Was going to comment this exactly","score":5,"comments":[]}]},{"body":"This is stupid.\n\nI agree with one of the commenters \n\n&gt;Why should one continue to trust this library, or you as a maintainer, in the future? I know I certainly never will. What if this is just the start of your protestware, what if one day you decide to add a release that wipes someone's hard drive because they use a Russian VPN server? There is no longer a foundation of trust in you as a maintainer to act in a responsible manner and publish releases that won't harm my users.\n&gt;Releases like this set a dangerous standard","score":39,"comments":[{"body":"I'll definitely add them to my list of non-trustworthy OSS developers","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"The first response by the author is pretty unhinged. He seems to think that playing a sound file in his javascript pop up library will help \"russian infrastructure to stop functioning and therefore bringing the victory of Ukraine closer\".\n\nSomehow, this isn't even the most objectionable thing about the repo to me (check the readme).","score":17,"comments":[{"body":"Sponsors be like: I don't want to play with you anymore","score":3,"comments":[]}]},{"body":"Virtue signalling and achieving nothing while destroying the perception of credibility of open source software for the future.  Wonderful.  It's absolutely ridiculous that we now have to vet software for \"protestware\". smh","score":7,"comments":[]},{"body":"Report it.","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Mozilla to begin signing Mv3 extensions for Firefox","not_safe_for_work":false,"locked":false,"body":"","score":527,"comments":[{"body":"&gt;      \n\n&gt;Mozilla's implementation of Mv3 will differ in two critical ways from Google's. First, it will provide developers with access to the APIs Google considers too troublesome to retain.\n\n&gt;\"While other browser vendors introduced declarativeNetRequest (DNR) in favor of blocking Web Request in Mv3, Firefox Mv3 continues to support blocking Web Request and will support a compatible version of DNR in the future,\" said Shane Caraveo, engineering manager for WebExtensions at Mozilla, in a blog post. \"We believe blocking Web Request is more flexible than DNR, thus allowing for more creative use cases in content blockers and other privacy and security extensions.\"","score":422,"comments":[{"body":"In other words, \"fuck you Google, we're keeping our adblockers. Love, Mozilla\"","score":500,"comments":[{"body":"One of the many reason I'll be sticking with Firefox for the foreseeable future.\n\n* Vertical tabs. It's absolutely bonkers Chrome insisted on killing this, and it's a must-have feature IMO for desktop/laptop.\n\n* Site containers and things like first-party cookie isolation are fantastic ways to improve privacy.\n\n* The web desperately needs more than one rendering engine if the standards are going to actually matter. There's too much risk of Chrome's engine becoming synonymous with the web in all but name.","score":46,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Other chromium teams are doing the same thing. Other browsers are maintaining the AdBlockers on chromium.","score":52,"comments":[{"body":"For real? Last I heard chromium edge was following Google's manifest 3. No clue about opera or brave tho.","score":12,"comments":[{"body":"Brave said they keep Mv2 support (while also supporting Mv3).","score":8,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"They have to though. If they prevented ad blockers, it would have no advantage compared to the Chrome clones or Safari.","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Mozilla siding with it's users again, great reason to keep using Firefox.","score":12,"comments":[]},{"body":"for a moment I thought you wer3 gonna say Mozilla to being mass layoffs.","score":48,"comments":[{"body":"Considering the current tech landscape, I wouldn't be surprised if some lay offs are in talks right now in Mozilla.","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Three Reasons why OpenAPI is the Best Documentation Platform for your API","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"I have written a detailed article on arrays in python, would love you guys to read it and give feedback","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Arrays are also used in multiprocessing to share data between processes.","score":1,"comments":[]}]},{"title":"Github Copilot in the Terminal (bash)","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"4 Strategies for Dealing with Bad Code","not_safe_for_work":false,"locked":false,"body":"","score":258,"comments":[{"body":"Strategy 5: Ignore it and hope it goes away","score":241,"comments":[{"body":"Strategy 6: Pile on it and ask for a pay rise to deal with all the problems!","score":85,"comments":[{"body":"Strategy 7 (the most sensible): Run for the hills and find a better job.","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Strategy 6: Throw in the towel and leave the company to deal with it.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"&gt; Curb your rewrite instinct\n\nIt once took me a week to replace a subsystem that people had spent 8 years trying to \"realign\". I just picked the key interface that abstracted away the core business rules that we actually wanted to save and threw out the horrific architecture around it.\n\nWhen I tested it I found all kinds of things that didn't work. When I tested those things against the existing system I found those tests silently failed with no indication anything had even gone wrong. So I actually made a better system in a week that what we eventually threw away.\n\nSometimes stuff is truly irredeemable. This pretence it never happens is one of the most irritating things I've seen on the internet. I can only assume those people have just been fortunate enough to only be subjected to good code.","score":131,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This is the worst dev related article I've read this week. Horrible and useless \"strategies\".","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"&gt;we all have been there. We tirelessly burn the midnight candle, trying to close a particularly painful bug and we come across a code section, the root cause of the problem\n\nCould have thrown in a 5th strategy.. Stop the culture of working \"tirelessly burning the midnight candle\" and the frequency of occurances of poor code will fall drastically. \n\nAt 11pm no developer has ever had the choice \"I could hack this together in 15 minutes, or work the problem the correct way in 60 minutes\", and then picked the 60 minute version of the task.","score":138,"comments":[{"body":"I'd argue too many do make that choice which keeps it as a viable option for employers.","score":30,"comments":[{"body":"This is an issue I have. I've been doing this for 25 years now. Burned out twice. For the past 5 years or so I have completely changed how I approach my job and what I expect from others.\n\nWork life balance is priority #1. Period. Always.\n\n40 hour weeks are the norm. Taking personal time is the norm. Flex time for the odd time extra time is required.\n\nAnd yet I've got devs that work all evening, work all weekend, show up Monday with a week worth of work done that wasn't asked or expected. Always like 'Thanks, but why, you weren't asked to do that, you weren't expected to do that, I don't _want_ you doing that'.\n\nBut they don't stop. They just can't not. They don't get it. And combine that with a culture of believing that this behavior will get you ahead at some point...\n\nThen what happens when management gets wind of these things? Praise. Promotion. Raises. \n\nCompletely undermining everything I've been striving for. \n\nCan't win for playing.","score":24,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Yeah, I have an eight hour work day. I'm not working late hours to fix a bug. I'm more likely disabling that feature until we have a resolution.\n\nSomething I just did the other day.","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"D3 in depth: a code-first tutorial of D3.js","not_safe_for_work":false,"locked":false,"body":"","score":13,"comments":[]},{"title":"The Forty-Year Programmer","not_safe_for_work":false,"locked":false,"body":"","score":12,"comments":[{"body":"Twenty-five-year dev here.\n\n&gt;Software Development is Young\n\nIt is, and it isn't 🤷‍♂️\n\nMy mother was a database administrator for forty years. Nearly that entire career was spent on SQL. And although SQL databases have continued to evolve, the core concepts really haven't. Sure, we've added some new-ish datastores that have their place, and it's possible something displaces SQL, but the underlying principles governing the design be the same.\n\nSame goes for most programming languages.  Plenty of new ones crop up. They're almost always imperative. Once you've learned a few, it's not often that a new one surprises you much.\n\nIt constantly surprises me A) how much stuff changes and B) how much the new stuff often isn't anything new, but just repackaged old.","score":19,"comments":[{"body":"It is young in terms of the trade's time in existence","score":6,"comments":[]}]},{"body":"Got my first full-time programming gig in 1979, which means I've been doing this for 43 years — 49 years if you go back to the first actual program I wrote in 1973. I've shipped products in FORTRAN, 8080/Z80 and 6502 assembler, Ada, varieties of BASIC, C, C++, C#, NewtonScript, Objective-C, Java, and JavaScript. I've created multiple websites by hand-editing HTML/CSS/JavaScript without a framework, which I mention only because some of you kids call that \"programming\". Wrote the server-side support for those sites, too, so I guess that makes me a \"full-stack\" developer.\n\nLearned C++ under Bjarne Stoustrup. Learned Ada from Grady Booch, who later became a user of one of my (non-Ada) products. Collaborated with Ada designer Jean Ichbiah on some non-programming projects. \n\nI was a software project manager for a couple years, but assigned myself development tasks to keep in the game. Started an after-hours project when working for others became stupid, and that grew into a new company.\n\nI regularly have to fix the bugs I wrote as a 20-year, 25-year, and 30-year programmer. Some things never change. But I write much more clever bugs now than I did 10, 15, or 20 years ago. Elegant bugs, you could say.\n\nI'm amused by the posters here who are 6 months into an online course and claim to have mastered some language and are ready to start something new. I'm amused by those who have worked 1-2 years and want to start their own business but have no experience beyond copying and pasting JavaScript into someone else's website to animate an image onto the screen. Put the time in. Get the Computer Science degree so you understand the theory behind what you do. Work for 10 years writing real code on real projects. You'll figure out that you didn't know anything back when you started. And you'll create your own opportunities for growth and change and won't have to ask a bunch of strangers on reddit. :-)","score":7,"comments":[{"body":"Professionally I'm only at 34 years, 37 altogether. And not only the above, but also the complexity and scope of the problems to solve have grown even faster. So I actually understand vastly less of the big picture now than I did when I started, despite having dedicated more of my life to it over that whole time than probably 99.9% of developers do.\n\nOTOH, I have collected a big bag of powerful tools as well, and pretty good intuition as to which ones to use in a given situation.","score":1,"comments":[]}]},{"body":"My first computer was a ZX81 (in 1981, when I was 11) where I learned Basic - my first commercial software job (on the side to school) was in 1986.\n\nSo with the private stuff I've also taken the 40 years mark.","score":2,"comments":[]}]},{"title":"The Distributed Computing Manifesto","not_safe_for_work":false,"locked":false,"body":"","score":29,"comments":[]},{"title":"Upload photo in Laravel Livewire","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"I made a video learning HTML and CSS in 30 days (from no web dev experience)","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"pygraphblas/Introduction-to-GraphBLAS-with-Python.ipynb at main · Graphegon/pygraphblas","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Automatically create interactive architecture diagrams for microservices applications","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"PrintABook: My FREE app lets you print your own books at home!","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"YTerMusic 0.0.6 - A full rust Youtube music TUI with local music caching for offline use.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Comparing 2 approaches of refactoring untested code","not_safe_for_work":false,"locked":false,"body":"","score":8,"comments":[]},{"title":"End of TheIdServer IS4","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Do you know the basic structure of c++ program, know all about this in given link below :","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"In English speaking subs, if your video is not in English, you should indicate that in your submission.  What language are you even speaking?","score":1,"comments":[]}]},{"title":"How to become a developer in 2023?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Four month ago I launched my YouTube channel to teach how to code. And I have been surprised to discover that many of my viewers were asking me: how to become a developer?  \nAfter 10 years of experience as a freelance developer, I have a clear view on how a junior can start his career.  \nI’ve summarize these points:\n\n* Try different langages, frameworks and pick one you like,\n* Dive deep into programming concepts – also into your framework,\n* Your goal is to become a master of your framework/langage,\n* Create a LinkedIn / GitHub profile, synthetic and professional as much as possible (your\n* profile picture has to be serious),\n* Multiply personal projects on your GitHub profile (at least 2–3),\n* Contribute if you can to open source projects,\n* Apply only to jobs that fits with your skills and wishes – that’s the most important condition,\n* If you got interviews for jobs you really want, my best advice is to create a clone project and to present it during your interview.  \n\n\nI got several others points but they are in the video I made this weekend.  \nAt the end I even share my own story and how I became a developer/CTO.  \nBest,  \nGuillaume","score":-3,"comments":[]}]},{"title":"How to implement Auth0 protected route in react-router v6?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"The bubble has popped for unprofitable software companies","not_safe_for_work":false,"locked":false,"body":"","score":2045,"comments":[{"body":"To some extent I'm glad of this. The worst trend in modern tech is the following:\n\n- Found a company on obscene amounts of VC funding\n- Undercut the prices of all your high street competitors and run at a massive net loss for a decade \n- Be so cheap that the competition goes bust\n- Then hike your prices to the moon once everyone else is gone.\n\nI hope this dies","score":2245,"comments":[{"body":"Not just tech. +1","score":780,"comments":[{"body":"This has been the WalMart/Dollar General model for the past 40 years.","score":365,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"How about the other model\n\n* Find a legal loophole that lets you avoid labor, tax, regulatory protections\n* Undercut the existing industry and price just a little cheaper\n* Bonus if you only use contractors instead of employees, call them \"gig\" workers\n* Go bankrupt when governments catch up and fix the loopholes","score":121,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"... for now. It will be back once debt is cheap again and 'stonks go up' has returned.","score":370,"comments":[{"body":"r/Programming discovers business cycles","score":296,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Is the software unprofitable or is the decision to mass hire without a goal, create unoptimized crap, host on overpriced infrastructure, unprofitable?","score":708,"comments":[{"body":"Uhhhhh..... Twitter had literally no revenue model for the first how many years?","score":278,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Just had my morning standup. 3 engineers and 1 QA were laid off. Mostly people who had time zone differences.\n\nI survived, but I'm panicking.","score":153,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I think the other thing in all of this is that companies just expand like crazy when they have VC money.\n\nLike what are 1600 people doing at Asana? Or 1100 people at Airtable?","score":137,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Automatically rewriting code to improve performance, by combining semantic analysis and profiling","not_safe_for_work":false,"locked":false,"body":"","score":33,"comments":[{"body":"[deleted]","score":-9,"comments":[{"body":"Nope. That's why I used a dynamic profiler to measure actual performance changes.","score":4,"comments":[{"body":"In the entire code base as well as unit tests?","score":0,"comments":[]}]}]}]},{"title":"pNew articles on arrays and variables in python is up. Do give it a read and feedback","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"This YouTube Video's Title Updates Every View | Here's How","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Sadly out of sync. Title says 66, video says 68.","score":1,"comments":[]}]},{"title":"Can someone make a fish port for \"commacd\"?","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Creating react app using toolchain | Create react app","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"The C Pointer Card Game - Pointers, Arrays and Strings for Kids","not_safe_for_work":false,"locked":false,"body":"","score":289,"comments":[{"body":"1. Your scientists were so pre-occupied with whether they could, they didn’t stop to ask whether they should.\n\n2. Is this not child abuse??","score":139,"comments":[{"body":"hahah people said the same about the other game we made https://punkx.org/unix-pipe-game/ .. but the jury is still out :)","score":40,"comments":[]},{"body":"OP's next game: [Jump to Conclusions](https://www.youtube.com/watch?v=sDEL4Ty950Q).","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"If step 1 in your card game is \"explain pointers and arrays to a child\" I'm not playing your game.","score":29,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I see you Satan.","score":18,"comments":[]},{"body":"\"For kids\"\n\n[greetings fellow kids](https://giphy.com/gifs/30-rock-sme-how-do-you-1Qdp4trljSkY8)","score":33,"comments":[]},{"body":"I thought it was gonna be really simple, like a kids card game. The first card got me lol","score":15,"comments":[]},{"body":"Hey OP! You allow shipping to Finland, could you allow shipping to Estonia ?","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"With the price of coal going sky high, this looks to be a reasonable substitute as a stocking stuffer.","score":4,"comments":[]},{"body":"This is so cool.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Why the number input is the worst input","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Disagree: WYSIWYG Text editor is the worst","score":0,"comments":[]}]},{"title":"GitHub Copilot Isn't Worth the Risk","not_safe_for_work":false,"locked":false,"body":"","score":254,"comments":[{"body":"Comes down to when is code unique or complex enough for it to be copyrightable. Is fast inverse square root complex enough? Run of the mill argparse block? What about all of the code on stackoverflow, that can sometimes be pretty complex and can for sure be found in many open source projects.\n\nCould be a pretty scary ruling with unintended consequences.","score":141,"comments":[{"body":"What about that one GUID used in the \"only let one copy of this program run at a time\" snippet on stackoverflow that was copied into dozens of programs","score":64,"comments":[{"body":"What is this? Not finding on Google but sounds funny","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"How do people use copilot? I only use it like a smart intellisense/boilerplate that know what and where things go.\n\nI never use the prompts for it. Its usually off.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"At this point I don't give a fuck, I'm simply tired of stupid people writing stupid code building systems that are a nightmare to maintain. If I write good code and people can take that as an anonymous example, I couldn't care less","score":99,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Copilot is doing well when it comes to (simple) unit tests, boilerplate code, shell scripts and stuff like that. It also managed to find some pretty cool solutions to problems that would’ve taken me half an hour to figure out by myself. Very neat.\n\nIt still produces weird, unintuitive or straight up wrong code on some instances though. It has struggled the most with Rust and its borrow/checker rules for me so far. Some code is also not really idiomatic. That’s where you usually refactor it yourself/fix issues. Often it saves quite a bit of time though.","score":5,"comments":[]},{"body":"I bet the risk of an employee manually copying and pasting copyrighted code without attribution is exponentially higher than CoPilot generating copyrighted code without attribution.","score":109,"comments":[{"body":"I may be wrong, but I think organisations will be more worried about this:\n\n&gt; Experts have reported that Copilot often suggests code with security flaws. In one study, researchers produced 1,689 programs with Copilot, of which 40% were vulnerable to attack.\n\nAfter a few decades in the SWE industry I've seen so many cases of \"well I just googled until it worked\". Which I think is sort of fine, because at the very least, most of the people who do this, know it's kind of wrong. Co-pilot is basically google programming with confidence, right? You think that the guided ML is going to be better at picking stuff out for you than you finding random answers on the internet, but what if/when it isn't?\n\nHonestly though, I expect them to build co-pilot functionality directly into VSC at some point. I'm probably going to be wrong about it, but from a SWE mangement perspective right now, I'm having a hard time seeing why you'd buy it. We're all heading into a few years of recession, we already have google programming for free, and, the internet is full of articles about the \"risks\". Times aren't exactly screaming for us to spend money on \"maybe\".","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"AI developers really ought to learn what the word consent means","score":134,"comments":[{"body":"They will never learn until negative consequences are applied","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Data from Quakes 2.0 (using live USGS data) indicates there have been over 9900 earthquakes globally in the past 30 days and over 200 just today! It's totally normal right? Search by magnitude and location, globally.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Totally","score":2,"comments":[]},{"body":"Your numbers show global earthquake frequency up by ~3.6X over normal background numbers, which is significant. USGS reports that there are on average 20K quakes per year or 55 per day.  Your 30 day rate says 330 per day. Also worth noting that the USGS states that there are more earthquakes being recorded since more seismic instruments are being deployed, which is a likely contributing factor but I don't think that fully explains the 3.6X increase factor.  \n\nI would also be curious what the standard deviation is for earthquakes per day over time.\n\nIt would be useful if there was a way to sort the table posted on your link by column.\n\nhttps://www.usgs.gov/faqs/why-are-we-having-so-many-earthquakes-has-naturally-occurring-earthquake-activity-been","score":1,"comments":[{"body":"Thanks for checking it out.  Yes, for now Columns are sorted by latest quake.  It took me about 12 hours to write the application.  We had almost 300 quakes today!","score":2,"comments":[{"body":"Thanks very much for taking the time to write this application!","score":2,"comments":[]}]},{"body":"&gt; but I don't think that fully explains the 3.6X increase factor.  \n\nBased upon?","score":1,"comments":[]}]}]},{"title":"This YouTube Video's Title Updates Every View | Here's How","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Memory Management in Python: 3 Popular Interview Questions","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Honestly, this is interesting (particularly the `is` comparison for integers behaving in a surprising manner), but I'd never hire a developer based on their knowledge of any of this.","score":7,"comments":[]}]},{"title":"TOP 5 must-know SEO skills for every developer","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Thankfully, every developer doesn't need to know SEO.","score":6,"comments":[{"body":"Web development is the only development, surely you have been on the internet long enough to realise that.","score":3,"comments":[{"body":"And not even EVERY web dev. Mostly the ones that do presentational websites","score":1,"comments":[]}]}]}]},{"title":"Considering C99 for curl","not_safe_for_work":false,"locked":false,"body":"","score":387,"comments":[{"body":"The biggest benefit of C99 is \"mixed declarations and code”, aka “declare anywhere”. The C89 requirement to declare all variables at the top of the scope means you often have to separate declaration and initialization, which leads to uninitialized variable bugs.","score":185,"comments":[{"body":"&gt; The biggest benefit of C99 is \"mixed declarations and code”, aka “declare anywhere”.\n\nAs mentioned, this is an example of the standards committee codifying something which had been common practice for decades. All interesting compilers accepted code like that before C99.","score":90,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Really clear this guy cares a lot about the software and is trying to make thoughtful choices.","score":213,"comments":[{"body":"I like how he publicly mentions new committers on Twitter; now that is how you make people feel included.","score":74,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"tl;dr: they decided that allowing all new features of C99 at one time represents a risk, because it might lead to large sections of code being rewritten, causing bugs to be introduced. For now, they cherry-picked a single feature (64-bit data types) to see how it goes, because it is supported by most platforms in the wild.","score":82,"comments":[]},{"body":"C++ style comments is nice too in some cases:\n//\nInstead of \n/* */","score":21,"comments":[{"body":"Yeah it is the first one they mention in potential advantages.","score":16,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Fixed-size types?","score":18,"comments":[{"body":"I wouldn't be surprised if stdint was not acceptable on grounds of platform portability: exact-size integers are optional.\n\nSo stdint only gives you leastN, which is an other name for standard types, and fastN, which I've always found dubious.","score":15,"comments":[{"body":"I'd be surprised if anyone is building cURL for a 12/18/36bit CPU with the various exotic 6bit/9bit char sizes. Those chips haven't been produced since the 70s.\n\nI guess emulators exist. But forcing your project not to adopt standard sized ints due to\n\n&gt; We need to let people cross compile to target a GE-645 emulator so they can show it is 'online'\n\nSeems fairly limiting, and a really niche edge causes that likely isn't well tested.","score":13,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Tools for rewriting Python code","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[]},{"title":"Sold - the commercial version of Mold linker","not_safe_for_work":false,"locked":false,"body":"","score":3,"comments":[{"body":"What a great name for the project!\n\nDisclaimer: I'm not the developer. I don't agree with the way he previously planned to take it commercial. However, I really like the name!","score":8,"comments":[]}]},{"title":"How Sensitive Cloud Data Gets Exposed","not_safe_for_work":false,"locked":false,"body":"","score":10,"comments":[{"body":"\"Improper Access Management\": a good acronym for IAM.  The process of defining policies and applying them to resources can become so abstract that it's difficult to reason about what their effect will be. Especially when exceptions need to be made, new services come online, etc.  If they can be kept simple, it's hard to screw this up, but if many layers are being applied, by teams that don't talk to each other enough, that's a recipe for trouble.","score":2,"comments":[]}]},{"title":"You've heard of big data, now get ready for cozy data","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"https://web.archive.org/web/20220719201313/https://thecynefin.co/big-thick-and-rich/\n\nAlso rich and thick data","score":2,"comments":[]},{"body":"I would also accept \"smol data\", similar emotional valence","score":1,"comments":[{"body":"Yeah, I've often used the term \"small data\". In the big data world they often focus on the volume and velocity of the \"3 Vs\" and forget about the variety. I like to build support for variety - a wide range of small data sets or collections of like digital stuff. Lots of examples here  on RAMADDA - https://ramadda.org/repository/alias/examples","score":1,"comments":[]}]}]},{"title":"This is a handy trick for creating download links","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Tech Videos - Data science roadmap | Web development complete course","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[]},{"title":"Who needs MLflow when you have SQLite?","not_safe_for_work":false,"locked":false,"body":"","score":24,"comments":[{"body":"You're extremely fortunate to earn money modelling data. Your project is the kind of thing I enjoy doing. If you're involved in hiring processes, please fight the artificial barriers placed against PhD and out-of-network hires.","score":6,"comments":[]}]},{"title":"Ray - Way Forward For True Multithreaded and Distributed Programming","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"We are going to run out of data to train our models with","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"My free transcription service powered by open-source Whisper AI","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"How to Write More Reusable Code?","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"Good read","score":1,"comments":[]}]},{"title":"MonoBox: A lightweight mobile music player that lets you play music from your local library on your PC","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[{"body":"&gt;- React\n\n&gt;- Lightweight\n\nChoose one.","score":2,"comments":[{"body":"haha it's react native\nand yeah it's lightweight\nwould appreciate it if you will star my repo as well man ⭐","score":-2,"comments":[]}]}]},{"title":"potato-head.clj - A story translated to Clojure","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Programming eBPF to robustly move packets in the Linux OS","not_safe_for_work":false,"locked":false,"body":"","score":51,"comments":[]},{"title":"The Fundamental Design of PhotonDB","not_safe_for_work":false,"locked":false,"body":"","score":1,"comments":[]},{"title":"Accessibility Week","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Most famous computer book ever!","not_safe_for_work":false,"locked":false,"body":"","score":354,"comments":[{"body":"It is a truly a great book, I learned C from it years ago, and I loved it was short and succinct. However the video fails to mention that most code in the book would probably not compile with a modern C compiler.","score":89,"comments":[{"body":"That's why there's The ANSI C Programming Language Second Edition","score":33,"comments":[{"body":"Which is by far the better book...and probably more famous too, since it reached a much larger audience.","score":20,"comments":[]},{"body":"Joked to be the bible amongst my friends. literally the only book our comp sci professors made us buy.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"&gt; I learned C \n\nI tried to.","score":18,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"My father was the editor for that and is thanked in the forward!","score":26,"comments":[{"body":"Shout out to K3wp Sr.!\n\nWe are not worthy...","score":8,"comments":[]}]},{"body":"This was our book in college. 1996-2000! There was no stackoverflow, just the book, help/man pages. You wventually memorize most things through use.","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"With reason. So dense with information, clearly written and comprehensive.","score":38,"comments":[]},{"body":"Knuth though?","score":16,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Nothing has ever angered me more than the Google Play Store","not_safe_for_work":false,"locked":false,"body":"","score":1477,"comments":[{"body":"Similar experience myself. After arguing pointlessly with someone on a power trip. I resorted to fake updating the app and reported it as fixed and thanked the rep for being so helpful. The updated app was approved (even though nothing had changed).\n\nGoogle isn't known for having competent customer support.","score":967,"comments":[{"body":"&gt;Google isn't known for having ~~competent~~ customer support.\n\nThere, I fixed it for you.","score":480,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I once had a ticket and a rep argues the ticket doesn't exist. Low and behold, after refreshing the ticket didn't exist, anymore. Gave up and their bs customer support.","score":100,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"great read. \n\nits possible that we need new paradigms for getting product to people but its equally possible that we simply need to reject the mega-corporate approach: \"just do as we say even if its nonsensical. nobody can help you and we actually don't care even though there's plenty options to communicate with us. our entire multi-billion dollar company has just one employee and he's the janitor/programmer. he's really a great guy with a rags to riches story that would melt your heart. otherwise, fuck you.\"\n\ni hate platforms. they do the best job of not supplying consumers with what they need while at the same time denying developers an open market. lose/lose.\n\ni'm not sure how aggregation/distribution happens without stores or platforms but i'm sure that having these mega-corporations and their narcissistic CEO's in charge of it isn't the answer.","score":313,"comments":[{"body":"It’s interesting how digital appstores are basically supermarkets all over again. Just with even less competition.","score":52,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Put in patch with slightly altered functionality and resubmit.  It is ridiculous but it works.","score":72,"comments":[]},{"body":"Join the thousands of other developers with the same problem.\n\nMy case with Google was: they banned my Google Play account with the accusation that my app was created to stream illegal content. They also banned my entire Google Ads account because it was used to display ads on said app.\n\nThey didn't ban only the ads that were displayed on this app that supposedly streamed illegal content. They banned my ENTIRE Google Ads account, meaning that I lost the ability to show ads in ALL my other apps and websites.\n\nSo I filled an appeal to Google asking how is my app streaming illegal content. My app not even required internet connection!\n\nSo they unbanned my app and Google Play account when they realized their mistake. But they still kept the ban on my Google Ads account because I \"displayed ads in an app that streamed illegal content\"\n\n/insert confused Jacky Chan meme","score":226,"comments":[{"body":"Accounts getting banned on such big platforms can be pretty bad. I believe some jurisdictions (mainly European, maybe even the EU) are working on legislation towards making it easier (or rather, possible) to appeal such decisions for private citizens (it puts more onus on the proprietor of the platform to provide evidence of supposed violations, I believe). Hopefully, this leads to those platforms having a system in place and at that point it could very well become easier for commercial parties to file such appeals as well.","score":71,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Looks like it's catching fire on Hacker News: https://news.ycombinator.com/item?id=33632468","score":210,"comments":[{"body":"Oh wow haha thanks for letting me know!","score":80,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"The scary truth about AI copyright is nobody knows what will happen next","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Ai debate is probably going to end up like the abortion debate.   \nEven in a perfect world where all the required attributions have been addressed,  \nat what point do we determine whether something new has been created, and is it \n“new” enough?","score":2,"comments":[]},{"body":"Personally, I don't think training AI on copyrighted works (without a license) should be considered fair use unless the model is also used for fair use purposes i.e. for education, research or in a transformative manner (training an AI to recognize or index search, rather than to generate copies.) Training and application of the AI should be considered part of a single overall process, and in each application of the model we should consider the whole process when determining whether or not copyright is being infringed.\n\nEven if the AI is not being used commercially and just being distributed free for personal use, it is still a tool enabling people to breach copyright.\n\nIt's very straightforward to see that we should protect the artists who create valuable work and allow the industry to find a licensing solution that fairly compensates them for that value, doing otherwise would fly in the face of the very principal of copyright. The tech companies behind these AI have access to plenty of funding to pay for licenses, and we don't need to worry about this affecting research because that's covered by fair use. Artists very clearly generate a significant portion of the value here but without copyright protection in this exact scenario they are powerless to negotiate any compensation at all.\n\nI'd point out that nobody is going around feeling like they have a right to train AI on Disney movies, this is very clearly a case of \"small artists can't afford to sue me so I can freely exploit them.\"","score":4,"comments":[{"body":"That reads more like an \"I wish\" than an evaluation of the law. In practice the training and application of the AI are going to be done by different people. Building models from a large set of training data is almost certainly \"transformative\". Testing those models on a separate data set and eliminating models that perform poorly often gets ignored, but would be even less likely to be infringing.\n\nApplication of an AI to generate code, pictures, music etc from a prompt may result in a product that infringes copyright but those are going to have to be challenged individually. \n\nDistribution of tools that can help breach copyright is not illegal. Universal studios challenged Sony/Betamax over VCR and failed. The music industry campaigned against cassette recorders and didn't fare any better.","score":2,"comments":[{"body":"It's just my argument.\n\nI'd argue that the model weights are a derivative (literary) work of the training data, and that fair use covers use of the model. Uses of the model and what it produces must still continue to follow fair use.\n\nIn the same way, an artist who creates a song by sampling another song has created a derived work. They can use and publish it for legitimate fair use purposes. Another artist can't then sample that sample from the derived work and use it however they want, it would still need to be fair use.\n\nIf you had an artist encode a sample into a novel format with the intention for some non-musical use, and published it as transformative fair use, and then another artist apply a process to encode it back into a musical one (and now has a sample that is a distorted version of the original sample,) would this be a transformative fair use of the first artist's work, or copyright infringement because the second artist's use of the original work is still derivative of the first work and is now is no longer transformative?\n\nI'd expect the latter to hold.\n\nOf course, if the second use is transformative of both, it would be fair use.\n\nIn the case of art generating AI, I'd say it will eventually be clear that the model weights are a derivative work of the training data, and the final produced work is a derivative work of the model weights and therefore transitively derivative of the training data, and that therefore that the original copyright needs to be respected in uses of both.","score":1,"comments":[]}]},{"body":"Sadly, the principle of copyright has already gotten pretty lost. The government is not able to provide its constitutionally mandated protections in any meaningful way anymore. The whole system was designed to fight people commercially pirating physical media.\n\nThis will just make it far worse, since it would have all the current internet derived problems of copyright protections, now with a thick layer of messy technical abstraction that would be the dream of every law firm to spend the next decade working out (and getting rich no matter who wins or loses.)","score":1,"comments":[]}]}]},{"title":"Here's how to A/B test a PHP app with feature flags and Amplitude.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"A very simple way to create a Self-Service developer experience for Kubernetes apps","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Taming Tracepoints in the Linux Kernel","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[]},{"title":"Backup your data before the ransom strikes","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"The correct title should have been 'back up your data'.\n\nWe use a multi tier backup system.\n\nThe final tier is glacier which is configured so even we can't  delete/modify the data.\n\nWhen then have jobs that validates it's readable.\n\nBackups are split across multiple cloud providers so hackers will have to breach multiple systems to get to all our backups.","score":2,"comments":[]},{"body":"Ah, this is the main part of the article:\n\n&gt; I appreciate there are better dedicated solutions, and probably what I am going to describe next cuts some corners\n\nShould we start writing about \"Don't write your own backup solution\" as we did for \"Don't write your own crypto\"?\n\nI could not recommend enough **not** to follow the article's workflow. It's dreadful on many levels.","score":1,"comments":[]}]},{"title":"The Backend Architecture of a Python Web App","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Fast-forwarding a Git clone without a full pull","not_safe_for_work":false,"locked":false,"body":"","score":7,"comments":[]},{"title":"Data Analysis: Understanding Its Types And Applications","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"InfoQ: Create Your Distributed Database on Kubernetes with Existing Monolithic Databases","not_safe_for_work":false,"locked":false,"body":"","score":2,"comments":[]},{"title":"Free Pascal Feature Announcement: Function References and Anonymous Functions","not_safe_for_work":false,"locked":false,"body":"","score":94,"comments":[{"body":"Not blaming free pascal but this sounds like news from early 2000","score":59,"comments":[{"body":"Java got that in version 8, around 2014, and I thought THAT was late!","score":29,"comments":[{"body":"Meanwhile, C++11 took 8 years!","score":8,"comments":[]}]}]},{"body":"Who is using free pascal and for what? One of the ERP languages I work in is based on pascal, and I did truly love delphi pascal back in the day. I just can't see myself actually use it for anything now.","score":21,"comments":[{"body":"There is a thing called Lazarus. It is intended to be like Delphi, but multiplatform. Last time I tried to use it, it was neither stable nor compatible to huge amount of Delphi components.","score":10,"comments":[{"body":"I currently use FPC/Lazarus for a variety of GUI and non-GUI projects.  Lazarus and Free Pascal as they currently exist are very stable, generate efficient code and result in compact software distributions that are easy to deploy.\n\nI also extensively use C# which is a better language, but compact, reliable software distribution packages give Free Pascal a clear advantage.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Desktop applications. Sure, nowadays everything must be enhanced with rich web content, where Laz does not chine, but even Qt and Delphi are impacted by this, not only Lazarus.","score":6,"comments":[]},{"body":"Some projects that use Free Pascal with Lazarus: https://wiki.freepascal.org/Projects_using_Free_Pascal.","score":7,"comments":[]},{"body":"HEDGEWARS!","score":3,"comments":[]}]},{"body":"Excellent work of the devs.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"The SaaS Handbook – How to Build Your First Software-as-a-Service Product Step-By-Step","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"The future of content is AI - A Beautiful Mind","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"If you had done any sentiment analysis on what people outside of tech think about AI-generated images, you wouldn't have chosen such a dumb title for this equally vapid article.","score":5,"comments":[]}]},{"title":"Learn how to fuzz like a pro: Introduction to fuzzing","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"jsonhero.io: Enhanced JSON structure visualization","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"MODWIN: A Tool for Inspecting, Modifying, and Building \"Lite\" Windows ISOs","not_safe_for_work":false,"locked":false,"body":"","score":18,"comments":[{"body":"Reminds me of nLite and NTLite","score":1,"comments":[]}]},{"title":"I made a Shopify store where you can add your GitHub heatmap to a shirt with custom colors.","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"Hmmm I do need more plain t shirts","score":7,"comments":[]},{"body":"I've wanted to give drop shipping a shot, but I wanted to add a programming spin to it. I built a custom Shopify &lt;-&gt; Printful integration to allow users to add their own GitHub username and customize the colors. Built on Shopify, with a serverless API powering the image creation and Shopify &lt;-&gt; Printful integration. If you have any questions, ask away!","score":-3,"comments":[]}]},{"title":"Wrapping errors in Go: A new approach","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[]},{"title":"Tech debt is your fault","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"No, it's not!  It's Steve's fault!  I saw him knock over the tech debt container onto the code last night!","score":9,"comments":[{"body":"Steve has been writing tech checks that we can't tech cash for years!","score":4,"comments":[]},{"body":"how the hell is it my fault? I've been fighting demogorgons this entire time! blame Justin! He's the tech guy!","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I would phrase it differently.\n\nIt's not your fault but rather everyone's responsibility.\n\nIn my experience you can easily identify the great develops in your team. They are the ones that will wade in and fix problems in code they didn't write without having to be told to.","score":9,"comments":[{"body":"True, that's a bit of a clickbait title on my end - however when something is owned by everyone, it's owned by no one - hence the \"you\", imho the sooner people understand that it's on their shoulders as well, the better.  \n\n\n\\&gt;  They are the ones that will wade in and fix problems in code they didn't write without having to be told to.  \nI've considered that to be the norm as well, until I found myself being responsible for a product where there has been zero effort put towards eliminating debt over a matter of years.","score":2,"comments":[{"body":"Agreed in that it clearly isn't the norm.\n\nMy experience is that only a small percentage of the team will wade in and fix fundamental issues in libraries.\n\nThe rest of the team will continue to band-aid over the problem.\n\n&gt; however when something is owned by everyone, it's owned by no one\n\nI guess they point I'm trying to convey is the concept of engendering in my team that it's everyone's responsibility to fix problems.\n\nThis also requires that I  give my team the confidence to take risks.  Changing someone else's code is inherently more risky.\n\nWe are very careful not to blame developers for mistakes (unless they keep making the same one) but rather review our processes.\nThis seems to help our Devs take more risks and therefore are more likely to dig in and fix technical debt.","score":2,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This is honestly a good read, thanks for posting. However, in my experience on high quality/performing teams, we do try to prevent tech debt. It’s the PMs/business that is forcing a corner cut here and there that adds up. \n\nStill searching for that ideal development environment.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[It's Chet fault ](https://wiki.c2.com/?ItsChetsFault)","score":3,"comments":[]},{"body":"&gt;Tech debt is your fault\n\nNot necessarily.\n\n&amp;#x200B;\n\n&gt;If not taken care of regularly, you might find yourself either struggling to keep the product afloat or even hating your job altogether.\n\nSimply not true and/or incomplete understanding of complexity.\n\nFirst, someone's understanding of what \"technical debt\" means is open to debate. The severity of the debt is open to debate. And sometimes debt isn't obvious to a developer for *years*, because it is so foundational/implicit that it can be hard to understand even when it is staring you dead in the face.\n\nSecond, the opposite is also true: a dearth of debt likely means you shipped six months too late. There is actually a \"healthy\" amount of debt, in my opinion.\n\nLastly, changing business requirements, acquisitions, or customers and portions of the business doing things you did not anticipate can result in code that was \"debt free\" suddenly becoming a debt-laden hellscape. Debt doesn't always involve developers. It often involves radically changing business needs that render otherwise reasonable decisions obsolete.\n\nFor me, my strategy is:\n\n1. Write the absolute minimum amount of code possible.\n2. Do not gold plate *anything*.\n3. Do not engage in science experiments.\n4. Do not buy into cargo-cult programming fads like microservices or SOAP or esoteric frameworks or obscenely complex \"code complete\" patterns that effectively amount to solutions in desperate need of a problem. Add complexity only as necessary, to solve an obvious problem.\n5. tl;dr be absolutely brutal about simplicity in your program.  Channel your inner Ward Cunningham.\n6. Insist on quality test coverage (preferably mostly integration tests; channel your inner Kent Dobbs). An engineering team cannot reliably evolve code without quality tests.\n7. Delete as much code as humanly possible.  Every line of code in an application that does not serve an obvious utility *right now* is a liability.\n8. Your entire engineering organization should have a process that strives for simplicity.\n9. Your entire product organization should have a process that strives for simplicity.\n\ntl;dr keep it real fucking simple, because you never know when you're going to need to deal with complexity you did not anticipate.","score":2,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It misses the fact that to resolve most technical debr, the people that are removing the debt needs to be smarter and more capable than the people who wrote the poor code in the first place. Sometimes it is the same people, only now smarter than when they started. Other times, the same team that did the original product in 3 years, is asking to do a 3 month rewrite, of the 6 month rewrite, that they were 15 months into and estimated that they were about 70% done with.","score":0,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}