{"name":"rage","description":"","subscribers":403558,"posts":[{"title":"SanLee teacher charged with sexual abuse of students","not_safe_for_work":false,"locked":false,"body":"","score":235,"comments":[{"body":"You ever just see someone’s face and go, yeah that’s makes total and complete sense. Rat looking bastard","score":82,"comments":[{"body":"I just did","score":9,"comments":[]}]},{"body":"I hope that Peter Pettigrew stays in jail for a long long time.","score":13,"comments":[]},{"body":"Remember McLovin? This is him now","score":36,"comments":[{"body":"McLovin some kiddies","score":4,"comments":[]}]},{"body":"dome him","score":13,"comments":[{"body":"What's that mean?","score":3,"comments":[{"body":"It means to crack him over the head","score":4,"comments":[]}]}]}]},{"title":"Biden administration says Mohammed bin Salman should be granted sovereign immunity in Khashoggi civil case | Jamal Khashoggi","not_safe_for_work":false,"locked":false,"body":"","score":394,"comments":[{"body":"The title makes it sound like the Biden admin is making this choice but since he was made a prime minister he literally has sovereign immunity and there isn’t anything we can do, those laws are well established and we can’t just choose to make exceptions like that, there’s a whole process to it that extends beyond the US.","score":207,"comments":[{"body":"I want to know what laws those are because the WH called sovereign immunity a “doctrine”, “customary” law, said the executive “recognizes” it, as a “practice”, and it is a “determination”. None of those things seem like laws clearly written down and documented somewhere. \n\n&gt;\t“the doctrine of head of state immunity is well established in customary international law and has been consistently recognized in longstanding executive branch practice as a status-based determination that does not reflect a judgment on the underlying conduct at issue in the litigation,” it said.","score":25,"comments":[{"body":"Welcome to International Law 101.","score":21,"comments":[]},{"body":"I think the specific law in question here is the Foreign Sovereign Immunity Act that went into effect in 1999.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Weird headline. Kinda baitclick / ragebait","score":72,"comments":[{"body":"Have you noticed which sub we’re in?","score":16,"comments":[{"body":"Ragebait and things that should be raged about are entirely different things","score":13,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"It was reported that his father \"promoted\" him days before the decision to charge him came down. By promoting him he gave his son a position of protection from his role in this killing. The Biden administration doesn't want to anger them(the saudis) any further due to all the ties we have to them for fuel and such. He should be tried and punished for his call to have this journalist killed. He may not have killed him but he facilitated it and he should be punished for that.Nobody should have any immunity when it comes to murder Presidents,Kings,Popes,or any of them.","score":8,"comments":[]},{"body":"ur an ass OP whoever u are. its useless karma points ur choosing over informing people lmao. people are so weird.","score":3,"comments":[]},{"body":"The headlines kind of a lie, he was granted sovereign immunity when he became PM.\n\nThat’s literally the law, Biden didn’t just decide that.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Suburban mom handcuffed, jailed for making 8-year-old son walk half a mile home","not_safe_for_work":false,"locked":false,"body":"","score":821,"comments":[{"body":"Time for the old man in me to talk about how my school was 2.5 miles away and had to walk them everyday","score":336,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He walked 800 metres?? That's not even ten minutes.","score":361,"comments":[{"body":"I walked home from school about a mile down the road every day for 4 school years. I didnt realize how lucky I was to have not been trafficked until I read this article!!! Phew","score":139,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I live fairly close to Waco. I can tell you with great certainty that sex trafficking in this area is would be virtually non-existent once the Baylor Bears football team was ruled out.","score":111,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"They arrested her over *half a mile???* No wonder this country is so fat lol","score":97,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Only a half mile? Where were the police when I was growing up? My school system didn't have bus service if you lived within 1.5 miles of the school.","score":524,"comments":[{"body":"This story is crazy. From the lady that called the police even after the kid confirmed that he lived just down the street, to the cops who said he was at risk of being kidnapped and child trafficked. They literally put her in cuffs and took her to jail for making an 8-year-old walk down a safe street.","score":265,"comments":[{"body":"Obviously the street wasn't safe because that lady was allowed to be there. /s","score":95,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"911 callers for stupid shit have caused a lot of trouble and nothing ever happens to them. When someone is wrongly arrested or shot there’s usually a caller that had no reason to call in the first place.","score":78,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"When I was 8 years old, I walked 500 meters to and from school. This is 800 metres. Come on","score":38,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Heartbreaking tribute after baby ‘tortured’","not_safe_for_work":false,"locked":false,"body":"","score":222,"comments":[{"body":"What is an offensive instrument? Very sad","score":51,"comments":[{"body":"I'm guessing it's just a different way of saying weapon","score":27,"comments":[]},{"body":"Bagpipes.","score":40,"comments":[{"body":"A school-issued recorder in the hands of a 3rd grader.","score":20,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"How could you do this? I can’t imagine even looking at my baby wrong. What kind of monsters do this?","score":36,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Yeah I'm not reading this","score":39,"comments":[{"body":"Same. Clicked to check out the comments and am so glad nobody posted details. I'm out.","score":11,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"God damn dude. Even on those sleepless nights with my kids when they were babies, I couldn't imagine ever hurting them. I just don't know how a person could bring themselves to do it. Fuck these people.","score":12,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Whoever did this is going to get an eternity of suffering and horror","score":16,"comments":[]},{"body":"I don’t think I’ve ever read the word “confronting” used this many times, nor in this way, in any story before.","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Adoptive Mother and Her Parents Charged in 11-Year-Old Girl's Death, Torture and Abuse of Other Adopted Children","not_safe_for_work":false,"locked":false,"body":"","score":136,"comments":[]},{"title":"YouTuber mocks and cosplays as a murdered child.","not_safe_for_work":false,"locked":false,"body":"","score":361,"comments":[{"body":"of course it would have to be someone like Trisha Paytas to do this kind of stuff. I knew she was a horrible person, did not know how horrible she was","score":155,"comments":[{"body":"She's even worse than I thought too some truly vile stuff.","score":43,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"That’s Trisha Paytas. All the disgusting outrageous shit she’s done seems to all be coming out recently and I think that’s wonderful, it’s way past time she saw some consequences for being the absolute worst.","score":101,"comments":[{"body":"I had no idea until I found the recently banned snark subreddit.\nThere is another sub about her crimes up now, I don't think I'm allowed to link it but it's in my post history.","score":27,"comments":[{"body":"trishyland was banned?!? OMG","score":13,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"What a horrible person. That’s disgusting","score":43,"comments":[{"body":"Literally abhorrent.","score":16,"comments":[]}]},{"body":"And to think, she now has a child of her own that she constantly [exploits](/r/TrishylandWifeys/) online.","score":38,"comments":[{"body":"##louder","score":20,"comments":[]},{"body":"Oh God I've been out of the Trisha loop for a while but she is definitely one of those people that should not be having children","score":10,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"How to make someone scream online","not_safe_for_work":false,"locked":false,"body":"","score":0,"comments":[{"body":"This is pathetic. Thought maybe me and my kid could play this game. Not with comms like that .","score":1,"comments":[{"body":"It's a rite of passage. Don't assume he isn't going to hear it somewhere else. Just think of a comeback or mute them","score":1,"comments":[]}]}]},{"title":"The Influencer Who Faked Cancer For Money","not_safe_for_work":false,"locked":false,"body":"","score":254,"comments":[{"body":"What a fucking train wreck.","score":17,"comments":[]},{"body":"She’s an A-grade cunt! Melbourne hates Belle Gibson!!","score":11,"comments":[{"body":"I saw her walking down Gertrude Street not that long ago and she was wearing a turban?","score":3,"comments":[]}]},{"body":"Toe rag of a person.","score":4,"comments":[]},{"body":"This is good content but man their \"viral marketing\", I've seen all three of this channel's videos all over the place","score":2,"comments":[]},{"body":"You mean the one that got *caught*","score":2,"comments":[]},{"body":"#amberturd inspiration","score":0,"comments":[]}]},{"title":"Man In Warren County, Tennessee gets barred from a property, proceeds to set the mountain on fire.","not_safe_for_work":false,"locked":false,"body":"","score":455,"comments":[{"body":"A totally reasonable reaction by a totally reasonable person. Who among us *hasn't* set fire to the land for being kicked out of somewhere?","score":82,"comments":[{"body":"Did that to the living room once. Don’t even think I was kicked out. But i definitely wasn’t invited back","score":7,"comments":[]},{"body":"I myself can’t even count how many times I’ve done it. It’s a normal, *healthy* reaction.","score":8,"comments":[]},{"body":"There isn't a single shred of sarcasm in me when I say, I also have strong urges to set things on fire at any given time of day. This is a *healthy* reaction","score":4,"comments":[]},{"body":"soyboy beta males, duh...","score":1,"comments":[]}]},{"body":"Sounds like he’s got a short fuse…","score":8,"comments":[{"body":"I’m just *stoked* that they caught him.","score":5,"comments":[]}]},{"body":"He knew how the game would turnout.","score":2,"comments":[]}]},{"title":"A Russian aquarium owner in Crimea/Ukraine released dolphins into the black sea to die of hunger and hypothermia","not_safe_for_work":false,"locked":false,"body":"","score":421,"comments":[{"body":"People fucking suck","score":93,"comments":[]},{"body":"This fucked me up way more than I thought it would... whoa. Did these poor creatures die or were they rescued?","score":26,"comments":[{"body":"Need to know","score":3,"comments":[{"body":"Damnit. I normally don't, but this was one of those, go choke a joint down moments and forget about this or your night will be ruined moments, but this reminded me, and now I'm stoned and sad. I really hope these bastards get fucked with the sharpest stick.","score":5,"comments":[]}]},{"body":"There's no way they survived longer than a week or so.","score":7,"comments":[{"body":"It's highly adapted to live in waters of this temperature assuming it's a black sea bottlenose (it appears to be). So it's not going to freeze to death like the title suggests. Feeding would be the main issue as it might not know how to feed on wild fish due to captivity, or fish in the area might have done a seasonal migration and to be present in low numbers. Dolphins don't migrate to escape the cold themselves, but follow fish populations that migrate for that reason.","score":3,"comments":[]}]}]},{"body":"Looks like a Black Sea bottle nosed dolphin to me, so unless I'm neglecting some seasonal importance I don't think hypothermia would be an immediate issue. But if they've lived their entire life in captivity, wild-feeding probably would be foreign and survivability pretty low for a reckless release. Super negligent, but the releasers likely comforted themselves with the possibility of the dolphins surviving, otherwise they likely would have just killed them outright and not filmed it instead of going to the trouble of a poorly thought out release. People are stupid and selfish but rarely evil, poor dolphins :/","score":21,"comments":[]},{"body":"WHY!?","score":10,"comments":[]},{"body":"Russians not really helping their image.","score":7,"comments":[]},{"body":"[removed]","score":15,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Driver has car ripped apart, rammed in road rage incident: ‘He was going crazy’","not_safe_for_work":false,"locked":false,"body":"","score":290,"comments":[{"body":"Crazy video.  \n\nMeth/crack can make for crazy people.","score":20,"comments":[]},{"body":"Emanuel super level headed about that gif he’s okay. Dangerous business driving your car.also shout out that bystander. Gather evidence when you can.","score":20,"comments":[]},{"body":"Emanuel has a super attitude about the whole deal and handled the situation sanely.","score":11,"comments":[]},{"body":"Has to be drugs. Hope they find the guy and he gets to rage out in a prison cell.","score":7,"comments":[]},{"body":"How he remained so calm is beyond me. Cool as a cucumber.","score":3,"comments":[]},{"body":"That’s scary. I’d have defended myself but that’s me.","score":2,"comments":[]}]},{"title":"Since mid-September the Islamic Republic in Iran has killed many demonstrators, including a large number of young females, calling them \"rioters.\" Meanwhile this is what the Islamic Police force has been doing.","not_safe_for_work":false,"locked":false,"body":"","score":303,"comments":[{"body":"Consistent with their previous antics","score":26,"comments":[]},{"body":"Any context? What store is this?","score":10,"comments":[]},{"body":"What a terrible and oppressive place to live.","score":8,"comments":[]},{"body":"Animals","score":6,"comments":[]},{"body":"I consider that the police officers are abusing their authority.","score":5,"comments":[]},{"body":"if this were in the US, I wouldn't be surprised in the least.","score":-24,"comments":[{"body":"Lol shill","score":10,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Handcuffed twins escape house of horrors","not_safe_for_work":false,"locked":false,"body":"","score":359,"comments":[{"body":"Damn, the woman who opened the door was an ICU nurse. Apparently, the mom has a lengthy history wot CPS in Louisiana but had just moved to Texas. The twins didn't even know where they lived currently.","score":104,"comments":[]},{"body":"She goes under the jail","score":25,"comments":[]},{"body":"Wht the hell year are we in where people still think this is ok\n\nEdit. Spelling","score":17,"comments":[]},{"body":"She’s smiling in the fucking mugshot? She didn’t care about those kids, one bit.","score":55,"comments":[{"body":"Judging from the shackled kids forced to eat and drink their own waste, I would assume she didn't care about them without the mugshot.","score":4,"comments":[]}]},{"body":"Burn","score":3,"comments":[]},{"body":"But why?","score":2,"comments":[]},{"body":"[Where was dead giveaway](https://youtu.be/nZcRU0Op5P4)","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Vile couple are arrested after 'Torturing Kitten' throwing it like a FRISBEE off Florida beach and demanding $1,000 to stop~!","not_safe_for_work":false,"locked":false,"body":"","score":490,"comments":[{"body":"* The incident transpired late last month in Miami and saw both suspects arrested by officers on the sands of Sunny Isles Beach - but not before resisting arrest\n\n* The entire altercation was caught on camera by one beachgoer - and the kitten, pictured clinging to life after the ordeal ~!","score":84,"comments":[]},{"body":"I am deeply disturbed and disgusted at the lack of a violent response by witnesses.","score":173,"comments":[{"body":"I hate the iamverybadass type of person but this is genuinely something I don’t think I could stand by and watch.","score":85,"comments":[{"body":"I do too, but there are situations where you should at least attempt to intervene and I believe this to be one.","score":30,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Oh my god I want to throw up. What horrible people.","score":35,"comments":[{"body":"Degenerates.. ~!","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Kitty saved and adopted if you don’t want to read article","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Fucking trash","score":16,"comments":[]},{"body":"I don't understand how these people still have intact bodies after doing things like this in public. I'm not claiming to be billy bad ass here but if you were caught doing that anywhere near my home town you and your people would be savagely beaten up pretty much immediately.","score":39,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Animal abuse needs to be a felony not a misdemeanor","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Veterinarian likely to face animal abuse charges for choking, beating German shepherd","not_safe_for_work":false,"locked":false,"body":"","score":280,"comments":[{"body":"I hope he loses his license and his family leaves his abusive ass. Disgusting.","score":49,"comments":[]},{"body":"I Wonder what’s going to happen to the child who videotaped it and then proceeded to post this.","score":31,"comments":[{"body":"Yeah yikes. No chance in hell that pos isn’t abusive towards everyone in that home. Fuck that guy and hopefully the family gets some protection","score":7,"comments":[]},{"body":"I was thinking this too, like why else would he film it, if not to help the dog out of a bad situation? Kid is brave for this, cuz if the dude is willing to beat the dog, I don’t think he’d have any qualms about hurting his family","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Got to keep this vague, but I know a vet that did some very fucked up things to multiple animals, had many whistleblowers backing up the claims. He went in front of our state vet board, and all that happened was a tiny fine. He also is a very high ranking Scientologist","score":14,"comments":[]},{"body":"What got me was the dog was already crying before he even got near it. Poor thing was clearly traumatized. I hope he goes to a good home. I had a dog that had been abused by a previous owner and he was so badly traumatized, even had disgusting injuries that could never be fixed. He was a lot of work, but he was the best boy 😭 how tf do you hurt a dog like that? You’re supposed to care for them, and it’s so sad because they’ll still be good to you and seek positive responses from you. They know you’re terrible, but they love you so much. Protect the dogs.","score":5,"comments":[]},{"body":"Love the massive gun safe in the dining room. What a cluttered shitshow of a home.","score":3,"comments":[]},{"body":"I hope he leaves earth","score":5,"comments":[]},{"body":"what the fuck is wrong with people?","score":2,"comments":[]},{"body":"Animal abuse, elder abuse , child abuse and mentially dissabled abuse = insert Doom music \n\nThe abuse of the defensless gets me to the point where i generaly dont care about the what legal troubles i will be in , shit like this makes me see red.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"women hits two kids with her car faces misdemeanor charges","not_safe_for_work":false,"locked":false,"body":"","score":334,"comments":[{"body":"Holy shit… it’s not just this article. Look at the suggestions! Utah - 5 year old hit while riding scooter. Utah - 13 year old killed while riding \nscooter. Utah -  Child rides into vehicle on scooter.\n\nUtah… y’all got some driver issues down there…","score":5,"comments":[{"body":"We broke our record for cyclists killed by cars this year","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"How many women hit em?","score":4,"comments":[]},{"body":"So there I was, eating my yogurt","score":10,"comments":[{"body":"Don't forget, she was dicking around on her phone too.","score":2,"comments":[]}]},{"body":"I wonder what trim level that Yukon is as SLE and above come with GMs lane assist. Which means it’s also possible she could have had the technology built into her car to prevent her negligent ass from drifting out of her lane in the first place. If her car had that technology but it was disabled then she should be charged with willful homicide as she took actions to prevent her from being negligent.","score":21,"comments":[{"body":"That's dumb. It would make people who don't buy a car with lane assist culpable for manslaughter.","score":-3,"comments":[{"body":"Which they should be if they drive off of the fucking road and kill a child.","score":8,"comments":[{"body":"Mob mentality. Lovely.","score":-12,"comments":[]}]}]}]}]},{"title":"California Man Fined $1,000 for Drawing Lines on Maps","not_safe_for_work":false,"locked":false,"body":"","score":11,"comments":[]},{"title":"Nurse accused of killing seven babies","not_safe_for_work":false,"locked":false,"body":"","score":580,"comments":[{"body":"Am I missing something here? This happened in 2015 and they’re just now going to trial?","score":89,"comments":[{"body":"They arrested her 3 times and didn't charge her until the third arrest. She's been on remand since 2018.","score":56,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"The twins on consecutive days gutted me. I just can't even imagine being the parents and one of your twins dies out of nowhere and the next day the other one dies too. Ugh this is the absolute worst","score":87,"comments":[]},{"body":"WTF. If she did this, I hope she never sees the light of day ever again. What a frickin psychopath.","score":105,"comments":[]},{"body":"Please be aware you are hearing only accusations. She might be guilty but it is not clear cut. The ward was clearly very badly run and it might be she is a scapegoat. \n\nhttps://www.reddit.com/r/TrueCrimeDiscussion/comments/8wcmnz/shock_as_british_nurse_lucy_letby_is_suspected_of/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf","score":142,"comments":[{"body":"Please have a read of this [article.](https://www.theguardian.com/uk-news/2022/oct/11/lucy-letby-mother-walked-in-nurse-trying-kill-baby-court-told) Very frightening and evil person.","score":14,"comments":[]},{"body":"Uhh sure but it seems like there is a good case for negligence on account of some insulin poisoning so maybe not all but seems like she was the only person who could have done something for some of the kids. Even if it was just negligence on her side and not intentional she should lose her license.","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Do what they do to child murderers in Gilead","score":6,"comments":[]},{"body":"What in the fuck","score":5,"comments":[]},{"body":"Criminologist have long suspected female criminals evade arrest much more frequently than men.","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Man breaks neck in back of police van paralyzing him and they toss him around like he was lying making it even worse. This got my blood boiling.","not_safe_for_work":false,"locked":false,"body":"","score":480,"comments":[{"body":"Wow. If there ever was a chance to save his spine, it went out the window with how they dragged and flung his body.","score":98,"comments":[{"body":"They were using \"traction\" to help him out.\n/s","score":19,"comments":[]}]},{"body":"Someone correct me if I’m wrong but I believe that this is also what happened to Freddie Gray.","score":42,"comments":[{"body":"Your aren't wrong.  But Freddy was intentionally abused with multiple slams on the brakes giving him a \"rough ride\".  And it was only a few days after Baltimore PD had changed their policy to secure, seatbelt,  all transported suspect because others had been injured by rough ride.  One big difference is that they did realize he was badly hurt and got medics in faster, but it wasn't enough to save his life.  All 6 cops charged in the case got off.   \n\nIn this case I think the injury wasn't intentionally caused by a \"rough ride\", but the driver was neglectful and incompetent.  Then the entire crew at booking were also negligent because they assume the worst in all suspects and were thinking he was faking his injuries.  A simple reflex test could have shown them it was a legit injury.  Why they didn't call in a medic to confirm that he was faking it like they thought is super frustrating.  A medic would have told him the injury was real.","score":36,"comments":[]}]},{"body":"JFC that was brutal, I had to stop watching it.","score":33,"comments":[{"body":"I am not too squeamish about things but I couldn't watch this either. The disregard for human life is sickening.","score":13,"comments":[]}]},{"body":"This man was anything BUT a human to these cops.","score":54,"comments":[{"body":"Cops are the only humans to cops, and that's only as long as they keep their mouths shut and stay in line. The sooner people realize that, the bigger the already dwindling chance we can stage of full on autocracy.","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Oh my lord....it's blatantly obvious he is severely injured.  I would have just assumed from the impact sound that he was badly hurt and either left him in his initial position until the medics could get there to put him on a backboard (as long as he could breathe okay like that) or transport him directly to hospital after that impact.  I don't understand the decision making here.  He's obviously not faking anything even though I understand that prisoners do pull fake shit thinking that going to hospital is better than booking.  But it's obvious to me that is not what is happening here.  Poor dude.  This sucks.","score":8,"comments":[]},{"body":"Watching this made my stomach churn. I used to believe most cops were all good and doing the job because they truly wanted to help society. At this point, I’m now cynical towards all police 😟","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"'Lies, deceit, and treachery,' Investigation finds 3 former Stoughton police officers had inappropriate relationship with young woman","not_safe_for_work":false,"locked":false,"body":"","score":290,"comments":[{"body":"She wasn't a woman when this started, she was 15 and groomed by these sickos starting at age 13.  The sad part is they probably won't even be charged, hopefully the state revokes their license to be an officer but I have my doubts and expect that they'll end up in a jurisdiction a couple counties over.","score":35,"comments":[]},{"body":"It wasn't an \"inappropriate relationship\" and she wasn't a \"young woman\". It was rape, and she was a child. Say it for what it is.","score":23,"comments":[]},{"body":"They shouldn’t be able to resign with benefits they should be fired, stripped of any title, blacklisted and prosecuted. It’s a joke that the fraternity of cops will stand behind literal pedophiles and groomers. Shameful","score":11,"comments":[]},{"body":"These asshats need to do actual jail time, and have all future public employment and benefits cut off.","score":5,"comments":[]},{"body":"Something similar happened in my small hometown.  The Asst. Chief of Police was having a very illegal sexual relationship with a 14 year old girl.  She got pregnant, and when it was all about to come out he shot and killed himself.","score":2,"comments":[]},{"body":"I was looking into sex crimes committed by LEOs and I found a study that said out of the time it does happen, they were overwhelmingly underage. They are predators through and through.","score":2,"comments":[]}]},{"title":"Despite child sex abuse complaints, judge orders child to home where crime allegedly occurred","not_safe_for_work":false,"locked":false,"body":"","score":576,"comments":[{"body":"Judge Cashe needs to be permanently removed from office. His judgement is seriously off.","score":104,"comments":[]},{"body":"In what world/universe/dimension is this okay????","score":32,"comments":[{"body":"“Ummm money… yes help me sleep at night”","score":1,"comments":[]}]},{"body":"I am convinced this guy is fucking evil.","score":33,"comments":[{"body":"And drink human blood after vote for Obama?","score":-37,"comments":[{"body":"What?  You Ok?","score":23,"comments":[]},{"body":"Are you high?  I mean what the fuck are you babbling about?","score":3,"comments":[]}]}]},{"body":"Matt Gaetz's house? Or Lauren Boebert's?","score":6,"comments":[]}]},{"title":"3 Ex-Stoughton Officers Had ‘Deeply Troubling' Relationships With Woman Who Later Died","not_safe_for_work":false,"locked":false,"body":"","score":257,"comments":[{"body":"They raped her when she was a child. Raped some other kids. Then harassed and bullied her until she killed herself.","score":79,"comments":[{"body":"Yeah the title really softballs it.","score":34,"comments":[]},{"body":"I’m wondering what the hell are they going to do about that 4th unnamed officer who is now working for a different department. Will they also be recommending his certifications get pulled as well???","score":3,"comments":[]}]},{"body":"This is terrible.  They shouldn't be cops.  Oh wait","score":16,"comments":[]},{"body":"Not a single “good cop” intervened for several years…","score":9,"comments":[{"body":"No such thing as a good cop.","score":5,"comments":[{"body":"My point exactly…","score":6,"comments":[]}]}]},{"body":"Charges? Or another qualified immunity case?","score":4,"comments":[]},{"body":"She only died an adult. She was assaulted as a child.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Mum guilty of selling 6-yr-old for sneakers","not_safe_for_work":false,"locked":false,"body":"","score":31,"comments":[{"body":"Yep that's sickening and white knuckle infuriating.","score":3,"comments":[]}]},{"title":"Toddler found dead in stolen car hours after deadly shooting, police say","not_safe_for_work":false,"locked":false,"body":"","score":481,"comments":[{"body":"Well, hope this guys have the life that he deserve. It's the only thing that I can wish him for.","score":90,"comments":[]},{"body":"I have a daughter the same age... I just simply can't imagine the pain that poor mother is going through.\n\nAbsolutely horrible.","score":49,"comments":[]},{"body":"That poor baby. They must have been so scared and in so much pain all alone. \nI hope their murderer suffers a much worse fate. \nMy heart breaks","score":39,"comments":[]},{"body":"Man, hope he doesn't plan on a fun prison getaway.","score":25,"comments":[]},{"body":"Sat here for 5 minutes thinking of what to comment… and I got nothing else.","score":26,"comments":[]},{"body":"What an absolute monster. He will get what he deserves.","score":3,"comments":[]},{"body":"Absolutely heartbreaking, so very sad.","score":3,"comments":[]},{"body":"Hope he gets what's deserved in prison. Child murderers aren't treated too kindly","score":3,"comments":[]},{"body":"“First and foremost, to pray for this family.”  What is that supposed to do?","score":1,"comments":[{"body":"it's not mean't to \"do\" anything  it's just a way to express solidarity","score":1,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Iranian woman dies ‘after being beaten by morality police’ over hijab law","not_safe_for_work":false,"locked":false,"body":"","score":567,"comments":[{"body":"Nothing says “morality” like beating someone to death!","score":135,"comments":[]},{"body":"Is there any chance in the foreseeable future of the Islamic regime being overthrown in Iran?","score":51,"comments":[{"body":"I really don't know. Khamenei (the supreme leader) is sick and there are talks about the next guy. It's a big deal and will cause chaos, and maybe lead to regime being overthrown or undergo some radical changes.","score":27,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"what kind of person beats a women.  What kind of morals do they have","score":5,"comments":[]},{"body":"Fucking hell, the Islamic revolution really did a number of that country. Poor woman.","score":5,"comments":[]},{"body":"“Let me make my laws from an ancient book about magic man in the sky”","score":32,"comments":[]},{"body":"And then you see westerners get visibly irritated when someone mentions the horrors in the Quran. Really being tricked into being hypocrites all the time.","score":12,"comments":[{"body":"what horrors in the quran are you referring to?","score":2,"comments":[{"body":"So many come to mind: \n\n- murder for apostasy\n- a man is legally allowed to beat a woman\n- Allah calls for the relentless persecution of Jews/Christians\n- constant insults towards Jews/Christians\n- the perversion of the idea of heaven\n- Allah is a self-proclaimed deceiver, and the best of it by his/her own words. Not an attribute I’d associate with the Most High\n- plenty of pagan attributes starting at the kaaba (black cube worship is saturn worship) or the worship of Mariam/Mary\n\nIt’s still very early here in Morocco so I don’t have my whole mind but there is a reason why it’s illegal in any muslim state to leave Islam. A truthful God doesn’t have to coerce you into believing what He says.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"What a great way to promote morals! Beating an innocent woman to death for violating morals. /s","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"French Dentists Jailed for doing thousands of unnecessary root canals and more on hundreds of patients","not_safe_for_work":false,"locked":false,"body":"","score":621,"comments":[{"body":"1000s root canals / 100s patients = 10s of root canals on each patient! Yikes!","score":71,"comments":[]},{"body":"Dentists and auto-mechanics: both absolutely necessary, and both prone to ripping off the patient/ customer. \n\nIf more investigations were done, we’d see *a lot* of dentists be put on notice.","score":64,"comments":[{"body":"Agreed.  It is very tough to find an honest one in either category, when you do, you hold on to them as long as possible.","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Very true. My dad is 61 and has never in his life had a cavity and sticks to his twice a year check ups. Since a lot has happened because of Covid, reschedules, short staffing, he had to go to a different dentist. The new dentist said he had some cavities. Since he’s never had a cavity, he was puzzled. But he was also puzzled because he had seen his regular dentist not long ago for something and he never said he had a cavity. My dad went back to his regular dentist because he didn’t believe it. Turns out he didn’t have any cavities still. If he didn’t go confirm with his regular dentist, the new dentist was going to give him fillings that he didn’t need.","score":17,"comments":[]},{"body":"Yep I had a dentist put in a crown and while she was sizing my tooth she purposely cut into the tooth in-front of and behind the one being worked on. By the time I found out (since she was still my dentist) I needed a root canal on the back one and a crown on the one in-front. Not once in all of the visits did she mention the holes growing in both teeth. It wasn’t until I had a toothache while out of town that I found out what was happening.","score":16,"comments":[]}]},{"body":"5-8 years isn’t long enough. Article mentions a poor woman losing all of her teeth. These two should have the same done to them","score":7,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I hope that the sentence also includes getting a root canal done on every tooth possible while in jail, without anesthetic. Because that shit _hurts_, it's basically torture but legal.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Now imagine how many of them are like this one","score":18,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Toddler starved before tragic death","not_safe_for_work":false,"locked":false,"body":"","score":355,"comments":[{"body":"Sick cunts both of them hope they rot in prison!","score":68,"comments":[]},{"body":"What a beautiful boy.. I just don't understand how anyone could do that to anything, especially an innocent baby. It makes me feel so sick and angry.","score":37,"comments":[]},{"body":"I see shit like this and hug my son a little tighter. How anyone could do such abhorrent things to a fucking toddler is unbelievable. He was 2 years old for Christ sake. An innocent fucking kid.","score":29,"comments":[{"body":"As a mom of a 2 year old, I’m doing that right now. Just read the article and pulled her close. Tried not to cry. These kids are amazing and it just rips me apart when I see shit like this. They’re just kids!!","score":13,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"&gt;Caroline Roberts, from child advocacy group Children at Risk, acknowledged the strains on Child Protective Services but said officials should have acted on Daniel’s situation before it was too late.  \n&gt;  \n&gt;“They are understaffed and underfunded and need more support,” Ms Roberts told KTRK.\n\n...\n\n&gt;Ms Roberts urged anyone who suspects abuse to keep reporting it to DFPS.\n\n...? It must take a special level of cognitive dissonance to work a job like that and not just snap","score":40,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It’s painfully hard to upvote these posts. \n\nEvil, nasty humans.","score":25,"comments":[]},{"body":"[ Removed by Reddit ]","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"And here Texas is, making it even harder on CPS to properly investigate instances of abuse, by ensuring more kids are born into situations line these. Yes, the parents are to blame here, but if this isn’t a case where abortion would have been the better choice, then I don’t know what to tell you.","score":25,"comments":[{"body":"Unfortunately we will see more stories like this as women all over the nation (US) are forced to have children they don't want and for whatever reason won't give up","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"based on the charges it seems like the 'mother' was the one doing the abusing while the 'father' knew about it but didnt say anything","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Woman ‘beaten to death’ while kids watch","not_safe_for_work":false,"locked":false,"body":"","score":430,"comments":[{"body":"My nephew &amp; I had to watch his father put his mum in hospital when we were 5 &amp; 2, we both remember everything. This will affect those poor kids for the rest of their lives.","score":184,"comments":[{"body":"That’s terrible. I’m so sorry to hear that.","score":28,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"What the fuck man... we have no room for these monsters.","score":22,"comments":[]},{"body":"As the former abuse victim of a vile piece of shit, I hope he gets absolutely destroyed in prison.","score":74,"comments":[]},{"body":"How exactly is that second degree murder?","score":39,"comments":[{"body":"Not to be pedantic but because it wasn't premeditated. It was absolutely murder, but he didn't plan it. He flew into a rage and did something terrible but doesn't sound like it was planned.","score":127,"comments":[{"body":"That makes sense, appreciate it","score":33,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"omg.  Seeing that picture with the mom and kids and how happy they all are was a real gut punch.\n\nThose poor kids.","score":18,"comments":[]},{"body":"I can't even click on the article.... FUCK.","score":7,"comments":[]},{"body":"Why were they questioning a 2 year old?","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Pete Arredondo: Uvalde police chief accuses board of ‘lynching’ as he faces firing over ‘failure’ police response to shooting","not_safe_for_work":false,"locked":false,"body":"","score":568,"comments":[{"body":"\"You know, in certain older civilized cultures, when men failed as entirely as you have, they would throw themselves on their swords.\"","score":189,"comments":[{"body":"Didn’t think I’d see a firefly/serenity reference here!","score":44,"comments":[{"body":"It sucks how much of a douche joss whedon turned out to be because gat dang can that mf'er drop some lines","score":25,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Uh, news flash buddy.    In a position of authority,  you exercised poor judgement, and as a direct result people died. \n\nSo yeah, you lose your job for that.","score":62,"comments":[]},{"body":"Wait, the article says he's the \"Head of the School's Police Force\" .. Is that right?! Schools have police forces? Or did the article mean to say \"Town's police force\"?","score":45,"comments":[{"body":"I had been wondering this.  Several articles mention \"school police force,\" so I guess it's correct.  The first school police force I've ever seen was when I went to college.","score":30,"comments":[]},{"body":"Yes, especially in a place like Texas. Most school districts have resource officers from the local city police that is assigned to various locations, but some do actually have their own force.","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"He should call the police to come save him","score":17,"comments":[]},{"body":"This POS really is on a nothing REALITY, takes NO RESPOSIBILITY, HAS NO HONOR, and is a COWARD!!!!","score":8,"comments":[]},{"body":"Damn. Couldn’t imagine what could possibly being worse than being fired for overseeing the biggest law enforcement debacle of the decade and listening to kids getting shot up and murdered while you and your guys stood in the hallways and did nothing. Somebody pity the poor cop for Gods sake!","score":6,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Man who destroyed vast forest wins demise of park","not_safe_for_work":false,"locked":false,"body":"","score":112,"comments":[]},{"title":"Thief tries to steal worker with Down syndrome's first paycheck","not_safe_for_work":false,"locked":false,"body":"","score":44,"comments":[{"body":"Wouldn't have done the thief any good. You can't just go and cash someone else's paycheck, and the employer could have just gotten them a new one.","score":7,"comments":[{"body":"Someone stole the check we sent to our cable company to pay our bill. They crossed out the company name and wrote in their own name, and Bank of America cashed it, and then were less than helpful in fixing the problem, just froze the account for a week and made us open a new one.","score":5,"comments":[{"body":"Those jerks!","score":2,"comments":[{"body":"Yeah, I'm not sure if every bank would cash a check with a crossed out name, but we're gonna switch anyway, cus that was just dumb.","score":3,"comments":[]}]},{"body":"Bank of America is fucking dumb wow","score":1,"comments":[{"body":"Yeah, I honestly couldn't believe they did that. We're at a new bank now.","score":1,"comments":[]}]}]}]},{"body":"Oh my goodness you’re a grown woman now\n\nI know momma\n\nYeah this is rage. To see how happy she was and then try to steal that woman’s happiness","score":3,"comments":[]},{"body":"Probably one of the sweetest moments I’ve seen with people and it all had to be ruined :|\n\nEdit: if the boss wasn’t a stud I would be pissed rn","score":1,"comments":[]},{"body":"1500 selling ice cream!","score":1,"comments":[]}]},{"title":"Officials in Nevada demolish tiny homes built for homeless in Las Vegas","not_safe_for_work":false,"locked":false,"body":"","score":228,"comments":[{"body":"What a fucking scummy thing to do. God damn.","score":19,"comments":[]},{"body":"WTF","score":2,"comments":[]},{"body":"Video unavailable. Got a mirror?\n\nEdit: nvm, found it.\n\nhttps://youtu.be/iqG92uFHjRg","score":3,"comments":[{"body":"OP link just worked for me...","score":1,"comments":[]}]}]},{"title":"Union leaders frustrated by Bank of Canada’s advice for companies not to adjust wages to inflation","not_safe_for_work":false,"locked":false,"body":"","score":239,"comments":[{"body":"Inflation destroy the middle class.","score":17,"comments":[]},{"body":"You have to be really careful with stuff like this because the act of increasing wages to counteract inflation can itself further the effects of inflation. Inflation arises from people buying products at a rate the supply side can't keep up with. Part of what will tame inflation is inflation preventing people from spending excessive amounts of money. It's a ping-ponging action that will bring things back into stability in the near future, and from there work can more easily be done to address problems in the economy.\n\nEconomics is super fucking complicated and hard to think about and make prescriptions for as a layman. I'm probably wrong in some regard in this comment because I'm not an expert in this field and few actually are online.","score":-8,"comments":[{"body":"American companies are posting 25 year record profits. \n\nThere's your inflation. Gouging. Blood from stones.","score":26,"comments":[{"body":"You're just fucking wrong lmao\n\nPopulism is brainrot.\n\nIf you don't believe me just go look at literally any reputable economist. You can trace increases in consumption with increases in prices. This is how the economy works. Use your brain.","score":-18,"comments":[]}]},{"body":"Always some chud who took Econ 101 in community college and thinks they’re an economist. Yes, we all know how supply and demand graphics work. No, this problem is not that simple. The answer isn’t to pass all of the negative consequences on to the middle class. Life isn’t black and white, complex problems can’t be answered with sweeping, over-simplistic explanations. You think they haven’t thought of this? Come on","score":7,"comments":[{"body":"The irony of you accusing me of over simplifying with my community college econ degree while doing exactly that\n\nSorry that I actually listen to people who have authority on the topic instead of dead dictators, niche economists, and morons online\n\nEDIT: To add, this is literal basic wage-inflation spiral. This is not a complicated part of economics. If you just raise wages, the inflation is going to worsen. It's why you don't fix inflation by just printing more money. This is basic econ and you have the fucking balls to act like me stating that you can't just print more money to end inflation is ridiculous.\n\nI literally said in my comment that I could be wrong, as I'm not an expert, but you ignore that shit and go on acting like I'm an armchair econ expert anyways. You didn't actually read or engage with my comment. You just saw that I was critiquing braindead economic positions that you happen to like and got angry, because you're a fucking moron. Piss off and go read some articles you pathetic twat.","score":-1,"comments":[{"body":"Lol","score":1,"comments":[]}]}]}]},{"body":"It's not inflation that destroyed the middle class. It's bad government policy by our lame duck prime minister that did the job rather nicely.  For 2 years people were paid benefits not to work and all this money was created and not backed by any labor or gains and given freely to anyone who had applied for it.","score":-30,"comments":[{"body":"Actually I prefer people just dying because of a pandemic than giving out handouts :)","score":6,"comments":[]}]}]},{"title":"Bobby 'Wolf' Lopez Survives a Near Fatal Experience With NYPD From a False Cannabis Arrest in 2016","not_safe_for_work":false,"locked":false,"body":"","score":63,"comments":[]},{"title":"Wildlife Shouldn’t Suffer Because of Human Stupidity - Freya the Walrus was just living her best life in Norway until the local government decided she had to die.","not_safe_for_work":false,"locked":false,"body":"","score":335,"comments":[{"body":"How about we euthanize tourists?","score":20,"comments":[]},{"body":"Norway's own Harambe-moment. It caused an outrage here when the news broke on sunday.","score":69,"comments":[]},{"body":"I think the media is much to blame, they made here a celebrity her in Norway and it made a lot of people come to see here. And when people wanted close encounters with this wild animal it got aggressive.","score":54,"comments":[{"body":"Did it?  I mean, was there an incident where someone got close and he (is it a he? ) got aggressive?\n\nOr is this:\n\n&gt; Freya the walrus, if anything, was better known for climbing aboard yachts in Oslo’s harbor.\n\nthe real problem.  (climbing on expensive boats and doing damage)","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"They killed her because it was too expensive to move her, now they are making a 20k statue of her from crowdfunding...","score":28,"comments":[{"body":"The risk she posed due to humans not leaving her alone wasn't something you could fix with money. It's why you don't feed wild bears.","score":8,"comments":[]}]},{"body":"Unbelievable. For some half naked summer tourists. Fuck these people.","score":16,"comments":[{"body":"To be fair, the walrus is fully naked.","score":1,"comments":[]}]},{"body":"It caused an outrage and the fishing minister was put before congress for it","score":3,"comments":[]},{"body":"If the government says so then they must be right! /S","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Youth baseball coach (also a cop) removed after rough encounter with opposing players after loss","not_safe_for_work":false,"locked":false,"body":"","score":54,"comments":[{"body":"Anyone think it's weird that the kid is mic'd up?","score":2,"comments":[]},{"body":"I know everything there is to know about that guy from watching a three min news clip.","score":2,"comments":[{"body":"Reddit moment","score":0,"comments":[]}]}]},{"title":"Footage showing nest of eagles moments before their tree is cut down","not_safe_for_work":false,"locked":false,"body":"","score":43,"comments":[{"body":"Thats just sad.   \n\nIsn't cutting down trees with eagle nests extremely illegal?","score":2,"comments":[]},{"body":"There are so many things wrong with this","score":1,"comments":[]}]},{"title":"Iranian Child Brides At Record Numbers","not_safe_for_work":false,"locked":false,"body":"","score":339,"comments":[{"body":"Fuckin sad man","score":104,"comments":[{"body":"3-4 year ago I found out that one of my uncles married his wife when she was fourteen, and she gave birth to her first when she was fifteen, he was 22 at the time. I hated him so much and I still had to sit in family gatherings knowing that. He died last year.","score":75,"comments":[]}]},{"body":"“Fathers are required in law to agree to the marriage of daughters younger than 13”\n\nWtf century are we in ?","score":80,"comments":[{"body":"Hi.  I’m religion, have we met?","score":67,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Actually, father's have to be approving of their daughter's marriage for it to be legal at any age. It causes a lot of problems for women.","score":24,"comments":[]}]},{"body":"It seems that poverty is also driving the parents to give up the children. Just sad.","score":7,"comments":[{"body":"Yea, some people here are idiot enough to make their underage children marry each other, or let them in some cases, that's one horrible thing,  but when it's an older man marrying the child it's, I would say, always a result of poverty of the child's family. and people are getting poorer and poorer.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Fubar.","score":7,"comments":[]},{"body":"Personally, I think there needs to be a global ban on marriage for anyone under 25. Tie it to human rights. It'd be a big step in protecting young people from being forced, or coerced into marriage. There should never be any loopholes allowing for parental permission. Marriage should only be for those who have had time to complete their education.","score":15,"comments":[{"body":"But what about all the 20 year old military boots, who want to marry the girl from the local bar? They’ve got to swoon someone with their 29% APR Mustang.","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Couple charged with using their adopted kids to make child porn","not_safe_for_work":false,"locked":false,"body":"","score":590,"comments":[{"body":"Just like that couple, I think  Australia. She and her husband would foster kids just to sexually assault them. They would move and then foster more kids. Several kids were hurt and I believe they're still not permanently jailed.\n\nVile either way.","score":139,"comments":[{"body":"foster kids have enough to deal with and sickos do that shit to them, horrible.","score":29,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Ugh these monsters were allowed to adopt 2 children. My heart breaks for the children who are suffering under the care of horrible humans like these","score":57,"comments":[{"body":"Yeah, it's easy to single them out in hindsight but how do you go about filtering out people like this from the system? They must've had pristine records to adopt in the first place","score":35,"comments":[{"body":"Shit like this makes it harder and harder for normal people to adopt. In the UK for example, some psycho single dad adopted and then murdered his adopted kid. During the investigation his ex-wife came forward and said that she would have warned social services not to let him adopt if she'd known. So now every prospective adopter has to let social services talk to every single ex each parent has ever had, which is really bloody hard to do in many cases!","score":19,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I just opened reddit as well…. what the fuck has this world come to","score":5,"comments":[]},{"body":"Fucking perverts.","score":4,"comments":[]},{"body":"I hope they end up in general population with no additional protection. Put them there at least 2 weeks &amp; the problem should itself out.","score":17,"comments":[]},{"body":"These two should be shot","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Austrians expressed shock and anger this week over the suicide of doctor who had been the target of a torrent of abuse and threats from anti-vaccination protesters. She had long been the target of death threats because of her criticism of the widespread anti-lockdown protests of 2021","not_safe_for_work":false,"locked":false,"body":"","score":77,"comments":[{"body":"Fake News. She was just bat-shit crazy. It's pretty common amongst the easily brainwashed left.","score":0,"comments":[]}]},{"title":"Hijab Protester Beaten Before 'Confession' Aired On TV, Says Rights Group","not_safe_for_work":false,"locked":false,"body":"","score":282,"comments":[{"body":"That is heartbreaking.","score":14,"comments":[]},{"body":"[removed]","score":21,"comments":[{"body":"You want the person sterilized?","score":13,"comments":[]}]},{"body":"Sounds like an idiot to me.. you live in the wrong part of the world...","score":1,"comments":[]}]},{"title":"Loveland mother filed for protection order against suspect at least twice before her death","not_safe_for_work":false,"locked":false,"body":"","score":189,"comments":[{"body":"This is a tragedy although I do not think the protective order would have stopped her murder.","score":21,"comments":[]},{"body":"Wish I was surprised but it *is* Loveland.","score":9,"comments":[{"body":"Right? Loveland police are great at consistently letting down the people they’re supposed to protect and serve. \n\nEdit: They are quite effective at serving the people with dead dogs and beaten elderly though.","score":8,"comments":[]}]}]},{"title":"Angry Boss Calls Into C-SPAN Show To Trash Union Workers","not_safe_for_work":false,"locked":false,"body":"","score":174,"comments":[{"body":"Is this what Patrick Bateman would sound like in 2022?","score":30,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Calling unions solely Blue Collar is next level, I'm a toxic piece of shit that yells at the television.","score":11,"comments":[{"body":"I'm a Senior Product Cad Designer for a major automotive maker in the US, about as white collar as you can get, constantly training, updating my skills, constantly learning new software and techniques and (wait for it...) I'm in a union....the (drumroll) UAW no less. I care a great deal about the quality of my work and so do most of my colleagues. This twatwaffle knows jack.","score":3,"comments":[{"body":"Exactly, I'm in the studio mechanics union (film and video industry), even NASA has a union.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"Call From:  FLORIDA\n\nshockedpikachu.jpg  \n\n\nHe didn't have a question, he just wanted an audience for his poopy diaper tantrum.","score":7,"comments":[]},{"body":"What are the odds that this guy is divorced and his kids don't talk to him?","score":33,"comments":[{"body":"Oh god,   no chance he’s not on at least his 3rd wife.  I can’t imagine anyone having to listen to that self righteous asshole for more that a few years before they’re ready to jump off a bridge or call the divorce lawyer.","score":11,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"\"fuck the blue collar workers and their unions because I can't put laminated flooring down in my highrise condo\" is about the take i'd expect from this goofy fuck.","score":35,"comments":[]},{"body":"This is the voice of an asshole if it had a larynx.","score":9,"comments":[]},{"body":"Sorry that your HOA won't let you do substandard construction work on your condo. I'm sure that's because of bribes to the city inspectors office.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"‘Counter-terror police wrecked my life looking for Sir Kim Darroch leaker’","not_safe_for_work":false,"locked":false,"body":"","score":195,"comments":[{"body":"Damn, he was recovering from Cancer surgery when he was raided and had to run to the bathroom with diarrhea multiple times while being interrogated at his home...with the cops crowding into the bathroom while he used the toilet to make sure he wasn't flushing evidence I imagine...fucking horrific.","score":31,"comments":[]},{"body":"https://archive.ph/8J3nQ","score":11,"comments":[]},{"body":"This was a political hit because of Johnson's fragile ego.","score":8,"comments":[]},{"body":"Can't read it","score":2,"comments":[{"body":"https://archive.ph/8J3nQ","score":1,"comments":[{"body":"The text won't populate for me","score":1,"comments":[{"body":"[removed]","score":1,"comments":[]}]}]}]}]},{"title":"This Should Ruffle Anyone's Freedom Feathers","not_safe_for_work":false,"locked":false,"body":"","score":139,"comments":[{"body":"It’s a fuckin 2 hour video!! Someone tell me what I’m supposed to be angry about.","score":57,"comments":[{"body":"That OP expects people to watch a 2 hour video","score":39,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"“you can not be in the roadway” casually j walks in front of oncoming traffic then proceeds to have a conversation with someone who is completely stopped in the roadway to ask about benefits/pay of his job. oh and that person was on the phone while operating a vehicle not sure if that’s legal or not where they’re at.","score":17,"comments":[{"body":"“You’re obstructing traffic” as he blocks the roadway with his car and then blocks the parking lot entrance with his body. \n\nFuck cops.","score":5,"comments":[]}]},{"body":"The dog was never put into care and was found dead a couple days after, it got hit by a car in the street. \n\n[link](https://www.wsoctv.com/news/local/gastonia-police-release-video-veterans-arrest-that-shows-officer-stunning-dog/FZUMDNUVEJFFPITL7EXFAP2MXM/?outputType=amp)","score":40,"comments":[{"body":"Motherfuckers","score":21,"comments":[]},{"body":"This breaks my heart. He was without his Dad, afraid and no help for 2 days and ended up dead bur to neglect and abuse of power. They could have asked him to collect his dog before apprehending him","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"For those who don’t want to watch the whole thing. \nThe first chunk establishes a cop who stopped him and warned him about being on the concrete median. He was walked to a parking lot nearby and they spoke of veteran assistance and the like. The cop also stopped and chatted with a dude in the road about hiring in this section, I believe. \n\n18 minutes in we have the female cop telling him he’s going to be arrested and his dog taken by animal control. When he is asked to take out his ID, he has his veteran ID, which many said is legal, but they refused it. His regular ID is out of date and he’s trying to clarify when he is grabbed and shoved against the car, setting his service dog into work mode to try to get to his handler and calm him. \n\nAbout 30 minutes in, we get the camera footage from the male officer (I believe same fellow from the beginning but don’t quote me), and he has the outside view of the man being pushed against the car. He is saying, “call your dog off” as the dog is trying to do her tasks, then the cop says, “she bit me,” from clearly several feet away on video. The dog is tased and bolts off. No one makes an effort to recover his dog and he is being clear that she is a service animal, yet no one even tries. \n\nYou can also plainly see on video they said he wasn’t cooperating getting out his ID, but it’s clearly in his hand while in cuffs.","score":3,"comments":[]},{"body":"Dogs tail is fucking waging, waiting for a treat. \n\nFuck these pigs.","score":22,"comments":[{"body":"The dog was working and calm and the other cop said he was bit somehow from five feet away. It’s clear as day on video even with the cuts they made.","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Man left 3-month-old Husky puppy with mouth taped shut inside hot car while he gambled at Las Vegas casino","not_safe_for_work":false,"locked":false,"body":"","score":433,"comments":[{"body":"Holy shit that is disgusting. Poor thing, it’s crazy that he survived, I hope this sweet puppy finds a family who treats him much better, This makes me want to cry","score":72,"comments":[]},{"body":"Just why?\n\nWhy have a dog?\n\nWhy have it in the car?\n\nWhy leave it in the car to gamble? \n\nWhy????","score":59,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"For anyone who doesn't know dog biology.  Dogs do not have sweat glands, just like most other fur covered animals.  Their major mechanism for cooling off when overheating is evaporative cooling by panting.  Evaporating saliva on the tongue takes heat from the blood flowing through it like a radiator. When we see cats and dogs  hang their tongues out of their mouth, the animals are really trying to cool off.  By taping the dogs mouth shut, this asshole made it even harder for it to cool off.","score":33,"comments":[]},{"body":"Fucking. Piece. Of. Shit.","score":68,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"The tape makes me think life sentence. You don’t get to be in society buster!","score":20,"comments":[]},{"body":"[removed]","score":95,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"[deleted]","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"There is video of him getting arrested. He had NOTHING to say. He knew he was an asshole and got caught being an asshole.","score":8,"comments":[]},{"body":"People who can do things like this genuinely do not deserve to live in a modern society. I wish we could just kill these people off and be done with it.","score":24,"comments":[{"body":"Yeah, but tape his mouth shut and leave him in the car in this heat...","score":24,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Inside hellhole where dad kept wife, 2 kids","not_safe_for_work":false,"locked":false,"body":"","score":19,"comments":[]},{"title":"Mum’s sick note before killing three kids","not_safe_for_work":false,"locked":false,"body":"","score":15,"comments":[{"body":"The state killed this woman and her children.\n\nShe suffered from depression and couldn't afford treatment, nor was she allowed to work.","score":5,"comments":[]}]},{"title":"4 children dead in Fairbanks after 15-year-old shot 3 siblings, self, troopers say","not_safe_for_work":false,"locked":false,"body":"","score":426,"comments":[{"body":"Wow, this is the first story I've ever heard of a sibling pulling a murder/suicide on his own siblings. This is heartbreaking.","score":121,"comments":[{"body":"Surprisingly, this was a lot more common in the 80s and 90s.","score":11,"comments":[]}]},{"body":"What would make a 15-year-old do this? This is so tragic, the parents just lost half of their kids...","score":59,"comments":[{"body":"Having 8 kids must be rough not only for the kids but also for the parents...","score":42,"comments":[{"body":"As someone whose mother with four children married someone with four children , it is completely traumatic for everyone involved.","score":10,"comments":[]}]},{"body":"Usually when something like this happens the child's upbringing is where a tragedy like this brews up.","score":11,"comments":[]},{"body":"My immediate guess would be that the kid was doing more of the parenting than the parents and was not doing very well with the situation(a bit of an understatement but you get the point)","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Those parents are gonna have it rough. Fuck.","score":42,"comments":[{"body":"And they still have 4 kids to care for, in the aftermath of this tragedy.","score":12,"comments":[]}]},{"body":"I’m assuming gop will now say We need to arm siblings!","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"‘Night of terror’: Female inmates raped when male detainees bribed guard, lawsuit says","not_safe_for_work":false,"locked":true,"body":"","score":588,"comments":[{"body":"Imagine having a set amount of money in your head that would somehow convince you to let a bunch of violent men rape women for hours. PRISON money too so not alot. \n\nSome people just arent human.","score":189,"comments":[{"body":"No, they’re human alright. It’s only humans that do these vile acts.","score":62,"comments":[{"body":"I mean… other animals rape, to death even, but I do get what you mean.","score":31,"comments":[{"body":"Oh, they absolutely do. But they don’t put thought behind it like humans do. \nThat’s the really disgusting thing, isn’t it? When animals rape, nobody blames them. They don’t have the mental capacity to understand moralism and determine what is ethical and what is not. \nWhen humans do it, they know full well what they’re doing (at least, in most cases). \nI’m honestly baffled as to how misanthropy isn’t more common, or at the very least societally acceptable.","score":31,"comments":[]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"You gotta be a special kinda fuckin moron and piece of shit to 1. Do that in the first place and 2. Think your stupid ass is gonna get away with it","score":38,"comments":[]},{"body":"Only $1000 to let 8 women be tortured all night…","score":29,"comments":[{"body":"*28. 20 filed a lawsuit followed by another 8","score":12,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"This is one of the most terrifying things I can imagine. These horrible things happening to you and you see the ones that are supposed to protect you in on it.  Fuck these guys!","score":26,"comments":[]},{"body":"I didn't know co-ed prisons existed, holy shit.","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Death penalty","score":44,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"There was a 2 year old in the back seat of that Houston road rage shooting from yesterday","not_safe_for_work":false,"locked":false,"body":"","score":70,"comments":[{"body":"I was hoping to pop in here and see that they got her","score":1,"comments":[{"body":"They got them yesterday. It's in the article.","score":2,"comments":[{"body":"Uplifting news!","score":2,"comments":[]}]}]},{"body":"Okay? That doesn't make it worse. It was already horrible to begin with.","score":-12,"comments":[{"body":"It does though","score":3,"comments":[{"body":"How? A child's life is worth more? Nope.","score":-1,"comments":[]}]},{"body":"Are you trolling? It's worse for many reasons:  \n  \n1) children are worth more to society than an adult (unless this guy was in his way to cure cancer).  \n2) a toddler is more likely to die if hit by a bullet than an adult man.  \n3) this can be more emotionally damaging to a toddler than an adult man.  \n4) just the simple fact that there was more than one person in the car makes it worse.  \n  \nEDIT: formatting","score":1,"comments":[{"body":"Yeah more people being put in danger is worse, but it's not worse cause it's a kid. \n\nHow is it more emotionally damaging, I know of many people in wars who clear suffer PTSD. You don't know anything about that child, he could be the next drain on society for all we know... Also currently a toddler isn't contributing to society. \n\nChildren aren't more or less important than any other person just because they are children.","score":2,"comments":[{"body":"It's not necessarily that they are more important. It's because they are more innocent. A child that young has no control over anything.","score":2,"comments":[]}]}]},{"body":"Yes it does","score":0,"comments":[]}]}]},{"title":"Pennsylvania State Trooper charged with felony animal cruelty - \"after hitting a loose horse with a patrol vehicle multiple times and pinning it to the pavement, where it was then euthanized\"","not_safe_for_work":false,"locked":false,"body":"","score":640,"comments":[{"body":"Wait wtf so no footage because you can only request footage within 60 days of the incident. What if the person requesting did not know this??","score":104,"comments":[{"body":"PA state troopers are scary as fuck because of their insanely long track record of abuse of power.","score":71,"comments":[{"body":"So very much on brand.","score":21,"comments":[]},{"body":"I got pulled over by one. I never got to say a word. He basically said $180 now or fight it in court and lose $360. If I can help it I’ll never drive in PA again.","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Pa state troopers are the fucking worst. Sitting on empty 3 lane highways in their souped up dodge chargers just waiting to get your ass. Never seen more people pulled over for speeding as I did in Pennsylvania, in a 70 mile stretch I saw 6 people pulled over","score":50,"comments":[{"body":"Don't ever drive north on 71 through Ohio just north of Cincinnati/Lebanon then.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Must have feared for his life","score":33,"comments":[]},{"body":"Euthanized? Sounds like they just shot the poor thing and don't want to say it.","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Jackass I hope he comes back as a horse in his next life. Unforgivable","score":7,"comments":[]},{"body":"ACAB","score":47,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Cincinatti man murders 3-year-old by throwing the toddler off a bridge; victim's father attacks the suspect in court","not_safe_for_work":false,"locked":false,"body":"","score":46,"comments":[{"body":"This fucking idiot killed Nyteisha Latimore and her 3yo because she had a miscarriage. The miscarriage had his DNA in it and he felt insulted. He told someone that because “she killed his baby” he was gonna take revenge on her living son. Stupid fucking son of a bitch. I hope that bereaved father punched just the right angle that your neck pain will never go away. \n\nThey’re seeking the death penalty for him. He is the reason that I won’t vote for the end of the death penalty.","score":8,"comments":[]},{"body":"I know they can’t just let the father beat this guy up, but I would walk over slowly","score":8,"comments":[{"body":"I'd fall. Ideally in front of the others. \"Damn it, two left feet...\"","score":3,"comments":[]}]},{"body":"If he got injured by the attack, then good","score":1,"comments":[]},{"body":"I hope when they execute him the poison dose is wrong and he slowly and painfully dies from sepsis.","score":1,"comments":[]},{"body":"If I was one of the cops, I think I'd \"accidentally\" fall over and not be able to stop the guy","score":1,"comments":[]}]},{"title":"Family says Alvin ISD mishandled investigation of alleged sexual assault of special needs high school student: The mother told KPRC 2 that Janie has the cognitive function of a child no more than 6-years-old and, because of that, she had instructed staff at the school to supervise her at all times.","not_safe_for_work":false,"locked":false,"body":"","score":180,"comments":[{"body":"Apparently she was molested by the same student, days before she was violently attacked and raped. Why wasn’t the issue escalated then?","score":27,"comments":[]},{"body":"I’m a sped teacher for students with severe needs. I mostly have boys but the couple girls in my class who are preteens ask for reassurance for one thing. One on one support for the entire school day. Of course, we talk about the academic and behavior needs but I always figured this was one of the contributing factors/fears parents have and why they are so adamant.","score":19,"comments":[]}]},{"title":"Exclusive: Hyundai subsidiary has used child labor at Alabama factory","not_safe_for_work":false,"locked":false,"body":"","score":343,"comments":[{"body":"I know the UAW isn't perfect, but there's a reason most of the foreign brands that have plants here build them where it doesn't have any sway.\n\nWhen I was a kid and somebody's parents worked at Jeep or GM, that meant a good union job.","score":43,"comments":[{"body":"Bro my grandfather’s production bonus in the 70 or 80s or some shit was a fuckn Roley ffs worked for GM not sure what role","score":6,"comments":[]},{"body":"i saw a doc on this year sa go , they are letting chinese build factories here and run it with a few americans and mostly chinese as they dump a lot of money into poor towns . it didn't end well for the americans a lot of people got hurt and fucked over .","score":1,"comments":[]}]},{"body":"A 12 year old working on a car assembly line? Holy shit they’re lucky the child didn’t get injured or die. \n\nAnd who knows how many cars are going to have failures due to a child stamping the metal and assembling portions of it","score":70,"comments":[]},{"body":"https://www.employmentlawhandbook.com/employment-and-labor-laws/states/alabama/wage-and-hour/child-labor/It sounds like somebody was trying to do the limited allowance subset claim for 12 year olds.Probably gotta do some digging for emails; etc.Edit: the Indiana senator wants to scrap the laws. The one that has minors working at a ski resort.https://www.salon.com/2021/11/03/have-new-idea-to-fix-labor-shortage-loosen-child-labor-laws/https://conversationalist.org/2022/02/09/republicans-want-to-solve-the-labor-shortage-problem-by-putting-children-to-work/https://www.commondreams.org/news/2021/11/02/rather-pass-wage-increases-gop-legislatures-move-weaken-child-labor-lawsCanada has been having the same issue with several conservatives wanting to add more child labor. (Even at hospitals.)","score":11,"comments":[]},{"body":"You should assume every product build under capitalism was at some point worked on by a child or slave labor, and not only tech product.\n\nSaying the contrary is a lie.","score":4,"comments":[{"body":"That’s not what “no ethical consumption under capitalism” means. If I grow food and sell it to my neighbor they know how it was produced. Your point only applies if you’re buying mass produced, factory products.","score":1,"comments":[{"body":"that was implied of course, but then again, you still use hoes and plastics that was produced with dubious methods in your garden","score":1,"comments":[{"body":"Ah I see","score":1,"comments":[]}]}]}]}]},{"title":"In Macau, all Philippine passport holders, and only Philippine passport holders are required to a daily NAT.","not_safe_for_work":false,"locked":false,"body":"","score":9,"comments":[]},{"title":"Mississippi police chief linked to racist recording — In a recording obtained by MCIR, a Mississippi law enforcement officer can be heard bragging about killing 13 people in the line of duty, saying, “I shot that n----- 119 times, OK?”","not_safe_for_work":false,"locked":false,"body":"","score":472,"comments":[{"body":"So it turns out he was spewing all that hate to a BLACK officer that used to work under him. \nWHAT THE FUCK. Mississippi is a terrifying place. \n\nhttps://www.google.com/amp/s/www.wlbt.com/2022/07/20/fired-lexington-police-chief-out-job-after-racist-expletive-laced-recording-is-leaked/%3FoutputType%3Damp","score":66,"comments":[{"body":"He must have thought he was talking to \"one of the good ones\".","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"The vote to remove him was 3-2… Pathetic.","score":62,"comments":[{"body":"He, I was pleasantly surprised the majority voted to remove him.\nI wonder if the alderman Charles Simmons is freinds with SCJ Clarence Thomas...","score":1,"comments":[]}]},{"body":"Asked whether he killed 13 people in the line of duty, he replied, “That’s something we don’t discuss, period.”\n\nWell we got ya on tape there buddy and it indicated that was a lie.","score":12,"comments":[]},{"body":"Where does he think he is, in a John Grisham novel?","score":7,"comments":[]},{"body":"That white Chief sounded like a plantation owner talking down to one of his slave workers. \n\nAnd the fact that the vote to get rid of him wasn’t unanimous goes to show you. \n\nSystemic racism and bigotry are alive and well in America.","score":31,"comments":[{"body":"And this is why every single House Republican voted against a Neo Nazi probe of law enforcement and the military. They know.","score":10,"comments":[{"body":"Not only do they know, their existence in politics depends on those people.","score":3,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"title":"Indiana attorney general says he is investigating doctor who treated 10-year-old rape victim.","not_safe_for_work":false,"locked":false,"body":"","score":21,"comments":[{"body":"Everything about this horrible case makes me hate this country even more. \n\nSeriously, just. What the hell.","score":5,"comments":[]},{"body":"Attorneys are scum.","score":1,"comments":[]}]},{"title":"‘They’re burning our crops on purpose’: Ukraine says Russia deliberately torching grain fields","not_safe_for_work":false,"locked":false,"body":"","score":533,"comments":[{"body":"This is classic war strategy by Putin.  It is much harder to fight when you are weakened by starvation.   Controling someone's food supply is controlling their life.  \nThis isn't a \"special military operation\" it is War!","score":51,"comments":[{"body":"It’s a classic war move, but it’s not just effecting Ukraine. Maybe that’s the point, he thinks the rest of the world will just let him have Ukraine so they can have food.","score":22,"comments":[]}]},{"body":"There does not seem to be any rules of engagement. War crimes are for smaller, poorre nations.\n\nThere used to be a United ?nations org of some sort, is it still around?","score":30,"comments":[{"body":"They can't do much when the instigator has veto rights against any intervention 🤡","score":16,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Warlike actions taken during actual war, Reddit shocked, more at 11.","score":9,"comments":[]},{"body":"Because the prices across the globe weren’t already too high. Putin needs to be captured and held in an ultra high security prison","score":29,"comments":[]},{"body":"I mean… it’s Russia. Scorched Earth is kinda their bread and butter.","score":17,"comments":[]},{"body":"No shit it’s fucking war?!!!","score":6,"comments":[]},{"body":"Burning the crops is an old time war strategy. It's fucked up but it's war. When you're losing or struggling in a fight for your life situation you're going to go for the balls. Morals don't exist.","score":13,"comments":[{"body":"I am just a spectator, but from my perspective Ukraine appears to have morals.\n\nAnd they are very much fighting for there life.","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Angry and heartbroken Uvalde parents flood school board meeting with demands for new leadership","not_safe_for_work":false,"locked":false,"body":"","score":710,"comments":[{"body":"Confused German asking: Will this tremendous shitshow just go on forever or will at some point some third party, maybe federal authority, maybe private lawyers, step in, enforcing a real investigation and liability? From here it seems police and local administration are just sitting out the scandal, covering each others asses, waiting for the powerless parents to back down at some point.","score":104,"comments":[{"body":"&gt;From here it seems police and local administration are just sitting out the scandal, covering each others asses, waiting for the powerless parents to back down at some point. \n\nYeah that's basically small town American politics for you.  The political power is well enriched in the community, politically, socially, and economically.  There's going to have to be a mini revolt of the town before anything is done.","score":32,"comments":[]},{"body":"It won't go on forever.  At some point the locals will tire and the news media will find something new to cover.\n\nLocal police have a lot of power in the US - in states with Police Unions there is nothing that can be done against bad cops or poorly run departments.","score":22,"comments":[]},{"body":"Don’t move here friend, it’s a shit show on wheels and it’s on fire","score":8,"comments":[]},{"body":"It is embarassing how these America town operate. Politics and what makes them look good is all that matters to these so- called leaders. They offer prayers, but not actual concrete solutiolkns. Like the first and most basic thing ...FIRE THE POLICE CHEF! \n\nBut this is America today....\" I don't care about you just me\"","score":3,"comments":[]},{"body":"It will go on until the republicans take the house and Senate and gerrymander every state until the democrats never win again. Then it will be illigal to talk about this stuff and everyone in American will have to pretend the GOP are gods own superior party never to be questioned.\n\nSomething like that idk","score":39,"comments":[{"body":"yup. and it's scary as fuck when you have zero ways of stopping this. Just voting means fuck all unless you are conservative, then that shit really works.","score":10,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"Shut down their police force and build one from the ground up that serves people not corporations","score":56,"comments":[]},{"body":"I hope those police can’t go out in public while off duty there without someone getting all up in their asses letting them know what a twat they are. And if any of them decide to move anywhere else, I hope someone makes sure to let whatever community they try to blend into know about it, so they don’t ever stop being told what a bitch they are.","score":6,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Now if only something were to actually happen because of it. Fuck our world sucks","score":9,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"NBC 7 Investigates: San Diego Police Face Scrutiny Over Woman’s Murder - neighbor interviews, dispatch records, 911 call timestamps and surveillance video all gathered by NBC 7 Investigates show the calls for help started nearly 12 hours earlier.","not_safe_for_work":false,"locked":false,"body":"","score":271,"comments":[{"body":"Police here are notorious for not responding to calls. Not at all surprising","score":29,"comments":[]},{"body":"I worked security at a bar, we called for a patron that was getting asked to leave that was threatening us with a gun. Took three hours to show up. When I asked why, they refused to answer. San Diego police is a fucking joke. Fuck SDPD","score":3,"comments":[]},{"body":"This is exactly why I am so grateful for the 2nd amendment. \n\n\nFor those Redditors that so proudly state that they don’t own a gun, do you honestly think the police will be there to protect you? Stories about lack of police response has become a daily occurrence.","score":10,"comments":[{"body":"Especially when your mayor defunds their Police while upping their armed guards. \nhttps://www.forbes.com/sites/adamandrzejewski/2021/07/20/democratic-mayors-defunded-their-police-while-spending-millions-on-their-own-police-protection/?sh=4e528508d86b","score":0,"comments":[]},{"body":"I’m glad you support defunding the police too haha f those guys they’re useless.","score":1,"comments":[]}]},{"body":"When you defund the police department and there is no Overtime this is what you get. Less paperwork to fill out.","score":-3,"comments":[]}]},{"title":"Well Known Anti Vegan Public Figure Argues For Pedophilia for 10 Minutes","not_safe_for_work":false,"locked":false,"body":"","score":131,"comments":[{"body":"Someone did their \"own  research\". I really hope no one actually listens to this and thinks it's facts.","score":18,"comments":[{"body":"At least 1000 upvotes on that, and youtube lets it stay up. It makes me sick.","score":5,"comments":[]}]},{"body":"[deleted]","score":11,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I couldn’t even get a minute in. Speaking as a woman with a natural hourglass figure that I never worked to get, and having never had a kid, I can say with authority that this guy is fucking full of shit. \n\nAgain, I’ve never had a kid. But yet, I have been asked by men no less than ten times throughout my lifetime, after looking at my body, \n\n“How many kids do you have?” \n\nKnow how many have tried to mansplain to me that that couldn’t possibly be true, that I MUST have had children? Four. \n\nNo, dumb motherfucker. I’m just naturally hot.","score":7,"comments":[{"body":"That's the most based thing I've ever read. I hope you tell them that verbatim.","score":3,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"This hurts my brain","score":4,"comments":[]},{"body":"Let's take a minute an at the very least appreciate he outed himself and hope to God he wakes up one day behind bars","score":3,"comments":[]},{"body":"He sells skype consultations and \"lives\" out of a backpack","score":2,"comments":[]},{"body":"What an idiot.","score":2,"comments":[]},{"body":"This guy may be \"well-known\" as an anti-vegan public figure but I don't think it could be any more obvious that's secondary to his being a fucking fascist.\n\nLike, this goes much deeper than merely being a danger to children. An extremely cursory glance at his channel just shows the entire thing is essentially aryan type mythologizing of the naturalistic fallacy. Utterly tapped psychopath.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Weeks after she was denied a protective order, a Michigan woman and her family are dead","not_safe_for_work":false,"locked":false,"body":"","score":622,"comments":[{"body":"My ex, who was actually an IN PATIENT psychiatric hold for over a month came out of the hospital and started posting on FB pics of the new gun he'd just purchased!\n\nYeah, guess who else is armed to the teeth now? I had never felt the need to own a gun, but you can bet I own SEVERAL now! Cops/courts don't protect poor women","score":65,"comments":[]},{"body":"What kind of human kills their own child in cold blood. Sickening. Glad he’s dead.","score":81,"comments":[{"body":"I hope there’s a hell so he can rot in it","score":5,"comments":[]}]},{"body":"&gt;The judge, Troy Daniel, wrote that Savage could request the order in divorce court, the documents show. Tirany Savage filed for divorce last Thursday, the station reported.&gt;\n\nShe did everything she could and the system failed her. The system allowed him to go and buy a deadly weapon. The system did nothing to protect her and her family, even after she asked.\n\n\nFour people dead and this broken system and easy access to firearms are to blame almost as much as the murderer himself.","score":188,"comments":[{"body":"Worse yet, the judge literally said there wasn’t enough evidence that he would harm her. That’s why he denied it.\n\n3 days later she is murdered","score":8,"comments":[{"body":"That judge needs to be in prison","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Female victims of DV are the most common in gun homicides.","score":4,"comments":[]}]},{"body":"[removed]","score":77,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Here’s the judge’s contact link (publicly available on his election website) if anybody wants to send him what they think. \n\nhttps://www.votetroydaniel.com/contact-me","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Imagine being the judge who said “there isn’t enough evidence he will harm you, so your request is denied.” And 3 days later he kills all of them.\n\nHope that judge feels the heavy weight of what he allowed to happen. The blood of a mother and children are on his hands","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Teen accused of murder in deadly traffic cone beating in Philadelphia","not_safe_for_work":false,"locked":false,"body":"","score":223,"comments":[{"body":"In all my years i never thought of a traffic cone as a murder weapon","score":25,"comments":[{"body":"A 14 year old using it as well. Against a 73 year old man.","score":4,"comments":[]},{"body":"If you've played Yakuza 0, you'd know that traffic cones are DEADLY weapons.\n\nhttps://youtu.be/B6YaHLqAy6A","score":2,"comments":[{"body":"In yakuza kiwami u can find majima hiding in that big one😂😂","score":2,"comments":[{"body":"Indeed. And I was not expecting it lol","score":2,"comments":[]}]}]}]},{"body":"Back in my day teens that played lacrosse only used parking cones to shove up your ass for being in loser denial. They never beat a person to death with them. What a piece of shit.","score":22,"comments":[{"body":"In Portland we just set them up a in passive aggressive manner.","score":6,"comments":[{"body":"I knew this post would catch a fellow Portlanders eye.  \n\nFucken cones!!!","score":2,"comments":[]}]}]},{"body":"Any time you knock someone to the ground or kick them in the head, especially if they are elderly is a high risk for getting manslaughter charges.  \nThe traffic cone didn't kill the 73yo, whatever he hit concrete or asphalt during the fall did.","score":4,"comments":[]},{"body":"Who the fuck raised these POS kids that think it's funny to attack and KILL an old man?!?!?!?","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]},{"title":"In New Mexico, critics want answers after a police standoff ends in fire, death of teen","not_safe_for_work":false,"locked":false,"body":"","score":228,"comments":[{"body":"Albuquerque cops are fucking monsters. They have committed so many outright murders over the years, many on video, and faced no consequences.","score":13,"comments":[{"body":"Big time monsters. The brutal murder of James Boyd still haunts me to this day.","score":2,"comments":[{"body":"Yeah that’s the first one that came to my mind as well. They had every opportunity to deescalate that situation. They just wanted to kill the guy.","score":3,"comments":[]}]}]},{"body":"Albuquerque doesn’t disappoint.\n\nNo wonder Albuquerque police is still on the Federal watchlist.","score":4,"comments":[]}]},{"title":"Florida man locks daughter’s 3 dogs in hot car for days, leaving them to die, deputies say","not_safe_for_work":false,"locked":false,"body":"","score":334,"comments":[{"body":"[deleted]","score":28,"comments":[{"body":"or he can get a life sentence and get the prison kind","score":2,"comments":[]}]},{"body":"Will anything be done about Florida Man. It’s been decades and he hasn’t been brought to justice.","score":15,"comments":[]},{"body":"Why? Just, why? Apparently he tortured these poor animals to death for no reason whatsoever? Feel so bad for the poor daughter, that her FATHER would do this to her?????","score":6,"comments":[]},{"body":"Feed him to the gators toes first","score":6,"comments":[]},{"body":"If this happened to my dog I would be the one getting arrested","score":6,"comments":[]},{"body":"The same thing should be done to him.","score":2,"comments":[]},{"body":"I read that as he locked hot dogs in a car for three days. Innocence- sigh.","score":1,"comments":[]},{"body":"literally j do the same to him make sure the cars got black seats and paint","score":1,"comments":[]},{"body":"We need a “Pets are People Too” act that levies the same neglect, homocide, or murder charges for harming someone’s pet as if they had done so to a human.\n\n3 counts of Murder in the 1st Degree, life sentence, civil judgment of everything he owns sold and liquidated to her - not that that will fix what was done but it would send the appropriate message.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"An 8-year-old boy is paralyzed from the waist down after getting shot in the chest in Highland Park parade attack","not_safe_for_work":false,"locked":false,"body":"","score":733,"comments":[{"body":"This is heartbreaking. All I can picture is a little dude who loved playing in the park, riding his bike, and running around at recess... and has now lost the ability to do those things.","score":49,"comments":[]},{"body":"One dumbass, shitty, edgelord, rapper created so much issues. They should let him out and leak his info to the families of those affected. Edit: damn autocorrect.","score":187,"comments":[{"body":"[removed]","score":53,"comments":[{"body":"[removed]","score":19,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"This is so horrible","score":7,"comments":[]},{"body":"Here is the family’s go fund me page: https://www.gofundme.com/f/kxwjn-the-roberts-family-fundraiser?qid=46ccdd217d780cc80143b08c644c9d7f","score":5,"comments":[]},{"body":"Why does everyone wants death to the perpetrator? In this case it seems like a sweet escape even.\n\nFor me, the better thing to do is to have him committed to an asylum, placed in isolation chamber without any interaction and let him stay alive and sane as long as possible, so he have all the time in the world to contemplate his action and saw no end in sight, not even death.\n\nJust eternal silence and echoes of his own voice","score":7,"comments":[]},{"body":"But the government wants to take my guns away. But the libs....  I need more guns. Guns guns, guns. \n\nLet's just make sure the kid has guns. Why does he need legs if he is armed.  \n\nOh and we need more guns.\n\nLet's go brandon.  \n\nWhat was the question?\n\nIf only we could talk and discuss the issue of gun control.","score":38,"comments":[{"body":"But but but what if there was a good guy with a gun to stop the bad guy? \n\nWell there never fucking is, is there?","score":5,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"well if he had a gun on him, he couldve defended himself...! in serious this is very sad that at such young age he will be paralyzed for life.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"US mum refused abortion despite baby being ‘incompatible with life’","not_safe_for_work":false,"locked":false,"body":"","score":366,"comments":[{"body":"Man ive seen the outcome of this, theres some woman on TikTok with a child that would barely classify as alive and she just cant admit the child isnt going to live for more than a couple years.","score":58,"comments":[]},{"body":"Yeah, stop killing babies! Make them suffer unimaginable pain instead! 🤦‍♂️","score":108,"comments":[{"body":"It's not about protecting the children. It's about hatred, malice, suffering, and most importantly: control.","score":67,"comments":[{"body":"Agreed. It's not pro life it's anti-choice","score":28,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"It’s about controlling the means of production: human labor. More babies = more poor people = more people that will work for shit wages to produce for the wealthy. Govt always gets a cut of production earnings.","score":3,"comments":[]}]},{"body":"The fascist republican scum will be the ones to suffer pain","score":2,"comments":[]},{"body":"[removed]","score":5,"comments":[{"body":"Yeah I noticed","score":2,"comments":[]}]}]}]},{"title":"As Ohio restricts abortions, 10-year-old girl travels to Indiana for procedure","not_safe_for_work":false,"locked":false,"body":"","score":178,"comments":[{"body":"6 weeks is way too fucking soon. Does anyone know why that specific metric is so popular?","score":29,"comments":[{"body":"Because it makes them look like they still want to allow them without giving the woman a realistic chance to know she is pregnant. Many people don't know they're pregnant until they miss their period for a couple weeks which is right around 6 weeks. It's basically a fake metric being used so people won't be able to legally get abortions in time.","score":33,"comments":[{"body":"Especially because they count every pregnancy as beginning from the end of the last your period, you could really only be three weeks pregnant, but if it's been six weeks since your last period that's how far along you are 🤷","score":9,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"This story is not verifiable.\n\nhttps://townhall.com/tipsheet/leahbarkoukis/2022/07/12/wapo---facts-can-be-created-from-fiction-n2610093","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"\\*Overturn Roe vs Wade\\*  \n\n\\*Stuff like this happens\\*  \n\n\\*Surprised Pikachu face\\*","score":8,"comments":[{"body":"Who's surprised?","score":7,"comments":[]}]},{"body":"[deleted]","score":1,"comments":[{"body":"How the fuck do you think?\n\n(pissed at the situation, not you)","score":2,"comments":[{"body":"[deleted]","score":1,"comments":[{"body":"They're **ten,** abuse is the only possibility.","score":2,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Vegan mum starved toddler to death","not_safe_for_work":false,"locked":false,"body":"","score":350,"comments":[{"body":"“We’re here because their children were starving so much that the youngest starved to death,” Miller said.\n\n How fucking blind are people to have to let it even get to this point.","score":36,"comments":[{"body":"Some people should never be parents in the first place. Just because you had a kid does not mean you know what’s best for them.","score":6,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Her being vegan is completely irrelevant to starving a child ... she's just a psychopath","score":150,"comments":[{"body":"Yeah if she was just a well-meaning person feeding her kid veggies and fruit every day, the kid dropping weight would have been enough to take it to the doctor. \n\nTo die of starvation, your body would have to have used every single resource available to keep you alive. That poor child would have been nothing but a skeleton with skin stretched over it. That is the work of an immensely disturbed person. Being vegan has nothing to do with it.","score":59,"comments":[]},{"body":"Militant vegan, psychopath, same picture.\n\n&amp;#x200B;\n\nEdit:  Vegans found us, oh boy, here they go brigading again.","score":-31,"comments":[{"body":"You can raise a kid on a vegan diet just fine. This isn't about being vegan or not. Pretty good chance she would've starved her kid to death even if she weren't vegan. \nCountless times irresponsible non-vegan parents starve their kids because they're mentally ill. Her being vegan doesn't suddenly make her special or more evil than the rest.","score":20,"comments":[{"body":"Children are a lot better off consuming animal products, vegan diets will adversely affect their growth. Any doctor in there right mind would tell you that.","score":14,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"They said the baby/toddler hadn't eaten in a week . . .my kids are in their 20s but i remember back to those times, i would have been terrified as a parent . . in fact, i would be scared for my 20 year olds now. The parents in this case just did not give a d_ _ n.","score":26,"comments":[]},{"body":"i think this is just people fucked in the head that happen to be vegan","score":62,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“They said the boy hadn’t eaten for about a week prior to his death” \n\nThis isn’t about being vegan in the least.","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Woman walking with baby stroller shot to death in NYC","not_safe_for_work":false,"locked":false,"body":"","score":270,"comments":[{"body":"Hmm...this smellslike a personal killing. Maybe he was paid by the baby's dad, maybe he IS the baby's dad....something about this is personal","score":69,"comments":[{"body":"Ex boyfriend or baby daddy","score":26,"comments":[{"body":"55% of female homicides occur at the hands of a current or former romantic partner.\n\n-Source CDC MMWR Vol 66, No 28. July 21, 2017","score":29,"comments":[{"body":"doesn't canada require permission of a gun purchase from your romantic partner?","score":2,"comments":[]}]}]}]},{"body":"Wonder what the story is behind this. Doesn’t sound like she was picked at random.","score":32,"comments":[{"body":"This was my first thought to… I wonder what her computer could tell us. Maybe it was opinions she’s put out or information she had, who knows? I’m sure we’ll never find out but it def sounds more like a hitman scenario than a random act of violence.","score":-48,"comments":[{"body":"Opinions she put out or information she had..? What?","score":20,"comments":[{"body":"She had information that could lead to the arrest and prosecution of Hillary Clinton.","score":23,"comments":[{"body":"Containing the true secret of Harambes death.","score":15,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]}]},{"body":"Sounds like some one didn't get the abortion they wanted....","score":-5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Hindu shopkeeper beheaded in Udaipur over social media post","not_safe_for_work":false,"locked":false,"body":"","score":233,"comments":[]},{"title":"8-year-old Florida boy accidentally shoots and kills baby","not_safe_for_work":false,"locked":false,"body":"","score":413,"comments":[{"body":"&gt; The boy’s father left the gun holstered in his Pensacola motel room closet. After he left the room, his son found it and fired a round that passed through and killed the baby and struck the toddler, said Escambia County Sheriff Chip Simmons during a news conference Monday. The children who were shot belonged to the girlfriend of the father.\n\nHoly. Fucking. Shit.","score":176,"comments":[{"body":"I hope the mother sues his ass to hell or something bc god damn","score":52,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"If only the baby had a gun. Thoughts and prayers","score":171,"comments":[{"body":"Only thing that can stop a bad 8 year old with a gun is a good baby with a gun.","score":45,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"I don’t want to hear another word about gun control until we start locking up convicted felons caught in possession of a firearm. This guy not only was a felon, but he was release with bond. This is what is wrong with our justice system.","score":8,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Sorry, what?","score":25,"comments":[]},{"body":"This is why we need a nationwide government grant so that ALL our precious babies can be issued with American firearms at conception.","score":95,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"“The boy’s father returned to the room, took the gun and what investigators believe were drugs and left the room again, Simmons said. He is charged with being a convicted felon in possession of a firearm, two counts of culpable negligence by storing a firearm within easy of a minor resulting in injuries, tampering with evidence and failure to store a firearm in a required manner.\n\nHe was arrested and later released on $41,000 bond.”\n\nBond, huh? That seems very lenient. I guess Florida thinks the 8 year old was just standing his ground.","score":58,"comments":[{"body":"And who had that kind of money to bail him out?!","score":14,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"This wasn't an accident. It was poor parenting.","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Supreme Court Overturns Roe v. Wade","not_safe_for_work":false,"locked":true,"body":"","score":338,"comments":[{"body":"I really thought I had processed my emotions about this when the draft was leaked. I really thought that.\n\nBut after the last few Supreme Court decisions, and then this to cap it off, I am almost blinded with rage again. \n\nI've been working with groups in my area to try to make sure everyone has access to reproductive care, both inside and outside the system, so I'm not just sitting on my hands lamenting, but I still feel completely powerless and full of hate.\n\n/rant","score":38,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Congrats, America. All you're missing is race segregation and you're back in the 50's","score":82,"comments":[{"body":"1850's maybe, 1950's at least had economic prosperity","score":20,"comments":[]},{"body":"Actually, they are already doing this...from safe spaces to segregated dorms for POC, it's a shame","score":4,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Welcome to your new theocracy, brought to you by the Republican party.","score":43,"comments":[{"body":"It's called Y'all-qaeda","score":17,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"[removed]","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Get fucked, SCOTUS.","score":13,"comments":[]},{"body":"From way outside - every republican seems to be a traitor.","score":9,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Disgusting","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"South Sudan fights child marriage where girls are sold for cows","not_safe_for_work":false,"locked":false,"body":"","score":272,"comments":[{"body":"This is not just a practice limited to Sudan, but a something that is done throughout the contient. \n\nIt's called Lobola where I lived for two years, and even though AFAIK minors were not involved, fathers would not allow their daughters to marry unless the dowry was paid by the prospective husband.\n\nObviously this is still problematic, as one of the big issues in particular is that a woman is denied her autonomy to marry a man of her choosing unless they can afford it - and you can bet the daughter's family can leverage that too.","score":18,"comments":[]}]},{"title":"Video shows passengers viciously attack Las Vegas Uber driver","not_safe_for_work":false,"locked":false,"body":"","score":99,"comments":[{"body":"**Animals**. She even did what they asked after they refused to let her follow the damn law. Disgusting.","score":18,"comments":[]},{"body":"Cops should have all the info. It’s on video and you book the ride with your info. What’s the delay? Rage inducing indeed.","score":15,"comments":[]},{"body":"I had this happen before when we were leaving a concert and I ordered an Uber. When the driver arrived, 2 people we knew but weren't staying at our hotel with us got in the car and the driver wouldn't leave until a person got out and their asses didn't even budge. I, the one who paid for it, said fuck it and got out, ran in 8 degree weather for 2 miles in the middle of the night to the hotel. When I got there those 2 girls got another Uber to take them home...","score":5,"comments":[]},{"body":"[deleted]","score":3,"comments":[{"body":"Dude, just last night I was staying in a hotel.  I walked to the gas station next door to get snacks in the middle of the night.  When I came back some guy who was obviously high as hell started mumbling something like, \"you been messing with my car\".  He then punched me in the face and ran back into his room.  I went to the front desk and they couldn't give 2 fucks.  They told me I could call the police if I wanted.\n\nPolice show up and knock on the guys door.  He doesn't answer and the police tell me there isn't anything they can do if he won't answer the door and they leave.  I went back to the front desk and they won't kick the guy out or do anything.  So i told them i didn't feel safe there anymore and was leaving.  Fuckers wouldn't even give me a refund because \"I had already stayed half the night\".","score":3,"comments":[{"body":"[deleted]","score":1,"comments":[{"body":"This was in Lake City, FL","score":1,"comments":[]}]}]}]},{"body":"Uber beats","score":1,"comments":[]},{"body":"I hope the criminals go to jail.","score":1,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Remember the mother who had to give up custody of her child to her rapist and pay child support. Unsealed records show the father is being investigated for drugging and raping the daughter. Judge gave him full custody anyways!","not_safe_for_work":false,"locked":false,"body":"","score":743,"comments":[{"body":"It’s also alleged that Barnes drugged and sexually assaulted his daughter on Feb. 21, 2022 and Feb. 22, 2022.\n\n“She was transported to New Orleans where she was evaluated and the doctor confirmed that there was evidence of forced entry congruent with sexual assault,” the document reads.\n\nOn March 18, 2022, Judge Cashe dismisses all of Abelseth’s claims saying all criminal charges have not been accepted and the evidence does not support the allegations made by the daughter.\n\nCourt records were not clear on what evidence led the judge to make his decision. An abuse advocate for Abelseth tells WBRZ the Tangipahoa Parish Sheriff's Office has not cooperated with the family over the location of the daughter's rape kit. The sheriff's office, once again, did not respond to requests for comment Thursday.\n\nSheriff Daniel Edwards is the brother of La. Governor John Bel Edwards.","score":104,"comments":[]},{"body":"Sickening. And no one is even digging into this \"right before our eyes\" case.","score":51,"comments":[]},{"body":"The judge should go to jail.","score":48,"comments":[]},{"body":"This is some bullshit reporting.  The article says the daughter was conceived “after a night of drinking.” Implying some fault on the mother.  NOWHERE does it mention the ages of the parents at that time, which was the most critical aspect of the entire case because it proves rape regardless of anything else.  And surprise, surprise, this 16 year old girl did not know how to deal with the legal system.  And surprise, surprise, the guy who raped a 16 year old girl raped the 16 year old daughter he apparently didn’t know he had until years later.  This woman, and now her child, were failed up and down for years and that shows through even with this shitty article.","score":110,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"FFS!!! The \"father\" and judge deserve something worse then death","score":31,"comments":[]},{"body":"Family court is a completely different ballgame. Things like proof aren't always needed and crazy shit can happen. I've been through two divorces as a kid and am the father who had to pay support for a child. I've personally seen/heard crazy stuff in family court. \n\nI think the best documentary that covers family court is 'Divorce Corp'. If anyone knows a better/different one I'd like to check it out too.","score":6,"comments":[]},{"body":"How the *hell* does a judge fuck up this badly?!? Aren't they trained to take *all* the facts into consideration?!?","score":5,"comments":[{"body":"Judges don't have to do the right thing","score":4,"comments":[]},{"body":"Child sex  rings. The judge is prob in on it.","score":4,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I called it on the last post. Guy who rapes a 16 year old now mysteriously wants custody of the 16 year old daughter who’s a product of that rape… Stevie Wonder could’ve seen this coming but the judge didn’t give a shit.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Cops Never Even Tried to Open Classroom Door in Uvalde Massacre, Report Says","not_safe_for_work":false,"locked":false,"body":"","score":44,"comments":[{"body":"Remember when their argument was they were not properly equipped, back in Columbine, each cruiser comes with an AR, cmon Operator Donuts you wanted to LARP as an Armed Malitia, use that training for the intended purpose.","score":4,"comments":[]},{"body":"We really need to start to question the usefulness of police in the US.","score":6,"comments":[{"body":"We, as in white ppl or…?","score":0,"comments":[]}]},{"body":"This is so unacceptable. Each and everyone of them should be fired. If their children were in there you don’t think they would have busted the door down. Disgusting, they should be ashamed as humans.","score":3,"comments":[{"body":"Some of them Did go inside and get their own kids out- leaving their classmates behind","score":1,"comments":[]}]}]},{"title":"New video shows 13-year-old boy had hands up when shot by Chicago police | Teen’s family says he is in danger of never walking again after sustaining a spinal injury from the shooting","not_safe_for_work":false,"locked":false,"body":"","score":394,"comments":[{"body":"I was ready to feel rage, but that video doesn't come close to matching the headline.  Definitely gonna need to see some body cam footage before I fully form an opinion.","score":42,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"He was..... pointing one arm toward them like you'd be doing when taking a shot at them...? \n\nWhy WOULDN'T they think he was aiming at them?","score":10,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"SMH I guess this answers why people dont just \"stop and surrender\"...","score":22,"comments":[{"body":"Based on that video, it doesn’t look like he stopped or surrendered. Not saying the shooting was justified, but it doesn’t exactly match the headline either.","score":37,"comments":[]},{"body":"Gee, running away from the cops and then suddenly spinning towards them while raising his hands.....there's no way to see how that could go wrong.","score":13,"comments":[{"body":"Definitely a potential darwin award moment right there.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"13 year old 7th grader\n\n1130 PM\n\nFleeing a stolen vehicle\n\nPolice fault\n\nDo parents not take any accountability towards raising their children anymore?","score":16,"comments":[{"body":"The answer is no.","score":5,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"[deleted]","score":-12,"comments":[{"body":"Their job already is to take care of people. If the bad apples are taking care of people this way I don’t think anyone wants them around to continue taking care of them","score":-8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"Alaska schoolchildren were served floor sealant instead of milk at a child care program, school district says","not_safe_for_work":false,"locked":false,"body":"","score":332,"comments":[{"body":"Wtaf!?","score":47,"comments":[]},{"body":"[deleted]","score":23,"comments":[{"body":"Unless you are part of this investigation or have some factual knowledge about this incident, you are merely speculating which isn't helpful or genuine.","score":-13,"comments":[{"body":"I mean they did say “how it CAN happen”, so yes. They’re not claiming that’s how it actually happened.  \n\nIt is absolutely okay to speculate, wonder and discuss without claiming to know the facts. Otherwise, what even is the point in having an open forum?  This is a place where one can express their thought process or whatever else. It is not restricted to “only involved parties or reporters may comment and/or give information”. Sorry. \n\nYou’re comment is not helpful, either! :D It’s absolutely okay! They don’t have to be!","score":11,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"I have to admit when I read this I was floored.","score":56,"comments":[{"body":"You have my seal of approval.","score":11,"comments":[]}]},{"body":"Drinking glue","score":-9,"comments":[]},{"body":"If this was a supplier side error their buisness is done for O_0","score":1,"comments":[]},{"body":"The article doesn’t say if the contractor was just plating the food, or if they are also the manufacturer. It sounds like the milk was in single-serve sealed containers and not poured into a cup from a larger container which is super concerning.","score":1,"comments":[]},{"body":"No shit, really?","score":-14,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"INVESTIGATIVE UNIT: Rape victim ordered to pay her abuser child support - Barnes was 30 years old and Abelseth 16 at the time of conception. The act was illegal at the time, even if it were consensual; Abelseth maintains it never was.","not_safe_for_work":false,"locked":false,"body":"","score":488,"comments":[{"body":"&gt; Things took a dramatic turn this year when a judge granted Barnes full custody. It happened after Barnes alleged Abelseth gave her daughter a cell phone. Abelseth said she was also ordered to pay Barnes child support.\n\nHow does giving your 16 year old a cell phone cause you to completely lose custody? Something is missing here.","score":59,"comments":[]},{"body":"In addition to the main reasons this man should not be around children, let alone be guardian to one, losing custody over giving a teenager a phone makes absolutely no sense. The fuck is wrong with this judge?","score":121,"comments":[{"body":"This stinks of Christian Fundamentalism.","score":16,"comments":[]},{"body":"Because dude worked for the police. This is thin blue line BS.","score":80,"comments":[{"body":"I’d also look into his political contributions to that judge","score":33,"comments":[]},{"body":"","score":0,"comments":[]}]}]},{"body":"The reason the courts are allowing this to happen is because of a technicality with the initial investigation of rape.  Abelseth officially filed a police report on the rape in 2015.  Since then, the police have shelved the allegation and have yet to hand it over to an investigator.  \n\nSo, because of this, the courts do not see any sort of rape charge on his record because he's yet to actually be charged with anything.  The police have sat on this thing for seven fucking years.  \n\nI don't understand this whole issue with the cell phone either?  And everything I've read and watched doesn't really go into detail as to why she would lose custody over such a thing.  That part is incredibly confusing.  \n\nBut this is all happening because this guy is in bed with local law enforcement.  Even on the guys company website, he shows the local police department as a customer of his.  And he's supposedly threatened her about having close ties with local law enforcement.\n\nThis whole situation is fucked.  And hopefully, the attention this is now receiving has a positive effect for her.","score":58,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Fuck the Judge, and Fuck the local PoPo, and most importantly,  fuck that rapist.","score":14,"comments":[]},{"body":"\"Judge Jeffrey Cashe granted Barnes custody, but an employee in his office said judicial canons would prevent him from explaining the decision, which was placed under seal, and an attorney from the Louisiana Foundation Against Sexual Assault (LFASA) said the decision was egregious.\"","score":11,"comments":[]},{"body":"This most definitely belongs here. Soooo much wrong with this!","score":21,"comments":[]},{"body":"So he raped a 16 year old, and now that the child conceived from that rape is 16, he decides to fight for full custody? Huh, I wonder why that would be.\n\nEdit: Yyyyyep, called it.","score":4,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Lawsuit: Millions of immigration files stored in caves, delaying citizenship applications","not_safe_for_work":false,"locked":false,"body":"","score":168,"comments":[{"body":"Holy fuck. We’ve been waiting on the interview for years now…WTF!!?","score":3,"comments":[]},{"body":"Always remember to fact check kids","score":2,"comments":[]},{"body":"Are the caves OPM in Boyers, PA? They may be caves- but they are super high tech. I worked there for a couple years out of high school.","score":1,"comments":[]}]},{"title":"Dog stolen from southwest valley found dead in North Las Vegas","not_safe_for_work":false,"locked":false,"body":"","score":254,"comments":[{"body":"I hope these assholes serve a lot of jail time. I can’t imagine how it would feel if someone stole my boy.","score":34,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Anyone know the name of the company?","score":15,"comments":[{"body":"Gonzalez Flooring","score":17,"comments":[]}]},{"body":"😡","score":11,"comments":[]},{"body":"This is heartbreaking.  Poor little baby.  😓","score":21,"comments":[]},{"body":"so sad 😞😞","score":7,"comments":[]},{"body":"Burn in hell ya damn heathens","score":4,"comments":[]},{"body":"What truly horrific people","score":4,"comments":[]},{"body":"What pieces of shit …. Need the name of this scumbag flooring company","score":2,"comments":[]},{"body":"RIP doggo.","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Shocking footage shows elderly Syrian woman kicked in face by Turkish 'racist'","not_safe_for_work":false,"locked":false,"body":"","score":246,"comments":[{"body":"This saddens me so much. We are all one people living on a rock floating through a sea of stars. There is no reason for all this hate we are one.","score":30,"comments":[]},{"body":"Why is it ‘racist’ and not just racist?","score":20,"comments":[{"body":"I assume they don't want to be sued for libel just in case.","score":7,"comments":[]}]},{"body":"Turkish, Pakistanis.allSOBs","score":2,"comments":[]}]},{"title":"Delaware House Upholds Governor’s Marijuana Legalization Veto","not_safe_for_work":false,"locked":false,"body":"","score":225,"comments":[{"body":"Tell us you hate easy tax money without telling us you hate easy tax money","score":63,"comments":[{"body":"This wasn't even for sales, this was JUST legalizing possession. And now that has to wait until the governor leaves office in 2025. Gross.","score":32,"comments":[]}]},{"body":"Looks like you found who the prison system was paying off…","score":6,"comments":[]},{"body":"Tell me you’re an idiot without telling me you’re an idiot","score":29,"comments":[]},{"body":"The vast majority of states with the initiative process have either legalized weed or will vote on legalization this November. Unfortunately, states without ballot measures are subject to the idiosyncrasies of drug warriors like Gov. Carney.","score":36,"comments":[{"body":"*cries in SD","score":2,"comments":[]}]},{"body":"Fuck corrupt politicians (aka, all of them).","score":6,"comments":[]}]},{"title":"North Carolina man given death sentence in 15-year-old daughter's killing; tortured her for 22 hours","not_safe_for_work":false,"locked":false,"body":"","score":223,"comments":[{"body":"‘Most people are good most of the time’ yeah but this guy and others like him are still breathing air somewhere","score":8,"comments":[]},{"body":"I prefer when my taxes go towards these type of people being life in prison without parole, maximum solitary confinement. Death sentence is just an easy out for people that should spend decades completely isolated. I’d rather them suffer here where we can ensure that suffering.","score":36,"comments":[{"body":"Death penalty is also more expensive and has a ridiculously high error rate. It’s just wrong. But humans feel good doing it. Pathetic","score":1,"comments":[]}]},{"body":"Whelp, I wished I never woken up to this","score":8,"comments":[]}]},{"title":"30 dogs, cats found dead in animal rescue CEO's home","not_safe_for_work":false,"locked":false,"body":"","score":506,"comments":[{"body":"Sounds like hoarding to me.","score":62,"comments":[{"body":"Boardin' and hoardin'.","score":15,"comments":[]}]},{"body":"Police responded to a wellness check on May 28th when they found all the dead animals, but this person was only arrested when she turned herself in in June? How did that come about?","score":47,"comments":[{"body":"Because June is the next month after may... So that could be within a week, police don't really do manhunts for stuff like this, most people turn themselves in once they're aware of the charges and have affairs in order.","score":72,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Lots of possibilities here. Adding to the other comments: \n\nShe could have been hospitalized for psychiatric treatment after the wellness check &amp; turned herself in after she was discharged. This situation  screams mental illness. \n\nThe police would have needed to investigate the situation and gather evidence of her crime/s before they could ever arrest her, and that takes time. Then it takes time to issue a warrant for arrest. She probably took time to get her affairs in order too, before turning herself in on the warrant.","score":13,"comments":[]},{"body":"Lots of possibilities here. Adding to the other comments: \n\nShe could have been hospitalized for psychiatric treatment after the wellness check &amp; turned herself in after she was discharged. This situation  screams mental illness. \n\nThe police would have needed to investigate the situation and gather evidence of her crime/s before they could ever arrest her, and that takes time. Then it takes time to issue a warrant for arrest. She probably took time to get her affairs in order too, before turning herself in on the warrant.","score":3,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Please rescue these animals\n\nRecuse them from what?\n\nWhat I’m going to do if you don’t","score":16,"comments":[]},{"body":"30!!!! There’s no way she was in the house still, my pets go a lil nuts when they are fed late, no way you can deal with the sound of that many dying animals and the smell as well from living in their own waste. People are insane man","score":3,"comments":[]},{"body":"A lot of “animal rescues” are unfortunately covers for hoarding.","score":7,"comments":[{"body":"What? Is this really a thing? Why? Tell me more.","score":5,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"‘I’m not jumping in after you.’ Man drowns as police watch at Arizona town lake","not_safe_for_work":false,"locked":false,"body":"","score":24,"comments":[]},{"title":"HIV positive teachers aid only gets 50 years for raping a 7 year old and trying to order a hit on the victim and his family","not_safe_for_work":false,"locked":false,"body":"","score":598,"comments":[{"body":"Dudes 40 with a 50 year sentence. He's gonna die in there","score":232,"comments":[{"body":"Let them find out why he’s there and he won’t see 41 🤷🏼‍♂️.","score":25,"comments":[]},{"body":"I'm sure that's true but probably not from old age.","score":76,"comments":[{"body":"☺️","score":29,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"With HIV and prison system medical treatment, as a child molester.  This is a death sentence.","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Good on the guy he tried to hire for turning him in. I think assisting the police in catching a criminal of this nature should get you automatically cleared from probation.","score":75,"comments":[{"body":"I mean dude was a hitman. I don't think one good deed makes up for being a murderer for hire.","score":35,"comments":[{"body":"A hitman with morals is pretty much a super hero","score":21,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"That's 45 years longer than the dude in my area who raped his kid and 4 other toddler's that him and his wife were babysitting regularly.","score":50,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"I mean I hate this shit too, but it’s not only, if this life is all we have he’s definitely lost it all, how likely is he to live past 95","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"VA hospital denied emergency care to dying vet because staff couldn’t verify his military service","not_safe_for_work":false,"locked":false,"body":"","score":597,"comments":[{"body":"Shouldn't an emergency room provide care regardless?","score":177,"comments":[{"body":"nah not in america","score":72,"comments":[]},{"body":"Yes, by law you will always receive care in an emergency department in the US. On top of that, there is almost no chance the doctors working the ED would just ignore a dying patient. This story is likely manipulated as hell.","score":31,"comments":[{"body":"Unfortunately, you're incorrect.\n\n\n&gt;“Despite the simulation education and interventions, the OIG learned … that there continue to be delays in the provision of emergency care to patients in the Emergency Department due to inefficient registration processes and practices.”\n\n\nDefinitely read the article. \n\n\n\n\n&gt;The veteran — identified only as a 60-year-old man who had been treated at Malcom Randall VA Medical Center for heart issues earlier that spring — was rushed to the hospital by a local ambulance after a neighbor found him unconscious at home.\n\n&gt;Emergency responders contacted staff en route to the hospital to inform them that the man was in poor health and was believed to be a VA patient.\n\n&gt;But when they arrived, the report states, first responders found the VA staff “belligerent” over the lack of identification and argued for several minutes about whether he was eligible to be treated at the facility.\n\n&gt;Under federal law, hospitals with emergency services are “obligated to provide medical screening examinations and stabilizing treatment to patients with emergency medical conditions,” regardless of their eligibility for care in other situations.\n\n&gt;After waiting about 10 minutes for staff to admit the man for care, the ambulance staff gave up and drove to another nearby hospital. The patient died of heart failure about 10 hours later.","score":53,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Then you go bankrupt","score":3,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"never expect good care from the VA. this is most likely true. the VA sucks ass","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"\"Under federal law, hospitals with emergency services are “obligated to   \nprovide medical screening examinations and stabilizing treatment to   \npatients with emergency medical conditions,” regardless of their   \neligibility for care in other situations.\"  \n\n\n\"Investigators said part of the problem in the 2020 incident may have   \nbeen grudges held by VA staff against the ambulance crew after a similar  \n incident a year earlier, where medical center nurses were also   \ncriticized for failing to put patient care ahead of eligibility   \nquestions.\"  \n\n\nok so in my eyes everybody in that department should be charged wtih a federal crime, not whatever \"VA Sunshine Healthcare Network leadership has promised an independent   \nreview of the situation to see if staff firings or discipline is warranted\" is. that to me sounds like the hospital equivalent of when the cops investigate themselves and find they didnt do anything wrong.","score":5,"comments":[]},{"body":"I'm literally scared of the US I don't know how you guys make it there.","score":9,"comments":[{"body":"It’s not that bad, I’ve been to about as many countries as I have fingers and besides like a couple Scandinavian countries the USA isn’t any worse than most. Every country has its problems. Not everyone experiences the dystopian things posted in the news.","score":22,"comments":[{"body":"Did you ever have to go to the hospital in any of those countries? What was your bill?","score":7,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Foster mum’s sick act on dying boy","not_safe_for_work":false,"locked":false,"body":"","score":290,"comments":[{"body":"IDK how you can look at a literal Cabbage Patch Kid and think beating them is a necessary thing to do.","score":136,"comments":[{"body":"Because he was lazy and whiney apparently...good grief what did they want? He was a bloody baby, their responsibility, not as if he could dress &amp; feed himself. Clearly 2 people who thought having a baby wouldn't make any difference whatsoever to their lifestyle but get them brownie points by adopting","score":65,"comments":[{"body":"Yeah that got me too. \"whiny\" man that's literally an infant they don't have many options other than whining.","score":25,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"What a pair of cunts. \n\nThe poor baby deserved better.","score":43,"comments":[]},{"body":"Just call the Children’s Services Department and tell them it isn’t working out. But you choose killing him?! Wtf is wrong with you.","score":17,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Sometimes I wonder how numb I am after everything I've experienced, and then I read stories like this.\nThis felt like an ancient rage, coming up through my ancestors.","score":74,"comments":[{"body":"That's because your normal","score":8,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Poor little thing... he looked so happy and cute and these two monsters decided that he didn't deserve to be treated as a living being.\nThis is very heartbreaking.","score":10,"comments":[]},{"body":"What a vile cunt she is and the husband is no fucking better!\n\nRest in piece little guy, you deserved much better.","score":31,"comments":[]},{"body":"What the actual fuck. This is beyond fucked up","score":7,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Off-duty cop shoots and kills dog 3 houses down (in its own yard) for not wearing collar. He then says he’s proud of it when confronted.","not_safe_for_work":false,"locked":true,"body":"","score":412,"comments":[{"body":"Deputy Ryan M Kuehner is a shit bag.","score":169,"comments":[{"body":"It sure was polite of the website to redact his name.\n\nAppreciate the correction.","score":18,"comments":[]}]},{"body":"Who the fuck just randomly shoots a dog 3 houses down while it’s in the owners yard not barking. Guarantee this isn’t this dudes first rodeo of hurting animals.","score":41,"comments":[{"body":"He's a cop I'm sure animals aren't the only thing he's hurting.","score":20,"comments":[{"body":"If he's scared of a dog 3 houses away imaging how brave he would be if a school was getting shot up","score":8,"comments":[]}]}]},{"body":"As 8f there isn't any more news coming out that shows cops are cowards","score":32,"comments":[]},{"body":"What a vile piece of shit. The website and that fucking prick.","score":19,"comments":[]},{"body":"I just don't understand why some people act like this. This is why I would rather have dogs than raise kids to live in a world like this.","score":32,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"This should read  \"unemployed' cop....","score":10,"comments":[{"body":"They have the most powerful union in the world. They kill humans and just get paid time off.","score":5,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Texas Official Sparks Fury After Saying He Can't Go Home to Hug Kids","not_safe_for_work":false,"locked":false,"body":"","score":349,"comments":[{"body":"Oh my lord. Frankly I am not even surprised because of how insensitive people are… but HOLY shit. To let this man represent your precinct? Lollllll","score":66,"comments":[]},{"body":"Yeah, imagine *never* being able to go home to hug your kid again. \n\nFucking idiot.","score":37,"comments":[]},{"body":"We are in Bizarro world. Are all of the police there idiots, cowards or accessories to Murder?","score":62,"comments":[{"body":"No. All police everywhere are idiots and cowards.","score":29,"comments":[{"body":"I understand there is a lot of feelings happening with this event, but pretending like all police everywhere is bad is not productive and better is to show police in other countries that works without being idiots and cowards and show that it is possible to reform the usa police to something better.","score":3,"comments":[{"body":"I hear you and I feel you and have you considered that it's too late for US police? You cannot reform this. Police departments across the country need to be dissolved and rebuilt with different (read: less) funding that also compliments public spending on programs that actually create safety like poverty reduction and education.","score":3,"comments":[{"body":"I don't think that is a viable solution tho, you can't go years without a police force while the new one gets created. I think it is more viable to slowly go through and reform and force education one part at a time. Step by step solutions are usually more successful than taking everything, throwing it away, and making something new.","score":-4,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"I'm sure he hugs his guns first.","score":20,"comments":[]},{"body":"Read the room you dumb f... wait, I saw the hat. He literally may not be able to read.","score":27,"comments":[]},{"body":"So out of touch with reality..?!","score":2,"comments":[]},{"body":"","score":0,"comments":[]}]},{"title":"Texas Police Lieutenant Says Cops Were Reluctant to Engage Gunman Because ‘They Could’ve Been Shot’","not_safe_for_work":false,"locked":false,"body":"","score":993,"comments":[{"body":"The more I learn about the shooting the worse and worse it gets.","score":190,"comments":[{"body":"The police prevented other parents from trying to rescue their children. They could bully concerned parents but would not try to stop someone from murdering school children.","score":52,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"I’m sorry, isn’t that a known factor of any law enforcement work?  What ever happened to, “To protect and serve”?","score":166,"comments":[{"body":"I’m not going to butcher the facts, but the US Supreme Court decided that police actually do not have an obligation to serve or to protect. This happened after a man was stabbed several times in front of non-acting police on the NYC subway. Hopefully gave enough info for you to check out that decision and what led up to it without screwing up the story\nEdit: changed a word for clarity","score":112,"comments":[{"body":"Yeah and the only reason that guy survived is out of the kindness of a strangers heart... Being alive is terrifying.","score":42,"comments":[]},{"body":"What is the point of having police then if they are under no obligation to perform their job duties?!","score":38,"comments":[{"body":"So you can die in hope Instead of living in fear.","score":34,"comments":[{"body":"Wow, they even managed to fuck *that* up.","score":21,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Bunch of pussies","score":91,"comments":[{"body":"I’ve seen momma cats beat the fuck out of predators trying to hurt their babies. These cops are straight up pathetic cowards.","score":40,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Thousands of detained Uyghurs pictured in leaked Xinjiang police files","not_safe_for_work":false,"locked":false,"body":"","score":431,"comments":[{"body":"Fuck the CCP, fuck fascists, and fuck anyone that denies genocide.","score":45,"comments":[]},{"body":"[removed]","score":-132,"comments":[{"body":"Go back to genzedong, if you deny the Uyghur genocide you're either blind or have an ulterior motive.","score":53,"comments":[{"body":"[removed]","score":-38,"comments":[{"body":"There can be Uighur concentration camps as well as WMDs in Iraq. Imagine, two things being bad at the same time!","score":23,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"What are they doing taking mugshots of children?","score":12,"comments":[{"body":"[removed]","score":-1,"comments":[{"body":"","score":0,"comments":[]}]}]},{"body":"Tankie alert, weewooo tankie alert.\nHow are you unironically a fascist? It's bizzare and boggles the mind. I'm a socialist but you guys are insane.","score":19,"comments":[{"body":"","score":0,"comments":[]}]}]}]},{"body":"We get it, your parents are blood related","score":34,"comments":[{"body":"Tankies have so many Brainworms it's not even funny amymore","score":3,"comments":[]}]}]},{"body":"","score":0,"comments":[]}]},{"title":"She Was Told Surgery Would Cost About $1,300. Then the Bill Came: $229,000.","not_safe_for_work":false,"locked":false,"body":"","score":687,"comments":[{"body":"So what do you do? Call your insurance company to make sure it's all good before any of this?\n\n\nWtf do you do in am emergency situation and can't plan ahead?","score":139,"comments":[{"body":"No, it's simple. If this happens to you, just spend thousands of your own money and years of your own time to hire a lawyer and sue the hospital and hope and pray you get a judge and jury that sides with you.","score":113,"comments":[{"body":"No, it's much simpler (and cheaper) than all that, but you have to be proactive. Cancel your insurance now, before something like this happens, and then just simply suffer and die like a medieval peasant if anything medically significant comes up.","score":102,"comments":[{"body":"Make sure to tattoo your forehead with “UNDER NO CIRCUMSTANCES CALL 911 TO SAVE ME. LET ME DIE LIKE THE PEASANT I AM.”","score":20,"comments":[{"body":"Tattoos are expensive. Carve it in with a rusty razorblade you found at the dump. If you're lucky, you can expedite the entire process.","score":17,"comments":[]}]}]}]},{"body":"I was being wheeled into the OR for an emergency appendectomy a few years ago, and the anesthesiologist stopped me before heading in to discuss what would happen, yada yada. At this point, I'm already hopped on some sweet pain killers, so it was a very pleasant interaction. Never did the idea of asking whether or not the hospital assigned anesthesiologist working in the OR of that hospital was in my network cross my mind.  Then I got the $10,000 out of network bill for his services. \n\nAt what point am I expected to ask these questions, and at what point am I medicated to the point where these expectations halt?","score":10,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Anyone got a better link?","score":30,"comments":[{"body":"https://archive.ph/pz4Ui","score":22,"comments":[]}]},{"body":"Fuck the American healthcare system","score":106,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"My heart sinks when I read about this hell. Even when Lucifer asks for your signature he’s told you what it’s for.","score":146,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Oklahoma Legislature Passes Bill Banning Almost All Abortions","not_safe_for_work":false,"locked":false,"body":"","score":344,"comments":[{"body":"Whichever side of this particular moral debate you fall on, we can all admit that prohibition never works and always leads to worse consequences than the thing we thought we could ban in the first place. This is very sad and hopefully stops soon.","score":91,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Merica slowly returning to the Middle-Age","score":73,"comments":[{"body":"I hate it here","score":8,"comments":[{"body":"Come to Denmark. We'd be happy to have you.","score":9,"comments":[{"body":"Not OP, but if only your government was as welcoming as you, I'd do it. It's beautiful.","score":8,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]}]},{"body":"Missouri is up next. I can't wait to get the fuck outta this area.","score":33,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"America you fucked.","score":27,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"Anyone have a free article? NYTimes are bullshit with needing money to read","score":11,"comments":[{"body":"I got you, fam:\n\nOklahoma Legislature Passes Bill Banning Almost All Abortions\n\nThe legislation prohibits abortion from the moment of fertilization and relies on lawsuits from private citizens to enforce it. If the governor signs the bill, it would be the nation’s strictest measure, and take effect immediately.\n\nBy Kate Zernike, Mitch Smith and Luke Vander Ploeg\nPublished May 19, 2022Updated May 20, 2022, 12:13 a.m. ET\n\nThe Oklahoma Legislature gave final approval on Thursday to a bill that prohibits nearly all abortions starting at fertilization, which would make it the nation’s strictest abortion law.\n\nThe bill allows private individuals to sue abortion providers and anyone who “aids or abets” an abortion. It would take effect immediately if signed by Gov. Kevin Stitt, a Republican who has pledged to make Oklahoma the most anti-abortion state in the nation.\n\n“There can be nothing higher or more critical than the defense of innocent, unborn life,” State Representative Jim Olsen, a Republican, said on Thursday on the floor of the Oklahoma House, where the bill passed on a 73-16 vote.\n\nThe measure is modeled on a law that took effect in Texas in September, which banned abortion after about six weeks and has relied on civilian instead of criminal enforcement to work around court challenges. Because of that provision — the law explicitly says state authorities cannot bring charges — the U.S. Supreme Court and state courts have said they cannot block the ban, even if it goes against the constitutional right to abortion established in Roe v. Wade.\n\nThe Oklahoma ban goes further than the Texas law, which bans abortion after about six weeks of pregnancy.\n\nThe bill defines an unborn child as “a human fetus or embryo in any stage of gestation from fertilization until birth.” Anti-abortion groups, believing abortion to be murder, have tried unsuccessfully since the 1973 Roe decision to pass federal or state legislation defining life as beginning at fertilization.\n\nThe vote on Thursday was the latest step by Oklahoma’s Republican-led Legislature, working alongside Mr. Stitt, to chip away at abortion rights until the procedure is all but outlawed entirely. Together, they have put their state at the head of the pack of Republican-led states rushing to pass laws that restrict or prohibit abortion in anticipation that the Supreme Court is soon likely to overturn Roe. A leaked draft opinion written by Justice Samuel A. Alito Jr. — along with oral arguments in the case at hand, regarding a Mississippi law that bans the procedure after 15 weeks of pregnancy — indicated that the court was prepared to do so.\n\nIn Oklahoma, outnumbered Democrats in the State House pleaded with their colleagues not to pass the bill on Thursday. Several urged instead for Oklahoma to focus more on funding for family planning services, or on improving the lives of young Oklahomans living in poverty.\n\n“Legislation like this, on the surface, says that we are going to end abortion in our state,” said State Representative Trish Ranson, a Democrat who voted against the bill. “The manner in which it chooses to do so is punitive, it’s speculative and it draws the worst of us together.”\n\nThe bill makes exceptions for cases of rape and incest, but only if those crimes have been reported to law enforcement.\nUnderstand the Challenge to Roe v. Wade\nThe Supreme Court’s decision could be the most consequential to women’s access to abortion since 1973.\n\n    An Extraordinary Breach: The leak of a draft opinion suggesting that the justices will end the constitutional right to abortion will be investigated by the Supreme Court marshal, but it’s unlikely the Justice Department will be involved.\n    The Court’s Transformation: As it appears to be close to issuing its ruling in the case of the Mississippi law that could overturn Roe v. Wade, the Supreme Court looks increasingly politics-driven\n    Destroyed Trust: Justice Clarence Thomas addressed the leak, saying that it had done irreparable damage to the Supreme Court.\n    Protests: Following the leak, supporters of abortion rights have staged demonstrations across the country, including outside the homes of several justices.\n    A 17th Century Judge Cited: Lord Matthew Hale, who wrote that women were contractually obligated to husbands, was cited eight times in Justice Samuel Alito’s draft opinion.\n\nAn Oklahoma Democrat, Cyndi Munson, in an exchange on the House floor with a Republican sponsor of the bill, said that many women — especially young girls who may be victims of incest — do not report rape or incest to law enforcement.\n\n“Can you explain to me why you’re OK with a person carrying on a pregnancy after they have been raped or there has been instances of incest?” Ms. Munson asked. “You understand what incest is, correct? You are OK with that?”\n\n“I am OK with preserving the life of the child,” Wendi Stearman, the Republican sponsor, responded. “The child was not part of that decision.”\n\nAbortion opponents are increasingly leaning on civilian enforcement to accomplish longstanding goals. Even if no lawsuits are filed against abortion providers, civilian enforcement laws have led to a chilling effect among abortion providers and abortion pill distributors who stop their work out of fear of being sued.\n\n“This isn’t a fire drill,” said Emily Wales, the president and chief executive of Planned Parenthood Great Plains, which has operations in Oklahoma. “This is not a rehearsal for what’s to come. We are living in this real world right now. The Supreme Court will finalize that this summer.”\n\nOther states have attempted to ban abortions throughout pregnancy, but have been stopped by court order because under the Roe decision, states cannot prohibit abortion before viability, or roughly 24 weeks. States including Mississippi have attempted ballot initiatives that define fetuses as persons, making abortion murder, but have failed.\n\nNo state currently prohibits abortion starting at fertilization. The Oklahoma legislation attempts to do so by employing a legal tactic the courts have allowed: civilian enforcement.\n\nIf signed by the governor, the Oklahoma bill would cut off another option for Texas women who had been flooding across the state border to seek legal procedures, and it seeks to punish even those from out of state who assist Oklahoma women in getting abortions.\n\nIn 2017, the last year for which statistics were available, there were 4,780 abortions in Oklahoma, according to the Guttmacher Institute, which supports abortion rights. As in most states, Oklahoma’s abortion rate had been declining. But the Texas law resulted in an influx of women crossing into Oklahoma to get abortions. Planned Parenthood said its health centers in Oklahoma saw a 2,500 percent increase in the number of patients from Texas in the first three months the law was in effect.\n\nOklahoma already has a trigger ban that would immediately ban abortion if the court overturns Roe, as well as a ban on abortion that has remained on the books since before the Roe decision. Two weeks ago, just after the leak of the Alito draft opinion, Mr. Stitt signed a six-week ban closely modeled on the Texas legislation. The previous month, he had signed a law that will take effect in late August, outlawing abortion entirely except to save the life of the mother. That ban imposes criminal penalties on abortion providers.\n\nThe latest bill in Oklahoma was condemned by the Biden administration as the most extreme example of legislators undoing the right to an abortion.\nThe State of Roe v. Wade\nCard 1 of 4\n\nWhat is Roe v. Wade? Roe v. Wade is a landmark Supreme court decision that legalized abortion across the United States. The 7-2 ruling was announced on Jan. 22, 1973. Justice Harry A. Blackmun, a modest Midwestern Republican and a defender of the right to abortion, wrote the majority opinion.\n\nWhat was the case about? The ruling struck down laws in many states that had barred abortion, declaring that they could not ban the procedure before the point at which a fetus can survive outside the womb. That point, known as fetal viability, was around 28 weeks when Roe was decided. Today, most experts estimate it to be about 23 or 24 weeks.\n\nWhat else did the case do? Roe v. Wade created a framework to govern abortion regulation based on the trimesters of pregnancy. In the first trimester, it allowed almost no regulations. In the second, it allowed regulations to protect women’s health. In the third, it allowed states to ban abortions so long as exceptions were made to protect the life and health of the mother. In 1992, the court tossed that framework, while affirming Roe’s essential holding.\n\nWhat would happen if Roe were overturned? Individual states would be able to decide whether and when abortions would be legal. The practice would likely be banned or restricted heavily in about half of them, but many would continue to allow it. Thirteen states have so-called trigger laws, which would immediately make abortion illegal if Roe were overturned.\n\n“This is part of a growing effort by ultra MAGA officials across the country to roll back the freedoms we should not take for granted,” Karine Jean-Pierre, the White House press secretary, said in a statement, referring to the “Make America Great Again” slogan embraced by supporters of Donald J. Trump.\n\nThe six-week abortion ban had already sharply reduced the number of procedures Oklahoma abortion providers could perform. Andrea Gallegos, the executive administrator at the Tulsa Women’s Clinic, said the governor’s signature on the bill passed Thursday would make performing any abortions in the state impossible.\n\n“These laws don’t stop abortion,” Ms. Gallegos said. “Women will still seek and get abortions. We’re just forcing the citizens of this country to have to flee their own state to access health care. It’s pretty awful.”\n\nThe effects could reverberate nationally, abortion rights supporters said.","score":18,"comments":[{"body":"“This signals to other states that they, too, can ban abortion,” said Elizabeth Nash, a state policy analyst for the Guttmacher Institute. “And for our clinic network, this disrupts access across the country.”\n\nThe Oklahoma bill would allow civilian lawsuits against anyone who helps pay for an abortion, which could implicate people across the country who have been donating to charitable organizations that help women in restrictive states get abortions elsewhere.\n\nThose who sue successfully would be given awards of at least $10,000, and compensatory damages, including for “emotional distress.”\n\nThe bill exempts women who get abortions from lawsuits, which has been a red line that legislatures have been unwilling to cross. It does not apply to abortions necessary to save the life of the mother “in a medical emergency.”\n\nAbortion rights supporters have argued that bills banning abortion starting at fertilization would effectively ban contraceptive methods that prevent implantation, such as an intrauterine device, but the Oklahoma bill specifies that it does not apply to contraception, including Plan B or morning-after pills.\n\nMr. Stitt’s office did not immediately respond to a request for comment about the bill’s passage on Thursday.\n\nAsked on “Fox News Sunday” how he would help women who carried out their pregnancies despite financial or other challenges that would make it difficult to raise a child, Mr. Stitt blamed the “socialist Democrat left” for attempting to abort children who would be born into poverty.\n\n“We believe that God has a special plan for every single life and every single child,” he said, “and we want everybody to have the same opportunities in Oklahoma, and aborting a child is not the right answer.”","score":11,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Indian American student choked by peer receives harsher punishment than his bully from Texas school","not_safe_for_work":false,"locked":false,"body":"","score":585,"comments":[{"body":"Suing the fuck out of them would probably the only thing they undestand.","score":243,"comments":[{"body":"&gt;The School Resource Officer refused to file a citation because the school administration allegedly asked that the incident not be documented as there have already been many bullying complaints.\n\nTakes me back to my time in middle/high school. Some school administrators think burying a problem and pretending it doesn't exist is the proper solution. \n\nHope this kid sues the school and hope that other kid gets a proper punishment","score":20,"comments":[{"body":"Just like bad employers","score":6,"comments":[]}]},{"body":"I'm not one to throw BS lawsuits out there. This is as fucking far from that as possible. God dam Texas is a goddamn shit hole anymore.","score":84,"comments":[]}]},{"body":"Wtf","score":46,"comments":[]},{"body":"If I'm not mistaken, the attacker's father has something to do with the school board. Either running or is already on it. Either way Coppell ISD sounds like shit show.","score":37,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"In Texas you can legally defend yourself from basically any vaguely threatening situation with a gun.\n\nWhen a defenseless kid gets choked out however, that's too violent.","score":148,"comments":[{"body":"The Indian kid committed the crime of not being white.","score":78,"comments":[{"body":"And by not being the son of a man running for the local school board.","score":38,"comments":[]}]}]},{"body":"Texas:  choking ok, pulling brown fellow and dragging by the neck ok.  But refusing to give up seat he parked at fairly,  that bad in tx","score":26,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"title":"Cosplay artist lodges report against stalker, cop allegedly blames dress","not_safe_for_work":false,"locked":false,"body":"","score":221,"comments":[{"body":"The police fucked up. I go to anime conventions and there is always security for the weirdos.  You can have a hobby and Still have the right to Not be harassed.","score":43,"comments":[]},{"body":"So the COP was basically saying \"I would Stalk you too if I was in his position\"","score":35,"comments":[]},{"body":"Welcome to Malaysia, people. The place where the 1MDB Incident took place.","score":3,"comments":[{"body":"There is no reason this could not have been the US.\n\nIn the States cops have a lot of freedom to decide what they want to enforce and what they do not.  \n\nOn top of this, we got this law that makes almost anything they do wrong while on duty almost impossible to prosecute.\n\nAnd on top of that they have this very strong brotherhood that puts protecting other cops at all costs as the most important thing they can do.\n\nA cop that told a woman she was raped cause of how she was dressed is going to be am embarrassment to the department for a week and nothing more.","score":2,"comments":[]}]},{"body":"\"It's your fault for being pretty.\"","score":2,"comments":[]}]},{"title":"Marijuana legalization supported by 74% of New Hampshire voters blocked by 15 senators in the State Senate","not_safe_for_work":false,"locked":false,"body":"","score":879,"comments":[{"body":"Show me how you live free or die my NH friends.","score":211,"comments":[{"body":"I always found it so weird how NH doesn’t have legal weed yet because their state policies generally lean libertarian. All of New England has legalized weed except for them. At least it’s decriminalized? 🤷‍♂️","score":63,"comments":[]},{"body":"You don't have to wear a helmet on your motorcycle. And that's about it.","score":26,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"For the people, by the people, just not YOU people.","score":42,"comments":[]},{"body":"&gt; \"A robust workforce is not a stoned workforce,\" he said.\n&gt; \n&gt; \"I have no problem proudly proclaiming that our state is a clean state that is looking out for the benefit of its children, its adults, its workforce and its revenues,\" Giuda said.\n\nJust in case you want to give this lying geriatric drug warrior a piece of your mind: http://gencourt.state.nh.us/senate/members/webpages/district02.aspx","score":100,"comments":[{"body":"&gt;  and its revenues,\n\nGuess that fucking moron doesn't know shit about current marijuana taxes....what a fucking dope...","score":45,"comments":[]},{"body":"&gt; \"A robust workforce is not a stoned workforce,\" he said.\n\nIs the concept of recreation outside working hours that far beyond capitalist oligarchs? Do we have to be obedient workers at the ready every waking hour?","score":20,"comments":[{"body":"","score":0,"comments":[]}]},{"body":"","score":0,"comments":[]}]},{"body":"Why do they think their opinions matter when they were voted in to represent what the people want, majority says legalize it so what's the issue?","score":96,"comments":[{"body":"That's what really chaps my ass!  \n\nVoted in by the people to represent the people...flat out they don't.   It's either whatever they want or whatever they are paid to.","score":65,"comments":[]},{"body":"","score":0,"comments":[]}]},{"body":"Corruption","score":22,"comments":[]},{"body":"","score":0,"comments":[]}]}]}